<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenSSH Projekt Ziele</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="description" content="Die OpenSSH Projekt Ziel Seite">
<meta name="keywords" content="openssh,projekt,ziele">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2004 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenSSH]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Projekt Ziele</font></h2>
<hr>
Unser Ziel ist einfach: Da telnet und rlogin unsicher sind, sollten alle
Betriebssysteme mit SSH Unterst&uuml;tzung ausgeliefert werden. (Siehe Bild unten).
<p>
Das SSH Protokoll gibt es in zwei inkompatiblen Varianten:
SSH 1 und SSH 2.
<p>

Das &auml;ltere SSH 1 Protokoll teilt sich wieder in zwei Haupt-Varianten auf:
Protokoll 1.3 und Protokoll 1.5.  Beide werden von OpenSSH unterst&uuml;tzt.
Beide benutzen die asymmetrischen Kryptographie-Algorithmen
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=des_crypt">3DES</a>
und
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=blowfish">Blowfish</a>.
(Es gab ein paar andere Algorithmen wie z.B. RC4, aber ihre Implementierung
h&auml;tte zu Sicherheitsproblemen gef&uuml;hrt.)
Einige SSH 1 Protokoll Implementierungen unterst&uuml;tzen au&szlig;erdem den
symmetrischen IDEA Algorithmus, aber da dieser Algorithmus in einigen 
Nationen patentiert ist und die anderen beiden ausgelieferten Algorithmen
ausreichend sind, hat OpenSSH keine Unterst&uuml;tzung f&uuml;r IDEA.

<p>
Das SSH Protokoll 1 benutzt ein einfaches CRC um die Daten Integrit&auml;t 
sicherzustellen, was sich als besch&auml;digt herausstellte;
eine "insertion attack" ist bekannterma&szlig;en m&ouml;glich, jedoch sind
Angriffe wegen der Menge an "Heftpflastern", die &uuml;ber die Jahre auf SSH
aufgeklebt wurden, &uuml;beraus schwierig durchzuf&uuml;hren.
Wird der 3DES Cipher benutzt, ist die 'insertion attack' bedeutend schwieriger
auszuf&uuml;hren. (Wir l&ouml;sen das Problem wahrscheinlich bald).
<p>
Die zweite Haupt-Variante von SSH ist das SSH 2 Protokoll. SSH 2 wurde eingef&uuml;hrt,
um die patentrechtlichen Schwierigkeiten bez&uuml;glich des RSA Protokolls zu umgehen
(was inzwischen nicht mehr n&ouml;tig ist, da das Patent ausgelaufen ist) und das 
CRC Daten Integrit&auml;tsproblem zu l&ouml;sen, das SSH 1 hat, und zudem aus einer
Reihe weiterer technischer Gr&uuml;nde.
Durch die Benutzung der asymmetrischen 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dsa">DSA</a>
und
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dh">DH</a>
Algorithmen vermeidet Protokoll 2
alle Patente. Das CRC-Problem wird durch die Benutzung eines richtigen
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=HMAC">HMAC</a>
Algorithmus gel&ouml;st. Das SSH 2 Protokoll unterst&uuml;tzt eine Menge mehr an
symmetrischen Ciphern und au&szlig;erdem eine Menge mehr an Features.
<p>

OpenSSH Code beinhaltet volle Unterst&uuml;tzung f&uuml;r Protokoll 1.3 und 1.5 seit dem
1. Dezember 1999.
<p>

F&uuml;r viele Kryptographiie Features greift OpenSSH auf die nicht-GPL lizenzierte
<a href="http://www.openssl.org">OpenSSL</a> library zur&uuml;ck.
<p>
Fast sofort nachdem wir unsere Implementation des SSH Protokoll 1 ver&ouml;ffentlicht hatten,
waren viele nicht-OpenBSD-Gruppen sehr, sehr interessiert.
Damien Miller, Philip Hands, und eine handvoll anderer begannen damit, OpenSSH
auf Linux und verschiedene andere Unix-Betriebssysteme zu portieren.
Von Anfang unserer Bem&uuml;hungen an hatten wir das Gef&uuml;hl, dass sogar der originale
SSH Code zu kompliziert war, er hatte einfach zu viele Abh&auml;ngigkeiten von
Betriebssystemen in sich. Unser Anspruch komplett sicheren und absolut
stabilen Code zu schreiben vermeidet es nat&uuml;rlich sich mit solchen 
&uuml;berm&auml;&szlig;igen Unterschieden herumzuschlagen. Um daher den gesamten Entwicklungsprozess
f&uuml;r uns alle einfacher zu machen, haben wir die Kern Entwicklung von der
Portabilit&auml;t getrennt.
Das hat f&uuml;r uns sehr gut funktioniert. (Vergleiche doch mal die Anzahl
Zeilen zwischen der Basis- und portablen Versionen).
<p>
Diesen Trend fortf&uuml;hrend haben Mitglieder des Projektteams von OpenBSD, die an 
OpenSSH gearbeitet haben, sich stark bem&uuml;ht das SSH 2 Protokoll ebenfalls zu unterst&uuml;tzen.
Diese Arbeit wurde prim&auml;r von Markus Friedl gemacht.  Um den 4. Mai 2000 war das
SSH 2 Protokoll soweit unterst&uuml;tzt, dass es von nun an nutzbar war.
<p>

<hr>
<h2><font color="#e00000">Benutzt du immernoch die "Klartext" Logins?</font></h2>
<img width=500 height=500 src="../images/shherrif.jpg" alt=sherrif>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt=OpenSSH></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: goals.html,v 1.18 ]
<br>
$Translation: goals.html,v 1.17 2004/08/24 12:11:24 jufi Exp $
<br>
</small>
<small>$OpenBSD: goals.html,v 1.15 2004/08/24 12:17:45 jufi Exp $</small>
</body>
</html>
