<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenSSH Projekt Geschichte und Verdienste</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="description"   content="Die OpenSSH Geschichte und Verdienste">
<meta name="keywords"      content="openssh,geschichte,verdienste">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2004 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<img alt="[OpenSSH]" height=30 width=141 src="../images/smalltitle.gif">
<p>
<h2><strong><font color="#e00000">Projektgeschichte und Danksagungen</font></strong></h2>
<hr>

OpenSSH ist ein Derivat der originalen und freien ssh Version 1.2.12 
von Tatu Yl&ouml;nen. Das war die letzte Version, die frei genug war, um von unserem
Projekt benutzt zu werden. Teile von OpenSSH tragen nach wie vor Tatus Lizenz, die in dieser
Version beinhaltet war. Diese Version und auch fr&uuml;here Versionen benutzten 
mathematische Funktionen aus der libgmp library. Diese library war auch in fr&uuml;hen
ssh Versionen enthalten. Die libgmp library unterliegt der (LGPL) Lesser GNU Public Licence,
obwohl Versionen dieser &Auml;ra der regul&auml;ren (GPL) GNU Public Licence unterlagen. 
<p>

Eine kombinierte Lizenz f&uuml;r alle Teile befindet sich unter
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE?rev=HEAD">
http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE</a>.
<p>

Schnell nach dem Ver&ouml;ffentlichen der Version 1.2.12 hatten darauf folgende 
Versionen immmer restriktivere Lizenzen, obwohl libgmp noch immer darin enthalten war
und notwendig war, um die Software zu benutzen.
Fr&uuml;he restriktive Versionen verboten 
es den Leuten Windows- oder DOS-Versionen zu erzeugen. Sp&auml;tere Versionen
beschr&auml;nkten ssh bei einer Benutzung in einer kommerziellen Umgebung und 
brachten Firmen dadurch dazu teure Versionen von Datafellows zu kaufen.
<p>

Fr&uuml;h im Jahre 1999 entdeckte Bj&ouml;rn Gr&ouml;nvall diese spezielle Version wieder
und begann darin Fehler zu beheben.
Seine Version von ssh heisst 
<a href="ftp://ftp.pdc.kth.se/pub/krypto/ossh/">OSSH</a>
und hat nur Unterst&uuml;tzung f&uuml;r das Protokoll 1.3.
Ger&uuml;chten zufolge wurde OSSH in
kommerzielle Produkte in Schweden eingebaut. 
Bis heute hat OSSH keine Unterst&uuml;tzung f&uuml;r Protokoll 2.

<p>
Die OpenBSD Projekt Mitglieder wurden erst weniger als zwei Monate vor dem Erscheinen
von <a href="http://www.openbsd.org/de/26.html">OpenBSD Version 2.6</a> auf Bj&ouml;rn's 
Arbeit aufmerksam.  
Wir wollten Unterst&uuml;tzung f&uuml;r ssh in unsere Version 2.6 
integrieren, aber wir mussten sicherstellen, dass es einfach perfekt war.
Daher haben wir uns sofort f&uuml;r einen "fork" der OSSH-Version 
entschieden, also eine Abspaltung davon, und verfolgten eine ebenso 
gr&uuml;ndliche und schnelle Entwicklung, wie es bei den OpenBSD 
Sicherheitsuntersuchungen (security audits) der Fall war. Als Ergebnis 
davon waren zum Zeitpunkt der Ver&ouml;ffentlichung viele ssh Quellcodedateien bereits von RCS Version 1.34, 
einige sogar bis hoch zu 1.66. Die Entwicklung ist wirklich sehr 
schnell vorangegangen, da wir auch eine 'Deadline' einzuhalten hatten.
<p>

Die folgenden Team-Mitglieder haben teilgenommen:

<ul>
<li>Theo de Raadt (KANADA) fing damit an "non-portabilities" zu entfernen,
die den Code nur schwerer lesbar machen -- das Ziel war einfacherer Quellcode,
so dass Sicherheitsl&ouml;cher und andere Punkte leichter entdeckt werden k&ouml;nnen.
<li>Niels Provos (DEUTSCHLAND, aber lebt in den USA) hat schnell die verbleibenden
kryptographischen und Komponenten mit GPL-Lizenz entfernt, indem er immer mit dem Auto nach
Kanada gefahren ist, so dass wir mit einer komplett frei nutzbaren Codebasis starten konnten.
<li>Markus Friedl (DEUTSCHLAND) kam dazu und war sehr schnell in der Lage den
SSH 1.3 Protokoll Code von der Version 1.2.12 mit einer SSH 1.5 Protokoll
Implementation zu ersetzen, die kompatibel mit den modernen "ssh 1.2.27" Serien war (diese 
&Auml;nderung war notwendig, um mit einer Menge an SSH-kompatiblen Windows Clients interoperieren
zu k&ouml;nnen, denen die Unterst&uuml;tzung f&uuml;r das SSH 1.3 Protokoll fehlte.  
Seine Implementation wird jetzt in OSSH benutzt. Er f&uuml;gte SSH 
Protokoll 1.5 Unterst&uuml;tzung in einer Weise hinzu, so dass die 
SSH Protokoll 1.3 Unterst&uuml;tzung weiterhin intakt blieb.
Sp&auml;ter f&uuml;gte er Unterst&uuml;tzung f&uuml;r SSH Protokoll Version 2 und SFTP hinzu.
<li>Bob Beck (KANADA) hat mit Makefile-Magie geholfen, um sicherzustellen, dass wir
OpenSSL ohne patentierte Algorithmen kompilieren konnten; da OpenBSD 2.6 ausgeliefert wurde, bevor
das RSA Patent auslief, mussten wir unsere CD mit libssl und libcrypto libraries ausliefern, denen
die RSA Unterst&uuml;tzung fehlte. Beim Installieren konnte der User diese aber per FTP/HTTP &uuml;ber 
das Internet ersetzen. Gl&uuml;cklicherweise ist diese Art von 'Hack' nicht mehr notwendig. 
<li>Aaron Campbell (KANADA) verbesserte zahllose Dokumentationsfehler und ein paar andere Code Probleme.
Es ist gr&ouml;&szlig;erenteils sein Verdienst, dass die man pages so vollst&auml;ndig sind.
<li>Dug Song (USA) hat mit ein paar Authentifikationsproblemen bei KerberosIV
geholfen (seine &Auml;nderungen wurden sorgf&auml;ltig gepr&uuml;ft, um sicherzustellen, dass keine kryptologischen &Auml;nderungen
gemacht wurden, sondern nur die Authentifikation ber&uuml;hrt wurde).
</ul>

<p>
Daher basiert OpenSSH auf diesen &auml;lteren Versionen von ssh 1.2.12, aber mit mehr beseitigten Fehlern und
neueren zus&auml;tzlichen Features:

<p>
<ul>
<li>alle Komponenten restriktiver Natur (z.B. Patente,
siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl</a>)
wurden aus dem Quellcode entfernt; jegliche lizensierte oder patentierte Komponenten
werden aus externen Bibliotheken genutzt.
(z.B. <a href="http://www.openssl.org/">OpenSSL</a>).

<li>beinhaltet zus&auml;tzliche Unterst&uuml;tzung f&uuml;r
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kerberos&amp;sektion=8">KerberosIV</a>
Authentifizierung und ticket passing.

<li>unterst&uuml;tzt Einmal-Passwort-Authentifizierung mit 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&amp;sektion=1">skey</a>

<li>Und hunderte weiterer &Auml;nderung, die die Leute in den man pages und im Quellcode 
selbst finden k&ouml;nnen.
</ul>

<p>
Das markierte die Version OpenSSH 1.2.2, die mit OpenBSD 2.6 ab dem 1. Dezember
1999 ausgeliefert wurde. Zu dieser Zeit wurde die meiste OpenSSH Entwicklung von
Aaron Campbell, Bob Beck, Markus Friedl, Niels Provos, Theo de Raadt und Dug 
Song gemacht. Wir danken all den Leuten, die Bugs gefunden und gemeldet haben.

<p>
<a name="portable">
<h3>OpenSSH portieren</h3>
Fast sofort nachdem wir unsere Protokoll 1 Implementation ver&ouml;ffentlicht hatten,
wurden verschiedene Nicht-OpenBSD Gruppen sehr sehr interessiert daran.
Damien Miller, Philip Hands, und eine Handvoll anderer begannen OpenSSH 
nach Linux und verschiedenen anderen Unix Betriebssystemen zu portieren.
Von Beginn unserer Bem&uuml;hungen an hatten wir das Gef&uuml;hl, dass der originale Code
von ssh zu kompliziert war, er hatte einfach zu viele Betriebssystemabh&auml;ngigkeiten 
in sich. Unser Anspruch komplett sicheren und absolut stabilen Code zu schreiben
vermeidet es, sich mit solcherlei Problemen herumzuschlagen.
Um daher den gesamten Entwicklungsprozess f&uuml;r uns alle leichter zu machen,
haben wir uns entschieden die Kernentwicklung von der Portabilit&auml;tsentwicklung
zu trennen. Dies hat sich bei uns als sehr gut herausgestellt.
(Vergleiche doch mal die Anzahl der Codezeilen zwischen der Basisversion und
den portablen Versionen).
<p>

<h3>SSH Protokoll 2 Unterst&uuml;tzung</h3>
Nach der Ver&ouml;ffentlichung von OpenBSD 2.6 entschied Markus Friedl, dass die 
Unterst&uuml;tzung von <a href="goals.html">SSH Protokoll 2</a> in 
Angriff genommen werden sollte. Indem er sich f&uuml;r Monate nur 
darauf beschr&auml;nkte, konnte er OpenSSH schlank und rank halten,
und es zur gleichen Zeit in eine Software verwandlen, die sowohl SSH Protokoll 1 
als auch Protokoll 2 benutzen kann. Diese Version, OpenSSH 2.0 genannt, wurde mit
OpenBSD 2.7 am 15. Juni 2000 ver&ouml;ffentlicht. Die meisten 
&Uuml;berpr&uuml;fungen von Markuses &Auml;nderungen wurden von Niels Provos 
und Theo de Raadt gemacht. Bob Beck wird daf&uuml;r gedankt OpenSSL auf 
eine neuere Version gebracht zu haben.
<p>
<h3>SFTP Unterst&uuml;tzung</h3>
Unterst&uuml;tzung f&uuml;r die Serverseite des SFTP Sub-Protokolls wurde von Markus
Friedl geschrieben und in der Version 2.3.0 im November 2000 ver&ouml;ffentlicht.  
Bald danach startete Damien Miller mit der Arbeit an einem sftp Client, der zum ersten 
Mal in Version 2.5.0 herausgebracht wurde.
<p>
<h3>SSH Server Versionen scannen</h3>
Um das &Uuml;berwachen der verwendeten SSH Server zu erleichtern, z.B. in einem
Firmen-Netzwerk, hat Niels Provos das
<a href="http://www.monkey.org/~provos/scanssh/">scanssh</a>
Tool geschrieben.  scanssh pr&uuml;ft eine Liste von Adressen und Netzwerken auf die Verwendung 
von SSH-Servern und ihrer Versions-Nummern. Es unterst&uuml;tzt die zuf&auml;llige Auswahl von 
IP-Adressen innerhalb gro&szlig;er Netzwerk-Bereiche und ist einfach n&uuml;tzlich, um 
Statistiken &uuml;ber die Verwendung von SSH-Servern in einer Firma oder dem Internet an sich
zu erhalten. Die Statistiken enthalten sowohl die unterst&uuml;tzten SSH-Protokolle, als auch die 
benutzten Software-Versionen.
<p>
scanssh wird benutzt, um die 
<a href="../usage/de/index.html">Statistiken</a> &uuml;ber Verbreitung und
Benutzung der SSH Potokolle im Internet zu erhalten. Die Messungen erlauben Einblicke in die
Verbreitung der verschiedenen SSH Protokolle und der Marktdurchdringung bestimmter
Server-Versionen.
<hr>
<h2><font color="#e00000">SSH: Letztlich sogar komplett frei.</font></h2>

<img width=764 height=500 src="../images/quiet.jpg">
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="Zu&uuml;ck zur OpenSSH-Hauptseite"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: history.html,v 1.33 ]
<br>
$Translation: history.html,v 1.24 2004/08/24 12:11:24 jufi Exp $
</small>
<br><small>$OpenBSD: history.html,v 1.22 2004/08/24 12:17:45 jufi Exp $</small>
</body>
</html>
