<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Wie man einen Bug in OpenSSH meldet</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="description" content="Wie man einen Bug in OpenSSH meldet">
<meta name="keywords" content="bug,problem,bericht,openssh,meldung,melden">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 2000-2004 by OpenBSD.">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">
<img alt="[OpenSSH]" height=30 width=141 src="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Wie man einen Bug in OpenSSH meldet</font></h2>
<hr>

<h3><font color="#0000e0">Probleme mit ver&ouml;ffentlichten Versionen.</font></h3>

Bevor du Bugs/Probleme mit ver&ouml;ffentlichten OpenSSH Versionen meldest,
gehe diese Checkliste durch:
<ol>
<li>&Uuml;berpr&uuml;fe, ob es <a href="http://www.openbsd.org/errata.html">patches
	und Hinweise bez&uuml;glich OpenSSH gibt.</a>
<li>Finde heraus, ob es eine neuere Version f&uuml;r
<a href="openbsd.html">OpenBSD</a>
oder f&uuml;r die <a href="portable.html">portable release</a>,
abh&auml;ngig von deiner Plattform, gibt.
<li>&Uuml;berpr&uuml;fe die <a href="faq.html">FAQ</a> nach Problemen, die oft 
als Bugs gemeldet werden, aber keine sind.
<li>&Uuml;berpr&uuml;fe die Liste der <a
href="http://bugzilla.mindrot.org/buglist.cgi?product=Portable+OpenSSH&amp;bug_status=RESOLVED">
bereits beseitigten Bugs seit der letzten Version</a> und
<a
href="http://bugzilla.mindrot.org/showdependencytree.cgi?id=822">
die bekannten Bugs, die seit der letzten Version gemeldet wurden</a>.
</ol>
<p>
Wenn es scheinbar nichts gibt, was dein Problem beheben k&ouml;te, benutze
<a href="http://bugzilla.mindrot.org">Bugzilla</a>
um einen bug report zu verschicken 
(siehe unten, wenn du die Bugs privat senden
willst).
<p>
Du kannst die OpenSSH Entwickler erreichen, in dem du eine
Email an eine der folgenden Adressen sendest:
<ul>
<li><a href="mailto:openssh@openssh.com">openssh@openssh.com</a>.  Dies
	ist eine private Liste, die nur von den OpenSSH Entwicklern gelesen wird.<br>
	<b>Passend zu:</b> Problemberichte zu OpenBSD's OpenSSH oder
	Sicherheitsprobleme auf jeglicher Plattform.<br>
	<b>Unpassend f&uuml;r:</b> How-to Fragen, Problemberichte f&uuml;r
	andere Plattformen als OpenBSD oder mit Patchen dritter Seite, allgemeine
	Diskussion.
<li><a href="mailto:openssh-unix-dev@mindrot.org">openssh-unix-dev@mindrot.org</a> 
	Dies ist eine &ouml;ffentliche Liste und man kann an diese Liste auch senden,
	wenn man sie nicht abonniert hat.<br>
	<b>Passend f&uuml;r:</b> Fehlerberichte, HOWTO-Fragen und Diskussionen
	&uuml;ber OpenSSH auf allen Plattformen (einschliesslich OpenBSD).<br>
	<b>Nicht passend f&uuml;r:</b> Berichte von Sicherheitsproblemen,
	Fehlerberichte f&uuml;r Bin&auml;rdateien, die nicht vom OpenSSH Team angeboten
        werden oder erzeugt wurden (es sei denn, man kann die Fehler mit einer
	Standard-OpenSSH Distribution nachvollziehen).
</ul>

<h3><font color="#0000e0">Probleme mit momentanen Versionen.</font></h3>

<ol>
<li>Teste das Problem mindestens zweimal, mit Quellcode, der vor h&ouml;chstens ein paar Tagen upgedatet wurde.
<li>Berichte nicht &uuml;ber Kompilierprobleme, es sei denn sie bleiben &uuml;ber einige Zeit bestehen.
	Sie sind meistens dein Fehler oder es wird bereits an ihnen gearbeitet, bevor
	du sie entdeckt hast. 
<li>Denk daran, dass die <a href="http://www.openbsd.org/anoncvs.html">anoncvs</a>
	Server deutlich hinter der tats&auml;chlichen Entwicklungsarbeit hinterherhinken.

<li>Checke <a href="http://www.openbsd.org/plus.html">OpenSSH &Auml;nderungen</a>,
        um zu pr&uuml;fen, ob sich des Problems bereits jemand annimmt.
</ol>
<br>

<a name="bugtypes"></a>
<h3><font color="#0000e0">Bug Reports einschicken.</font></h3>

Versuche, das exakte Problem festzunageln. Gib niemals vage Instruktionen
oder Details wie z.B. "es st&uuml;rzt ab."
Sprich &uuml;ber IRC mit anderen oder benutze 
ein anderes Forum wie etwa <a href="http://marc.theaimsgroup.com/?l=openssh-unix-dev&amp;r=1&amp;w=2">
Mailinglistenarchive</a> um sicherzustellen, dass es etwas neues und reproduzierbares 
und kein lokales Problem ist.
<p>

Einen exzellenten &Uuml;berblick &uuml;ber die Kunst Fehler zu melden bietet 
Simon Tatham's <a href="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html">
How to Report Bugs Effectively</a>. Denke daran, je besser die Informationen
in deinem Bericht sind, desto gr&ouml;sser ist die Chance, dass dein Problem
auch beseitigt wird.
<p>

Neue Features werden akzeptiert, insbesondere mit Code, der deine neuen Features implementiert.
Wenn jemand anderes den Code f&uuml;r dein neues Feature schreibt, sind die Chancen gross, dass derjenige
dich falsch versteht und du das nicht einmal bemerkst.

<p>
Bug Report-Typen in der Reihenfolge ihre Beliebtheit:
<ol>
<li>Reproduzierbare Probleme mit Source Fixes sind die besten.
<li>Reproduzierbare Probleme, die nicht spezifisch f&uuml;r dein Hardware-/Software-Layout sind.
<li>Reproduzierbare Probleme, die spezifisch f&uuml;r dein Software Layout sind.
<li>Reproduzierbare Probleme, die spezifisch f&uuml;r dein Hardware Layout sind.
</ol>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt=OpenSSH></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: report.html,v 1.17 ]
<br>
$Translation: report.html,v 1.12 2004/08/22 20:14:04 grunk Exp $
</small>
<br>
<small>$OpenBSD: report.html,v 1.14 2004/08/23 07:13:10 jufi Exp $</small>
</body>
</html>
