<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenSSH Alternatives for Windows & Mac</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="the OpenSSH project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<img alt="[OpenSSH]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color=#e00000>Windows & Mac</font><hr></h2>

Die folgenden"freien" Klienten werden f&uuml;r die Zusammenarbeit mit OpenSSH von
Windows Maschinen empfohlen:<p>

<ul>
<li><a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/">PuTTY</a>
ist eine SSH1+SSH2 Implementation.  PSCP, ein
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>-artiges
Programm f&uuml;r Windows, ist auch verf&uuml;gbar.
<p>
PuTTY unterliegt der MIT Lizenz (BSD-&auml;hnlich).
Putty's SSH2 Modus enth&auml;lt keine unterst&uuml;tzung f&uuml;r User-Authentifikation mit
<a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/wishlist.html#dsa">
DSA Schl&uuml;sseln.</a>
User-Authentifikation mit RSA Schl&uuml;sseln wird aber in beiden Protokollen unterst&uuml;tzt.
<p>

"PuTTY ist eine freie Implementation von Telnet und SSH f&uuml;r Win32 Plattformen,
geschrieben und gepflegt hautps&auml;chlich von Simon Tatham, der in Grossbritannien lebt."
<p>

<li><a href="http://www.zip.com.au/~roca/ttssh.html">TTSSH (SSH1)</a>
ist eine nur-SSH1 Implementation von Robert O'Callahan.
<p>

"TTSSH ist ein freier SSH Client f&uuml;r Windows. Er ist als Erweiterungs-DLL 
f&uuml;r Teraterm Pro implementiert. Teraterm Pro ist ein fantastischer freier Terminal
Emulator/Telnet Client f&uuml;r Windows, und sein Quellcode ist verf&uuml;gbar. TTSSH
f&uuml;gt Teraterm Pro SSH-F&auml;higkeiten hinzu, ohne irgendwelche bestehenden Funktionen von
Teraterm zu opfern. TTSSH kann ebenfalls frei heruntergeladen und benutzt werden
und sein Quellcode ist ebenfalls mit freier Lizenz erh&auml;ltlich.
Weiterhin wurde TTSSH vollst&auml;ndig in Australien implementiert [...]."
<p>

<li><a href="http://telneat.lipetsk.ru/">Telneat</a>
ist ein Telnet/SSH1/SSH2 Client f&uuml;r Windows von Kosta Schegloff,
<p>
der folgende Features bietet:
<ul>
<li>"volle Telnet Unterst&uuml;tzung
<li>SSH Unterst&uuml;tzung (IDEA, DES, TripleDes, ArcFour, BlowFish, Kompression)
<li>SSH2 Unterst&uuml;tzung
<li>termcap Unterst&uuml;tzung
<li>unterst&uuml;tzt Win95, OSR2, Win98, WinNT, Win2000
<li>unterst&uuml;tzt externe SSH Verschl&uuml;sselungs-Plugins
<li>bis zu 10 Konsolen
<li>Mausgesteuertes cut-and-paste
<li>'Scroll-Puffer'
<li>Autologin
<li>konfigurierbare 'recode' Tabellen
<li>unabh&auml;ngige Konfiguration f&uuml;r jeden Host
<li>Login Skripte"
</ul>
<p>
 
<li><a href="http://cygwin">Cygwin (POSIX Software als Aufsatz zu Windows)</a>
<p>
OpenSSH (Protokolle SSH1 und SSH2) mit Cygwin l&auml;uft auf Windows, wenn man die
<a href="portable.html">portable version of OpenSSH</a> benutzt.
<p>
 
<li><a href="http://cs.mscd.edu/MSSH/index.html">MSSH</a>
<p>
MSSH vom Metropolitan State College of Denver unterst&uuml;tzt Windows 95
und Windows 98 mit dem SSH1 Protokoll.
<p>

<li><a href="http://www.i-tree.org/ixplorer.htm">Secure iXplorer</a>
<p>
Secure iXplorer ist ein grafischer Aufsatz f&uuml;r <a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/">PuTTY's</a> pscp.exe.
<p>

<li><a href="http://winscp.vse.cz/eng">WinSCP</a>
<p>
WinSCP ist ein scp(1) Programm f&uuml;r Windows mit integriertem PuTTY 
</ul>

Die folgenden Clients werden f&uuml;r die Zusammenarbeit mit OpenSSH von Mac Maschinen aus  empfohlen:<p>

<ul>
<li><a href="http://www.lysator.liu.se/~jonasw/freeware/niftyssh/">NiftyTelnet 1.1 SSH</a>
ist ein nur-SSH1 Implementation, die mit einem
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>-artigen
Programm ausgeliefert werden. Geschrieben von Jonas Wallden.<p>

"NiftyTelnet 1.1 SSH r3 ist eine erweiterte Version von Chris Newman's
NiftyTelnet 1.1 Applikation, die Unterst&uuml;tzung f&uuml;r verschl&uuml;sselte Terminal
Sessions mittles SSH (Secure Shell) Protokoll beinhaltet.
Bitte lies die enthaltene Readme Datei bevordu diese Version weitergibst."

<p>

<li><a href="http://www.macssh.com/">MacSSH</a> ist eine nur-SSH2 Implementation.
<p>

"MacSSH is a modified version of BetterTelnet with SSH2 support. [...]
The only SSH2 client for MacOS that I could find is a commercial product
thats costs more than $100, and it crashes my Mac when closing a session...
Since it's best to do things by oneself, here's MacSSH."
</ul>

<p>
<hr>
<a href=index.html><img height=24 width=24 src=../back.gif border=0 alt=OpenSSH></a>
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: windows.html,v 1.16 ]
<br>
$Translation: windows.html,v 1.14 2001/06/20 18:36:30 jufi Exp $
<br></small>
<small>$OpenBSD: windows.html,v 1.14 2001/06/20 19:16:26 jufi Exp $</small>
</body>
</html>

