<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD 2.9</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Language" content="de">
<meta name="description" content="OpenBSD Version 2.9">
<meta name="keywords" content="openbsd,2.9,version,sicherheit,betriebssystem,
           krypto,ipsec,vpn,firewall,unix,bsd">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2003 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href=../images/Business.jpg><img align=left hspace="24" src=../images/Business.jpg></a>
<h2><font color=#0000e0>Die OpenBSD Version 2.9:</font></h2>
<p>

Ver&ouml;ffentlicht am 1. Juni 2001<br>
Copyright 1997-2001, Theo de Raadt.<br>
<font color=#e00000>ISBN 0-9683637-7-6</font>
<p>

<a href=#new>Was gibt es neues ?</a><br>
<a href=#install>Installationsanleitung</a><br>
<a href=#ports>Der ports tree</a><br>
<a href=orders.html>Bestellung eines CD Sets</a><br>

<p>
<h3><font color=#0000e0>
Wenn du die CDs dieser Version haben willst:
<ul>
<li>Bestelle eine CD mit unserem <a href="orders.html">Bestellsystem</a>.
<li>Sieh dir die Informationen auf <a href=ftp.html>der FTP Seite</a> an, wenn du
eine Liste der Mirrors sehen willst	
<li>Gehe in das <font color=#e00000>pub/OpenBSD/2.9/</font> Verzeichnis auf einer
der Mirror-Seiten.	
<li>Lese den Rest dieses Dokumentes gründlich
<li>Werfe einen Blick auf <a href=errata29.html>die 2.9 Errata Seite</a> für eine Liste 
	von Bugs und Workarounds.
<li>Ein <a href=plus29.html>detailliertes Log der &Auml;nderungen</a> zwischen den
	Versionen 2.8 und 2.9.
</ul>
</font></h3>
<br clear=all>
<br>
<p>

<strong>Hinweis:</strong> Alle anwendbaren Copyrights und Danksagungen finden sich
in den jeweiligen  Quellcodedateien, die in den Archiven src.tar.gz, srcsys.tar.gz
und XF4.tar.gz oder auch in den Dateien, die via ports.tar.gz geholt wurden,
enthalten sind. Die 
Distributionsdateien, mit denen die packages aus der ports.tar.gz Datei erzeugt werden,
sind aus Platzgr&uuml;nden nicht auf den CDROMs enthalten.
<p>

<a name=new></a>
<hr>
<p>
<h3><font color=#0000e0>Was gibt es neues ?</font></h3>
<p>
Dies ist eine unvollst&auml;ndige Liste der neuen Features und Systeme, die es in OpenBSD 2.9 gibt. 
Eine umfassendere Liste gibt es im <a href=plus29.html>changelog</a>.
<p>

<ul>

<li>Die Dateisystem-Performance hat dank neuer Softupdates und neuem dirpref Code einen m&auml;chtigen 
Schub erhalten. Einige Tests haben eine 60-fache Steigerung in der Geschwindigkeit des Dateisystems gezeigt.
Wenn es einen Grund f&uuml;r das Update auf 2.9 gibt, dann ist es dieser.
<p>

<li><a href="http://www.OpenSSH.com">OpenSSH</a> (das sowohl SSH1, als auch
das SSH2 Protokoll unterst&uuml;tzt) ist jetzt bei Version 2.9. Sichere Dateitransfers sollten
mit dem stark verbesserten SFTP Subsystem gemacht werden, welches jetzt als Server
und Client geliefert wird.
<p>

<li>Umfassende &Auml;nderungen an der Dokumentation, haupts&auml;chlich den man pages und
der Web FAQ. Die manual pages enthalten jetzt brauchbare Beispiel, um die Erkl&auml;rungen zu 
erg&auml;nzen.
<p>

<li>Umfangreichere und besser geteste Sammlung von "ports".
<p>

<li>&Uuml;ber 1000 fertig erzeugte und getestete packages.
<p>

<li>OpenBSD 2.9 funktioniert auch auf dem neuen Apple Titanium PowerBook G4.
<p>

<li>Der <a href="alpha.html">OpenBSD/alpha</a> port ist nach einer Pause von 2 Versionen zur&uuml;ck, und das
mit einer besseren Hardwareunterst&uuml;tzung als je zuvor !
<p>

<li>Das System beinhaltet die folgenden grossen Komponenten von Aussenstehenden:
<p>
<ul>
<li>XFree86 4.0.3 (und i386 enth&auml;lt zus&auml;tzlich 3.3.X Server, um wirklich alle Chipsets zu unterst&uuml;tzen)
<li>gcc 2.95.3 (+ patches)
<li>perl 5.6.0 (+ patches)
<li>Apache 1.3.19, mod_ssl 2.8.2, OpenSSL 0.9.6 (+ patches), DSO Unterst&uuml;tzung
<li>ipf 3.4.16 (+ patches)
<li>groff 1.15
<li>sendmail 8.11.3
<li>lynx 2.8.2 mit HTTPS Unterst&uuml;tzung
<li>sudo 1.6.3p7
<li>ncurses 5.2
<li>Latest KAME IPv6
<li>KTH Kerberos 1.0.4
<li>OpenSSH 2.9

</ul>
<p>

<li>Wesentlich verbesserte Treiberunterst&uuml;tzung
<p>
<ul>
<li>3Com 3c990 3XP Typhoon/Sidewinder Treiber (nur Ethernet).
<li>Neue Hardware RAID Treiber einschliesslich:
	<ul>
	<li>Adaptec FSA
	<li>American Megatrends MegaRAID
	<li>Compaq Smart ARRAY Controller
	</ul>
<li>Neue SCSI Treiber, die folgendes unterst&uuml;tzen:
	<ul>
	<li>Initio 940/950
	<li>Symbios Logic 53c1x10
	<li>AMD Am53c974-basierende PCI Adapter
	</ul>
<li>Viel neue Unterst&uuml;tzung f&uuml;r verschiedene Laptop Soundkarten: 
	<ul>
	<li>ESS Maestro 1/2/2E
	<li>Yamaha DS-1S
	<li>Cirrus Logic CS4281 Audio Devices
	</ul>
<li>USB Hardware wird jetzt standardm&auml;ssig unterst&uuml;tzt, was auch Tastaturen und M&auml;use einschliesst.
</ul>
<p>

<li>Viele Verbesserungen f&uuml;r Sicherheit und Stabilit&auml;t (siehe die roten Eintr&auml;ge im
<a href=plus29.html>complete changelog</a>).
<p>

<li>Viele neue Features, einschliesslich:
<p>
<ul>
<li>Unterst&uuml;tzung f&uuml;r lange Usernamen.
<li>Stark verbesserte Linux <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&sektion=8">emulation</a>, so dass jetzt viel mehr Applikationen funktionieren.
<li>Unterst&uuml;tzung f&uuml;r 802.1d spanning tree f&uuml;r <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=bridge&sektion=4">bridge(4)</a>.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vlan&sektion=4">vlan(4)</a> bridging Unterst&uuml;tzung erlaubt jetzt viele neue Dinge, die man mit Bridges machen kann (z.B kannst du OpenBSD als 802.1Q kompatiblen Switch einsetzen)
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kqueue&sektion=2">kqueue(2)</a> kernel event notification Mechanismus.
<li>Einf&uuml;hrung des <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&sektion=4">wscons(4)</a> maschinen-unabh&auml;ngingen Konsolentreibers.
<li>Starke Verbesserungen an softupdates, inklusive Geschwindkgkeits- und Stabilit&auml;tsfixes.
<li>Bug-fixes und Erweiterungen an den <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=atapiscsi&sektion=4">atapiscsi(4)</a> und <a href="http://www.openbsd.org:/cgi-bin/man.cgi?query=pciide&sektion=4">pciide(4)</a> Treibern, einschliesslich
UltraDMA/100 Unterst&uuml;tzung f&uuml;r Intel-, Promise-, und Highpoint-Controller.
</ul>
<p>

</ul>
<p>

<a name=install></a>
<hr>
<p>
<h3><font color=#0000e0>Installationsanleitung</font></h3>
<p>
Es folgen Instruktionen, die du in gedruckter Form haben w&uuml;rdest, wenn du
anstatt einer alternativen Installationsmethode eine CDROM gekauft h&auml;ttest.
Die Anleitungen f&uuml;r
FTP-Installationen sind recht &auml;hnlich, die Anleitungen f&uuml;r die CDROM-Installationen
wurden jedoch intakt gelassen, um zu zeigen, um wieviel einfacher alles mit einer
CDROM gewesen w&auml;re.
<p>

<hr>
Bitte beachte auch die folgen Dateien auf den CDROMs, die noch weitere
Details enthalten, um OpenBSD 2.9 auf deiner Maschine zu installieren:
<p>
<ul>
<li>	CD1:2.9/i386/INSTALL.i386
<li>	CD1:2.9/powerpc/INSTALL.powerpc
<li>	CD1:2.9/vax/INSTALL.vax
<p>
<li>	CD2:2.9/sparc/INSTALL.sparc
<li>	CD2:2.9/mvme68k/INSTALL.mvme68k
<li>	CD2:2.9/amiga/INSTALL.amiga
<li>	CD2:2.9/mac68k/INSTALL.mac68k
<li>	CD2:2.9/hp300/INSTALL.hp300
<li>	CD2:2.9/sun3/INSTALL.sun3
<p>
<li>Die alpha Version gibt es nur auf den ftp-sites, nicht auf den CDs.
</ul>
<hr>

<p>
Hier gibt es kurze Installationsinformationen f&uuml;r Leute, die mit OpenBSD vertraut sind
und den Befehl "disklabel -E" kennen. Wenn du irgendwie unsicher in Bezug auf die 
Installation bist, lies die entsprechenden INSTALL.* Dateien, die oben 
angegeben sind!
<p>

<h3><font color=#e00000>OpenBSD/i386:</font></h3>
<ul>
<p>
Spiele mit den BIOS-Optionen herum und versuche, von CD zu
booten. Wenn das nicht klappt, schreibe 
<i>CD1:2.9/i386/floppy29.fs</i> auf eine Floppy, und nimm diese als Boot-Medium.
Wenn du OpenBSD neben anderen Betriebssystemen betreiben willst, solltest
du unbedingt das Dokument
INSTALL.i386
lesen.
<p>
Benutze das  &quot;rawrite&quot; Werkzeug,  von <i>CD:/2.9/tools/rawrite.exe</i> 
um eine Floppy unter MS-DOS zu erstellen.
Unter Unix einfach das <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">dd(1)</a> Utility benutzen. 
Das folgende Beispiel f&uuml;r <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">dd(1)</a> k&ouml;nnte 
&quot;floppy&quot;, &quot;rfd0c&quot;, oder &quot;rfd0a&quot; als Device benutzen.

<ul><pre>
# <strong>dd if=&lt;file&gt; of=/dev/&lt;device&gt; bs=32k</strong>
</pre></ul>

<p>
Benutze ausschliesslich perfekte und sauber formatierte Floppies OHNE
DEFEKTE BL&Ouml;CKE oder deine Installation wird wahrscheinlich nicht klappen.
Mehr Informationen &uuml;ber die Installation von OpenBSD/i386 gibts in der <a href="../faq/de/faq4.html#4.1">FAQ4.1</a>.
</ul>

<p>
<h3><font color=#e00000>OpenBSD/sparc:</font></h3>
<ul>
<p>
Die Version 2.9 von OpenBSD/sparc befindet sich auf CD2. Um von dieser CD zu booten, kannst du, abh&auml;ngig von deiner BIOS
Version, eines der Kommandos unten benutzen:

<ul><pre>
> <strong>boot cdrom 2.9/sparc/bsd.rd</strong>
oder
> <strong>b sd(0,6,0)2.9/sparc/bsd.rd</strong>
</pre></ul>

<p>
Wenn deine sparc kein CD-Laufwerk hat, kannst du alternativ von einer Floppy aus booten. Dazu musst du 
&quot;CD2:2.9/sparc/floppy29.fs&quot; auf eine Floppy schreiben. N&auml;heres dazu gibts unter der 
<a href="../faq/de/faq4.html#4.1">FAQ4.1</a>. Um von dieser Floppy zu booten, kannst du, abh&auml;ngig von deiner 
BIOS Version, eines der Kommandos unten benutzen:
<ul><pre>
> <strong>boot floppy</strong>
oder
> <strong>boot fd()</strong>
</pre></ul>

<p>
Benutze ausschliesslich perfekte und sauber formatierte Floppies OHNE
DEFEKTE BL&Ouml;CKE oder deine Installation wird wahrscheinlich nicht klappen.
<p>
Wenn deine Sparc weder ein Floppy-, noch ein CD-Laufwerk hat, kannst du entweder ein bootbares Tape erzeugen, oder via 
Netzwerk booten, wie es in der
INSTALL.sparc Datei beschrieben ist.
</ul>

<p>
<h3><font color=#e00000>OpenBSD/amiga:</font></h3>
<ul>
<p>
Erzeuge BSD-Partitionen mit Hilfe der Anleitung in INSTALL.amiga.
Dann die CD2 unter AmigaOS als Device CD0 mounten. Als n&auml;chstes folgendes CLI-Kommando
eingeben :
"CD0:2.9/amiga/utils/loadbsd CD0:2.9/amiga/bsd.rd".
</ul>

<p>
<h3><font color=#e00000>OpenBSD/hp300:</font></h3>
<ul>
<p>
Du kannst mit den Anleitungen aus INSTALL.hp300 &uuml;ber Netzwerk booten.
</ul>

<p>
<h3><font color=#e00000>OpenBSD/mac68k:</font></h3>
<ul>
<p>
Boote ganz normal das MacOS und partitioniere mit Hilfe der passenden
A/UX Konfigurationen. Danach packst du die Macside Utilities von
CD1:2.9/mac68k/utils auf deine Festplatte. Als n&auml;chstes l&auml;&szlig;t du Mkfs laufen, 
um die Dateisysteme zu erzeugen, die du mit Hilfe von A/UX gerade gemacht hast.
Danach benutzt du den 
BSD/Mac68k Installer um alle Teile aus CD1:2.9/mac68k/ auf deine Partition zu 
kopieren.
Schlussendlich bist du nun bereit, den BSD/Mac68k Booter mit dem genauen Ort des Kernels
zu konfigurieren und kannst das System booten.
</ul>

<p>
<h3><font color=#e00000>OpenBSD/sun3:</font></h3>
<ul>
<p>
Entweder machst du einen diskless boot oder erzeugst ein Installtionstape, wie in
INSTALL.sun3 beschrieben.
</ul>

<p>
<h3><font color=#e00000>OpenBSD/alpha:</font></h3>
<ul>
<p>
Hol' dir die Version per ftp. Danach machst du einen diskless boot oder bootest via Floppy, wie 
in INSTALL.alpha beschrieben.
</p>
</ul>

<p>
<h3><font color=#e00000>Anmerkungen zum Quellcode:</font></h3>
<ul>
<p>
src.tar.gz enth&auml;lt ein Archiv mit Quellcode, da&szlig; in /usr/src liegen sollte.
Diese Datei enth&auml;lt bis auf die Kernel-Quellen, die sich in
einer separaten Datei befinden, alles, was man braucht. Um den Quellcode zu entpacken :
<p>
<ul><pre>
# <strong>mkdir -p /usr/src</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/src.tar.gz</strong>
</pre></ul>
<p>
srcsys.tar.gz enth&auml;lt ein Quellcode-Archiv, das in /usr/src/sys beginnt.
Diese Datei enth&auml;lt alle Kernel-Quellen, die man ben&ouml;tigt, um einen neuen Kernel
zu erzeugen. Um sie zu entpacken:
<p>
<ul><pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/srcsys.tar.gz</strong>
</pre></ul>
<p>
Beide Archive enthalten einen regul&auml;ren CVS checkout. Wenn man diese Dateib&auml;ume
benutzt, ist es m&ouml;glich, die anoncvs-Server wie auf 
<a href=anoncvs.html>http://www.OpenBSD.org/anoncvs.html</a> zu benutzen.
Wenn man diese Dateien benutzt, hat man ein viel schnelleres erstes Update, als wenn man
einen frischen, eigenen OpenBSD Quellbaum (source tree) mit Hilfe von CVS holt.
<p>
</ul>
<a name=ports></a>
<hr>
<p>
<h3><font color=#0000e0>Der Ports Tree</font></h3>
<p>
Mitgeliefert wird auch ein ports tree Archiv. Um es zu entpacken:
<p>
<ul><pre>
# <strong>cd /usr</strong>
# <strong>tar xvfz /tmp/ports.tar.gz</strong>
# <strong>cd ports</strong>
</pre></ul>
<p>
Das ports/ Unterverzeichnis ist ein checkout f&uuml;r den OpenBSD ports tree.
Lies  am besten
<a href=../ports.html>http://www.OpenBSD.org/ports.html</a>
wenn du noch nichts &uuml;ber ports weisst.
Dieser Text ist keine Anleitung, wie man die ports benutzt, sondern nur dazu da, 
um den Leuten den Einstieg in das OpenBSD ports system zu erm&ouml;glichen.
<p>
Nat&uuml;rlich ist das OpenBSD ports System nicht vollst&auml;ndig. Es ist zu bezweifeln, 
dass es das jemals sein wird. Trotzdem w&auml;chst es sehr schnell und wird stabiler.
Fast alle ports, die ausgeliefert werden, sollten ohne Probleme auf den meisten 
Architekturen kompilierbar sein (auf z.B. i386 konnten &uuml;ber 1200 packages 
ohne Probleme erzeugt werden).
<p>
Das <i>ports/</i> Verzeichnis stellt ein CVS (siehe in der manpage f&uuml;r 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=1&manpath=OpenBSD+Current&arch=i386&format=html">
cvs(1)</a> nach, 
wenn du mit CVS nicht vertraut bist) checkout unserer ports dar. Wie unser kompletter
source tree ist auch auch unser ports tree via anoncvs verf&uuml;gbar. Um ihn also auf dem 
Laufenden zu halten, musst du den <i>ports/</i> tree auf einem schreibbaren Medium haben und den
tree mit diesem Kommando updaten:
<p>
<ul><pre>
# <strong>cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd -rOPENBSD_2_9</strong>
</pre></ul>
<p>
[Nat&uuml;rlich musst du die Namen f&uuml;r Server und [portsdir] mit deinen lokalen
Verzeichnis, bzw. dem Namen eines anoncvs-Servers in der N&auml;he austauschen.]
<p>
Denk daran, dass die meisten ports via ftp als fertige packages erh&auml;ltlich sind.
Upgedatete packages f&uuml;r 2.9 werden verf&uuml;gbar gemacht, sobald Probleme bekannt sind.
<p>
Falls du gerne einen weiteren port sehen willst, mithelfen willst, oder einfach mehr
erfahren willst, solltest du die Mailingliste ports@openbsd.org kennenlernen.
<p>

<hr>
<a href="index.html"><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br><small>
Originally [OpenBSD: 29.html,v 1.27 ]
<br>
$Translation: 29.html,v 1.20 2004/03/14 10:26:01 thorna Exp $
</small>
<br><small>$OpenBSD: 29.html,v 1.18 2004/03/14 22:01:51 jufi Exp $</small>
</body>
</html>
