<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN//2.0">
<html>
<head>
<title>OpenBSD/alpha</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="Die OpenBSD/alpha Seite">
<meta name="keywords" content="openbsd,alpha">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2001 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<h2>OpenBSD/alpha</h2>

<hr>
<h3><font color="#0000e0"><strong>Geschichte und Status:</strong></font></h3>

<p>Der OpenBSD/alpha port wurde im Sommer 1996 begonnen indem Code vom
NetBSD/alpha port benutzt wurde, der von Chris Demetriou
&lt;cgd@netbsd.org&gt; in 1994 aus der Taufe gehoben worden war. Nach dem original 
OpenBSD port hinderten einige Copyright Probleme OpenBSD daran dem Code von 
NetBSD zu folgen. 
Trotzdem wurde die Arbeit am alpha port fortgef&uuml;hrt und viele Fehler wurden behoben.
W&auml;hrend wir Fehler behoben haben hat NetBSD weitere Erweiterungen am
alpha port durchgef&uuml;hrt, denen wir dummerweise nicht folgen durften. Seitdem 
verschlechterte sich die Hard- und Soft-wareunterst&uuml;tzung aufgrund eines
Mangels an Programmieren und der Unm&ouml;glichkeit dem NetBSD-Code zu folgen.
Das f&uuml;hrte dazu, dass die 2.5 und 2.6 Versionen nur ziemlich wenig Kernel-
Erweiterungen hatten. Da der port daher so alt und abgestanden geworden war, war 
alpha nicht mehr in der OpenBSD Version 2.7 enthalten.<p>

<p>Seit kurzem gibt es Menge Interesse daran, den port wieder auf den aktuellen 
Stand zu bringen. Das gepaart mit der Tatsache, dass NetBSD die Lizenz seines
alpha codes ge&auml;ndert hat, so dass es keine Copyright Probleme mehr gibt,
f&uuml;hrt dazu, dass es erneut eine Anstrengung gibt den alpha port wieder
auf den aktuellen Stand zu bringen. (Details, warum wir dem NetBSD Code 
nicht mehr folgen konnten, gibts auf der
<a href=policy.html>policy</a> Seite.)</p>

<p>Es gibt zur Zeit keinen verantwortlichen f&uuml;r den alpha port. Technische 
Diskussionen &uuml;ber den alpha port sollten direkt an die <a
href="mailto:alpha@openbsd.org">&lt;alpha@openbsd.org&gt;</a> Mailingliste gerichtet werden.
Wenn du in irgendeiner Weise an Entwicklung am alpha port interessiert bist, schicke 
Anfragen bitte an diese Adresse. Wenn du am job des alpha port Verantwortlichen 
interessiert bist, hilf dem Projekt eine Weile und nimm den Job an.
</p>

<h3><font color=#0000e0><strong>Projekte (ohne besondere Reihenfolge):
</strong></font></h3>
<li>Den Alpha Kernel mit Hilfe von NetBSD auf aktuellen Stand bringen.
<li>Neue Binutils, um das ELF object file Format zu unterst&uuml;tzen.  (das f&uuml;hrt zu shared libs)
<li>Neue Bootblocks die ELF unterst&uuml;tzen.
<li>compat_osf1 shared libs.
<li>zu UVM kovertieren.
<li>neue pmap.
<li>bus_dma (was zur Unterst&uuml;tzung einer ganzen Menge an Ger&auml;ten f&uuml;hrt).
</ul>

<h3><font color=#0000e0><strong>Unterst&uuml;tzte Hardware:</strong></font></h3>

<p>Aufgrund der &Auml;nderungen, die momentan am alpha gemacht werden ist
die momentan unterst&uuml;tzte Hardware in schneller Bewegung. Nach unserem Wissen
wird die folgende Hardware noch unterst&uuml;tzt, aber das kann sich zu jeder Zeit &auml;ndern.
</p>

<ul>
<li><b>DEC 3000/[3456789]00 Serie mit den folgenden Peripheriegr&auml;ten:</b>
  <ul> 
  <li> Unterst&uuml;tzte Hardware:
    <ul>
    <li> eingebaute serielle Ports.
    <li> eingebautes LANCE ethernet.
    <li> eingebaute SCSI Chips (53c[f]94), obwohl m&ouml;glicherweise nicht beide zur selben Zeit arbeiten k&ouml;nnen.
    </ul>
  <li> Dinge, die m&ouml;glicherweise funktionieren ,aber nicht getestet sind:
    <ul>
    <li> TurboChannel option slot LANCE (PMAD-A).
    </ul>
   
  <li> Dinge, die zur Zeit *nicht* unterst&uuml;tzt werden:
    <ul>
    <li> Frame buffers jeglichen Typs
    <li> Andere TurboChannel option boards.
    <li> Der ISDN/Audio chip.
    </ul>
  </ul>
  
<li><b> AlphaStation {200,250,255,400,500}, AXPpci,<br>
Multia (obwohl viele Multias Kinderkrankheiten hatten oder auch Entwicklungsprobleme)<br>
Systeme, die die folgende Peripherie benutzen:</b>
  <ul> 
  <li> Unterst&uuml;tzte Hardware:
    <ul>
    <li> NCR 53c810 SCSI (eingebaut oder PCI board).
    <li> Built-in ns16550 serielle Ports.
    <li> DC21040-based ethernet (eingebaut oder PCI board).
    <li> DC21140-based PCI ethernet boards.
    <li> DC21050-based PCI-PCI bridges (obwohl andere Typen von PCI-PCI bridges funktionieren k&ouml;nnen).
    <li> PCI VGA video boards.
    <li> ISA VGA boards.
    <li> DEC ZLXp-E1 (DC21030-basierte, "TGA") video boards.
    <li> PCI und ISA NE2000-kompatible Ethernet Karten.
    <li> SMC/WD 8003, 8013, und die SMC "Elite16" ISA Ethernet boards.
    <li> 3Com 3c503 Ethernet Karten.
    <li> 3Com 3c5xx/3c9xx Ethernet Karten.
    <li> Lite-On PNIC (82c168, 82c169) basierte Ethernet Karten.
    <li> Keyboard.
    <li> PS/2-style M&auml;use.
    <li> IDE Controller (inklusive des eingebauten IDE Controller in manchen Maschinen).
    <li> Intel Etherexpress Pro/100B Karten.
    <li> Cyclades ISA Multiport serielle Karten.
    </ul>
   
  <li> Dinge, die vielleicht funktionieren,aber nicht gestestet wurden:
    <ul>
    <li> Eingebaute Parallel Ports.
    <li> ISA ns16x50-family serielle Port boards.
    <li> ISA ns16x50 multi-Port serielle boards.
    <li> Andere NCR 53c8xx SCSI boards.
    <li> Die Adaptec 152* SCSI Controller ISA boards.
    </ul>
   
  <li> Dinge, die zur Zeit *nicht* unterst&uuml;tzt werden:
    <ul>
    <li> Sound hardware (inclusive dem eingebauten Windows Sound System in manchen Machinen).
    <li> DEC ZLXp-E2 and ZLXp-E3 PCI video boards.
    <li> Der eingebaute scsi Controller auf der AlphaStation 600.
    <li> PCI und ISA boards, die nicht oben aufgelistet sind.
    <li> Das Floppylaufwerk.
    </ul>
  </ul>
  
 
<li><b>Zur Zeit werden keine der folgenden Systeme unterst&uuml;tzt:</b>
  <ul>
  <li> DECpc AXP 150 Systeme (EISA-bus PC-artige Systeme)
  <li> Alpha "server" Systeme (anders als vielleicht der AlphaServer 400, der eine versteckte AlphaStation 400 sein k&ouml;nnte).
  <li> Multiprocessor Alpha Systeme
  <li> EB164, PC164, PC164[LSR]X
  <li> Digital Personal Workstation (Miata) Systeme
  <li> 21264 basierte Systeme
  <li> API (Alpha Processor, Inc.) Systeme
  </ul>
</ul>

<h3><font color=#0000e0><strong>Snapshots:</strong></font></h3>

<p>W&auml;hrend wir daran arbeiten den alpha port wieder zum Leben zu erwecken wird es snapshots 
bestenfalls sporadisch geben. Wenn du daran interssiert bist uns zu helfen, w&auml;re es gut, wenn du
einen snapshot installieren w&uuml;rdest, dann auf -current upgradest und dann loslegst!
</p>

<hr>
<a href=plat.html><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: alpha.html,v 1.46 ]
<br>
$Translation: alpha.html,v 1.4 2000/09/12 18:27:49 jufi Exp $
<br>
<small>$OpenBSD: alpha.html,v 1.5 2001/02/16 03:11:03 smart Exp $</small>
</body>
</html>
