<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/arc</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="Die OpenBSD/arc Seite">
<meta name="keywords" content="openbsd,arc">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2001 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<h2>OpenBSD/arc</h2>

<hr>
<h3><strong>Geschichte und Status:</strong></h3>

<p>
Die fr&uuml;he Geschichte ist nicht ganz klar. Es scheint so, als ob die 
erste Arbeit von CMU w&auml;hrend ihres Mach-Projektes gemacht wurde.
Die erste Hardware waren
DEC R2000/R3000-basierte DECstations.  Dieser Code wurde sp&auml;ter von sowohl der Sprite- als auch der BSD-Gruppe benutzt.
Der 4.4BSD Code, auch als `pmax'-Port bekannt, wurde etwa Mitte '93 ver&ouml;ffentlicht. Er wurde von einer Vielzahl von Leuten in den 
NetBSD-Tree eingef&uuml;gt, ist aber nie ganz stabil, komplett oder zuverl&auml;ssig geworden. 
Compiler toolkit Probleme haben den Port stets geplagt, da das Standard "a.out" -Format eine ung&uuml;nstige Variante f&uuml;r die MIPS Architektur ist.
</p>

<p>
Per Fogelstr&ouml;m wurde immer vertrauter mit dem Code, nachdem er ihn auf ein selbstgebautes IDT R3081-basiertes Board portiert hatte.
Hinterher f&uuml;gte er R4400 - Unterst&uuml;tzung hinzu, als er 
das System auf 
ein MIPS R4400 Acer PICA board portierte.  Willowglen
Singapore kaufte ein weiteres PICA Board f&uuml;r Theo de Raadt, so da&szlig; er 
den Port soweit verbessern konnte, da&szlig; er als Entwicklungssystem f&uuml;r ein
internes Projekt benutzt werden konnte. Seitdem haben Theo, Per und andere den Port komplettiert.
</p>

<p>
Das Acer PICA ist eine tote Plattfrom. Acer baut keine Maschinen mehr, aber noch schlimmer ist, das die Maschinen sehr rar sind.
Allerdings war die Acer PICA nur eine aus einer ganzen Familie von Maschinen,
die von anderen Firmen wie 
MIPS, Deskstation, NEC, Olivetti gebaut wurden. Diese Maschinen waren als ARC-Maschinen bekannt, gebaut nach der 
<a href="http://www.microsoft.com/hwdev/download/respec/riscspec.zip">
Advanced RISC Computing</a> Spezifikation.
Wahrscheinlich werden keine neuen 
ARC BIOS Maschinen f&uuml;r MIPS mehr gebaut werden.
Microsoft hat angek&uuml;ndigt, da&szlig; es MIPS nach NT 4.0 nicht mehr unterst&uuml;tzt.
OpenBSD/arc stellt eine gute Alternative zu NT dar, insbesondere , da jetzt keinerlei  Updates f&uuml;r NT MIPS mehr herausgebracht werden.
Deskstation hat die Gesch&auml;ftst&auml;tigkeit aufgegeben, so da&szlig; es von ihnen auch keinerlei ARC MIPS Maschinen mehr geben wird.
</p>

<p>
Als ein Resultat wurde der Code wandelbarer gemacht, und daher sollte er 
jetzt eine gr&ouml;&szlig;ere Menge von ARC-Maschinen unterst&uuml;zen.
Hoffentlich wird ein Port daraus resultieren, der auf der gesamten Breite 
von MIPS-Prozessoren l&auml;uft:
R4000, R4xx, R43xx, R4400, R46x0, R4700, R5000, 
R8000 und R10000.
</p>

<p>
<h3>Momentan unterst&uuml;tzt der Port folgendes:</h3>
<ul>
<li>Acer Pica: 150MHz R4400PC, ISA, mit onboard ethernet, scsi, video,
	und seriellem Port.</li>
<li><a href="http://www.deskstation.com">Deskstation</a>
	Tyne: 133MHz R4600, ISA and VLB.</li>
<li><a href="http://www.deskstation.com">Deskstation</a>
	rPC44: 100MHz R4400PC, EISA bus.</li>
<li><a href="http://www.algor.co.uk">Algorithmics</a> R4000/R5000/R10000 evaluation board</li>
<li>NEC RiscStation works.</li>
</ul>
</p>

<p>
<h3>Unterst&uuml;tzte Karten/Bauteile/Peripherie:</h3>
<ul>
<li> Grafik:</li>
  <ul>
  <li> der eingebaute S3 VGA Grafik Adapter in PICA.</li>
  <li> Standard VGA graphics adapter in rPC44 und Tyne.</li>
  <li> Bitte zur Kenntnis nehmen, da&szlig; X11R6 momentan nur S3 Boards unterst&uuml;tzt.</li>
  </ul>
 
<li> Keyboard:</li>
  <ul>
  <li> Standard PC kompatibles Keyboard mit optional geladenem Treiber f&uuml;r verschiedene Tastaturbelegungen.</li>
  </ul>
  
<li> Maus:</li>
  <ul>
  <li> PS2 Maus auf PICA</li>
  <li> Serielle Maus in /dev/tty00 auf rPC44 und Tyne.</li>
  </ul>
 
<li> Serielle Ports:</li>
  <ul>
  <li> on-board tty00 und tty01 (Nur PICA. K&ouml;nnen noch nicht als Konsole benutzt werden)</li>
  <li> ISA tty00 und tty01 auf Systemen mit seriellem Port auf dem Motherboard (Tyne).</li>
  <li> ISA tty02 und tty03 auf allen Systemen, die ISA unterst&uuml;tzen.</li>
  </ul>

<li> Parallel Ports:</li>
  <ul>
  <li> Parallel Ports werden on-board (PICA) oder mit ISA (rPC44 and Tyne) unterst&uuml;tzt.</li>
  </ul>
 
<li> Floppy:</li>
  <ul>
  <li> Floppy wird nur auf PICA unterst&uuml;tzt.</li>
  </ul>
 
<li> Ethernet:</li>
  <ul>
  <li> on-board SONIC ethernet controller (PICA only)</li>
  <li> 3Com Etherlink boards (Alle ISA f&auml;higen Systeme)</li>
  <li> NE2000 kompatible ISA boards.</li>
  </ul>
 
<li> SCSI:</li>
  <ul>
  <li> on-board NCR53C96 SCSI controller (PICA)</li>
  <li> VLB "Buslogic BT-440C/445C" SCSI controller.</li>
  <li> ISA "Buslogic BT-545" SCSI controller im rPC44.</li>
  </ul>
 
<li> IDE:</li>
  <ul>  
  <li> IDE disks via wd driver &uuml;ber ISA bus. Bootbar nur auf Deskstation Systems.</li>
  </ul>

<li> Verschiedenes:</li>
  <ul>
  <li> Joystick am ISA Bus.</li>
  </ul>
</ul>
</p>

<p>
<h3>An den folgenden Ports wird noch gearbeitet:</h3>
<ul>
<li>Algorithmics P-4032 und P-5064 boards.</li>
</ul>
</p>

<p>
Die Leute, die am meisten an OpenBSD/arc arbeiten sind :
Per Fogelstr&ouml;m, Theo de Raadt, Niklas Hallqvist, Warner Losh,
und ein paar andere. Nat&uuml;rlich sind weitere jederzeit willkommen!
</p>

<p>
<h3>J&uuml;ngste Entwicklungen:</h3>
<ul>
<li>PCI Bus Unterst&uuml;tzung auf Algorithmics P-4032 und P-5064 boards.</li>
<li>Unterst&uuml;tzung f&uuml;r <a href="http://www.qedinc.com">QED</a> RM52x0 Prozessoren. (R5000 Derivate).</li>
<li>Kernel DDB funktioniert.</li>
</ul>
</p>

<p>
Der ARC port ist komplett, und schliesst alles ein, was man
von einem OpenBSD-Port erwarten kann.
</p>

<hr>
<p>
<a href="ftp.html">Neue Snapshots gibt es von Zeit zu Zeit.</a>

<p>
Mail an <a href="mailto:imp@openbsd.org">Warner Losh</a> und
<a href="mailto:pefo@openbsd.org">Per Fogelstr&ouml;m</a>.
</p>

<hr>
<a href="plat.html"><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: arc.html,v 1.35 ]
<br>
$Translation: arc.html,v 1.8 2001/08/25 10:15:09 jufi Exp $
<br>
<small>$OpenBSD: arc.html,v 1.4 2001/08/25 10:29:57 jufi Exp $</small>
</body>
</html>
