<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="resource-type" content="document">
<meta name="description" content="B&uuml;cher &uuml;ber BSD und OpenBSD">
<meta name="keywords" content="openbsd,b&uuml;cher,informationen">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1998-2003 by OpenBSD.">
<meta name="generator" content="The vi editor from UNIX">
<meta name="Author" content="Ian Darwin">
<title>Der OpenBSD B&uuml;cherladen</title>
</head>

<body bgcolor="#ffffff">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" border="0" src="../images/smalltitle.gif"></a>
<p>
<h2><font color="#cc0000">UNIX und BSD B&uuml;cher</font></h2>
<hr>

<p>
Wir arbeiten jetzt mit <a href="http://www.amazon.com/">Amazon.com</a>
zusammen, so dass du einige dieser B&uuml;cher direkt bei ihnen bestellen kannst.
<em>Die Bestellung &uuml;ber die "Bestelle bei Amazon" Links ist ein Weg, dem OpenBSD Projekt
zu helfen</em>.

<p>
<ul>
<li><a href="#1">OpenBSD-spezifische B&uuml;cher</a>
<li><a href="#2">BSD-spezifische B&uuml;cher</a>
<li><a href="#3">Unix Anwenderhandb&uuml;cher</a>
<li><a href="#4">Unix Administration</a>
<li><a href="#5">Unix Programmierung</a>
<li><a href="#6">Netzwerk Administration</a>
<li><a href="#7">Kryptografie</a>
</ul>
<hr>

<h3><a name="1">OpenBSD-spezifische B&uuml;cher</a></h3>
<dl>
<dt><i>Absolute OpenBSD</i>
<dd>by Michael Lucas
<dd>
Michael Lucas, der Autor der Big Scary Daemons Serie von O'Reilly,
die die BSD-Familie behandelt, hat ein Buch speziell &uuml;ber OpenBSD
geschrieben. Das Buch deckt alle Aspekte des OpenBSD Betriebssystems
f&uuml;r neue UNIX und BSD User auf ca. 600 Seiten ab.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1886411999/openbsdA/">Bei Amazon bestellen</a>]
<p>
<dt><i>Building Firewalls with OpenBSD and PF</i>
<dd>von Jacek Artymiak
<dd>
Der Autor Jacek Artymiak, der durch seine exzellente Online-Serie von 
Artikeln &uuml;ber pf und OpenBSD bekannt ist, hat dieses Buch mit
200 Seiten &uuml;ber allgemeine pf- und OpenBSD-Sicherheit geschrieben.
<dd>[<a href="http://www.devguide.net/books/buildingfirewallswithopenbsdandpf/">Bestellen bei devguide.net</a>]
<p>
<dt>
<i>Building Linux and OpenBSD Firewalls</i>
<dd>von Wes Sonnenreich, Tom Yates.
<dd>
Dieses Buch beschreibt die OpenBSD 2.5 Installation und das elementare Management der Firewall-Tools.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0471353663/openbsdA/">Bestellen
bei Amazon</a>]
</dl>
<hr>

<h3><a name="2">BSD-spezifische B&uuml;cher</a></h3>
<dl>
<dt>
<i>Design and Implementation of the 4.4 BSD Operating System</i>
<dd>von Marshal Kirk McKusick, Keith Bostic, Michael J. Karels, John S. Quarterman
<dd>
Mit 549 Seiten plus Index, muss man <a href="http://cseng.aw.com/book/0,3828,0201549794,00.html">dieses Buch</a> als umfassend bezeichnen.
McKusick, Bostic und Karels sind wohlbekannt als die Hauptfiguren an der 
Berkeley CSRG (Computer Systems Research Group) w&auml;hrend der 4.3/4.4BSD
Zeit. Dieses Buch deckt die Versionen 4.4 und 4.4-Lite ab, und diskutiert
alles was man &uuml;ber die Funktionsweise des Betriebssystems wissen sollte.  Nicht
100% anwendbar, aber wahrscheinlich am n&auml;chsten dran, wenn man nach einem &Uuml;berblick &uuml;ber
die Systeminterna von OpenBSD sucht.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201549794/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt>
<i>Source Code Secrets: The Basic 386BSD Operating System Reference
(Volume 1 of Operating System Source Code Secrets)</i>
<dd>von L. W. Jolitz, William Jolitz; 1997
<dd>
Die Jolitzes haben die erste Version von BSD f&uuml;r die PC-386 Architektur erzeugt,
und verdienen eine Menge Dank daf&uuml;r, dass sie BSD auf diese preiswerte
Architektur gebracht haben. Die ersten Versionen, die noch "386bsd" hiessen, wurden in Artikeln
im <EM>Dr. Dobbs Journal</EM> beschrieben. Dieses Buch geht &uuml;ber diese Artikel hinaus,
und beinhaltet eine umfassende Menge an Quellcode.
Nat&uuml;rlich ist nicht alles auf moderne Versionen von OpenBSD anwendbar, aber kann immernoch eine Menge daraus lernen.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1573980269/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt>
<i>Berkeley Unix: A Simple and Comprehensive Guide</i>
<dd>von James Wilson
<dd>
F&auml;ngt mit den Basis-Kommandos an und endet mit fortgeschrittenen Programmiertechniken.
Die System Calls werden dabei ausf&uuml;hrlich behandelt.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=047161582X/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt>
<i>An Introduction to Berkeley Unix and ANSI C</i>
<dd>von Jack Hodges
<dd>
Eine Einf&uuml;hrung in das Betriebssystem und die Programmiersprache.  Gedacht f&uuml;r
ein Selbststudium, und verlangt daher keinerlei Vorkenntnisse von Unix. Deckt die
fundamentalen Dinge der Programmierung ab, die korrekte Benutzung der Syntax,
Programmierungsstil, Finden von Fehlern, Logik und System Programmierung mit C.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0130684953/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt>
<dt>
<i>4.4 BSD User's Reference Manual (URM)</i>
<dd>ver&ouml;ffentlicht von O'Reilly, 1994
<dd>
Dies ist nur eine gedruckte Version der Man-Pages f&uuml;r User. 
Dein OpenBSD enth&auml;lt die Online Man-Pages, die auf OpenBSD
zugeschnitten und aktueller sind.
Also brauchst du das Buch eigentlich nicht, nimm stattdessen einfach das
<em>man</em> Kommando.
<p>
<dt>
<dt>
<i>4.4 BSD System Manager's Manual (SMM)</i>
<dd>ver&ouml;ffentlicht von O'Reilly, 1994
<dd>
Dieses Buch beschreibt im Detail, was man wissen muss, um
ein BSD System zu administrieren. Recht viel dieses Materials ist auf
OpenBSD anwendbar.
Ungl&uuml;cklicherweise ist es im Moment nicht mehr zu haben.
Noch schlimmer ist aber, dass die elektronische Version aufgrund 
von Lizenz Beschr&auml;nkungen von AT&amp;T nicht in 4.4BSD enthalten war,
daher ist das meiste davon auch nicht in OpenBSD enthalten.
Das bisschen, was da ist, kann &uuml;ber die <a href="docum.html">Dokumentationsseite</a> gefunden werden.
<p>
<dt>
<dt>
<i>BSD mit Methode</i>
<dd>erschienen bei C&amp;L Computer- und Literaturverlag GmbH, 1998
<dd>
<a href="http://www.cul.de/buecher/bsd.html">Ein Buch auf deutsch</a> &uuml;ber alle
drei freien BSDs , das die Grundlagen der Installation, X Konfiguration und System Administration abdeckt, genauso
wie Perl Programmierung und Tips f&uuml;r LaTeX/Lyx hat.
Auch die grafische Oberfl&auml;che KDE wird abgedeckt.
<br>&Auml;ltere Versionen von OpenBSD sind auf den beiden zugeh&ouml;rigen CD-ROMs enthalten. 
<br>Momentan nicht bei Amazon.com erh&auml;ltlich, aber <a
href="http://www.lob.de/cgi-bin/work/frameset?flag=jfl&amp;frame=yes&amp;id=38effe1813566">
Lehmann's Online Bookshop</a> hat es. Wahrscheinlich willst du aber gerne <a
href="http://www.lob.de/cgi-bin/work/frameset?flag=jfl&amp;frame=yes&amp;id=38effe1813566">aktuellere
Versionen der CD-ROMs haben</a>.
</dl>
<hr>

<h3><a name="3">Unix Anwenderhandb&uuml;cher</a></h3>
<dl>
<dt><i>Unix Made Easy</i>
<dd>von John Muster
<dd>Ein allgemeines Unix Buch, das alle Bereiche des Systems abdeckt.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0078821738/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>UNIX Power Tools</i>
<dd>von Jerry D. Peek, Tim O'Reilly, und Mike Loukides
<dd>
Dieses Buch ist jetzt in der zweiten Auflage erschienen. Es beinhaltet hunderte
netter Tricks, eher unbekannte Techniken und Zusatzutilities.
Sei dir im klaren dar&uuml;ber, dass viele der Utilities sowieso schon Teil von
OpenBSD sind, oder zumindest als ports/packages vorhanden sind.
Das meiste der Sektion 52.03, die &uuml;ber die Schwierigkeiten der Portierung von
Software auf die verschiedenen Unices handelt, kannst du vergessen, wenn du den
<a href="../ports.html">Ports Mechanismus </a>
verstanden hast, der Teil von OpenBSD ist.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1565922603/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i><a href="http://www.rodsbooks.com/multiboot/">The Multi-Boot Configuration Handbook</a></i>
<dd>von Rod Smith
<dd>
<dd>
Das Buch erkl&auml;rt Techniken f&uuml;r Multi-booting.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0789722836/openbsdA/">Bestellen bei Amazon</a>]
</dl>
<hr>

<h3><a name="4">Unix Administration</a></h3>
<dl>
<dt><i>UNIX System Administration Handbook</i>
<dd>von Evi Nemeth, Garth Snyder, Scott Seebass, Trent R. Hein
<dd>
Das ist ein exzellentes Buch &uuml;ber Unix System Administration.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0130206016/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>Essential System Administration</i>
<dd>von AEleen Frisch
<dd>
Dieses Buch beinhaltet viele fundamentale Ziele in der Systemadministration. Enthalten sind auch 
Beispiele f&uuml;r einen grossen Bereich von Unix-Systemen, inklusive BSD.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1565921275/openbsdA/">Bestellen
bei Amazon</a>]
</dl>
<hr>

<h3><a name="5">Unix Programmierung</a></h3>
<dl>
<dt><i>Unix Systems for Modern Architectures</i>
<dd>von Curt Schimmel
<dd>
Diese Buch f&uuml;hrt seinen Leser durch alle low-level Kernel Modelle f&uuml;r Multi-Prozessor-
Architekturen. OpenBSD beinhaltet bisher keine Multiprozessorf&auml;higkeit, aber was glaubst du,
was die Entwickler lesen?
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201633388/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>Lions' Commentary on UNIX 6th Edition with Source Code</i>
<dd>von John Lions
<dd>
Obwohl das hier beschriebene Unix im Vergleich zu BSD wie ein
Ford Modell T
zu einem 70's Mustang oder Thunderbird aussieht, sagt UNIX Erfinder Ken Thompson
"Nach &uuml;ber 20 Jahren ist das hier immer noch die beste Ausf&uuml;hrung &uuml;ber
das Arbeiten eines "echten" Betriebssystems." Urspr&uuml;nglich mit Hilfe von Fotokopien weitergegeben,
ist dieses Buch dasjenige, an dem sich die erste und zweite Generation von Unix-Hackern ihre Z&auml;hne
scharf gemacht haben. Empfohlen als eine gute Einf&uuml;hrung f&uuml;r ein "timesharing" Betriebssystem, wenn man
das nicht schon kennt.
Deutlich k&uuml;rzer als der McKusick weiter oben.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1573980137/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>The Practice of Programming</i>
<dd>von Brian W. Kernighan and Rob Pike
<dd>
Brian Kernighan hatte seine Hand bei zwei weiteren B&uuml;chern im Spiel, die wir empfehlen, auch wenn sie nicht Unix-spezifisch sind, aber f&uuml;r
alle Programmierer auf Unix oder sonstwo n&uuml;tzlich. Dieses Buch deckt praktische Programmier&uuml;berlegungen f&uuml;r C, C++ und Java ab. 
Sehr zu empfehlen.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=020161586X/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>The Elements of Programming Style</i>
<dd>von Brian W. Kernighan and P. J. Plauger
<dd>
Dieses Buch ist <i>The Practice of Programming</i> recht &auml;hnlich, aber &auml;lter.  Die
Beispiele sind in Fortran und PL/I.  
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0070342075/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>Advanced Programming in the Unix Environment</i>
<dd>von W. Richard Stevens
<dd>
Das hier ist ein sehr detailliertes und leicht zu lesendes Buch. Es hat mehrere Beispiele,
von denen man leicht lernen kann. Es beinhaltet allerhand Informantionen &uuml;ber
Bibliotheken und Systemaufrufe,
und passende Informationen um sie auch anzuwenden.
Dieses Buch ist zusammen mit den OpenBSD man pages eine exzellente Kombination.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201563177/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>The C Programming Language (deutsche Version: Programmieren in C)</i>
<dd>von Brian W. Kernighan und Dennis M. Ritchie
<dd>
Dies ist eine klarer und b&uuml;ndiger Ratgeber zur Programmiersprache C,
vielleicht der einzige, den du jemals brauchen wirst. Er konzentriert sich einzig auf C, nicht darauf,
wie du deinen Compiler bedienen musst oder sonstwas.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0131103628/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>C: A Reference Manual</I>
<dd>von Samuel P. Harbison und Guy L. Steele 
<dd>
Wenn du nur zwei B&uuml;cher &uuml;ber C h&auml;ttest, dann w&uuml;rdest du neben <i>The C Programming Language</I> 
dieses hier wollen !
Das ist kein Lehrbuch, (daher der Titel), sondern befasst sich mit Syntax, Data types,
ISO C library Functions, und C/C++ Kompatibilit&auml;t.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0133262243/openbsdA/">Bestellen von Amazon</a>]
<p>
</dl>

<hr>

<h3><a name="6">Netzwerk Administration</a></h3>
<dl>
<dt><i>SSH, The Secure Shell.</i>
<dd>von	Daniel J. Barrett und Richard Silverman
<dd>Der definitive Ratgeber. OpenSSH wird im Detail behandelt.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0596000111/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>TCP/IP Illustrated, Volume 1</i>
<dd>von W. Richard Stevens
<dd>
"Network administration" ist eine wirkliche unpassende Beschreibung f&uuml;r dieses Buch.  
Es ist eine Enzyklop&auml;die der TCP/IP Protokoll-Familie.
Es beinhaltet Informationen und Diagramme, mit deren Hilfe man die Protokolle bis in
die tiefsten Ebenen verstehen kann.
Enthusiasten, Entwickler und Netzwerk-Administratoren werden dieses Buch alle geniessen.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201633469/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>Kerberos: A Network Authentication System</i>
<dd>von Brian Tung
<dd>
Ein Wegweiser f&uuml;r Administratoren von Kerberos-basierten Netzwerken. 
Erkl&auml;rungen der Konzepte von Kerberos, genauso wie Installation 
und Administration desselben.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0201379244/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>IPsec: The New Security Standard for the Internet, Intranets and Virtual
Private Networks</i>
<dd>von Naganand Doraswamy und Dan Harkins 
<dd>
Dieses Buch erkl&auml;rt die IPsec Protokoll Suite.  Es beschreibt auch dessen Beziehung zu aktuellen
Entwicklungen wie etwa VPNs und Zukunftsideen.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0130118982/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>Computer Networks</i>
<dd>von Andy Tanenbaum
<dd>
Dieses Buch ist ein High-Level Guide f&uuml;r moderne Computer Netzwerke.  Es pr&auml;sentiert eine breite Masse
an Protokollen, Konzepten und Technologien. Es deckt Technologien von Fiber bis drahtlos,
LANs, Mobile IP, und eine Menge weitere ab.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0133499456/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>DNS and BIND</i>
<dd>von Paul Albitz and Cricket Liu
<dd>
Dieses Buch ist eine exzellente Einf&uuml;hrung in DNS und BIND, und somit f&uuml;r jeden
n&uuml;tzlich, der eins oder beides unter OpenBSD implementieren muss.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0596001584/openbsdA/">Bestellen
bei Amazon</a>]
<p>
<dt><i>DHCP</i>
<dd>von Ted Lemon and Ralph E. Droms
<dd>
Empfohlen vom <A HREF="http://www.isc.org/">Internet Software Consortium</a>,
 welches die Organisation ist, die die DHCP Client/Server Software
schreibt, die in OpenBSD enthalten ist. 
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1578701376/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>Managing NFS and NIS</i>
<dd>von Hal Stern
<dd>
Stellt essentielle Informationen &uuml;ber das Managen von NFS und NIS mit 
Beispielen bereit.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1565925106/openbsdA/">Bestellen
bei Amazon</a>]

<p>
<dt><i>802.11 Security</i>
<dd>von Bruce Potter und Bob Fleck
<dd>
Bietet Informationen &uuml;ber die Grundlagen von drahtloser Sicherheit
einschliesslich praktischer L&ouml;sungen zum Konfigurieren von Clients,
Access Points und Gateways unter verschiedenen Betriebssystemen. 
Zwei Kapitel sind OpenBSD 3.1 gewidmet, und beinhalten auch wi, 
bridge, pf und altq.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0596002904/openbsdA/">Bestellen
bei Amazon</a>]
</dl>

<hr>
<h3><a name="7">Kryptografie</a></h3>
<dl>
<dt><i>Angewandte Kryptografie: Protokolle, Algorithmen, und Source Code in C</i>
<dd>von Bruce Schneier
<dd>
Eine umfassende Erkl&auml;rung der Kryptografie, mit Informationen &uuml;ber ihre
Geschichte, Protokolle und Algorithmen. Dieses Buch ist eine grossartige Einf&uuml;hrung in
die Kryptografie, mit den notwendigen Grundlagen, um das ganze Feld auch verstehen zu k&ouml;nnen.
Ausserdem hat es eine ziemlich umfangreiche Literaturliste und Quellenangabe.
<br>
Bei Amazon hat das Buch jemand wie folgt kommentiert "<i>
It is common to find that masters of mysterious technical arts are poor communicators. Bruce Schneier
demonstrates exceptional skill as a technical communicator. Here is a book about an esoteric subject - one
built on a foundation of theoretical mathematics - that ordinary folk can read. Sure, one needs to be
motivated by an interest in the subject, and the technical level sometimes requires a more than ordinary
background in number theory and the like - but a degree in theoretical mathematics is not necessary to
derive pleasure and profit from reading Applied Cryptography.</i>"
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0471117099/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>Handbook of Applied Cryptography</i>
<dd>by Alfred J. Menezes, Paul C. van Oorschot und Scott A. Vanstone 
<dd>Ein neuer und detaillierter Blick auf die Kryptografie.  Der Author schreibt:
<dd>
...  Public-key cryptographic techniques
are now in widespread use, especially in the financial services
industry, in the public sector, and by individuals for their personal
privacy, such as in electronic mail. This Handbook will serve as a
valuable reference for the novice as well as for the expert who
needs a wider scope of coverage within the area of cryptography.
It is a necessary and timely guide for professionals who practice
the art of cryptography.
<dd>Das gesamte Buch kann von der Website der Autors in PDF oder Postscript
<a href="http://cacr.math.uwaterloo.ca/hac/index.html">
kostenlos heruntergeladen werden</a> (nur zum pers&ouml;nlichen Gebrauch).
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN=0849385237/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>SSL and TLS Essentials: Securing the Web</i>
<dd>von Stephen A. Thomas
<dd>
Dieses Buch biete eine Einf&uuml;hrung in die SSL und TLS Protokolle, sowie dazu passende Beispiele.
Das SSL Protokoll ist momentan die Basis f&uuml;r sicheren Datentransfer und gesicherte Transaktionen
im Internet. Abgesehen von der Verschl&uuml;sselung deckt das Buch auch Datenintegrit&auml;t und Details
&uuml;ber das SSL-Protokoll ab.
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0471383546/openbsdA/">Bestellen bei Amazon</a>]
<p>
<dt><i>SSL and TLS: Designing and Building Secure Systems</i>
<dd>von Eric Rescorla
<dd>
Dieses Buch bietet umfassende Informationen &uuml;ber die SSL und TLS 
Protokolle und behandelt ihren Betrieb und Sicherheit zusammen mit
Details der Benutzung und der Implementierung.
Es gibt auch Kapitel &uuml;ber HTTP &uuml;ber SSL und SMTP &uuml;ber 
TLS (STARTTLS).
Eric Rescorla ist der Author von <tt>ssldump</tt>, einem Werkzeug mit
dessen Hilfe man SSL Verbindungen &uuml;berwachen kann.
Er hat mehrere kommerzielle und freie SSL Implementations geschrieben.
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0201615983/openbsdA/">
Bestellen bei Amazon</a>]
<p>
<dt><i>Big Book of IPsec RFCs: Internet Security Architecture</i>
<dd>zusammengestellt von Pete Loshin
<dd>
Ein kompletter Neudruck der <A HREF="../faq/faq13.html#rfc">IPsec RFCs</a> mit
einem ausf&uuml;hrlichen Index und Glossar.
<dd>
[<A href="http://www.amazon.com/exec/obidos/ISBN%3D0124558399/openbsdA/">Bestellen bei Amazon</a>]
</dl>


<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: books.html,v 1.41 ] 
<br>
$Translation: books.html,v 1.32 2003/08/20 20:04:34 grunk Exp $
</small>
<br><small>$OpenBSD: books.html,v 1.29 2003/08/22 20:32:38 jufi Exp $</small>
</body>
</html>
