<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Kryptografie in OpenBSD</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="description" content="OpenBSD Kryptografie">
<meta name="keywords" content="openbsd,Kryptografie,openssh,openssl,kerberos">
<meta name="keywords" content="openbsd,ipsec,isakmp,ike,blowfish,rsa,dsa">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997-2004 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<img align="left" alt="[Blowfish-Bild]" height="166" width="197" SRC="../images/blowfish-notext.jpg">
<br>
<br>
<br>
Das Mantra eines jeden guten Sicherheitsingenieurs ist: "Sicherheit
ist kein Produkt, sondern ein Prozess." Es steckt mehr dahinter
als starke Kryptografie in ein System zu integrieren, es bedeutet das gesamte
System so zu entwerfen, dass alle Sicherheitsmassnahmen, inklusive der 
Kryptografie, zusammenarbeiten. 
<br>
<br>
-- Bruce Schneier, Autor von "Applied Cryptography".
<br clear=all>
<h2><font color="#e00000">Kryptografie</font></h2>
<hr>

<strong>Index</strong><br>
<a href="#why">Warum liefern wir Kryptografie aus?</a><br> 
<a href="#ssh">OpenSSH</a>.<br> 
<a href="#prng">Pseudo Zufallszahlen Generatoren</a> (PRNG): ARC4, ...<br>
<a href="#hash">Kryptografische Hash Funktionen</a>: MD5, SHA1, ...<br>
<a href="#trans">Symmetrische Verschl&uuml;sselungsverfahren</a>: DES, Blowfish, ...<br>
<a href="#hardware">Unterst&uuml;tzung f&uuml;r kryptografische Hardware</a><br>
<a href="#people">Internationale Kryptologen gesucht</a><br>
<a href="#papers">Weitere Quellen</a><br>
<p>
<hr>

<a name="why"></a>
<h3><font color="#e00000">Warum liefern wir Kryptografie aus?</font></h3><p>

In drei Worten:  <strong>weil wir k&ouml;nnen</strong>.<p>

Das OpenBSD Projekt ist in Kanada beheimatet.<p>

Die <a href="../ECL.html">Export Kontrollliste von Kanada</a>
beinhaltet keine signifikaten Beschr&auml;nkungen bez&uuml;glich des
Exports von kryptografischer Software und ist sogar noch offener,
was den Export frei-erh&auml;ltlicher kryptografischer Software angeht.
Marc Plumb hat 
<a href="http://www.efc.ca/pages/doc/crypto-export.html">
einige Nachforschungen betrieben, um die Kryptografiegesetze zu pr&uuml;fen
</a>.
<p>

Daher hat das OpenBSD-Projekt Kryptografie in zahlreichen Stellen im Betriebsystem
integriert. Wir verlangen, dass die kryptografische Software, die wir benutzen
wollen, 
<a href="policy.html">frei erh&auml;ltlich ist und guten Lizenzen unterliegt</a>.
Wir benutzen keine Kryptografie mit unzul&auml;nglichen Lizenzen direkt.
Wir verlangen ausserdem, dass solche Software aus L&auml;ndern mit vern&uuml;nftigen
Exportbedingungen kommt, da wir nicht die Gesetze irgendeines Landes brechen 
wollen.
Die kryptografischen Komponenten, die wir momentan benutzen, wurden in
Argentinien, Australien, Kanada, Deutschland, Griechenland, Norwegen und
Schweden geschrieben.
<p>

Wenn wir OpenBSD-Versionen oder -Snapshots machen, erzeugen wir diese
in freien L&auml;ndern, um sicherzustellen, dass sowohl Quellen, als auch
Bin&auml;rdateien frei von Beschr&auml;nkungen sind.
In der Vergangenheit wurden unsere Versionen in Kanada, Schweden und
Deutschland erzeugt.
<p>

OpenBSD wird mit Kerberos V ausgeliefert.
Die Codebasis, die wir benutzen, ist die exportierbare Heimdal
Version aus Schweden.
Unsere X11-Quellen wurden ebenfalls so erweitert, dass sie Gebrauch von
Kerberos machen.
<p>


<img align=right alt="vpnc-test-partner.gif" src="../images/vpnc-test-partner.gif">
OpenBSD war das erste Betriebssystem, das mit einem IPsec-Stack ausgeliefert wurde.
IPsec ist Teil des Systems seit der Ver&ouml;ffentlichung der Version OpenBSD 2.1 im
Jahre 1997. Unser voll konformer kernel-interner IPsec-Stack mit m&ouml;glicher 
Hardwareuntertst&uuml;tzung durch Zusatzkarten und unser eigener freier ISAKMP daemon
wird als eine der Maschinen im `IPsec conformance testbed' von der
<a href="http://www.vpnc.org">VPNC</a> benutzt.
<br clear=all>
<p>

Heutzutage ist Kryptografie eine wichtige Sache, um die 
<a href="security.html">Sicherheit</a> eines Betriebsystems zu 
erh&ouml;hen. Die in OpenBSD integrierte Kryptografie kann in folgende
Bereiche klassifiziert werden:
<p>

<a name="ssh"></a>
<h3><font color="#e00000">OpenSSH</font></h3><p>

Seit der Version 2.6 hat OpenBSD 
<a href="http://www.openssh.com/">OpenSSH</a> integriert, eine absolut
freie und nicht-patentierte Version von ssh. 
<a href="http://www.openssh.com/">OpenSSH</a> interagiert auch mit ssh
Version 1 und hat viele weitere Features,
<ul>
<li>
alle Teile restriktiver Natur wurden entfernt (also Patente, siehe
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl">ssl</a>)
jegliche lizensierte oder patentierte Komponenten stammten aus externen
Libraries/Bibliotheken.
</li>
<li>
wurde um das Protokoll Version 1.5 erweitert.
</li>
<li>
beinhaltet Unterst&uuml;tzung f&uuml;r Kerberos Authenfizierung und
Ticket-Passing.
</li>
<li>
unterst&uuml;tzte Einmal-Passw&ouml;rter durch 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey">skey</a>.
</li>
</ul>
<p>

Grob gesagt haben wir eine Version von ssh mit freier Lizenz genommen und sie OpenBSD-fiziert.
Ungef&auml;hr ein Jahr sp&auml;ter haben wir OpenSSH so erweitert, das es nun auch das 
SSH 2 Protokoll beherrscht, das Resultat ist, dass alle drei grossen SSH Protokolle unterst&uuml;tzt
werden: 1.3, 1.5, 2.0.
<p>

<a name="prng"></a>
<h3><font color="#e00000">Pseudo Zufallszahlen Generatoren</font></h3><p>

Ein Pseudo Zufallszahlengenerator (PRNG = Pseudo Random Number Generator) versorgt Applikationen mit einem Strom
von Zahlen, die einen erheblichen Einfluss auf die Sicherheit des Systems haben:
<p>

<ul>
<li>Es sollte f&uuml;r einen Aussenstehenden unm&ouml;glich sein, weitere Zahlen vorauszusagen,
sogar mit Kenntnis der bisherigen Zahlen.
<li>Die generierten Zahlen sollten keine sich wiederholenden Muster aufweisen,
d.h. der PRNG sollte einen sehr langen Kreislauf haben.
</ul>
<p>

Ein PRNG ist eigentlich nur ein Algorithmus, bei dem mit den selben Startwerten
auch die selben Ergebnisse herauskommen.
Bei einem Multi-User-System gibt es viele M&ouml;glichkeiten den PRNG mit
Zufallsdaten zu f&uuml;ttern.
Der OpenBSD Kernel benutzt das Maus-Interrupt-Timing, Netzwerk-Daten-Interrupt-
Verz&ouml;gerungen, die Zeit zwischen Tastendr&uuml;cken und Festplatten
I/O-Informationen, um Zufallszahlen zu bekommen.
Zufallszahlen stehen den Kernel-Routinen zur Verf&uuml;gung und werden an 
"Userland"-Programme weitergegeben.
Bisher werden Zufallszahlen benutzt von:<p>

<ul>
<li>Dynamische sin_port Zuweisung in bind(2).
<li>PIDs von Prozessen.
<li>IP Datagramm-IDs.
<li>RPC Transaktions-IDs (XID).
<li>NFS RPC Transaktions-IDs (XID).
<li>DNS Abfrage-IDs.
<li>Inode generation numbers, siehe getfh(2) und fsirand(8).
<li>Timingst&ouml;rungen in traceroute(8).
<li>St&auml;rkere vor&uuml;bergehende Namen f&uuml;r mktemp(3) und mkstemp(3)
<li>Zuf&auml;lligkeit zum TCP ISS hinzugef&uuml;gt, um Spoofing-Angriffe zu
	verhindern.
<li>Zuf&auml;lliges padding in IPsec esp_old Paketen.
<li>Um salts f&uuml;r die verschiedenen Passwort-Algorithmen zu generieren.
<li>Um vorget&auml;uschte S/Key Herausforderungen zu generieren.
<li>In <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd">isakmpd</a>,
        um lebende Beweise f&uuml;r Schl&uuml;sselaustausch zu haben.
</ul>

<p>
<a name="hash"></a>
<h3><font color="#e00000">Kryptografische Hashfunktionen</font></h3><p>

Eine Hashfunktion komprimiert ihre eingegebenen Daten zu einer
Zeichenkette konstanter L&auml;nge.
F&uuml;r eine kryptografische Hashfunktion ist es undurchf&uuml;hrbar, folgendes zu finden:

<ul>
<li>Zwei Eingaben, die die selbe Ausgabe erzeugen (Resistent gegen Kollisionen),
<li>Eine andere Eingabe f&uuml;r eine gegeben Eingabe mit der selben Ausgabe
	(2nd preimage resistant).
</ul>
<p>

In OpenBSD werden MD5, SHA1, und RIPEMD-160 als kryptografische Hash-Funktionen benutzt,
z.B. hier:<p>
<ul> 
<li>In <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey">S/Key</a>
    um Einmal-Passw&ouml;rter bereitzustellen.
<li>In <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec">IPsec</a>,
    und
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd">isakmpd(8)</a>
    um die Herkunft von Daten zu authentifizieren und Packetintegrit&auml;t zu gew&auml;hrleisten.
<li>Um MD5 Passw&ouml;rter im FreeBSD-Stil bereitzustellen (kein Standard), siehe
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd.conf&amp;sektion=5">
    passwd.conf(5)</a>
<li>In libssl zum digitalen Signieren von Nachrichten.
</ul>
<p>

<p>
<a name="trans"></a>
<h3><font color="#e00000">Symmetrische Verschl&uuml;sselungsalgorithmen</font></h3><p>

Symmetrische Verfahren werden benutzt um Daten zu ver- und entschl&uuml;sseln.
Normalerweise werden sie mit einem Schl&uuml;sel zur Ver- und einem Schl&uuml;ssel zur 
Entschl&uuml;sselung gebraucht. Die Sicherheit eines symmetrischen Algorithmus sollte
wirklich nur auf den Schl&uuml;sseln beruhen.
<p>

OpenBSD stellt symmetrische Verfahren wie DES, 3DES, Blowfish und Cast f&uuml;r Kernel-
und Userland-Programme zur Verf&uuml;gung, die an vielen Pl&auml;tzen, wie z.B. an diesen benutzt
werden :
<p>
<ul>
<li>In der libc zum Erstellen von
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=blf_key">Blowfish</a>
    Passw&ouml;rtern.  Dazu siehe auch das <a href="../papers/bcrypt-paper.ps">USENIX paper</a>
    .
<li>In
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec">IPsec</a>
    um Vertrauen in die Netzwerkschicht zu bringen.
<li>In <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd">isakmpd</a>
    um den Austausch von IPsec Schl&uuml;sselmaterial zu sch&uuml;tzen.
<li>In AFS um die Nachrichten zu sch&uuml;tzen, die &uuml;ber das Netzwerk gehen,
    und Vertrauen in den Zugriff auf entfernte Dateisysteme zu gew&auml;hrleisten.
<li>In libssl um Applikationen &uuml;ber das kryptografisch sichere und zudem
    de-facto-Standard 
    ssl-Protokoll laufen zu lassen.
</ul>

<a name="hardware"></a>
<h3><font color="#e00000">Unterst&uuml;tzung f&uuml;r kryptografische Hardware</font></h3><p>

OpenBSD unterst&uuml;tzt seit Version 2.7 einige kryptografische Hardware wie etwa 
Hardwarebeschleuniger und Zufallszahlengeneratoren.
<ul>
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crypto&amp;sektion=9">
    IPsec crypto dequeue</a></b><br>
    Unser IPsec-Stack wurde so ver&auml;ndert, dass kryptografische Funktionen
    auch "au&szlig;er-der-Reihe" gemacht werden k&ouml;nnen. Die meisten Software-IPsec-Stacks
    m&uuml;ssen die kryptografischen Funktionen mit jedem einzelnen Paket, das sie behandeln,
    durchf&uuml;hren. Das resultiert in synchroner Leistungsf&auml;higkeit. Um Hardware sauber und schnell
    zu nutzen, muss man diese zwei Komponenten trennen, so wie von uns durchgef&uuml;hrt. Tats&auml;chlich
    springt dabei sogar etwas Leistung f&uuml;r die Softwareseite heraus.
<p>
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hifn&amp;sektion=4">
    Hifn 7751</a></b><br>
    Karten, die den Hifn 7751
    verwenden, k&ouml;nnen als symmetrischer kryptografischer Hardwarebeschleuniger benutzt werden, z.B. 
    <a href="http://www.soekris.com/vpn1201.htm">Soekris VPN1201 oder VPN1211</a>
    (<a href="http://www.soekris.com/how_to_buy.htm">hier zu kaufen</a>)
    oder
    <a href="http://www.powercrypt.com">PowerCrypt</a>.
    Die momentan dabei erreichte Leistung betr&auml;gt
    64Mbit/sec f&uuml;r 3DES/SHA1 ESP, wenn man einen einzelnen Hifn 7751 auf jeder Seite eines
    Tunnels hat, das ist fast eine 600%ige Verbessrung gegen&uuml;ber einer
    P3/550 CPU.  An weiteren Verbesserungen bez&uuml;glich einiger Punkte wird noch gearbeitet,
    aber mit Stand 13.April 2000 wird der Code als stabil angesehen.
    Wir haben unseren eigenen Treiber geschrieben, um diesen Chip zu unterst&uuml;tzen, anstatt
    den (in den USA geschriebenen)
    <a href="http://www.powercrypt.com">Powercrypt</a> Treiber zu benutzen, ausserdem
    arbeitet unser Treiber sauber mit IPsec zusammen.
    Der 7751 wird in bezug auf Industriestandard als langsam angesehen und viele Anbieter 
    haben schnellere Chips (auch Hifn hat einen schnelleren, aber auch teuereren Chip).
    Die Spitzenperformance mit 3DES SHA1 ESP betr&auml;gt etwa 64Mbit/sec.
    <p>
    Nachdem 2.9 ausgeliefert worden war, wurde noch Unterst&uuml;tzung f&uuml;r den Hifn 7951 Chip hinzugef&uuml;gt,
    eine vereinfachte Version des 7751, die einen Beschleuniger f&uuml;r Public Keys enth&auml;lt
    (noch nicht unterst&uuml;tzt) und einen Zufallszahlengenerator (unterst&uuml;tzt).  Die Karten wurden von
    <a href="http://www.soekris.com/">Soekris Engineering</a> gespendet.
    <p>
    Nach der Auslieferung von 3.0 wurde dann noch Unterst&uuml;tzung 
    f&uuml;r den Hifn 7811 Chip hinzugef&uuml;gt, einer schnelleren Version 
    des 7751 (etwa 130Mbit/s) mit einem Zufallszahlengenerator.
    Die Karte wurde von <a href="http://www.gtgi.com/">GTGI</a> gespendet.
    <p>
    Nachdem 3.2 ausgeliefert wurde, wurde eine Unterst&uuml;tzung f&uuml;r
    den LZS Kompressionsalgorithmus, der von
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipcomp&amp;sektion=4">ipcomp(4)</a>
    benutzt wird, hinzugef&uuml;gt.
    <p>
    Nachdem 3.4 ausgeliefert wurde, wurde Unterst&uuml;tzung f&uuml;r die
    7955 und 7956 Chips hinzugef&uuml;gt. Zus&auml;tzlich zu allen Funktionen
    des vorherigen 7591 Chips beherrschen diese AES.
    <p>
    Hifn war anf&auml;nglich eine Firma, mit der schwer umzugehen war 
    (sie haben uns angedroht, uns wegen unseres "nicht-USA reverse engineering" 
    ihres crypto unlock Algorithmus zu verklagen), aber in letzter Zeit 
    haben sie uns besser unterst&uuml;tzt und uns Boards und Support gegeben.
    <p>

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=lofn&amp;sektion=4">
    Hifn 6500</a></b><br>
    Dieses Ger&auml;t ist eine asymmetrische Krypto-Einheit. Sie unterst&uuml;tzt RSA, DSA,
    und DH Algorithmen, genauso wie andere grosse Funktionen. Es enth&auml;lt einen sehr schnellen
    Zufallszahlen-Generator. Wir haben ein Ger&auml;t, die ganze Dokumentation, und Beispiel-Code. 
    Mit 3.1 arbeiten sowohl der Zufallsgenerator, als auch die big number unit.
    <p>

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=nofn&amp;sektion=4">
    Hifn 7814/7851/7854</a></b><br>
    Dieses Ger&auml;t ist ein Paket-Prozessor und asymmetrische Kryptoeinheit. Sie hat Unterst&uuml;tzung
    f&uuml;r RSA, DSA, und DH Algorithmen, wie auch f&uuml;r andere wichtige "big number functions" und hat 
    auch einen Zufallszahlengenerator. Momentan werden die "big number engine" und der Zufallszahlengenrator 
    unterst&uuml;tzt (keine Paket-Transformationen).
    <p>

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ubsec&amp;sektion=4">
    Broadcom BCM5801/BCM5802/BCM5805/BCM5820/BCM5821/BCM5822/5823
    (oder der Beta Chip Bluesteelnet 5501/5601)</a></b><br>
    Direkt nach der Ver&ouml;ffentlichung von OpenBSD 2.7 konnten wir erstmalige Unterst&uuml;tzung
    f&uuml;r diese fr&uuml;hen Versionen erreichen,  die uns der Hersteller
    zu Verf&uuml;gung gestellt hat, insbesondere mit dem Testchip 5501.
    Diese Ger&auml;te bringen die schnellste symmetrische Kryptografie, die wir bisher gesehen haben.
    <p>
    Bluesteelnet wurde von Broadcom aufgekauft und hat danach richtige Teile gemacht.
    Ihre neue BCM5805 ist &auml;hnlich, au&szlig;er dass sie auch eine asymmetrische Maschine
    hinzuf&uuml;gt haben, um DSA, RSA und &auml;hnliche Algorithmen zu unters&uuml;tzen. Mit einer 
    ann&auml;hernd doppelt so grossen Performance wie die der Hifn wird dieser Chip hoffentlich
    bald verbreiteter sein. 
    <p>
    Die Leute von Broadcom/Bluesteelnet waren wirklich grossartig. Sie gaben uns die
    komplette Dokumentation f&uuml;r ihre Chips, Beispiel-Code und dazu noch eine ausreichende Menge an Karten,
    um das ganze zu testen.
    <p>
    Post-2.8 wurde dieser Treiber auch dahingehend modifiziert, dass er Zufallszahlen auf dem
    BCM5805 und &auml;hnlichen Versionen produziert, und diese dann in der `Kernel Entropie Pool'
    &uuml;bergibt.
    <p>
    Post-2.9 wurde Unterst&uuml;tzung f&uuml;r den BCM5820 hinzugef&uuml;gt, was gr&ouml;sstenteils ein schnellere
    (64bit, h&ouml;here Taktrate) Version des BCM5805 ist. Noch ungetestete Unterst&uuml;ltzung 
    f&uuml;r den BCM5821 wurde auch Post-3.0 hinzugef&uuml;gt.
<p>
    Mit 3.1 wird die "big num engine" unterst&uuml;tzt, und RSA/DH/DSA Operationen k&ouml;nnen
    beschleunigt werden.
    <p>
    Unterst&uuml;tzung f&uuml;r den BCM5801, BCM5802, BCM5821 und BCM5822 wurden vor
    OpenBSD 3.2 hinzugef&uuml;gt (die ungetestestete BCM5821 Unterst&uuml;tzung in 3.1 hat wegen einiger
    nicht dokumentierter Interrupt Handling-Probleme nicht funktioniert).
    <p>
    Partielle Unterst&uuml;tzung f&uuml;r BCM5823 wurde bei 3.4 hinzugef&uuml;gt. Der Chip unterst&uuml;tzt AES, aber der Treiber nicht.
    <p>
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ises&amp;sektion=4">
    Securealink PCC-ISES</a></b><br>
    Der <a href="http://www.safenet-inc.com/technology/chips/safexcel_ises.asp">PCC-ISES</a> 
    ist ein neuer Chipsatz aus den Niederlanden.  Wir haben Probe-Hardware und
    Dokumentation, und die Arbeit an einem Treiber ist im Gange. Im Moment
    kann der Treiber bereits Zufallszahlen an den `Kernel Entropie Pool' liefern.
    <p>
       
<li><b>SafeNet SafeXcel 2141</b><br>
    Wir haben Dokumentation und Probe-Hardware f&uuml;r die
    <a href="http://www.safenet-inc.com/technology/chips/safexcel_2141.asp">SafeNet</a>
    Krypto-Karten bekommen. Wir arbeiten daran, wenigstens die symmetrische Kryptografie zu 
    unterst&uuml;tzen. 
    <p>

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=txp&amp;sektion=4">
    3com 3cr990</a></b><br>
    3com hat uns einen Treiber gegeben, um die Ethernet-Seite dieses Chipsets zu unterst&uuml;tzen, 
    und wir haben basierend darauf einen eigenen Ethernet-Treiber geschrieben. Der
    Treiber wurde jetzt in OpenBSD eingef&uuml;gt, wo wir eine freie Lizenz 
    f&uuml;r den Microcode erhalten haben.  Wegen schlechter Dokumentation 
    und einem Mangel an Koorperation (der teilweise durch die hohen 
    Austauschraten bei 3com begr&uuml;ndet ist), werden die IPsec Funktionen
    des Chips nicht unterst&uuml;tzt... daher hat sich das ganze als 
    gar nicht sinnvolle Erfahrung herausgestellt.
    <p>

<li><b>Intel IPsec card</b><br>
    Intel tut viel f&uuml;r ihre Netzwerkprodukte, aber im Gegensatz zu allen anderen Anbietern weigert
    sich Intel standhaft, uns Dokumentation zu geben. Wir haben mit etwa 5 Technikern gesprochen, die an der
    Entwicklung dieser Produkte beteiligt sind. Sie alle wollten, dass wir Dokumentation bekommen. Sie 
    loben uns f&uuml;r das, was wir bisher getan haben. Aber ihre H&auml;nde sind vom Management gebunden,
    die f&uuml;r sich keinen Vorteil sehen, wenn sie uns Dokumentation geben. Vergiss Intel. 
    (Wenn du Gigabit Ethernet Hardware kaufen willst, empfehlen wir alles andere.. aus eben dem selben
    Grund: Die meisten Treiber, die wir bisher geschrieben haben, wurden ohne Dokumentation geschrieben.)  
    <p>
<p>

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pchb&amp;sektion=4">
    Intel 82802AB/82802AC Firmware Hub RNG</a></b><br>
    Der 82802 FWH Chip (zu finden auf i810, i820, i840, i850, und i860 Motherboards)
    enth&auml;lt einen `random number generator (RNG)'.  High-performance IPsec
    ben&ouml;tigt mehr Zufallszahlenentropie.  Seit dem 10. April 2000 unterst&uuml;tzen wir den
    RNG. Wir werden Unterst&uuml;tzung f&uuml;r weitere RNGs auf anderen Crypto Chips hinzuf&uuml;gen.
   <p>

<li><b>VIA C3 RNG</b><br>
    Die neuere VIA C3 CPU enth&auml;lt einen Zufallszahlengenerator als Anweisung.
    Ab <a href="33.html">3.3</a> wird dieser Zufallszahlengenerator im
    Kernel dazu genutzt, den Entropie Pool zu f&uuml;llen.
    <p>

<li><b>OpenSSL</b><br>
    Jahre zuvor hatten wir einen grossen Plan, Krypto-Karten zu unterst&uuml;tzen, die
    RSA/DH/DSA automatisch &uuml;ber OpenSSL Calls k&ouml;nnen. Mit OpenBSD 3.2 wir diese
    Unterst&uuml;tzung funktionieren, und jede Karte mit einer solchen Funktionalit&auml;t,
    die unterst&uuml;tzt wird, wird automatisch die Hardware benutzen, einschliesslich 
    OpenSSH und dem httpd im SSL Modus. An den Applikationen werden 
    keinerlei &Auml;nderungen ben&ouml;tigt.
</ul>

<p>
   <b>Wenn jemand beim Schreiben der Treiber helfen will, bitte einfach
    <a href="#people">herkommen und mithelfen</a>.</b>
<p>
<a name="people"></a>
<h3><font color="#e00000">Internationale Kryptologen gesucht</font></h3><p>

Nat&uuml;rlich braucht unser Projekt Leute, die an diesen Systemen arbeiten. 
Wenn ein Nicht-amerikanischer Kryptologe, den die oben erw&auml;hnten Zw&auml;nge
nicht betreffen, an Mitarbeit an unserer eingebettenen Kryptologie 
interessiert ist, soll er uns kontaktieren.
<p>

<p>
<a name="papers"></a>
<h3><font color="#e00000">Weitere Quellen</font></h3><p>

Eine Reihe von Leuten aus dem OpenBSD-Team haben Vortr&auml;ge und Aufs&auml;tze &uuml;ber
die Ver&auml;nderungen geschrieben, die sie in OpenBSD eingef&uuml;hrt haben.
Die Postscript-Versionen sind hier erh&auml;ltlich:
<p>

<ul>
<li>A Future-Adaptable Password Scheme.<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    von <a href="mailto:provos@openbsd.org">Niels Provos</a>,
    <a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
    <a href="../papers/bcrypt-paper.ps">Papierform</a> und
    <a href="../papers/bcrypt-slides.ps">Folien</a>.
<p>
<li>Cryptography in OpenBSD: An Overview.<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    von <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
    <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
    <a href="mailto:art@openbsd.org">Artur Grabowski</a>,
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/crypt-paper.ps">Papierform</a> und
    <a href="../papers/crypt-slides.ps">Folien</a>.
<p>
<li>Implementing Internet Key Exchange (IKE).<br>
    <a href="events.html#usenix2000">Usenix 2000</a>,
    von <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a> und
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>.<br>
    <a href="../papers/ikepaper.ps">Papierform</a> und
    <a href="../papers/ikeslides.ps">Folien</a>.
<p>
<li>Encrypting Virtual Memory<br>
    <a href="events.html#sec2000">Usenix Security 2000</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/swapencrypt.ps">Papierform</a> und
    <a href="../papers/swapencrypt-slides.ps">Folien</a>.
<p>
<li>The Design of the OpenBSD Cryptographic Framework.<br>
    <a href="../events.html#usenix2003">Usenix 2003</a>, von
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:jason@openbsd.org">Jason L. Wright</a>, und
    <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
    <a href="../papers/ocf.pdf">Papierform</a>.
</ul>

<p>
<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt="[Haupt-Seite]"</a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: crypto.html,v 1.126 ]
<br>
$Translation: crypto.html,v 1.75 2004/02/21 08:07:45 jufi Exp $
<br>
</small>
<small>$OpenBSD: crypto.html,v 1.68 2004/02/21 08:47:13 jufi Exp $</small>
</body>
</html>
