<!DOCTYPE HTML PUBLIC  "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>CTM</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="resource-type" content="document">
<meta name="description" content="Die OpenBSD/CTM Seite">
<meta name="keywords" content="openbsd,ctm">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2004 by OpenBSD.">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#23238E">

<center>
<img alt="CTM for OpenBSD" src="../images/bsdctm.gif" width="401" height="126">
</center>

<h3><font color="#0000e0">Was ist CTM?</font></h3>

<p>
CTM ist ein System, das von Poul-Henning Kamp erschaffen wurde, um die
regelm&auml;ssigen &Auml;nderungen an einem source tree per E-Mail verf&uuml;gbar
zu machen. Das ist ein guter Weg, um beim "-current source" auf dem laufenden zu bleiben,
selbst wenn man eine langsame Internetverbindung hat, z.B. via Modem.

<p>
OpenBSD CTM enth&auml;lt alle Module des OpenBSD CVS repository
plus einige vereinzelte Gesamt-Versionen von verschiedenen Modulen.
CTM benutzt eine sehr kleine Bandbreite, um die &Auml;nderungen am
source tree zu verschicken und komprimiert sie ausserdem per <tt><b>gzip -9</b></tt>.
Im Gegensatz zu <a
href="cvsup.html">CVSup</a>, ist CTM in normalem C geschrieben und daher f&uuml;r
jede Plattform verf&uuml;gbar, die von OpenBSD unterst&uuml;tzt wird.
CTM implementiert ein sogenanntes push System, w&auml;hrend alle anderen Methoden,
die Zugriff auf das OpenBSD CVS repository nehmen, pull Systeme sind.
<p>
Bei <b>jeglichen</b> Problemen, Vorschl&auml;gen, Berichten und Fragen bez&uuml;glich CTM
wende dich bitte an den 'CTM maintainer'
<a href="mailto:hgw@d1906.inka.de">Hans G&uuml;nter Weigand</a>.
<small>(Bitte keine anderen OpenBSD Leute um CTM Unterst&uuml;tzung,
da sie mit anderen Dingen besch&auml;ftigt sind.  Danke.)</small>

<h3><font color="#0000e0">Wie funktioniert es?</font></h3>

<p>
Die grunds&auml;tzliche Idee von CTM ist, dass du dich auf einer bestimmten
Mailingliste einschreibst, sie also abonnierst, um einen bestimmten Teil des
source trees oder eines CVS Moduls zu erhalten. Du erh&auml;ltst jeden Tag eine E-Mail mit den jeweiligen 
&Auml;nderungen dieses Tages. Ein solcher Satz &Auml;nderungen wird <strong>delta</strong>
genannt. Tats&auml;chlich macht der CTM-Server alle 12 Stunden neue deltas.


<p>
Du beginnst mit einem Basissatz gegen den dann sp&auml;ter die deltas gepatched
werden. Um mit CTM zu beginnen, musst du unbedingt die neueste Version des "base
set" (Basissatz) und alle danach folgenden deltas herunterladen; nachdem du diese verarbeitet 
hast, kannst du mit denen weitermachen, die du per E-Mail erh&auml;ltst.
Die Basis-S&auml;tze sind jeweils in 1440k Teile aufgeteilt, damit man sie leichter &uuml;ber
eine langsame Leitung herunterladen kann.

<p>
Basen werden nach 50 relativen deltas erstellt, so dass du nie mehr als 
50 deltas herunterladen musst, um auf den aktuellen Stand zu kommen.

<p>
Es gibt zur Zeit zwei verschiedene Arten von Basis-Dateien. Eine ganze Zeit
lang haben wir <tt><b>tar.gz</b></tt> Dateien per Hand erstellt, aber wir
sind jetzt wieder bei echten CTM Basis Deltas. Die letzteren enthalten
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md5&amp;sektion=1">md5(1)</a>
Checksummen und werden automatisch erstellt, sind also etwas sicherer.
Du kannst diese beiden Arten anhand ihres Dateinamens unterscheiden. Ein Beispiel f&uuml;r 
eine <tt><b>tar.gz</b></tt> Datei ist
<tt><b>OpenBSD-cvs.1450.tar.gz</b></tt>, w&auml;hrend ein CTM Basis Set
den folgenden Namen h&auml;tte: <tt><b>OpenBSD-cvs.1500A.gz</b></tt>.  Siehe unten f&uuml;r
detaillierte Anweisungen.

<h3><font color="#0000e0">Wieviel Bandbreite braucht CTM ?</font></h3>

<p>
Du musst das base set haben und alle relativen deltas bis zum 
jetzigen Datum dazu, und zwar per FTP von der unten aufgef&uuml;hrten Liste. Sie haben die folgenden
Gr&ouml;&szlig;en:

<ul>
<li> ungef&auml;hr 215Mb f&uuml;r OpenBSD-cvs
<li> ungef&auml;hr 40Mb f&uuml;r OpenBSD-cvs-x11
<li> ungef&auml;hr 65MB f&uuml;r OpenBSD-cvs-xf4.
<li> ungef&auml;hr 83Mb f&uuml;r OpenBSD-src
<li> ungef&auml;hr 36Mb f&uuml;r OpenBSD-src-x11
<li> ungef&auml;hr 4Mb f&uuml;r OpenBSD-ports
<br> Denke dran, dass das komprimierte Dateien sind -- ausgepackt sind sie etwa f&uuml;nfmal so gross.
<li> relative deltas sind zwischen 10k und 500k, und manchmal auch einige MB
<li> CTM teilt die deltas immer in 100kB Mail-Messages , die dann automatisch wieder zusammengef&uuml;gt werden
<li>Wenn ein Delta gr&ouml;sser als 5MB ist, wird es nicht via mail versendet. Anstattdessen bekommst du eine
 Benachrichtigung, dass du das Delta per FTP holen musst.
Gr&ouml;&szlig;ere CTM Updates sind selten, passieren aber meist nach dem Importieren von grossen Dingen
wie etwa den binutils, Perl, gcc, XFree86 , etc. oder dem Einf&uuml;gen eines CVS-Tags in den source tree.
</ul>

<h3><font color="#0000e0">Wie man benutzt man CTM?</font></h3>

<ul>
<li>Abboniere die CTM Mailingliste f&uuml;r das Source-set deiner Wahl.
<p>
   Es gibt verschiedene Mailinglisten f&uuml;r das Thema CTM.  Es gibt eine Liste f&uuml; die
   Updates am CVS repository,  eine Liste f&uuml;r den source tree, eine Liste
   f&uuml;r den X11 Teil und eine f&uuml;r den ports tree, sowie eine 
   f&uuml;r die Log Messages des CTM delta Generators.
   <p>
<p>
F&uuml;r das CVS repository (CVSROOT, ports, src und www Module,
aber ohne die X11 und XF4 Module):
<pre>
       echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org
</pre>
F&uuml;r das X11 Modul des CVS tree:
<pre>
       echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org
</pre>
F&uuml;r das XF4 Modul des CVS Repository:
<pre>
       echo subscribe OpenBSD-cvs-xf4 | mail majordomo@OpenBSD.org
</pre>
F&uuml;r eine ausgecheckte Kopie des src Modules:
<pre>
       echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org
</pre>
F&uuml;r eine ausgecheckte Kopie des X11 Moduls:
<pre>
       echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org
</pre>
F&uuml;r eine ausgecheckte Kopie des  ports tree:
<pre>
       echo subscribe OpenBSD-ports-CTM | mail majordomo@OpenBSD.org
</pre>
F&uuml;r die CTM log Liste:
<pre>
       echo subscribe CTM-log | mail majordomo@OpenBSD.org
</pre>

<p>
<li>Installiere das CTM Programm aus einem Package oder aus der ports
collection.  Den port gibt's unter
<tt><b>/usr/ports/devel/CTM</b></tt>.


</ul>
	<b>Hinweis:</b> Die Beispiele unten decken nur OpenBSD-cvs ab, einfach zur
	Kl&auml;rung. Die anderen source sets m&uuml;ssen auf die gleiche Art behandelt werden.

<p><ul>

<li>Lade das Basis-Set von einer FTP Site herunter. Du findest es im 
Unterverzeichnis <tt><b>base/OpenBSD-cvs</b></tt>. Hole alle Dateien in diesem 
Verzeichnis. Wenn du sie alle hast, kannst du die Basis-Datei erstellen und sie mit 
folgenden Kommandos auspacken, abh&auml;ngig vom Datei-Typ, den du hast:

<pre>
       cat split/OpenBSD-cvs.1500A.gz.* &gt; OpenBSD-cvs.1500A.gz
       cd target
       CTM -v -v -v .../OpenBSD-cvs.1500A.gz
</pre>
<p>
oder

<pre>
       cat split/OpenBSD-cvs.1450.tar.gz.* &gt; OpenBSD-cvs.1450.tar.gz
       cd target
       tar -xzvf .../OpenBSD-cvs.1450.tar.gz
</pre>

wobei <tt><b>split</b></tt> das Verzeichnis st, in dem du die heruntergeladenen Dateien
abgelegt hast und <tt><b>target</b></tt> der Platz ist, den du f&uuml;r das Auspacken des 
source set gew&auml;hlt hast.

<p>
Es ist nicht notwendig, die Dateien weiter zu behalten, sobald du einmal einen kompletten
tree hast. Aber du kannst die Basis-Set Dateien aus Backup-Gr&uuml;nden behalten. Auf jeden
Fall musst du aber die Nummer des Basis-Sets notieren, bevor du weitermachen kannst.

<p>
<li>Jetzt musst du die Deltas holen, die generiert wurden, seit das Basis-Set erstellt wurde.
Gehe auf einen der FTP-Server, die unten aufgef&uuml;hrt sind, ins Unterverzeichnis
<tt><b>OpenBSD-cvs</b></tt> und lade jede Datei herunter, die 
<em>gr&ouml;sser</em> ist als die Nummer des benutzten Basis-Sets. Dann verarbeite die Deltas:

<pre>
       cd target
       CTM -v -v -v deltas/OpenBSD-cvs.*
</pre>

<p>
wobei <tt><b>target</b></tt> das Verzeichnis ist, wo dein source set tree ist,
und <tt><b>deltas</b></tt> der Platz ist, wo deine Deltas gespeichert sind.
<p>

<li>Warte bis du dein erstes Delta von der Mailingliste bekommst:
<p>
<li>Entpacke und verarbeite das CTM delta mit Hilfe von <tt><b>CTM_rmail</b></tt>.
<p>

<pre>
       CTM_rmail -p /tmp -d deltas -b target folder
</pre>

<p>
wobei <tt><b>folder</b></tt> Der Mailordner ist, der die Delta-Mail enth&auml;lt.
Das wird das CTM Delta dekodieren und im 
<tt><b>deltas</b></tt> Verzeichnis speichern. Das Delta wird eine Datei der Form
form <tt><b>OpenBSD-cvs.<var>XXXX</var>.gz</b></tt> sein, wobei <var>XXXX</var>
die Nummer des Deltas ist.  Dann wird das Delta in den directory tree 
unter <tt><b>target</b></tt>, eingearbeitet, der Platz an dem du das
Basis Set ausgepackt hast.

<p>
Wiederhole diesen letzten Schritt jedesmal, wenn du ein Delta von der
Mailingliste erh&auml;lst. Wenn du magst, kannst du diesen Schritt mit Hilfe von procmail,
maildrop, oder &auml;hnlichen Programmen aus der
<a href="ports.html">ports collection</a> automatisieren.
</ul>
<p>
Hier ist die Liste der FTP Server die CTM deltas bereithalten:

<ul>
<li>Der Haupt-FTP Server ist hier zu finden:
<p>
<a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
     ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/
</a>.
<p>
Dieser Server wird normalerweise automatisch vom CTM delta Erzeugungsprozess upgedatet.
Basis-Sets sind als eine grosse Datei im <tt><b>base</b></tt> Verzeichnis zu finden.
Die split Dateien sind in <tt><b>base-split</b></tt>.
</ul>
<ul>
<li><a href="ftp://CTM.se.OpenBSD.org:/pub/OpenBSD-CTM/">
     ftp://CTM.se.OpenBSD.org:/pub/OpenBSD-CTM/
</a>
<p>
Dieser Server wird durch CTM deltas upgedatet, die von der Mailingliste eintreffen. Er hat 
zus&auml;tzlich die "split base deltas" im <tt><b>base</b></tt> Unterverzeichnis.
gespiegelt vom
<a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
     ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/
</a>.
</ul>
 
<ul>
<li><a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
<p>
ist identisch zu 
<p>
<li><a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
<p>
und ist ein Mirror von
<a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.se.OpenBSD.org
</a>
.
</ul>
<p>
<b>HINWEIS:</b> <a href="mailto:hgw@d1906.inka.de">Ich</a> bin sehr 
an weiteren Sites interssiert, die die 
deltas spiegeln m&ouml;chten.

<p>

<h3><font color="#0000e0">Sollte ich den source tree oder das CVS repository nehmen?</font></h3>

<p>
Das h&auml;ngt unter anderem von deinem verf&uuml;gbaren Platz auf der Festplatte ab.
Da CTM nicht besonders gut mit Dateien umgehen kann, die ausserhalb des CTM Prozesses 
modifziert wurden, ist die bessere Wahl sicherlich das <a href="anoncvs.html">CVS</a>
repository. Du kannst deine Arbeitskopie des source tree dann aus deinem CVS repository 
auschecken, einem stable branch folgen, und auch deinen lokalem &Auml;nderungen in deinem
source tree behalten. CVS ist smart genug, um deine lokalen &Auml;nderungen einzuf&uuml;gen.
Du kannst die volle Bandbreite an CVS-Kommandos mit Ausnahme von Kommandos wie etwa 
<tt><b>commit</b></tt> und <tt><b>cvs tag</b></tt> benutzen.

<p>
Der Nachteil ist der daf&uuml;r notwendige Plattenplatz.  Ein 'checked-out'
source tree ben&ouml;tigt etwa 370MB, aber wenn du dein eigenes cvs repository hast,
brauchst du etwa 1GB daf&uuml;r, <b>plus</b> zus&auml;tzliche 370MB f&uuml;r den 
"checked out" tree.
Das beinhaltet noch nicht die 100MB oder mehr, die du f&uuml;r erzeugte Dateien in einem 
"build" brauchst (abh&auml;ngig von der Archiktektur), sprich das Kompilieren der Sourcen.

<p>
Wenn du nur den source tree holst, musst du dich mit lokalen Ver&auml;nderungen 
anfreunden. Ein Weg, um das zu tun, ist die Nutzung des <b>union</b> Dateisystems,
(see <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_union&amp;sektion=8">mount_union(8)</a>),
obwohl es auch schon Berichte gegeben hat, das <b>union</b> Dateisystem k&ouml;nne
unstabil sein, wenn die unteren und oberen "layers" auf dem selben physischen 
Dateisystem residieren. Wenn du aber obere und untere Layer auf verschiedene
Dateisysteme plazierst, solltest du dieses Problem nicht haben.
Ein Beispiel:

<p>
Nehmen wir an, dein "CTM-updated" tree sei in <tt><b>/usr/src-CTM</b></tt>, und dein realer
source tree, der, an dem du deine &Auml;nderungen durchf&uuml;hrst und deine "builds" machst,
sei in <tt><b>/usr/src</b></tt>.  <tt><b>/usr/src</b></tt> sollte zu Anfang ein leeres Verzeichnis sein. 
Das folgende Kommando wird den union-mount setzen:
<br><br>
<pre>
    <b>mount -t union -o -b /usr/src-CTM /usr/src</b>
</pre>
<p>

<br><br>
&Auml;nderungen an Dateien in <tt><b>/usr/src</b></tt> werden zu einer Datei, die in
<tt><b>/usr/src</b></tt> enthalten ist, und die in <tt><b>src-ctm</b></tt> versteckt.  
Wenn &Auml;nderungen via CTM 
am darunterliegen <tt><b>src-ctm</b></tt> tree gemacht werden, werden diese &Auml;nderungen <b>nicht</b>
sichtbar sein, wenn es eine Datei in der dar&uuml;berliegenden Schicht gibt, die sie versteckt.

<p>
Das solltest regelm&auml;ssig das union-Dateisystem  "unmounten" 
und nach Dateien suchen, die es nur im union Dateisystem gibt.

<pre>
       umount /usr/src
       find /usr/src -type f
</pre>

<p>
Die Befehle <tt><b>ls -W</b></tt> und <tt><b>rm -W</b></tt> werden auch n&uuml;tzlich sein
da Objekte in <tt><b>/usr/src</b></tt>, die "whiteouts" im Namen beinhalten, auch Dateien in <tt><b>src-ctm</b></tt>.
verstecken.

<p>
Wenn du das CVS repository hast, kannst du das <tt><b>cvs checkout</b></tt>
Kommando benutzen, um daraus einen source tree zu machen, und jedesmal, wenn du mit CTM
ein Update durchgef&uuml;hrt hast, kannst du ein <tt><b>cvs update</b></tt> benutzen, um deinen
source tree 'upzudaten'.

<p>
Um ein erstes src repository zu bekommen:: 
<pre>
       cd /usr
       cvs -qd YOUR_CVS_REPOSITORY checkout -P src
</pre>
<p>
und nach jedem CTM Update:
<pre>
       cd /usr/src
       cvs -q update -Pd
</pre>

<h3><font color="#0000e0">Wie stabil ist CTM f&uuml;r OpenBSD?</font></h3>

	CTM wird seit &uuml;ber f&uuml;nf Jahren in OpenBSD benutzt, und in FreeBSD noch
	l&auml;nger.  CTM ist ziemlich zuverl&auml;ssig und stabil.

<h3><font color="#0000e0">Was h&auml;lt die Zukunft f&uuml;r CTM bereit?</font></h3>

Es gibt zahlreiche m&ouml;gliche Verbesserungen und  (kleine) &Auml;nderungen.
Darunter sind:

<ul>
<li> CTM verschickt niemals ein Delta, das gr&ouml;sser als 5 MB ist, per Mail. Das konnte man 
     auf zwei Weisen &auml;ndern: Die maximale Delta-Gr&ouml;sse k&ouml;nnte erh&ouml;ht werden,
     oder eine 'queue', die nur eine bestimmte Menge an Mails pro Tag abschickt, 
     k&ouml;nnte installiert werden. Wenn ein Delta z.B. 6MB gro&szlig; ist, wird es in 96
     Mail-Nachrichten aufgeteilt. Diese werden dann in eine 'queue' gepackt. Am ersten Tag werden
     davon 50 Nachrichten versendet, am zweiten Tag 46, plus 4 der folgenden Deltas.

<li> Die CTM Software k&ouml;nnte neu geschrieben werden, oder zumindest besser repariert werden.
     Die C Implementierung ist kein Beispiel guten Programmierens.
     Das w&auml;re auch eine gute Gelegenheit zum Hinzuf&uuml;gen neuer Features, wie z.B.
     das Unterzeichnen von CTM deltas mit PGP.

B
</ul>

Maile <a href="mailto:hgw@d1906.inka.de">mir</a> deine Meinung oder W&uuml;nsche!

<h3><font color="#0000e0">Mehr Informationen</font></h3>

Wenn du mehr &uuml;ber CTM lernen willst, ist das FreeBSD Handbuch ein guter Platz f&uuml;r Hilfe:

<ul>
<li> <a href="http://www.FreeBSD.org/handbook/CTM.html">
         http://www.FreeBSD.org/handbook/CTM.html
     </a>
</ul>

Es gibt auch man pages f&uuml;r alle CTM Utilities.

<p>
Du kannst auch die OpenBSD Mailinglisten oder mich selbst kontaktieren, wenn du 
Schwierigkeiten mit CTM hast, obwohl meine Freizeit doch recht eingeschr&auml;nkt ist.

<p>
<h3><font color="#0000e0">Zusammenfassung:</font></h3>

<p>

<ul>
<li> Mailinglisten:

   <ul>
   <li><tt>echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org</tt>
   <li><tt>echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org</tt>
   <li><tt>echo subscribe OpenBSD-cvs-xf4 | mail majordomo@OpenBSD.org</tt>
   <li><tt>echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org</tt>
   <li><tt>echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org</tt>
   <li><tt>echo subscribe OpenBSD-ports-CTM | mail majordomo@OpenBSD.org</tt>
   <li><tt>echo subscribe CTM-log | mail majordomo@OpenBSD.org</tt>
   </ul>

<p>
<li> FTP (f&uuml;r base sets und relative deltas):

   <ul>
   <li> <a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
        ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/</a>
   <li> <a href="ftp://CTM.OpenBSD.org:/pub/OpenBSD-CTM/">
         ftp://CTM.OpenBSD.org:/pub/OpenBSD-CTM/</a>
   <li> <a href="ftp://CTM.ca.OpenBSD.org:/pub/OpenBSD-CTM/">
         ftp://CTM.ca.OpenBSD.org:/pub/OpenBSD-CTM/</a>
   <li> <a href="ftp://CTM.se.OpenBSD.org:/pub/OpenBSD-CTM/">
         ftp://CTM.se.OpenBSD.org:/pub/OpenBSD-CTM/</a>
   </ul>
</ul>

<p>
Wichtigen &Auml;nderungen und Hinweise &uuml;ber CTM werden auf der announce@OpenBSD.org 
Mailingliste bekannt gegeben.

<p>

<h3><font color="#0000e0">Danksagungen</font></h3>
<ul>

<li> Poul-Henning Kamp (phk@FreeBSD.org) f&uuml;r CTM und die Hilfe 
     f&uuml;r die delta Generierung.

<li> Theo de Raadt (deraadt@theos.com) f&uuml;r OpenBSD und daf&uuml;r, dass
     er mir die Ressourcen gegeben hat, die CTM deltas auf cvs.OpenBSD.org zu erstellen
     (inzwischen werden sie an einem anderen Ort generiert) und
     f&uuml;r die Nameserver-Magie

<li> Todd C. Miller (millert@OpenBSD.org) f&uuml;r das Einrichten und Pflegen der
     CTM Mailinglisten

<li> Bob Beck (beck@OpenBSD.org), Artur Grabowski (art@OpenBSD.org),
     Magnus Holmberg (mho@OpenBSD.org) und
     Wolfram Schneider (wosch@FreeBSD.org) f&uuml;r das Einrichten des ftp space
     f&uuml;r die base sets und deltas auf ctm.*OpenBSD.org

<li> Thomas Graichen (graichen@OpenBSD.org) f&uuml;r den Beginn mit CTM f&uuml;r
     OpenBSD und das Verwalten &uuml;ber all diese Jahre

<li> Wim Vandeputte (wvdeputte@OpenBSD.org) f&uuml;r das aktuelle Hosten von CTM 

<li> ... und all die anderen, die indirekt geholfen haben
</ul>

<p>
Viel Gl&uuml;ck!

<p>


<hr>

<p>
Das OpenBSD/CTM Logo wurde f&uuml;r das OpenBSD Projekt von 
   <a href="mailto:flipk@openbsd.org">Phillip F Knaack</a> entworfen.

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD" /></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ctm.html,v 1.26 ]
<br>
$Translation: ctm.html,v 1.17 2004/02/20 18:51:45 jufi Exp $
<br></small>
<small>$OpenBSD: ctm.html,v 1.14 2004/02/20 19:47:24 jufi Exp $</small>
</body>
</html>
