<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/i386 Laptop Seite</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD laptop">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997,1998 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">
<img alt="[OpenBSD]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color=#e00000>i386 Laptop Status</font><hr></h2>

<p>
Dies ist eine Liste von Laptops, die bekanntermassen mit OpenBSD 2.6 funktionieren.

<p>
Wenn dein Laptop unten nicht aufgelistet ist, bedeutet das nicht zwangsl&auml;ufig, dass
er nicht funktioniert, und du wirst wahrscheinlich ein &auml;hnliches Modell unten in der
Liste entdecken. Seit OpenBSD 2.6 wissen wir nicht von Laptops, die nicht wenigstens zu einem
kleinen Teil funktionieren. Von diesen gibt es folgende Probleme:
<ul>
<li>Einige haben Probleme mit der APM Unterst&uuml;tzung.  Bitte denk dran, dass <strong>apm -S</strong>
    einige Laptops nicht in den Ruhezustand schickt, aber das ist kein Riesenproblem.
<li>Vielen fehlt die Sound Unterst&uuml;tzung
<li>Einige wenige haben Probleme mit der PCMCIA Unterst&uuml;tzung
<li>XFree86 unterst&uuml;tzt ihre Displays nicht sauber
<li>Oder einige eingebaute Ger&auml;te funktionieren nicht..
<li>Cardbus wird &uuml;berhaupt nicht unterst&uuml;tzt. PCMCIA arbeitet aber bestens. 
<li>Einige haben Probleme mit den pcmcia card eject interrupts, also dem Auswurf der Karten.
</ul>

<p>
Wenn du deinen Laptop zum Laufen gebracht hast (oder eben auch nicht) und er 
ist nicht unten aufgef&uuml;hrt, bitte schreibe eine Mail an
<a href="mailto:chris@openbsd.org">chris@openbsd.org</a> damit er aufgenommen
werden kann. Bitte gib uns dabei soviel Informationen wie m&ouml;glich.

<p>
Berichte &uuml;ber APM Probleme sollten an unsere APM-Entwickler geschickt werden,
<a href=mailto:mickey@openbsd.org>Michael Shalayeff</a> und
<a href=mailto:weingart@openbsd.org>Tobias Weingartner</a>.

<p>
<table border=1>
<tr>
	<th>Laptop</th>
	<th>Hinweise</th>
</tr><tr>
    <td>
	Sony VAIO F430
    </td><td>
        Seit OpenBSD 2.6-Current (vom 17. Feb 2000)<P>
 
	APM: "<strong>zzz</strong>" suspend funktioniert, genauso wie der keyboard
	suspend. "<strong>halt -p</strong>" und "<strong>apm -S</strong>" 
	nicht. (Aber ich muss mir noch die phdisk utilities ansehen - ich untersuche
	das in K&uuml;rze.) <P>

	DVD Laufwerk und Floppy funktionieren alle. Ethernet funktioniert nach einem
	wakeup mit der Karte, die ich benutze (3Com 3c589). <P>
	
	Kontaktiere <a href=mailto:beck@openbsd.org>Bob Beck</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO z505r
    </td><td>
	APM Unterst&uuml;tzung: "<strong>zzz</strong>", suspend via keyboard, hibernation 
	(Tiefschlaf) via keyboard, und "<strong>halt -p</strong>" funktionieren alle.
	"<strong>apm -S</strong>" l&auml;sst ihn sofot aufwachen.<p>

	Hibernation benutzt einen Block am Ende der Festplatte, ungef&auml;hr
	3-5MB gr&ouml;sser als der Speicher in deiner Maschine.  Um hibernation zu reparieren,
	benutze "<strong>phdisk.exe /create /partition</strong>" um die Partition 
	zu erstellen. Das phdisk Programm ist auf dem Boot-Floppy-Image auf der ersten
	Recovery CD zu finden. <p>

	Eingebautes ethernet arbeitet bestens, braucht aber einen Reset nach einem suspend,
	und zwar mittels 
	"<strong>ifconfig fxp0 down; ifconfig fxp0 up</strong>".<p>

	Nach einem suspend l&auml;uft die profiling clock nicht mehr.  An Patches 
	wird bereits gearbeitet.<p>

	Sound wird in 2.6 nicht unterst&uuml;tzt. Seit Mitte April 2000 l&auml;uft er mit einem Neomagic-Ger&auml;tetreiber.
	<p>

	Wenn der memory stick slot leer ist, kann das Fehler verursachen, die den 
	dmesg-Puffer &uuml;berlaufen lassen, und somit das OpenBSD-Installations-Programm
	verwirren k&ouml;nnen. Im BIOS (F2 beim Booten dr&uuml;cken) gibt es eine Option, 
	um den Memory Stick abzuschalten. <p>

	Eine XF86Config Datei ,die f&uuml;r die Benutzung mit XFree86 3.3.X angepasst ist,
	gibt es 
	 <a href="../xf86configs/vaioz505r">hier</a>.
	<p>

	Kontaktiere <a href=mailto:deraadt@openbsd.org>Theo de Raadt</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO z505s
    </td><td>
	&Auml;hnlich wie beim VAIO z505r, nur das die mitgelieferte USB Floppy einige
	Probleme macht.<p>
	Kontaktiere <a href=mailto:provos@openbsd.org>Niels Provos</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO 747</td>
    </td><td>
	Seit OpenBSD 2.6 funktionieren XFree86 und APM.<p>

	Wird mit einer PCMCIA Modem Karte ausgeliefert (COM One MCC220 Platinium Card), und die
	funktioniert auch.<p>

	Sound funktioniert (nur 8 Bit).<p>

	APM genauso wie der VAIO z505r,
	mit Ausnahme von hibernation, das einfach noch nicht getestet wurde.<p>

	USB funktioniert nicht.<p>

	Eine XF86Config Datei kann man
	<a href="../xf86configs/vaio747">hier</a> finden.<p>

	Kontaktiere <a href=mailto:markus@openbsd.org>Markus Friedl</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO PCG 505-FX
    </td><td>
	Unbekannt.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 701C
    </td><td>
	Alle Features inklusive hibernation und APM funktionieren.<p>

	Kontaktiere <a href=mailto:todd@openbsd.org>Todd Fries</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 770Z
    </td><td>
	Seit OpenBSD 2.8 funktioniert alles bestens.
	Der clcs Treiber ist aber irgendwie unstabil, am bestens deaktivierst du ihn.
	Das macht aber nichts, da der sb Treiber sich sauber verbindet und arbeitet.
	
	Es gibt <a href="../xf86configs/thinkpad770z">hier</a> eine XF86Config Datei.<p>
	Kontaktiere <a href=mailto:angelos@openbsd.org>Angelos Keromytis</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 760
    </td><td>
	Mit OpenBSD 2.6 funktionieren XFree86 und APM nicht.<p>

	Neuere Versionen von XFree86 unterst&uuml;tzen X, und Patches sind verf&uuml;gbar.<p>

	Der MWave modem/sound funktioniert nicht.<p>

	APM wurde nach 2.6 repariert, Patches sind auf dem Weg.<p>

	Kontaktiere <a href=mailto:todd@openbsd.org>Todd Fries</a>.
    </td>
</tr><tr>
    <td>
       IBM Thinkpad T20
    </td><td>
       Auf OpenBSD 2.7 (und h&ouml;her) funktioniert apm fast komplett. Die einzige
       Sache, die bisher nicht hinhaut ist halt -p (f&auml;hrt einfach nicht runter).
       Geht in den 'suspend mode' wenn der Deckel geschlossen wird und geht wieder in
       den Normalmodus, wenn der Deckel wieder ge&ouml;ffnet wird.<p> 

       Das eingebaute Modem ist ein Winmodem... ignoriere es. Tats&auml;chlich ist es auf einer 
       `mini-pci' Karte, so dass es wahrscheinlich ausgebaut werden kann.<p>

       Audio funktioniert, aber dazu musst du den PCI sleep mode im BIOS deaktivieren.<p>
       OpenBSD X11 unterst&uuml;tzt diese Maschine seit 2.8, aber es gibt eine Menge visuelles
       Rauschen bei 32bpp, bei 16bpp ist es aber gut.<p>
	
       Siehe <a href="http://www.snafu.org/t20/">http://www.snafu.org/t20/</a> f&uuml;r 
       nehr Informationen.<p>

       Kontaktiere <a href=mailto:marc@snafu.org>Marco S Hyman</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 50CT
    </td><td>
	APM funktioniert, aber du musst mit den letzten 32 MB der 
	Festplatte vorsichtig sein, da hier das BIOS das Tiefschlaf-Image
	lagert (long time hibernation image).
	Du kannst im BIOS unter disklabel nachsehen, um zu sehen, wie viele
	Bl&ouml;cke exakt daf&uuml;r verwendet werden.
	Wenn du dabei Fehler machst, wird das Filesystem-Zerst&ouml;rungen oder -Fehler
	nach sich ziehen.
	<p>
        Der Libretto benutzt einen einzelnen IRQ f&uuml;r sowohl
	<strong>sb</strong>
        als auch <strong>wss</strong> , also ist es das beste, eins von beiden
	auszuw&auml;hlen und das anderen im Kernel zu deaktivieren.
	Das externe PCMCIA Floppy-Laufwerk wird zur Zeit nicht unterst&uuml;tzt, 
	aber es kann w&auml;hrend der Installation benutzt werden.
	<p>
        Die Installation kann wegen des einzelnen PCMCIA Slots etwas schwierig sein.
        Der beste Weg ist also eine Netzwerk-Installation. Daf&uuml;r l&auml;dst du die 
	Boot-Floppy und gibst am Boot-Prompt
        <em>boot -c</em> ein.  Sobald du den <em>UKC</em>
        Prompt siehst, ziehst du das Floppy-Laufwerk ab und steckst 
	die Netzwerk-Karte ein und tippst exit.
	Der Kernel wird dann die Netzwerk-Karte ansprechen und du solltest eine
	normale Netzwerk-Installation machen k&ouml;nnen.
	Es kann n&ouml;tig sein, das Sound-Device im BIOS abzuschalten, damit 
	die Boot-Floppy die Netzwerkkarte korrekt identifiziert wird.
	<p>
	Eine XF86Config Datei die f&uuml;r XFree86 3.3.X ausgelegt ist,
	kann man <a href="../xf86configs/libretto50ct">hier</a> bekommen.
	<p>
	Kontaktiere <a href=mailto:millert@openbsd.org>Todd Miller</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 100CT
    </td><td>
	Die meisten der Informationen f&uuml;r den Libretto 50CT gelten auch
	f&uuml;r den 100CT
	<p>
	X11 funktioniert im 800x400 Modus.  Ein entsprechendes XF86Config File 
	f&uuml;r XFree86 3.3.X kann man
	<a href="../xf86configs/libretto100ct">hier</a> bekommen.
	<p>
	Kontaktiere <a href=mailto:millert@openbsd.org>Todd Miller</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Portege 660CDT
    </td><td>
	APM funktioniert &uuml;berhaupt nicht.<p>

	Die gemixete <strong>sb</strong> und <strong>wss</strong> Sound
	Hardware kann Probleme bereiten. Neuere Versionen des Flash-
	BIOS sind noch schlimmer, da sie noch unflexibler sind, was die
	Benutzung von Interrupts angeht.<p>

	Kontaktiere <a href=mailto:deraadt@openbsd.org>Theo de Raadt</a>.
    </td>
</tr><tr>
    <td>
	Digital HiNote VP735
    </td><td>
	APM arbeitet komplett.<p>

	Alles in der Maschine funktioniert.<p>
	Der einzige Hinweis ist die PCIBIOS, BIOS32, PCIBIOS_INTR_FIXUP,
	PCIBIOS_BUS_FIXUP  Optionen im Kernel einzuschalten, so dass
	dem USB-Controller ein Interrupt zugewiesen wird und der CardBus-
	Controller konfiguriert wird.
	<p>

	Ein XF86Config File ,das f&uuml;r XFree86 3.3.X angepasst ist, kann man
	<a href="../xf86configs/hinotevp700">hier</a> bekommen.
	<p>

	Kontaktiere <a href=mailto:mickey@openbsd.org>Michael Shalayeff</a>.
    </td>
</tr><tr>
    <td>
	Fujitsu Lifebook C325
    </td><td>
	APM funktioniert komplett.<p>

	Der Sound nur dann, wenn man dem BIOS mittteilt ,es m&ouml;ge den SB Emulations Modus aktivieren.

	Alles andere an der Maschine funktioniert.<p>

	Kontaktiere <a href=mailto:tom@knienieder.com>Tom Knienieder</a>.
    </td>
</tr><tr>
    <td>
	Fujitsu Stylistic 500
    </td><td>
	APM funktioniert.<p>

	Der serielle Port allerdings nicht.<p>

	Es m&uuml;ssen einige Verrenkungen gemacht werden, um einen kleinen Kernel (4MB) zu bekommen.<p>

	X "funktioniert" (es st&uuml;rzt ab wie verr&uuml;ckt). <p>

	Kontaktiere <a href=mailto:d@openbsd.org>David Leonard</a>.
    </td>
</tr><tr>
    <td>
	Siemens SCENIC Mobile 360
    </td><td>
	APM arbeitet komplett.<p>

	Der Sound funktioniert, und benutzt OSS.<p>

	Kontaktiere <a href=mailto:b1000@softhome.net>Dan Carlsson</a>.
    </td>
</tr><tr>
    <td>
	Dell Inspiron 3200 D233XT (Bios release: A10)
    </td><td>
	APM funktioniert komplett.<p>

	Suspend (ins RAM oder auf die Festplatte) funktioniert nicht unter X (der X Server wird nach dem resume 
	nicht wieder aufgebaut), aber DPMS klappt (der Screen wird nach einer Weile Nichtstun abgeschaltet).
	Die BIOS APM Einstellungen (f&uuml;r automatisches suspend) wollen nicht mit dem X-Server zusammenarbeiten 
	und sollten daher abgeschaltet werden.

	Suspend auf Festplatte ben&ouml;tigt eine DOS (FAT16) Partition, die eine Datei names
	"SAVE2DSK.BIN" enth&auml;lt.  Diese Datei, die mit Dell tools unter Win98 erstellt wird,
	(sie ist bei Auslieferung bereits da), hat die folgende Gr&ouml;&szlig;e: (RAM Gr&ouml;&szlig;e + 2 oder 3
	MB).  Eine ad hoc DOS Partition ist daher notwendig (sie muss die erste Partition auf der
	Festplatte sein).<p>

	PCMCIA: funktioniert, bis auf die "live" Card Ejection oder Insertion (Auswurf oder Reindr&uuml;cken)(beide h&auml;ngen die
	Maschine komplett auf, ein Hard Reset ist dann n&ouml;tig).<p>

	USB: funktioniert nicht, wenn man es trotzdem aktiviert, h&auml;ngt der Kernel beim Booten, w&auml;hrend er
	den USB-Controller sucht.<p>

	Kontaktiere <a href=mailto:b1000@softhome.net>Dan Carlsson</a>.
    </td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CS
	</td><td>
	APM funktioniert nicht, allerdings haut <b>halt -p</b> hin.<p>
	
	Der Sound arbeitet schon mit dem GENERIC Kernel, aber die Lautsprecher sind es echt nicht wert.
	X l&auml;uft bestens.<p>

	Kontaktiere <a href=mailto:ericj@monkey.org>Eric Jackson</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CDT
	</td><td>
	APM ist komplett im Eimer (und kann deine Festplatte zerst&ouml;ren).<p>

	XFree86 funktioniert mit (800x600 16bpp).<p>

	Sound funktioniert (21739 Hz, half duplex stereo).<p>

	<!-- Serial IR soll angeblich auch funktionieren, das muss aber noch gepr&uuml;ft werden. -->

	Kontaktiere <a href=mailto:brad@openbsd.org>Brad Smith</a>,
	oder <a href=mailto:d@openbsd.org>David Leonard</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 550CDT
	</td><td>
	APM deep sleep (<b>zzz</b>) funktioniert, aber <b>-S</b> wacht sofort wieder auf.<p>

	XFree86 arbeitet bestens.<p>

	Der Sound funktioniert, wenn man im BIOS ein wenig mit den IRQs spielt.<p>

	USB funktioniert; zumindest eine Digital Kamera , die ich reingesteckt habe, wurde richtig erkannt und konfiguriert.<p>

	Das eingebaute Modem funktioniert nicht, da es Software ben&ouml;tigt, die nur unter Windows zu haben ist, es implementiert 
	einfach keine richtige RS232 Schnittstelle.<p>

	Der pcic in dieser Maschine ist kaputt, so dass ich keinen Kommentar zu PCMCIA machen kann.<p>

	Kontaktiere <a href=mailto:aaron@openbsd.org>Aaron Campbell</a>.
	</td>
</tr><tr>
    <td>
	NEC Versa 2000
    </td><td>
	APM arbeitet komplett.<p>

	Alles an der Maschine funktioniert.<p>

	Kontaktiere <a href=mailto:mickey@openbsd.org>Michael Shalayeff</a>.
    </td>
</tr><tr>
    <td>
        Acer TravelMate 345
    </td><td>
        Mit OpenBSD 2.7-CURRENT funktioniert auch APM.<p>

       XFree86 l&auml;uft (800x600 16bpp).<p>

       Sounds funktioniert.<p>

       Lucent Modem dagegen noch nicht.<p>

       Kontaktiere <a href=mailto:kevlo@openbsd.org>Kevin Lo</a>.
    </td>
 </tr><tr>
    <td>
        Compaq Armada M700<p>
    </td><td>
       APM arbeitet korrekt, aber du kannst es nicht w&auml;hrend einer X-Session benutzen, sondern
	nur von der Konsole aus. 

       CardBus funktioniert.<p>
  
       Internal 10/100 Ethernet (f&uuml;r die Modelle, die ihn haben).
       arbietet bestesn mit dem fxp Treiber. <p>

       Bis jetzt keine Sound-Unterst&uuml;tzung. Vermutlich arbeitet bereits jemand daran.
       <p>
  
       Bis jetzt keine Unterst&uuml;tzung des internen Modems.  (Es ist ein Winmodem.)
       Es gibt einen 'binary only' Treiber f&uuml;r Linux. Ausserdem gibt es da noch das 
       <a href="http://linmodems.org">linmodem project</a>i, das versucht einen 
       Opensource Winmodem Treiber zu schreiben.<p>

       Eine XF86Config Datei gibt es
       <a href="../xf86configs/armadam700">hier</a>.<p>

       Kontakte <a href=mailto:nate@openbsd.org>Nathan Binkert</a>.
    </td></tr>
</table>

<hr>
<a href=plat.html><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: i386-laptop.html,v 1.36 ]
<br>
$Translation: i386-laptop.html,v 1.14 2000/12/12 18:01:49 jufi Exp $
<br></small>
<small>$OpenBSD: i386-laptop.html,v 1.12 2000/12/13 18:24:19 jufi Exp $</small>
</body>
</html>
