<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenBSD/i386 Laptop Seite</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="Die OpenBSD-Laptop Seite (i386)">
<meta name="keywords" content="openbsd,laptop,i386">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997-2003 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">i386 Laptop Status</font></h2>
<hr>

<p>
Dies ist eine Liste von Laptops, die bekanntermassen mit OpenBSD 2.9 funktionieren.

<p>
Wenn dein Laptop unten nicht aufgelistet ist, bedeutet das nicht zwangsl&auml;ufig, dass
er nicht funktioniert; wahrscheinlich wirst du aber ein &auml;hnliches Modell unten in der
Liste entdecken. Seit OpenBSD 2.6 funktionieren fast alle Laptops sehr gut, es blieben nur
ein paar kleinere Probleme. Sp&auml;tere Versionen von OpenBSD sind sogar noch besser.
<p>
Von denen, die Probleme machen..
<ul>
<li>Einige haben Probleme mit der APM Unterst&uuml;tzung.  Bitte denk dran, dass <strong>apm -S</strong>
    einige Laptops nicht in den Ruhezustand versetzt, was aber kein grosses Problem ist
<li>Einigen fehlt die Soundunterst&uuml;tzung
<li>Einige haben subtile Bugs in der PCMCIA und Cardbus Unterst&uuml;tzung
<li>XFree86 unterst&uuml;tzt manche Displays nicht sauber. Manchmal hilft XFree86 4.x 
<li>Oder einige eingebaute Ger&auml;te funktionieren nicht..
<li>Einige haben Probleme mit den pcmcia card eject interrupts, also dem Auswurf der Karten.
</ul>

<p>
Wenn du deinen Laptop zum Laufen gebracht hast (oder eben auch nicht) und er 
unten nicht aufgef&uuml;hrt ist, schreibe bitte eine Mail an
<a href="mailto:www@openbsd.org">www@openbsd.org</a>, damit er aufgenommen
werden kann. Bitte gib uns dabei soviel Informationen, wie m&ouml;glich.

<p>
Berichte &uuml;ber APM Probleme sollten an unsere APM-Entwickler geschickt werden,
<a href="mailto:mickey@openbsd.org">Michael Shalayeff</a> und
<a href="mailto:weingart@openbsd.org">Tobias Weingartner</a>.

<p>
<table border=1>
<tr>
	<th>Laptop</th>
	<th>Hinweise</th>
</tr>
<tr>
 <td>
        Acer TravelMate 345
    </td><td>
       Seit OpenBSD 2.7-CURRENT funktioniert auch APM.<p>

       XFree86 l&auml;uft (800x600 16bpp).<p>

       Sound funktioniert.<p>

       Lucent Modem dagegen noch nicht.<p>

       Kontaktiere <a href="mailto:kevlo@openbsd.org">Kevin Lo</a>.
    </td>
 </tr>
       <td>
               Acer Travelmate 524TEV Laptop
       </td>
       <td>
       <p>vollst&auml;ndige APM Unterst&uuml;tzung (sowohl mit Konsole als auch X).
       <p>gute PCMCIA Card Unterst&uuml;tzung (ne0).
       <p>Interne Intel Ethernet Express Pro 10/100 funktioniert.
       <p>XFree86 mit ATI Rage Mobility AGP funktioniert (1024x768, 16bpp).
       <p>Sound und Winmodem funktionieren nicht.
       <p>Kontaktiere Matthias Schmidt &lt;xhr@gmx.net&gt;
       </td>
</tr>
<tr>
        <td>
                Asus L8400<p>
        </td>
        <td>
        APM und suspend funktionieren komplett (sowohl unter X als auch unter Konsole).<br>
        Das interne 10/100 Ethernet (Realtek 8139) funktioniert ebenfalls,
        genauso wie der S3 Savage MX-MV Graphik-Chip unter XFree86 4.1.0.
        <p>
        Sound (ESS ES1989) funktioniert, das Winmodem aber nicht.
        <p>
        Der Rest (PCMCIA, Infrared, USB) wurde noch nicht getestet.
        <p>
        Kontakte <a href="mailto:jufi@openbsd.org">Jan-Uwe Finck</a>.
</tr>

<tr>
    <td>
        Compaq Armada M700<p>
    </td><td>
       APM arbeitet korrekt, aber du kannst es nicht w&auml;hrend einer X-Session benutzen, sondern
        nur von der Konsole aus.
	<p>
       CardBus funktioniert.<p>

       Internes 10/100 Ethernet (f&uuml;r die Modelle, die ihn haben).
       arbeitet bestens mit dem <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fxp&sektion=4">fxp(4)</a>
       Treiber. <p>

       Bis jetzt keine Sound-Unterst&uuml;tzung. Vermutlich arbeitet bereits jemand daran.
       <p>

       Bis jetzt keine Unterst&uuml;tzung des internen Modems.  (Es ist ein Winmodem)
       Es gibt einen 'binary only' Treiber f&uuml;r Linux. Ausserdem gibt es da noch das
       <a href="http://linmodems.org">linmodem project</a>i, das versucht einen
       Opensource Winmodem Treiber zu schreiben.<p>

       Eine XF86Config Datei gibt es
       <a href="../xf86configs/armadam700">hier</a>.<p>

       Kontakte <a href="mailto:nate@openbsd.org">Nathan Binkert</a>.
    </td>
 </tr>
<tr>
    <td>
        Dell Inspiron 3200 D233XT (Bios release: A10)
    </td><td>
        APM funktioniert komplett.<p>

        Suspend (ins RAM oder auf die Festplatte) funktioniert nicht unter X (der X Server wird nach dem resume
        nicht wieder aufgebaut), aber DPMS klappt (der Screen wird nach einer Weile Nichtstun abgeschaltet).
        Die BIOS APM Einstellungen (f&uuml;r automatisches suspend) wollen nicht mit dem X-Server zusammenarbeiten
        und sollten daher abgeschaltet werden.

        Suspend auf Festplatte ben&ouml;tigt eine DOS (FAT16) Partition, die eine Datei names
        "SAVE2DSK.BIN" enth&auml;lt.  Diese Datei, die mit Dell tools unter Win98 erstellt wird,
        (sie ist bei Auslieferung bereits da), hat die folgende Gr&ouml;&szlig;e: (RAM Gr&ouml;&szlig;e + 2 oder 3
        MB).  Eine ad hoc DOS Partition ist daher notwendig (sie muss die erste Partition auf der
        Festplatte sein).<p>
          
        PCMCIA: funktioniert, bis auf die "live" Card Ejection oder Insertion (Auswurf oder Reindr&uuml;cken)(beide h&auml;ngen die
        Maschine komplett auf, ein Hard Reset ist dann n&ouml;tig).<p>

        USB: funktioniert nicht, wenn man es trotzdem aktiviert, h&auml;ngt der Kernel beim Booten, w&auml;hrend er
        den USB-Controller sucht.<p>

        Kontaktiere <a href="mailto:b1000@softhome.net">Dan Carlsson</a>.
    </td>
</tr>
<tr>
    <td>
       Dell Latitude CPt<p>
    </td><td>
       apm -z und -S funktionieren.<p>

       Sound klappt auch.<p>

       XFree86 v3 funktioniert bei 1024x768x24bpp.  XF4 sieht bei 16bpp besser aus.<p>

       Beide PCMCIA slots funktionieren.<p>

       USB wird erkannt, ist aber noch nicht getestet. Nach einem Suspend schient es aber
       nicht zu funktionieren. <p>

       Eine XF4 Config Datei findet sich
       <a href="../xf86configs/latitudecpt">hier</a>.<p>

       Kontakte <a href="mailto:op21@squish.org">Paul Wang</a>.
      </td>
</tr>
<tr>
     <td>
       Dell Lattitude LMP-133ST
     </td><td>
       Der Generic kernel funktioniert. APM auch gr&ouml;sstenteils.
       XFree86 v3 war bestens (nur 8 bit).
       XF4.0 funktioniert nur mit verschiedenen Problemen, ein paar Pixel sind heruntergerutscht
       und die virtuellen Konsolen waren unleserlich (sind aber k&uuml;rzlich in XF4 current 
       gefixt worden, allerdings auf dieser Maschine noch nicht getestet)
       <p>
       Eine XF4 Config Datei gibt es 
       <a href="../xf86configs/latitudelmp">hier</a> und eine f&uuml;r XFree86 R3
       <a href="../xf86configs/latitudelmp-xf3">hier</a>.
       <p>
       Kontakte Ian Darwin.
       </td>
</tr>
<tr>
    <td>
        Digital HiNote VP735
    </td><td>
        APM arbeitet komplett.<p>
          
        Alles in der Maschine funktioniert.<p>
 
        Ein XF86Config File ,das f&uuml;r XFree86 3.3.X angepasst ist, kann man
        <a href="../xf86configs/hinotevp700">hier</a> bekommen.
        <p>
 
        Kontaktiere <a href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</tr>
<tr>
    <td>
        Fujitsu Lifebook C325
    </td><td>
        APM funktioniert komplett.<p>

        Der Sound nur dann, wenn man dem BIOS mittteilt, es m&ouml;ge den SB Emulations Modus aktivieren.

        Alles andere an der Maschine funktioniert.<p>

        Kontaktiere <a href="mailto:tom@knienieder.com">Tom Knienieder</a>.
    </td>
</tr><tr>
    <td>
        Fujitsu Stylistic 500
    </td><td>
        APM funktioniert.<p>

        Der serielle Port allerdings nicht.<p>

        Es m&uuml;ssen einige Verrenkungen gemacht werden, um einen kleinen Kernel (4MB) zu bekommen.<p>

        X "funktioniert" (es st&uuml;rzt ab wie verr&uuml;ckt). <p>

        Kontaktiere <a href="mailto:d@openbsd.org">David Leonard</a>.
    </td>
</tr>
<tr>
    <td>
	IBM Thinkpad 701C
    </td><td>
	Alle Features inklusive hibernation und APM funktionieren.<p>

	Kontaktiere <a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 770Z
    </td><td>

       <p>Dieser Laptop hat kein wirkliches BIOS; die meisten der Ger&auml;teeinstellungen, 
       wie etwa IRQ Zuweisungen etc. wurden durch Windows gemacht.</p>

       <p>Du kannst die seriellen und Infrarot-Schnittstellen als com* Ger&auml;te
       erkennen lassen, indem du mit den IRQ Zuweisungen von Windows spielst.
       Genauso mit dem Parallel-Port.(es ist der lpt2).</p>

       <p>Wenn du APM &uuml;berhaupt zum Laufen bekommen willst, brauchst du diese Zeile in
       in deiner Kernel-Konfigurationsdatei:</p>

<pre>
option         APM_DISABLE_INTERRUPTS=0
</pre>

        <p>Hibernation (Auf Festplatte speichern) arbeitet gut, solange du eine 
	Windowspartition mit ge&uuml;gend Platz darauf hast (ein bisschen mehr als
	der System-Speicher, also das RAM). Suspend/resume/powerdown funktionieren
	alle gut, Hibernation unter dem X Window System (mit XFrre86 3.3.6 getestet) verursacht 
	eine Framebuffer corruption und es sieht so aus, als ob der einzige Ausweg
	ein Verlassen und Neustarten des X-Servers w&auml;re, ein Wechsel zwischen den
	virtuellen Konsolen reicht nicht. Das Wechseln der Aufl&ouml;sungen soll 
	m&ouml;glicherweise helfen. XFree86 4.0 hat das Problem nicht mehr, aber das
	letzte Mal, als ich nachgesehen habe, hatte es keinen beschleunigten Treiber 
	f&uuml;r den Grafikchip. Die beste Idee ist einfach auf die Text-Konsole zu 
	wechseln, bevor man 'Hibernation' versucht. </p 

       <p>Wenn du den externen Monitor anschaltest (Fn+F7), wird dich XFree86 3.3.6
       mit irgenwelchen wilden Regenbogenfarben begr&uuml;ssen und m&ouml;glicherweise
       das ganze System einfrieren (es sei denn du wechselst in den Textmodus und 
       killst den X Server innerhalb weniger Sekunden); wenn du in den Text-Modus 
       wechseln willst musst den X-Server herunterfahren (ansonsten gibt es einen
       Crash beim n&auml;chsten Wechsel auf X). Den externen Monitor einzuschalten, 
	w&auml;hrend man im Video-Modus ist, bringt keinerlei Nebeneffekte; du kannst dann
       X starten oder einfach zu X wechseln, wenn es bereits l&auml;ft.</p>	

       <p>Der <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=clcs&sektion=4">clcs(4)</a> 
       Treiber ist teilweise kaputt, am besten deaktivierst du ihn.
       Es macht wirklich nichts aus, da der Soundblaster-Treiber (<a href=
       "http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Curren&amp;arch=i386">sb(4)</a>) 
       sich sauber verbindet und bestens funktioniert. M&ouml;glicherweise musst du mit den
       IRQ Zuweisungen spielen, um das zum Laufen zu kriegen.</p>
	
	Es gibt <a href="../xf86configs/thinkpad770z">hier</a> eine XF86Config Datei.<p>
	Kontaktiere <a href="mailto:angelos@openbsd.org">Angelos Keromytis</a>.
    </td>
</tr><tr>
    <td>	
       IBM Thinkpad A21p
    </td><td>
       Siehe den Eintrag f&uuml;r den T21. Alles ist gleich mit Ausnahme der Videokarte,
       die eine ATI Rage 128 Mobility LF ist. OpenBSD
       2.8 post Mitte-Dezember mit XFree86 4.0.2 arbeitet bestens mit
       1600x1200 24bpp. Du musst:
       <pre>
               sysctl -w machdep.allowaperture=2
       </pre>
       und gib die korrekten Frequenzbereiche in die Monitor Sektion
       von XF86Config ein. Hier ist  ein Beispiel: 
       <a href="../xf86configs/thinkpada21p">XF86Config.</a>
    </td>
</tr><tr>
    <td>
       IBM Thinkpad A30p
    </td><td>
       <p>In meinem Modell funktionieren die meisten Dinge mit OpenBSD 3.1 
       und h&ouml;her. </p>
       <p>Bedenke, dass IBM auch Variationen des Basis-Modells ausliefert</p>
       <p>Das &uuml;bliche Setup anderer Thinkpad Modelle wird gebraucht, 
       wenn man Windows beh&auml;lten m&ouml;chte. Wiie immer, funktioniert
       das Multibooting mit Windows NT. Ich habe die "restore" Partition
       bis jetzt behalten, und empfehle die recovery Partition als Backup
       auf CD zu brennen.</p>
       <p>Die Grafik-Karte (ATI Radeon Mobility) muss expliziet angewiesen
       werden in 1600x1200 zu laufen (was ein Zweileiner in XF86Config ist).  
       Manchmal startet X nicht richtig, und muss gekillt und neu gestartet 
       werden.
       Die XVideo Erweiterung funktioniert normal, so dass DVDs im 
       Full-Screen-Modus mit ogle geschaut werden k&ouml;nnen. 
       In -current ist mplayer in der Lage auch die meisten anderen Arten 
       von Video darzustellen.</p>
       <p>Der Sound funktioniert, ebenso die integrierte Ethernet-Karte, 
       genauso wie die integrierte Prism WiFi und auch Suspend.
       Die Spezialtasten (Sound-Volume, Licht-Intensit&auml;t...) werden 
       von der Hardware verwaltet, und arbeiten ebenfalls bestens unter 
       OpenBSD.  Auch der CD Brenner funktioniert.</p>
       <p>IDE dma wird mit 3.1 nicht erkannt, da der Chipsatz eine neue 
       Version des Intel 82801 ist. Das wurde korrigiert, sofort nachdem 
       ich den Laptop hatte.  Ich habe noch nicht einmal versucht, Modem 
       oder Infrarot zum Laufen zu bekommen.</p>
       Kontakte <a href="mailto:espie@openbsd.org">Marc Espie</a>.
    </td>
</tr><tr>
    <td>
       IBM Thinkpad T21
    </td><td>
       <p>Seit OpenBSD 2.8 funktioniert alles bestens.</p>

       <p>Hier ist die fdisk Ausgabe; der einfachste Weg dahin ist es wohl,
	die Windows-Partition zu ver&auml;ndern (ich benutze PartitionMagic) und sie an
	das hintere Ende der Festplatte zu schieben, dann eine OpenBSD Partition zu erzeugen
	(und ignoriere das Ver&auml;ndern der Partitionen durch fdisk -- mach einfach weiter und
	erzeuge all die Dateisysteme, die du mit disklabel erzeugen willst).</p>

<pre>
         Starting        Ending
 #: id  cyl  hd sec -   cyl  hd sec [     start -       size]
-------------------------------------------------------------------------
 0: 1C 1023   1   1 -  1023 239  63 [  42003423 -   20502657] <Unknown ID>&gt;
*1: A6    0   1   1 -  1021 239  63 [        63 -   15452577] OpenBSD     
 2: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
 3: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
</pre>

      <p>Zur Aktivierung der seriellen und des Infrarot-Ports (beide als com*),
	musst du mit den IRQ-Zuweisungen im BIOS spielen, setze sie einfach auf
	die Standard-Werte aus der GENERIC Konfigurations-Datei. Genauso f&uuml;r den
	parallelen Port (OpenBSD kann lpt2 erkennen). M&ouml;glicherweise musst du hier
	ebenfalls mit den Windowseinstellungen rumprobieren.</p>

       <p>Es gibt bis jetzt mindestens zwei miniPCI Karten im Angebot:
       eine ist ein (nicht unterst&uuml;tztes) WinModem, und die andere ist eine
       ethernet/modem Karte. Ethernet  arbeitet bestens (wird als 
       fxp/inphy Karte erkannt); das Modem sieht aus wie ein echtes, aber wird bis jetzt noch nicht unterst&uuml;tzt.
       </p>

       <p>Sound (CS4614) arbeitet bestens. Um ein Einfrieren des Systems bei gleichzeitiger
       Cardbus und Audiobenutzung simultan zu verhindern musst du m&ouml;glicherweise zumindest zwei IRQs f&uuml;r
       die Benutzugn durch PCI Ger&auml;te im BIOS reservieren; I benutze 9 und 11. Es ist auch m&ouml;glich
       das PCI Power Management im BIOS abzuschalten:
       Power configuration (Das ist das einzige Men&uuml;, das scrollt, stelle also sicher, dass du wirklich bis an das
       untere Ende der Seite gehst. :-)</p>

       <p>APM funktioniert, bis auf 'hibernation' (das verlangt Unterst&uuml;tzung durch das OS). Um
       "halt -p" zum Laufen zu kriegen, musst du die sysctl Variable
       machdep.apmhalt auf 1 setzen (dazu brauchst du OpenBSD 2.8-current mit
       Sources von Mitte Januar oder sp&auml;ter). Diese Zeile in deiner Kernel Konfigurationsdatei 
       brauchst du ausserdem, um APM zum Funktionieren zu bringen:</p>

<pre>
option         APM_DISABLE_INTERRUPTS=0
</pre>

       <p>Obwohl die Grafikkarte mit XFree86
       3.3.6pl8 funktionieren soll, konnte ich sie nur mit XFree86
       4.0.1 mit ein paar Patches <a
       href="http://www.probo.com/timr/savagemx.html">von hier</a> zum
       Laufen kriegen (es gibt auch Binaries f&uuml;r OpenBSD 2.8 an der selben
	Stelle). 
       Du brauchst einen Kernel mit "option INSECURE" und musst den securelevel in /etc/rc.securelevel
       auf -1 setzen (so, dass der X-Server /dev/mem  &ouml;ffnen kann und das BIOS mmap()en).
       Is dieser Konfiguration kann es bis zu 1400x1050 mit 16bpp darstellen (Version 1.1.13
       des Savage Treibers arbeitet bei 24bpp auch gut)</p>
	

       <p><b>UPDATE:</b> Die oben erw&auml;hnten Patches wurden in
       XFree86 4.0.2 aufgenommen, und es klappt dahe rohne weitere &Auml;nerungen. Du braauchst weiter
       einen Kernel mit  der Option INSECURE, setze einfach die
       machdep.allowaperture sysctl Variable auf 2, typischerweise in
       /etc/sysctl.conf, wenn du ein OpenBSD 2.8 (oder sp&auml;ter) hast, das aus Sourcen sp&auml;ter als dem
        15. Dezember 2000 kommt.</p>


       <p>Einige Modelle k&ouml;nnen nur 1024x768 darstellen. Die, die 
       1400x1050 k&ouml;nnen, k&ouml;nnen auch 1600x1200 mittels eines "virtual screen"
       (wobei sich das ganze Display verschiebt, wenn man "off-screen" geht); ich habe das aber
	nicht getestet, obwohl es unter Windows funktioniert.</p>

       <p>Wenn du den Deckel des Laptops schliesst, geht das System in Ruhemodus;
       unter XFree86 4.0 funktioniert das Aufwachen auch, (XFree86 3.3.6 kann
	das vielleicht nicht, unter dem ThinkPad 770Z ging's jedenfalls nicht).</p>

       <p>Eine XF86Config Datei f&uuml;r XFree86 4.0 kann man <a
       href="../xf86configs/thinkpadt21">hier</a> finden.</p>

       <p><b>UPDATE</b> Anscheinend haben neuere T21s den ATI Rage
       3D Rage Mobility anstattdessen.
       <a href="../xf86configs/thinkpadt21-2">Hier</a> gibt's eine XF86Config
       f&uuml;r XFree86 4.0 in dieser Konfiguration.</p>
       
       <p>Eine nervende Sache ist es, wenn du eines der UltraBay
       2000 Ger&auml;te herausnimmst; f&auml;ngt das System an zu piepena. Der einzige Weg das zu beenden ist es
       zu 'suspenden' und dann irgendein Ger&auml;t in die UltraBay reinzustecken (muss nicht das selbe sein)
       Denk dran, dass das 'Hot-Swap' von OpenBay bislang unter OpenBSD (2.8) nicht unterst&uuml;tzt wird, daher
       kann man bisher nur Batterien 'hot-swappen'.</p>


       <p>Kontakte <a href="mailto:angelos@openbsd.org">Angelos Keromytis</a>.</p>
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 760
    </td><td>
	Mit OpenBSD 2.6 funktionieren XFree86 und APM nicht.<p>

	Neuere Versionen von XFree86 unterst&uuml;tzen X, und Patches sind verf&uuml;gbar.<p>

	Der MWave modem/sound funktioniert nicht.<p>

	APM wurde nach 2.6 repariert, Patches sind auf dem Weg.<p>

	Kontaktiere <a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
       IBM Thinkpad T20
    </td><td>
       Wenn man OpenBSD 2.7 (oder sp&auml;ter) benutzt, funktioniert apm fast vollst&auml;ndig. Um
       "halt -p" zum Laufen zu kriegen, musst du die sysctl Variable
       machdep.apmhalt auf 1 setzen (du brauchst OpenBSD 2.8-current von
       Mitte Januar oder sp&auml;ter). Die Einheit geht in den Suspend Modus, wenn der Deckel
       geschlossen wird. Sie kehrt aber ohne Probleme wieder 
       den Normalmodus zur&uuml;ck, wenn der Deckel wieder ge&ouml;ffnet wird.<p> 

       Das eingebaute Modem ist ein Winmodem... ignoriere es. Tats&auml;chlich ist es auf einer 
       `mini-pci' Karte, so dass es wahrscheinlich ausgebaut werden kann.<p>

       Audio funktioniert, aber dazu musst du den PCI sleep mode im BIOS deaktivieren.<p>
       OpenBSD X11 unterst&uuml;tzt diese Maschine seit 2.8, aber es gibt eine Menge visuelles
       Rauschen bei 32bpp, bei 16bpp ist es aber gut. Ein XF4 config File f&uuml;r
       OpenBSD 2.9 findet sich 
       <a href="../xf86configs/thinkpadt20">hier</a><p>
	
       Siehe <a href="http://www.snafu.org/t20/">http://www.snafu.org/t20/</a> f&uuml;r 
       nehr Informationen.<p>

       Kontaktiere <a href="mailto:marc@snafu.org">Marco S Hyman</a>.
    </td>
</tr><tr>
    <td>
       IBM Thinkpad T23
    </td><td>
       Mit OpenBSD 3.1-beta und sp&auml;ter getestet.  Problem mit der boot floppy:
       du musst mit -c booten und ahc abschalten oder die Maschine h&auml;ngt beim Booten.
       Beim GENERIC Kernel tritt das nicht auf.<p>

       Apm funktioniert gr&ouml;sstenteils -- Suspend ist OK, hibernate nicht (ben&ouml;tigt
       Unterst&uuml;tzung durch das BS).  Hibernate-Versuche resultieren in nichts als einem
       Tastaturpiepser. Das Audio Chipset wird unterst&uuml;tzt (auich). Hinweis:
       Es gibt 16 verschiedene "mutes" und die meisten davon sind standardm&auml;ssig eingeschaltet.
       Bestes Feature: eingebautes 802.11b und fxp Ethernet. Wireless
       benutzt den PRISM 2.5 ISL3874A(PCI), Firmware 1.0.7 (primary), 1.3.6
       (station).<p>

       X funktioniert (XF4).  XF4 config Datei f&uuml;r OpenBSD findet sich 
       <a href="../xf86configs/thinkpadt23">hier</a>. Alle X Applikationen, die ich bisher getestet 
       habe, funktionieren. Ogle (DVD Player) funktioniert nicht bei 24 bpp, aber bei 16 bpp.<p>

       Siehe <a href="http://www.snafu.org/t23/">http://www.snafu.org/t23/</a>
       f&uuml;r mehr Infos.<p>

       Kontaktiere <a href="mailto:marc@snafu.org">Marco S Hyman</a>.
    </td>
<tr>
    <td>
        NEC Versa 2000
    </td><td>
        APM arbeitet komplett.<p>

        Alles an der Maschine funktioniert.<p>

        Kontaktiere <a href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</tr>
<tr>   
    <td>
        Siemens SCENIC Mobile 360
    </td><td>
        APM arbeitet komplett.<p>

        Der Sound funktioniert, und benutzt OSS.<p>
        
        Kontaktiere <a href="mailto:b1000@softhome.net">Dan Carlsson</a>.
    </td>    
</tr>
<tr>
  <td>
        Sony VAIO F430
    </td><td>
        Seit OpenBSD 2.6-Current (vom 17. Feb 2000)<P>
       
        APM: "<strong>zzz</strong>" suspend funktioniert, genauso wie der keyboard
        suspend. "<strong>halt -p</strong>" und "<strong>apm -S</strong>"
        nicht. (Aber ich muss mir noch die phdisk utilities ansehen - ich untersuche
        das in K&uuml;rze.) <P>

        DVD Laufwerk und Floppy funktionieren alle. Ethernet funktioniert nach einem
        wakeup mit der Karte, die ich benutze (3Com 3c589). <P>

        Kontaktiere <a href="mailto:beck@openbsd.org">Bob Beck</a>.
    </td>
</tr>
<tr>    
    <td>
        Sony VAIO z505r
    </td><td>
        APM Unterst&uuml;tzung: "<strong>zzz</strong>", suspend via keyboard, hibernation
        (Tiefschlaf) via keyboard, und "<strong>halt -p</strong>" funktionieren alle.
        "<strong>apm -S</strong>" l&auml;sst ihn sofot aufwachen.<p>
        
        Hibernation benutzt einen Block am Ende der Festplatte, ungef&auml;hr
        3-5MB gr&ouml;sser als der Speicher in deiner Maschine.  Um hibernation zu reparieren,
        benutze "<strong>phdisk.exe /create /partition</strong>" um die Partition
        zu erstellen. Das phdisk Programm ist auf dem Boot-Floppy-Image auf der ersten
        Recovery CD zu finden. <p>
       
        Eingebautes ethernet arbeitet bestens, braucht aber ab und zu einen Reset nach einem suspend,
        und zwar mittels
        "<strong>ifconfig fxp0 down; ifconfig fxp0 up</strong>".<p>
        
        Nach einem suspend l&auml;uft die profiling clock nicht mehr.  An Patches
        wird bereits gearbeitet.<p>
        
        Sound wird durch den <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=neo&sektion=4">
        neo(4)</a> Treiber unterst&uuml;tzt. Manchmal f&uuml;hrt das automatische
        Konfigurieren des AC97 mixers zum H&auml;ngen w&auml;hrend des Bootens.
        <p>
    
        Wenn der memory stick slot leer ist, kann das Fehler verursachen, die den
        dmesg-Puffer &uuml;berlaufen lassen, und somit das OpenBSD-Installations-Programm
        verwirren k&ouml;nnen. Im BIOS (F2 beim Booten dr&uuml;cken) gibt es eine Option,
        um den Memory Stick abzuschalten. <p>

        Eine XF86Config Datei ,die f&uuml;r die Benutzung mit XFree86 3.3.X angepasst ist,
        gibt es
         <a href="../xf86configs/vaioz505r">hier</a>.
        <p>

        Kontaktiere <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr>
<tr>
    <td>
        Sony VAIO z505s
    </td><td>
        &Auml;hnlich wie beim VAIO z505r, nur das die mitgelieferte USB Floppy einige
        Probleme macht.<p>
        Kontaktiere <a href="mailto:provos@openbsd.org">Niels Provos</a>.
    </td>
</tr>
<tr>
    <td>
        Sony VAIO 747</td>
    </td><td>
        Seit OpenBSD 2.6 funktionieren XFree86 und APM.<p>

        Wird mit einer PCMCIA Modem Karte ausgeliefert (COM One MCC220 Platinum Card), und die
        funktioniert auch.<p>

        Sound funktioniert (nur 8 Bit).<p>

        APM genauso wie der VAIO z505r,
        mit Ausnahme von hibernation, das einfach noch nicht getestet wurde.<p>

        USB funktioniert nicht.<p>
       
        Eine XF86Config Datei kann man
        <a href="../xf86configs/vaio747">hier</a> finden.<p>
       
        Kontaktiere <a href="mailto:markus@openbsd.org">Markus Friedl</a>.
    </td>
</tr><tr>
    <td>
        Sony VAIO PCG 505-FX
    </td><td>
        Unbekannt.
    </td>
</tr>
<tr>
       <td>Sony VAIO PCG XG700K</td>
       <td>
       <p>OpenBSD 2.9 funktioniert, hat aber ein paar Probleme mit disklabel/fdisk,
       &auml;hnlich denen des Thinkpad T21.
       <p>sysctl machdep.apmhalt=1 muss so konfiguriert sein, damit das Notebook abschalten kann.

       <p>apm -z versetzt das System nur in leichten Schlaf
       (das kann man m&ouml;glicherweise &uuml;ber phdisk fixen); apm -s tut gar nichts.

       <p>XFree86 4.0 arbeitet mit dem S3 Savage Treiber bestens bei 1024x768.
       1200x1024 soltle m&ouml;glich sein, aber ich habe es nicht ausprobiert.
       Mein XF86Config f&uuml;r XFree86 4.0 kann man 
       <a href="../xf86configs/vaioxg700k">hier</a> finden.

       <p>Sound und USB arbeiten bestens. 

       <p>Alle drei Cardbus Slots werden konfiguriert, wenn man angedockt ist, ansonsten sind es zwei.
       H&auml;ngt sich manchmal auf, wenn ich meine billige NE-Karte entferne.

       <p>Das interne WinModem wird nicht unterst&uuml;tzt, genausowenig wie
       Firewire oder der "Jog Dialer".

       <p>Kontakte Ian Darwin.
       </td>
</tr>
<tr>
       <td>Sony VAIO PCG-SRX77</td>
       <td>
       <p>OpenBSD 3.3 funktioniert, allerdings mit ein paar Problemen.
       <ul>
       <li>XFree86 funktioniert, ich benutze die folgende
       <a href="xf86configs/sonysrx77">XF86Config</a>.
       <li>Audio funktioniert mit dem 
       <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=auich&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">auich(4)</a>
       Treiber.
       <li>Das eingebaute Ethernet funktioniert ebenfalls, und zwar mit dem
       <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fxp&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">fxp(4)</a>
       Treiber.
       <li>Cardbus und eingebautes Wireless funnktionieren <strong>nicht</strong> 
       ohne einen <a href="ftp://ftp.courtesan.com/pub/millert/OpenBSD/srx77/cardbus.diff">f&uuml;rchterlichen hack</a>.
       <li>USB und der Memory Stick Port funktionieren.
       <li>Firewire wurde noch nicht getestet.
       <li>Das Jog Dial wird noch nicht unterst&uuml;tzt.
       <li>Das eingebaute Software Modem funktioniert nicht.
       <li>APM funktioniert nicht; der Laptop legt sich zwar schlafen, wacht aber nicht mehr auf.
       <li>"halt -p" h&auml;lt die Maschine nicht an.
       </ul>

       Wende dich an <a href="mailto:millert@openbsd.org">Todd Miller</a>.
       </td>
</tr>
<tr>
    <td>
	Toshiba Libretto 50CT
    </td><td>
	APM funktioniert, aber du musst mit den letzten 32 MB der 
	Festplatte vorsichtig sein, da hier das BIOS das Tiefschlaf-Image
	lagert (long time hibernation image).
	Du kannst im BIOS unter disklabel nachsehen, um zu sehen, wie viele
	Bl&ouml;cke exakt daf&uuml;r verwendet werden.
	Wenn du dabei Fehler machst, wird das Filesystem-Zerst&ouml;rungen oder -Fehler
	nach sich ziehen.
	<p>
        Der Libretto benutzt einen einzelnen IRQ f&uuml;r sowohl
	<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">sb(4)</a>
        als auch <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wss&sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">wss</a>,
	also ist es das beste, eins von beiden
	auszuw&auml;hlen und das anderen im Kernel zu deaktivieren.
	Das externe PCMCIA Floppy-Laufwerk wird zur Zeit nicht unterst&uuml;tzt, 
	aber es kann w&auml;hrend der Installation benutzt werden.
	<p>
        Die Installation kann wegen des einzelnen PCMCIA Slots etwas schwierig sein.
        Der beste Weg ist also eine Netzwerk-Installation. Daf&uuml;r l&auml;dst du die 
	Boot-Floppy und gibst am Boot-Prompt
        <em>boot -c</em> ein.  Sobald du den <em>UKC</em>
        Prompt siehst, ziehst du das Floppy-Laufwerk ab und steckst 
	die Netzwerk-Karte ein und tippst exit.
	Der Kernel wird dann die Netzwerk-Karte ansprechen und du solltest eine
	normale Netzwerk-Installation machen k&ouml;nnen.
	Es kann n&ouml;tig sein, das Sound-Device im BIOS abzuschalten, damit 
	die Boot-Floppy die Netzwerkkarte korrekt identifiziert wird.
	<p>
        Es gibt Beispiel-XF86Config Dateien f&uuml;r sowohl
        <a href="../xf86configs/libretto50ct">XFree86 4.X</a> als auch
        <a href="../xf86configs/libretto50ct-xf3">XFree86 3.3.X</a>.
	<p>
        Im &uuml;brigen war der Treiber in XFree86 4.1 defekt (in
        XFree86 4.2 funktioniert er wieder) und daher funktioniert das XFree86, das mit
        OpenBSD 3.0 ausgeliefert wird, nicht mit dem libretto.  Ich habe den alten 
        XFree86 4.01 chips Treiber (der ja funktioniert)
        f&uuml;r XFree86 4.1 kompiliert.  Lade einfach <a
        href="ftp://ftp.courtesan.com/pub/todd/OpenBSD/chips_drv.o">
        chips_drv.o</a> herunter und kopiere es nach
        <pre>
           /usr/X11R6/lib/modules/drivers/chips_drv.o
       </pre>
       Das bringt XFree86 4.1 auf dem 50CT und 70CT zum Laufen.
       <p>
	Kontaktiere <a href="mailto:millert@openbsd.org">Todd Miller</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 100CT
    </td><td>
	Die meisten der Informationen f&uuml;r den Libretto 50CT gelten auch
	f&uuml;r den 100CT
	<p>
       X11 funktioniert im 800x400 Modus.  Es gibt eine Beispiel-XF86Config Datei f&uuml;r sowohl
       <a href="../xf86configs/libretto100ct">XFree86 4.X</a> als auch
       <a href="../xf86configs/libretto100ct-xf3">XFree86 3.3.X</a>.
	<p>
	Kontaktiere <a href="mailto:millert@openbsd.org">Todd Miller</a>.
    </td>
</tr><tr>
    <td>
       Toshiba Portege 2000
    </td><td>
       Das eingebaute WaveLAN und 10/100 Ethernet (fxp) funktionieren.<p>
       Audio dagegen nicht.<p>
       APM funktioniert ("<strong>zzz</strong>") und auch "<strong>halt -p</strong>".
       Trotzdem wird die Batterielaufzeit falsch angezeigt--angeblich ist das Laptop immer
       an die Steckdose angeschlossen.<p>
       USB ist ungetestet, verbindet sich aber.<p>
       Das dazugeh&ouml;rige PCMCIA CD-ROM arbeitet zur Zeit noch nicht.<p>
       XFree86 4.2 und h&ouml;her funktionieren. Hier ist eine Beispiel-
       <a href="../xf86configs/portege2000">XF86Config</a>-Datei. 
       Trotzdem ist die Wiederholungsrate auf der Tastatur ein wenig zu schnell.
    </td>
</tr><tr>
    <td>
	Toshiba Portege 660CDT
    </td><td>
	APM funktioniert &uuml;berhaupt nicht.<p>

	Die gemixte <a href="
        http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">sb(4)</a>
        und <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wss&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">wss(4)</a> 
        Sound Hardware kann Probleme bereiten. Neuere Versionen des Flash-
	BIOS sind noch schlimmer, da sie noch unflexibler sind, was die
	Benutzung von Interrupts angeht.<p>

	Kontaktiere <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr>
<tr>
	<td>
	   Toshiba Tecra 500CS
	</td><td>
	APM funktioniert nicht, allerdings haut <b>halt -p</b> hin.<p>
	
	Der Sound arbeitet schon mit dem GENERIC Kernel, aber die Lautsprecher sind es echt nicht wert.
	X l&auml;uft bestens.<p>

	Kontaktiere <a href="mailto:ericj@monkey.org">Eric Jackson</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CDT
	</td><td>
	APM ist komplett im Eimer (und kann deine Festplatte zerst&ouml;ren).<p>

	XFree86 funktioniert mit (800x600 16bpp).<p>

	Sound funktioniert (21739 Hz, half duplex stereo).<p>

	<!-- Serial IR soll angeblich auch funktionieren, das muss aber noch gepr&uuml;ft werden. -->

	Kontaktiere <a href="mailto:d@openbsd.org">David Leonard</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 550CDT
	</td><td>
	APM deep sleep (<b>zzz</b>) funktioniert, aber <b>-S</b> wacht sofort wieder auf.<p>

	XFree86 arbeitet bestens.<p>

	Der Sound funktioniert, wenn man im BIOS ein wenig mit den IRQs spielt.<p>

	USB funktioniert; zumindest eine Digital Kamera, die ich reingesteckt habe, wurde durch den 
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ugen&amp;sektion=4">ugen(4)</a> Treiber
        richtig erkannt und konfiguriert.<p>

	Das eingebaute Modem funktioniert nicht, da es Software ben&ouml;tigt, die nur unter Windows zu haben ist, es implementiert 
	einfach keine richtige RS232 Schnittstelle.<p>

	Der pcic in dieser Maschine ist kaputt, so dass ich keinen Kommentar zu PCMCIA machen kann.<p>

	Kontaktiere <a href="mailto:aaron@openbsd.org">Aaron Campbell</a>.
	</td>
</tr><tr>
    <td>
       Toshiba Satellite 320CDS
    </td><td>
       <p>
       Zuverl&auml;ssiges altes Modell. Du musst Windows zumindest in 
       einer Minimal-Variante behalten, da das BIOS Setup per Software 
       mittels eines <code>TSETUP</code> Programms gemacht wird.</p>
       <p>X arbeitet in 800x600, 16 bits.</p>  
       <p>Der Soundchip kann als Windows Sound System Klon (wss) behandelt
       werden. 
       Das hat zur Folge, dass man die Erkennung f&uuml;r den Soundblaster 
       Klon abschaltet.
       Das BIOS Setup muss auf seperate Channel f&uuml;r Spielen und 
       Aufnehmen gelegt werden. Aufnahmen haben ich noch nicht probiert.
       <p>
       PCMCIA Karten funktionieren. Cardbus Modelle genauso, vorausgetzt
       das BIOS ist auf den Cardbus Modus gesetzt, und nicht auf
       automatische Erkennung.
       </p>
       Kontakte <a href="mailto:espie@openbsd.org">Marc Espie</a>.
    </td>
</tr>
</table>

<hr>
<a href="i386.html"><img height="24" width="24" src="../back.gif" border="0" alt="Zur&uuml;ck zur OpenBSD-Hauptseite"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: i386-laptop.html,v 1.79 ]
<br>
$Translation: i386-laptop.html,v 1.54 2003/05/28 13:26:07 jufi Exp $
<br></small>
<small>$OpenBSD: i386-laptop.html,v 1.47 2003/05/28 14:01:08 jufi Exp $</small>
</body>
</html>
