<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="document">
<meta name="description" content="The OpenBSD Ports and Packages Collection">
<meta name="keywords" content="openbsd,ports">
<meta name="distribution" content="global">
<meta name="copyright" content="copyright 1997-2001 by the OpenBSD project">
<title>OpenBSD Ports und Packages</title>
<link rev="made" href="mailto:www@openbsd.org">
</head>

<body text="#000000" bgcolor="#FFFFFF" link="#23238E">

<img height=30 width=141 src=../images/smalltitle.gif alt="[OpenBSD]" >

<h2><font color="#e00000">Die Ports &amp; Packages Kollektion</font></h2>

<hr>

<h3><font color="#0000e0">Motivation</font></h3>

OpenBSD ist  f&uuml;r sich schon ein ziemlich komplettes System, aber es gibt trotzdem
noch eine Menge Software, die man vielleicht gerne zus&auml;tzlich haben m&ouml;chte.
Leider gibt es da das Problem wo die Grenze zu ziehen ist: was soll noch dabei sein,
genauso wie die gelegentlich auftretenden Export- oder Lizenzbeschr&auml;nkungen.
Da OpenBSD als einzelnes UNIX-artiges Betriebssystem gedacht ist, k&ouml;nnen einige
Dinge einfach gar nicht Teil des Systems sein, wenn es ausgeliefert wird.

<p>
<strong><font color="#e00000">
Die ports &amp; packages collection(Kollektion,Sammlung) wird KEINER Sicherheitsuntersuchung unterzogen,
wie es bei OpenBSD selbst geschieht. Obwohl wir uns bem&uuml;hen die Qualit&auml;t der Pakete/packages
hoch zu halten, haben wir doch einfach nicht gen&uuml;gend 'Man-Power', um den gleichen Level an
Robustheit und Sicherheit sicherzustellen.
</font></strong>

<p>
Die ports collection, zu Anfang geborgt von 
<a href="http://www.freebsd.org/">FreeBSD</a>, f&uuml;llt diese L&uuml;cke.
Das Konzept ist, f&uuml;r jede Software aus dritter Hand ein Makefile zu haben, das enth&auml;lt:
<ul>
<li>wo man sie holt,
<li>wie man sie holt,
<li>von was sie abh&auml;ngt (falls &uuml;berhaupt),
<li>wie man die Sources &auml;ndert (wenn &uuml;berhaupt),
<li>und wie man sie kompiliert, erzeugt und installiert.
</ul>
Diese Information wird in einer Verzeichnishierarchie unterhalb /usr/ports
vorgehalten.

<p>
Packages sind die ausf&uuml;hrbaren (binary) Versionen der ports. Ein kompilierter port 
wird zum package das im System mittels pkg_add(1) registriert werden kann.

<p>
<strong><font color="#e00000">
Packages sehen aus wie einfache <code>.tgz</code> B&uuml;ndel, aber sie sollten immer mit Hilfe von
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&amp;format=html">pkg_add(1)</a>,
hinzugef&uuml;gt werden, da es noch weitere Informationen geben k&ouml;nnte, die nur
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&amp;format=html">pkg_add(1)</a>
sauber verarbeiten kann.</font></strong>
Tip: du kannst zwischen packages und <strong>.tgz</strong> B&uuml;ndeln mit Hilfe von
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1&amp;format=html">pkg_info(1)</a>.
unterscheiden.

<h3><font color="#0000e0">Woher und wie kriegt man packages</font></h3>

Eine grosse Sammmlung vor-kompilierter Pakete ist f&uuml;r die meisten
Architekturen verf&uuml;gbar.
<ul>
<li>Auf der CD-Rom (die du <a href="orders.html">hier</a> bestellen kannst),
<li>Auf den <a href=ftp.html>ftp Mirror Sites</a>.
<li>Aus der 'Web Package' Liste:
<ul>
<li><a href="http://www.openbsd.org/2.8_packages/">Pakete f&uuml;r OpenBSD 2.8</a>
<li><a href="http://www.openbsd.org/2.7_packages/">Pakete f&uuml;r OpenBSD 2.7</a>
</ul>
</ul>


Ein package hinzuzuf&uuml;gen geht einfach mit
<code>pkg_add pkgname.tgz</code>.
Wenn du packages immer aus einer einzigen Quelle beziehst (ein package repository),
setze PKG_PATH auf diese repository URL, um Abh&auml;ngigkeiten aufzul&ouml;sen. 

<p>
Um zum Beispiel das gimp package f&uuml;r die Version 2.8 auf einer i386
Maschine direkt von der ftp-site (inklusive von Abh&auml;ngigkeiten) zu installieren, gib 
folgendes ein:

<pre>
    # setenv PKG_PATH ftp://ftp.openbsd.org/pub/OpenBSD/2.8/packages/i386/
    # pkg_add ${PKG_PATH}gimp-1.1.27.tgz
</pre>

<h3><a name="stable"><font color="#0000e0">Ports und packages Update f&uuml;r eine neue OpenBSD Version</font></a></h3>
<p>
Zum ersten Mal gab es in der Version 2.7 einen 'stable branch' f&uuml;r den ports tree.
<p>
Um jetzt zum Beispiel den 'stable branch' f&uuml;r die Version 2.8 zu holen:
<pre>
    $ cd /usr/ports
    $ cvs -q -d anoncvs@some.anon.server:/cvs up -r OPENBSD_2_8 -Pd
</pre>
<p>
Beginnend mit der Version 2.8 wurden ausgew&auml;hlte Bin&auml;r-Pakete ebenfalls
verf&uuml;gbar gemacht. Der Dank f&uuml;r die harte Arbeit des Koordinieren der 
&Auml;nderungen am 'stable branch' geht an 
<a href="mailto:naddy@openbsd.org">Christian Weisgerber</a>.
Bitte sieh dir die  
<a href="../pkg-stable.html">stable packages page</a> an, um etwas &uuml;ber 
'updated packages' und wichtige Updates f&uuml;r den 'stable branch' herauszufinden.
</p>
<p>
Package Namen werden <strong>immer</strong> ver&auml;ndert, sobald ein Paket auf neueren
Stand gebracht oder sonstwie ver&auml;ndert wird, um jegliche Verwirrung zwischen einem
Paket der Original-Version und einem Paket zu vermeiden, in dem z.B. ein Bug gefixed wurde.
</p>


<h3><font color="#0000e0">Die Verwaltung installierter packages</font></h3>

Die <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=packages&amp;sektion=7&amp;format=html">packages(7)</a>
manual page enth&auml;lt n&uuml;tzliche Informationen &uuml;ber verschiedene Wege seine installierten 
packages zu verwalten, Konflikte zu l&ouml;sen (Dateien, die bereits existieren) und Abh&auml;ngigkeiten
zu behandeln.
<p>
Seit OpenBSD 2.8 solltest du folgendes tun, um ein package upzudaten:
<ul>
<li>Entferne das alte package mit 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete&amp;sektion=1&amp;format=html">pkg_delete(1)</a>
<li>F&uuml;ge das neue package hinzu mit
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&amp;format=html">pkg_add(1)</a>
</ul>
Das ist etwas unbequem, da packages Abh&auml;ngigkeiten haben k&ouml;nnen, und du m&ouml;glicherweise 
eine grosse Menge von anderen Programmen/packages entfernen musst, um ein update ausf&uuml;hren zu k&ouml;nnen.

<h3><font color="#0000e0">ports benutzen</font></h3>

Wenn ein bestimmes package f&uuml;r deine Architektur nicht existiert, kannst du normalerweise den port
trotzdem kompilieren. Ausserdem werden einige User aus verschiedenen Gr&uuml;nden einfach alles 
aus dem Source kompilieren wollen. 

<p>
Du kannst die offizielle Version per FTP aus dem pub/OpenBSD/[version] (dabei ist 
[version] die Versionsnummer) Verzeichnis von allen 
<a href=ftp.html>FTP Mirror Sites</a> holen.
Die 'release versions' sind die, die wir mit unserer CDROM ausliefern, und die mehr Tests als die
von den snapshots hinter sich haben.
Weitere Informationen gibt es in der  
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&sektion=7&format=html">ports(7)</a> man page.

<h3><font color="#0000e0">Der Lebenszyklus des Ports tree</font></h3>

<p>
Der ports tree ver&auml;ndert sich, wie der Rest von OpenBSD, st&auml;ndig.
Der normale Lebenszyklus des ports tree ist wie folgt:
<ul>
<li>Der neuesten Version von OpenBSD f&uuml;r ein paar Monate nach der Ver&ouml;ffentlichung einer Version
dichtauf folgen.
<li>Etwa zwei Monate vor der n&auml;chsten Version von OpenBSD auf OpenBSD-current wechseln.
</ul>
Der Wechsel des Status wird weithin in den Mailinglisten bekannt gemacht. 
<a href=mail.html>Mailing lists</a>.

<p>
Der current ports tree <strong>kann nicht</strong> mit der zuletzt ver&ouml;ffentlichten
Version benutzt werden, sobald das Umschwenken auf das Verfolgen von OpenBSD-current
geschehen ist. Das liegt an den &Auml;nderungen, insbesondere der am 'port make process',
die Code ben&ouml;tigen, den es nur im OpenBSD-current tree gibt. 

<p>Der ports tree arbeitet als einzelnes Wesen. Das Updaten eines einzelnen Verzeichnisses muss nicht
zwangsl&auml;ufig klappen, da package-Abh&auml;ngigkeiten dich dazu zwingen k&ouml;nnen grosse Teile
deines port trees upzudaten und neu zu kompilieren.
Es wird daher allgemein empfohlen ports-current nicht zu folgen, es sei denn man ist bereit sich
mit verschiedenen Problemen herumzuschlagen.
<a href=mail.html>Mailinglisten</a> wie z.B.
<code>ports-changes@openbsd.org</code> oder
<code>tech@openbsd.org</code> sind vermutlich unverzichtbar.

<p>
Eine Liste der <a href="../portsplus.html">t&auml;glichen &Auml;nderungen</a> an ports
und ports-current ist verf&uuml;gbar.


<p>
Den ports-current tree kann man sich wie folgt holen:
<ul>
<li><a href=anoncvs.html>Anonymous CVS</a> (siehe Link). Das Kommando ist f&uuml;r 
gew&ouml;hnlich <strong>cvs get ports</strong>.
<li>Anonymous ftp von
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz">
ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz</a>.
	Dieses Archiv wird jede Nacht auf den neuesten Stand gebracht.
<li><a href="cvsup.html">CVSup</a>. Siehe auch das Beispiel zum Benutzen von CVSup im
    <a href="cvsup.html#checkout">checkout mode</a>.
<li>Dein Web Browser durch Benutzung des 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/ports/">CVS
	web interface</a>.
</ul>

<h3><font color="#0000e0">Ports und XFree</font></h3>
Es gibt einige spezielle magische Dinge in den OpenBSD XFree Konfigurationsdateien,
die es dem ports-tree erlauben, imake-basierte Anwendungen unter
/usr/local zu installieren.

<p>OpenBSD wird zur Zeit aus verschiedenen Gr&uuml;nden nicht mit XFree 4.0.x ausgelifert. 
Diese 'ports Magie' funktioniert (noch) nicht mit XFree 4.0.x . 
Dazu musst du den Patch in
<code>/usr/ports/infrastructure/patches/patch-xfree-4.0</code>
auf die Standard 'binary' XFree 4.0.x Distribution anwenden.
<p>Zuk&uuml;nftige Versionen von XFree 4.0.x werden vermutlich die n&ouml;tige Magie 
enthalten.

<h3><font color="#0000e0">Beispiele f&uuml;r die Benutzung des Ports tree</font></h3>

<p>
Gehen wir davon aus du hast einen ports tree und willst das
Archivierungs-Werkzeug <strong>unzip</strong> installieren und kompilieren. Du solltest etwas wie
das hier tun k&ouml;nnen:

<pre>
    % cd /usr/ports/archivers/unzip
    % su
    # make
    # make install
    # exit
</pre>

Einfach, oder? Insbesondere, wenn man bedenkt, was alles im Hintergrund passiert ist:
<ul>
<li>Herunterladen der unzip sources von einer ftp site,
<li>&Uuml;berpr&uuml;fen der Integrit&auml;t des source archive,
<li>Entpacken des unzip source,
<li>Anwenden der OpenBSD spezifischen Patches,
<li>Konfigurieren und Erzeugen des Programms,
<li>Erzeugen eines 'binary package' unter /usr/ports/packages,
<li>Installieren dieses Paketes.
</ul>

<p>
Mit OpenBSD 2.8 erzeugen die meisten der ports beim Installieren packages.

<p>
Wenn ports erzeugt werden, wird das /usr/ports/distfiles Verzeichnis mit Programmquellcode
gef&uuml;llt, und /usr/ports/packages wird mit 'binary packages' gef&uuml;llt. 
User mit geringer Bandbreite sollten sich mal mirror-distfiles(7) ansehen, um einen
effizienten Weg kennenzulernen alle Distfiles auf einmal herunterzuladen.  
In OpenBSD-current kannst du das Skript /usr/ports/infrastructure/fetch/clean-old
benutzen, um alte distfiles zu entdecken.
Denk dran, da&szlig; die OpenBSD CD nur den ports tree enth&auml;lt und einige ausgew&auml;hlte packages.
Wenn du nur die distfiles haben willst, musst du sie auf einem anderen
Weg herunterladen.

<h3><font color="#0000e0">Erzeugen neuer ports</font></h3>
<p>
Wenn du daran interessiert bist mitzuhelfen beim Erweitern des OpenBSD ports tree
solltest du zuerst <a href="porting.html">porting.html</a> lesen.
Diese Seite referenziert die porting Sektion des
<a href="http://www.freebsd.org/handbook/">FreeBSD handbook</a>
genauso wie OpenBSD spezifische Verhaltensmassregeln und Hinweise.

<h3><font color="#0000e0">Probleme und Kontakte</font></h3>

<p>
Wenn du Probleme mit existierenden ports hast oder Information zum Erzeugen neuer ports ben&ouml;tigst
schicke eine E-Mail an die OpenBSD
ports Mailingliste, <a href="mailto:ports@openbsd.org">ports@openbsd.org</a>.
Verbesserungen sind jederzeit willkommen, aber in jedem Fall f&uuml;ge bitte folgendes bei:
<ul>
<li>Die Ausgabe von <code>uname -a</code>,
<li>Deine OpenBSD Version inklusive jeglicher Patches, die du eingespielt hast
<li>Eine komplette Beschreibung des Problems.
</ul>
Falls ein port nicht richtig erzeugt wird, ist ein komplettes 'build transcript' fast
jedesmal notwendig. Einige ports haben Konfigurationsschwierigkeiten mit dem, was
sich bereits auf deiner Maschine befindet.
<ul>
<li>Benutze <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=script&amp;sektion=1&amp;format=html">script(1)</a> um eine komplette build Aufzeichnung zu erhalten. Nicht die 'configure information' entfernen !
<li>H&auml;nge die Ausgabe von <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1&amp;format=html">pkg_info(1)</a> an, wenn es auch nur im entferntesten sinnvoll erscheint.
    <li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gcc&amp;sektion=1&amp;format=html">gcc(1)</a> interne Compiler sollten an die
gcc Mailingliste gemeldet werden. Es spart Zeit, wenn du ihrer Richtlinie folgst und zumindest die Daten mitlieferst, die <tt>gcc -save-temps</tt> ausgibt. 
</ul>

<hr>
<a href="index.html"><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ports.html,v 1.47 ]
<br>
$Translation: ports.html,v 1.13 2001/02/21 17:28:41 jufi Exp $
</small>
<br><small>$OpenBSD: ports.html,v 1.12 2001/02/21 20:52:28 jufi Exp $</small>
</body>
</html>
