<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/powerpc</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="Die OpenBSD/powerpc Seite">
<meta name="keywords" content="openbsd,ppc,powerpc,mac,macintosh,apple"
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2001 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<img border="0" alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">powerpc</font><hr></h2>

<h3><font color="#0000e0">Unterst&uuml;tzte Hardware:</font></h3>
<p>
Momentan werden nur 'New World' Maschinen unterst&uuml;tzt. 
Um die Liste weiter unten zu verbessern, maile <b>bitte</b> deine dmesg nach der
Installation an <a href="mailto:dmesg@openbsd.org">dmesg@openbsd.org</a>,
wie auch <a href="../faq/de/faq4.html#4.5">in den FAQ</a> beschrieben.

<p>
<b>Maschinen</b>
<ul>
<li>PowerMac G4
<li>PowerMac Dual G4
<li>PowerMac G4 Cube
<li>iMac Rev A
<li>iMac Rev B
<li>iMac Rev C
<li>iMac DV 
<li>iMac DV+ 
<li>PowerBook G3 (FireWire)
<li>PowerBook G4
<li>iBook <i>(laufendes Testmodell)</i>
<li>StarMax <i>(laufende Entwicklung)</i>
<li>weitere... <i>(laufende Entwicklung)</i>
</ul>

<p>
<b>Onboard I/O Module</b> (obio)
<ul>
<li>Apple Paddington
<li>Apple Keylargo
</ul>

<p>
<b>PCI-Bridges</b>(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pchb&sektion=4">pchb</a>)
<ul>
<li>Apple Uni-North 
<li>Apple Uni-North AGP 
<li>Apple Uni-North Eth
<li>Motorola MPC106 Host-PCI
</ul>

<p> 
<b>Grafikkarten</b>
<ul>
<li>ATI Mach64 GP
<li>ATI Mach64 GV
<li>ATI Mach64 128 PK
<li>ATI Mach64 128 VR AGP
<li>ATI Mobility M3
<li>ATI Rage Fury AGP4x
</ul>

<p><b>Ethernet</b>
<ul>
<li>DEC DECchip 21040 (Tulip) (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=de&sektion=4">de</a>)
<li>Apple iMac Rev. A-C Ethernet (bm)
<li>Apple GMAC (gm)
</ul>
 
<b>Wireless Ethernet Adapters</b><p>
<ul>
<li>Aironet 802.11DS PCMCIA und PCI (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=an&sektion=4">an</a>)
<li>WaveLAN 802.11DS PCMCIA (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wi&sektion=4">wi</a>)
</ul>
<p>
    
<p><b>SCSI Host Adapter</b>
<ul>
<li>Symbios Logic 53c810, 53c825 (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=siop&sektion=4">siop</a>)o
</ul>

<p><b>RAID Controller</b>
<ul>
<li>Adaptec SCSI RAID (<a href="http://www.intelligent-io.com/">I2O</a>) controllers (ASR-2100S, ASR-3200S, etc.) (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=iop&sektion=4">iop</a>)
</ul>

<p><b>Laufwerke/Ger&auml;te</b>
<ul>
<li>Alle IDE Ger&auml;te, die auch vom <a href="i386.html">i386</a> unterst&uuml;tzt werden.
<li>Alle ATAPI Ger&auml;te, die auch vom <a href="i386.html">i386</a> unterst&uuml;tzt werden.
<li>Alle SCSI Ger&auml;te, die auch vom <a href="i386.html">i386</a> unterst&uuml;tzt werden.
</ul>

<p><b>USB Controller/Hubs</b>
<ul>
<li>Apple USB (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ohci&sektion=4">ohci</a>)
<li>OHCI root hub (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ohci&sektion=4">ohci</a>)
<li>Opti RM861HA (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ohci&sektion=4">ohci</a>)
<li>Alps Electric Hub im Apple USB Keyboard
</ul>
 
ep><b>USB Ger&auml;te</b>
<ul>
<li>Alps Electric Apple USB Keyboard (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ukbd&sektion=4">ukbd</a>)
<li>Solid Year Keyboard und Mouse (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ukbd&sektion=4">ukbd</a>) (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ums&sektion=4">ums</a>)
<li>Logitech M4848 (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ums&sektion=4">ums</a>)
<li>Kensington Kensington USB/PS2 Wheel Mouse (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ums&sektion=4">ums</a>)
<li>USB Zip Drives (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=umass&sektion=4">umass</a>) <i> haben bekannte Probleme w&auml;hrend des Bootens, falls sie angeschlossen sind</i>
</ul> 

<hr>

<p>
<a name="#unsup"><h3><font color=#0000e0>Nicht unterst&uuml;tzte Hardware:</font></h3></a>
<ul>
<li>
Unterst&uuml;tzung f&uuml;r alte Maschinen nach dem 'PREP Style' gibt es nicht mehr, da es hier sowohl
an der passenden Hardware, als auch an der Geschwindigkeit mangelt (im Vergleich zu aktuellen Maschinen).
<li>
Apple PowerMac Systeme mit einem 601 Prozessor oder fehlender OpenFirmware
werden wahrscheinlich niemals unterst&uuml;tzt. 
<li> 
Momentan werden Maschinen mit &auml;lterer OpenFirmware nicht unterst&uuml;tzt.
Das liegt hautps&auml;chlich daran, dass es zuwenig Entwickler gibt, die an der Unterst&uuml;tzung 
arbeiten, und zus&auml;tzlich am Mangel an Hardware.
<li>Auf der Seite der Ger&auml;te werden die folgenden zwar erkannt, aber nicht unterst&uuml;tzt:
<ul>
<li>Texas Instruments TSB12LV23 FireWire
</ul>
</ul>

<h3><font color="#0000e0">Shared HFS Festplatten:</font></h3>
<p>
Ist es m&ouml;glich eine Festlatte mit MacOS (OS X?) und OpenBSD zu betreiben, sie quasi zu teilen?
MacOS muss zuerst installiert sein, und eine noch nicht benutzte Partition kann dann
zum Installieren von OpenBSD benutzt werden.
Wenn eine Festplatte von beiden benutzt wird, und bootbar ist, muss der Bootloader "ofwboot"
in die erste HFS Partition kopiert werden.
Es ist nicht bekannt, ob die Openfirmware den OpenBSD bootloader von der
MacOS X FFS Partition laden kann.
In INSTALL.powerpc finden sich weitere Details zum Installieren einer "shared disk".


<h3><font color="#0000e0">Root Drive:</font></h3>
<p>
Wenn mehrere Laufwerke im System installiert sind, k&ouml;nen nur einige bestimmte 
als OpenBSD root drive benutzt werden. Konfigurationen, die nicht denen weiter unten 
genannten entsprechen, werden nicht in der Lage sein zu entdecken, welche Festplatte
das 'root drive' ist, und daher immer einen Prompt mit der Frage nach dem root drive 
ausspucken oder ganz versagen.
<p>
<ul>
<li><tt>ultra0</tt> ist als root drive immer in Ordnung.
<li><tt>ultra1</tt> ist solange als root drive in Ordnung, so lange <tt>ultra0</tt> 
eine Festplatte ist, kein ATAPI).
<li>Wenn es unter <tt>ultra1</tt> keine Festplatte gibt, kann man eine Platte unter
<tt>ide1</tt> (zip bay) als root drive benutzen. 
<li>Es ist nicht m&ouml;glich <tt>ide0</tt> (CD-ROM) als root drive zu benutzen, es sei 
denn am Ultra IDE bus sind keinerlei Ger&auml;te angeschlossen.
</ul>

<h3><font color="#0000e0">X Aufl&ouml;sung:</font></h3>
<p>
Der aktuelle X Server hat keinen Mechanismus um die Aufl&ouml;sung der
Darstellung zu &auml;ndern. Um sie dennoch zu &auml;ndern, muss man in MacOS
booten und die Aufl&ouml;sung dort &auml;ndern.
Dort wird die Einstellung beibehalten und OpenFirmware wird in dieser Aufl&ouml;sung
booten, es sei denn man schliesst einen anderen Monitor an.
Der X Server l&auml,ft also in genau der Einstellung, in der OpenFirmware bootet.

<hr>
<p>Wenn du gerne neue 'pre-release' Features testen willst, probiers es mal mit einem der
snapshots. 
F&uuml;r die powerpc Architektur werden von Zeit zu Zeit
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/powerpc">snapshots</a> 
gemacht.
<p>
<h3><strong>Geschichte:</strong></h3>

<p>
Der powerpc port wurde zuerst Ende 1996 nach OpenBSD importiert.
Teile des Kernels kamen aus dem NetBSD/macppc port, und die
userland und build Teile kamen von
<a href="mailto:drahn@openbsd.org">Dale Rahn</a>.

<p>
Dale hat ELF Binary Unterst&uuml;tzung hinzugef&uuml;gt, und Per Fogelstrom und er
haben mit der allgemeinen Treiber-Unterst&uuml;tzung &uuml;ber die n&auml;chsten Versionen
von OpenBSD weitergemacht.
Unterst&uuml;tzung f&uuml;r OpenFirmware, VI Power4e Boards, MCG Powerstack
Maschinen, DEC 21040, VGA terminal support, und so weiter wurde hinzugef&uuml;gt.
<p>
Seit 1998 wurde der Scherpunkt auf die Apple Maschinen verlagert, und Dale Rahn
hat damit begonnen all die iMacs und PowerMacs mit diesem port zum Laufen zu kriegen.
Deswegen gab es keine offiziellen Versionen von OpenBSD 2.6 und 2.7 f&uuml;r diesen port.
Eine ganze Menge an Problemen mit dem Compiler Loader wurde gel&ouml;st, eine Menge an
iMac-Treiber wurde hinzugef&uuml;gt und Kompatibilit&auml;t mit den alten Maschinen wurde
fallengelassen, um sich ganz auf die neuen Apple Maschinen konzentrieren zu k&ouml;nnen.
<p>
OpenBSD/powerpc 2.8 hat Apple Hardware unterst&uuml;tzt.

<p>
In 2.9 hat powerpc UVM implementiert, diese &Auml;nderung hat auch gleichzeitig
den 'shared library "pmap" bug' beseitigt, der ziemlich durchdringend war.



<p>

<h3><font color="#0000e0">Bekannte Probleme</font></h3>
Der adb keyboard Treiber f&uuml;r iBook und Titanium Powerbook G4
hat Probleme solcherart, dass manche Tastendr&uuml;cke Crashes verursachen
k&ouml;nnen. Dieses Problem h&auml;ngt gr&ouml;sstenteils mit dem Dr&uuml;cken
mehrerer Tasten zusammen, die die
<code>Fn</code> Taste beinhalten. Denk auch daran, dass &lt;CTRL>&lt;CMD>&lt;POWER> die 
Maschine reseten wird.
<p>
USB Hot-Plug Probleme existieren auf vielen der neuen Systeme. 
Dieses Problem existiert aber nur mit dem root hub auf Systemen, die nur
einen Port pro root hub haben, G4 Tower Systemen, PowerBook G4, neueren IMacs.
Diese Systeme sind mit sowohl ohci0 als auch ohci1 konfiguriert.
<hr>

Kontaktiere
<a href="mailto:deraadt@openbsd.org">Theo de Raadt</a> oder
<a href="mailto:drahn@openbsd.org">Dale Rahn</a>
wenn du gerne mit anderen Leuten zusammen daran arbeiten willst, oder einfach mehr
Informationen brauchst.
</p>

<hr>
<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="[OpenBSD]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: powerpc.html,v 1.38 ]
<br>
$Translation: powerpc.html,v 1.15 2001/07/08 14:57:50 jufi Exp $
<br></small>
<small>$OpenBSD: powerpc.html,v 1.15 2001/07/08 15:49:13 jufi Exp $</small>
</body>
</html>
