<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/powerpc</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="Die OpenBSD/powerpc Seite">
<meta name="keywords" content="openbsd,ppc,powerpc">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-1999 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<h2>OpenBSD/powerpc</h2>

<hr>
<h3><strong>Status:</strong></h3>

<p>
Dieses ist ein ziemlich neuer port.  Er unterst&uuml;tzt einige Maschinen mit dem 
PowerPC Prozessor -- <strong>aber nicht alle</strong>.  Obwohl es Kommitees f&uuml;r
Standardisierung gibt, gibt es leider signifikante Unterschiede zwischen des PowerPC
Computern, sogar wenn sie vom selben Hersteller sind !
Die Liste unten gibt dar&uuml;ber Asukunft.

<p>
Um zu funktionieren muss die Maschinen eine Variante der OpenBoot Firmware enthalten!

<p>
Die Prozessor Unterst&uuml;tzung ist zur Zeit recht stabil.
Die Treiber sind zur Zeit noch recht beschr&auml;nkt, da die meisten PCI-Ger&auml;te bisher nur auf
little-endian Maschinen getestet wurden. Weitere Unterst&uuml;tzung 
f&uuml;r Macintosh Hardware ist in Entwicklung, aber jegliche Information, die 
zur Programmierung beitr&auml;gt, kann dabei helfen !

<p>
Die folgenden Prozessoren werden unters&uuml;tzt: 603, 603e, 604, 604ev, 750.

<p>
Der port benutzt noch keine richtigen Ger&auml;tetreiber. Er benutzt die OpenFirmware
f&uuml;r alle Belange der Ger&auml;tetreiber: Konsole, Festplatte, Ethernet. Installiert werden 
kann via netboot, Floppy und Netzwerk oder CDROM.  Netroot
support existiert, ist aber ungetestet.

Der port hat zur Zeit zwei verschiedenen Versionen des Kernels, eine, die nur die Openfirmware
f&uuml;r alle Ger&auml;te benutzt, und eine Version, die programmiert wurde, um einige MCG
PowerStack und VI Serien Maschinen zu unterst&uuml;tzen.
</p>

<p>
<strong>Hardware, die bekanntermassen funktioniert:</strong>
<ul>
<li> Motorola Maschinen
mit OpenFirmware (PPC1bug Firmware l&auml;uft bekanntermasse nicht):
(Maschinen mit 603* Prozessoren und einige Versionen der Motorola Openfirmware funktionieren leider nicht)
<ul>
<li>Series E
<li>RiscPC
<li>Pro2000
<li>Pro3000
<li>Pro4000 
</ul>
<li> V-I
<ul>
<li>Power4e boards.
</ul>
</ul>

<p>
<strong>Hardwareunterst&uuml;zung, die noch in Entwicklung ist:</strong>
<ul>
<li>Apple PowerMac Systeme mit mind. einem 603 Prozessor und OpenFirmware.
<ul>
<li>Nur der Apple Imac (333Mhz) hat zur Zeit Treiberunterst&uuml;tzung.
<li>Andere Systeme k&ouml;nnen bei Verf&uuml;gbarkeit von Hardware und Informationen unterst&uuml;tzt werden .
Neuere Systeme haben Priorit&auml;t gegen&uuml;ber &auml;lteren/langsameren Systemen.
</ul>
</ul>

<p>
<strong>Maschinen die NICHT FUNKTIONIEREN</strong>.
<ul>
<li>IBM Machinen.
<li>PPCP Machinen.
<li>Apple PowerMac Systeme mit einem 601 Prozessor oder ohne OpenFirmware
werden nie funktionieren.
<li>Die Apple Implementation der OpenFirmware unterst&uuml;tzt keine ELF
executables (wie den boot-block f&uuml;r diesen port).  Ein Workaround ist hierf&uuml;r n&ouml;tig.
</ul>
</p>

<h3><strong>Geschichte:</strong></h3>

<p>
Die PowerPC spezifischen Teile des Kernels kamen aus dem NetBSD port
von Wolfgang Solfrank. Die userland und build tools kamen von einem
unabh&auml;ngigen und unvollst&auml;ndigen port von Dale Rahn. Hoffentlich k&ouml;nnen
noch weitere Teile dieses ports integriert werden, z.B. Ger&auml;tetreiber-Unterst&uuml;tzung
f&uuml;r Interrupts und Echtzeittreiberunterst&uuml;tzung.

Die &Auml;nderung auf den Wolfgang port wurde wegen dessen Unterst&uuml;tzung f&uuml;r Multiuser
gemacht, w&auml;hrend der andere noch als Single-User lief, und das noch aus der RAM-Disk
(es gab keine funktionierenden Ger&auml;tetreiber).
<p>
Nachdem das erledigt war, hat Per Fogelstrom Unterst&uuml;tzung f&uuml;r das  VI Power4e 
vme Board hinzugef&uuml;gt, und die Openfirmware Ger&auml;teunterst&uuml;tzung herausgenommen. (Version 2.3)
<p>
F&uuml;r die Version 2.4 wurde Unterst&uuml;tzung f&uuml;r die Openfirmware Ger&auml;te wieder hinzugef&uuml;gt,
und zwar so ,dass der Mix zwischen Hardware- und Software-Treibern m&ouml;glich war.
Danach wurde die Unterst&uuml;tzung des power4e f&uuml;r die 
MCG PowerStack Maschinen realisiert. Dec 21040 und VGA-Unterst&uuml;tzung wurde hinzugef&uuml;gt
 wobei VGA noch nicht als Konsole, aber als Terminal benutzt werden kann.
X Server werden nicht unterst&uuml;tzt, aber der Mechanismus, um VGA mittels mmap anzusprechen, existiert bereits.
<p>
In 2.5 war die Unterst&uuml;tzung auf dem selben Level wie bei 2.4.
<p>
In 2.6 gab es keine offizielle Version f&uuml;r den PowerPC.
Die Arbeit am iMac hatte begonnen und Compiler Loader Probleme konnten nicht
gel&ouml;st werdne, was das Erzeugen des Systems aus dem tree heraus verhinderte.
<p>
Nach 2.6 wurde die iMac Unterst&uuml;tzung hinzugef&uuml;gt, weitere Entwicklung, um die iMac-Systeme und weitere 
Systeme besser zu unterst&uuml;tzen, ist auf dem Weg.
Zusammen mit der Einf&uuml;hrung der iMac-Treiber ging die Kompatibilit&auml;t mit den
&auml;lteren Systemen verloren. Das liegt gr&ouml;&szlig;tenteils an fehlenden Tests, mit 
der Zeit werden die &auml;lteren Systeme durch Wiedereinf&uuml;gen in die System&auml;nderungen
wieder unterst&uuml;tzt.
<p>

Kontaktiere
<a href=mailto:deraadt@theos.com>Theo de Raadt</a> oder
<a href=mailto:rahnds@openbsd.org>Dale Rahn</a> 
wenn du gerne mit anderen Leuten zusammen daran arbeiten willst, oder einfach mehr
Informationen brauchst.
</p>

<hr>
<a href=plat.html><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: powerpc.html,v 1.22 ]
<br>
$Translation: powerpc.html,v 1.3 2000/06/30 18:44:04 jufi Exp $
<br>
$OpenBSD: powerpc.html,v 1.3 2000/06/30 18:58:06 jufi Exp $</small>

</body>
</html>
