<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD Sicherheitsmeldungen</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD Sicherheitshinweise">
<meta name="keywords" content="openbsd,Sicherheit">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997-2003 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color=#e00000>Sicherheit</font></h2>
<hr>

<table width="100%">
<tr>
<td colspan="2">
<strong>Index</strong>
</td>
</tr>
<tr>
<td valign="top">
<a href="#goals">Sicherheitsziele des Projektes</a>.<br> 
<a href="#disclosure">Komplette Enth&uuml;llungspolitik</a>.<br> 
<a href="#process">Quellcode Pr&uuml;fungsprozess</a>.<br> 
<a href="#default">"Sicher als Standardeinstellung"</a>.<br> 
<a href="#crypto">Benutzung von Kryptografie</a>.<br> 
<p>
<a href="#watching">Ver&auml;nderungen beobachten</a>.<br> 
<a href="#reporting">Sicherheitsrelevante Dinge bekanntmachen</a>.<br> 
<a href="#papers">Weiterf&uuml;hrende Quellen</a>.<br>
<p>
</td>
<td valign="top">
Die Sicherheitshinweise f&uuml;r spezifische Versionen findest du hier:<br>
<a href="#20">2.0</a>,
<a href="#21">2.1</a>,
<a href="#22">2.2</a>,
<a href="#23">2.3</a>,
<a href="#24">2.4</a>,
<a href="#25">2.5</a>,
<a href="#26">2.6</a>,
<a href="#27">2.7</a>,
<a href="#28">2.8</a>,
<a href="#29">2.9</a>,
<a href="#30">3.0</a>,
<a href="#31">3.1</a>,
<a href="#32">3.2</a>,
<a href="#33">3.3</a>.
</td>
</tr>
</table>
<hr>

<dl>
<a name=goals></a>
<li><h3><font color=#e00000>Ziel</font></h3><p>

OpenBSD glaubt an starke Sicherheit. Wir streben danach, die NUMMER EINS
in der Industrie in Sachen Sicherheit zu sein (wenn wir es nicht schon sind).
Unser "Open Software" Entwicklungsmodell erlaubt uns, einen kompromissloseren
Blickwinkel hinsichtlich Sicherheit zu haben, als Sun, SGI, IBM, HP und 
anderen Herstellern das m&ouml;glich ist.
Wir k&ouml;nnen &Auml;nderungen machen, die grosse Hersteller nicht machen
w&uuml;rden.
Und da OpenBSD mit 
<a href="crypto.html">
Kryptografie</a> exportiert wird, sind wir in der Lage, kryptografische 
Ans&auml;tze zu w&auml;hlen, um Sicherheitsprobleme zu l&ouml;sen.
<p>

<a name=disclosure></a>
<li><h3><font color=#e00000>Komplette Enth&uuml;llung</font></h3><p>

Wie viele Leser der 
<a href="http://online.securityfocus.com/archive/1">
BUGTRAQ Mailingliste</a>,
glauben wir an komplette Enth&uuml;llung von Sicherheitsproblemen.
Im Bereich der Betriebssysteme waren wir wahrscheinlich die ersten, 
die dieses Konzept verwirklicht haben.
Viele Hersteller, selbst von freier Software, versuchen immer noch, Probleme
vor ihren Benutzern zu verstecken.
<p>

Sicherheitsinformationen bewegen sich sehr schnell in Cracker-Kreisen.
Auf der anderen Seite ist es unsere Erfahrung, dass es typischerweise etwa 
einer Stunde Arbeit bedarf, um eine saubere L&ouml;sung zu programmieren und
zu ver&ouml;ffentlichen -- somit ist eine sehr schnelle Reaktion m&ouml;glich.
Daher glauben wir, dass eine komplette Enth&uuml;llung Personen, die sich
wirklich um Sicherheit Gedanken machen, hilft. 
<p>

<a name=process></a>
<li><h3><font color=#e00000>Pr&uuml;fungsprozess</font></h3><p>

Unser Sicherheitspr&uuml;fungsteam gesteht &uuml;blicherweise aus sechs bis 
zw&ouml;lf Mitgliedern, die fortw&auml;hrend nach Sicherheitsl&ouml;chern suchen
und diese beseitigen. Wir suchen und pr&uuml;fen seit dem Sommer 1996. 
Der Prozess, den wir verfolgen um die Sicherheit zu erh&ouml;hen, ist
prinzipiell eine einfache Datei-f&uuml;r-Datei Analyse jeder 
kritischen Softwarekomponente. 
Wir suchen nicht so sehr nach Sicherheitsl&ouml;chern, als
vielmehr nach allgemeinen Softwarefehlern, und wenn Jahre sp&auml;ter jemand 
ein Problem entdeckt, das ein Sicherheitsloch war, von uns aber schon beseitigt
wurde, weil es einfach ein Fehler war, dann umso besser.
Diese Fehler wurden in nahezu allen Bereichen des Systems gefunden.
Ganz neue Klassen von Sicherheitsproblemen wurden w&auml;hrend unserer
 &Uuml;berpr&uuml;fungen gefunden, und oftmal muss Quellcode, der bereits einmal
gepr&uuml;ft wurde, noch einmal auf diese neuen Probleme hin &uuml;berpr&uuml;ft werden.
Code wird oftmals viele Male gepr&uuml;ft und das noch von verschiedenen Leuten
mit verschiedenen Pr&uuml;fungsfertigkeiten.
<p>

Manche unseres Sicherheitspr&uuml;fungsteams haben f&uuml;r Secure Networks
gearbeitet, der Firma, die das erste Netzwerk-Sicherheits-Scanning-Produkt
in der ganzen Industrie, Ballista, gemacht hat (Secure Networks wurde von
Network Associates aufgekauft und Ballista in Cybercop Scanner umgetauft,
na ja ...).
Diese Firma hat eine Menge Sicherheitsforschung betrieben und passt daher 
gut zum OpenBSD Standpunkt. OpenBSD hat Ballista's Test seit dem ersten Tag mit fliegenden Fahnen bestanden.
<p>

Eine weitere Facette des Prozesses unserer Sicherheits&uuml;berpr&uuml;fungen
ist seine Proaktivit&auml;t, sprich seine vorausschauende Art und Weise.
Wir haben herausgefunden, dass in den meisten F&auml;llen die
M&ouml;glichkeit, einen Fehler auszunutzen, nicht gegeben ist.
W&auml;hrend unserer fortw&auml;hrenden &Uuml;berpr&uuml;fungen finden wir viele     
Softwarefehler, und beseitigen diese, obwohl deren Ausnutzbarkeit nicht bewiesen
ist. Wir beseitigen den Fehler, und suchen nach weiteren, die 
beseitigt werden m&uuml;ssen. Wir haben viele einfache und offensichtliche 
Programmierfehler beseitigt, um Monate sp&auml;ter festzustellen, dass diese 
Fehler tats&auml;chlich ausnutzbar gewesen w&auml;ren. (Oder noch wahrscheinlicher
w&uuml;rde jemand auf
<a href="http://online.securityfocus.com/archive/1">BUGTRAQ</a>
berichten, dass andere Betriebssysteme auf ein neu entdecktes Problem hin
anf&auml;llig w&auml;ren, und dass das Problem in OpenBSD schon seit einigen 
Versionen nicht mehr besteht.)
In anderen F&auml;llen wurden wir vor kompletter Ausnutzbarkeit komplexer
Schritt-f&uuml;r-Schritt Angriffe bewahrt, weil wir einen der Zwischenschritte
undurchf&uuml;hrbar gemacht haben, als wir einen Fehler beseitigt hatten.
Ein Beispiel, wo wir einen solchen Erfolg verbuchen konnten, war die lpd-
Warnung, die Secure Networks herausgebracht hat.
<p>

<li><h3><font color=#e00000>Die Belohnung</font></h3><p>

Unser proaktiver &Uuml;berpr&uuml;fungsprozess hat sich ausgezahlt. 
Stellungnahmen wie : "Dieses Problem wurde in OpenBSD vor
6 Monaten beseitigt" sind schon Normalit&auml;t geworden in Sicherheitsforen wie
<a href="http://online.securityfocus.com/archive/1">BUGTRAQ</a>.<p>

Der intensivste Teil unserer Sicherheits&uuml;berpr&uuml;fungen fand
unmittelbar vor der Ver&ouml;ffentlichung von OpenBSD Version 2.0 und w&auml;hrend
der 2.0 nach 2.1-Entwicklungsphase statt, w&auml;hrend des letzten Drittels von
1996 und der ersten H&auml;lfte von 1997. Tausende (ja, Tausende!) von
sicherheitsrelevanten Fehlern wurden schnell in diesem Zeitraum
beseitigt, Fehler wie der Standard Puffer-&Uuml;berlauf (buffer overflow),
Schw&auml;chen in der Implementation von Protokollen, unberechtigtes Sammeln
von Daten und Dateisystem-"races". So wurden die meisten Sicherheitsprobleme
vor der Version 2.1 beseitigt, und dann noch einmal eine geringe Anzahl bis zur
Version 2.2 . Wir finden jetzt nicht mehr so viele Probleme, es ist jetzt
einfach eine Sache wiederkehrender Gewohnheiten. Neuerdings sind die Probleme,
die wir finden aber immer obskurer oder komplizierter.
Trotzdem machen wir aus einer Reihe von Gr&uuml;nden weiter:<p>

<ul>
<li>Ab und zu finden wir ein Problem, das wir vorher &uuml;bersehen hatten.
<li>Sicherheit ist wie ein Wettr&uuml;sten; die besten Angreifer
werden weiter nach komplizierteren Angriffen suchen, also machen wir auch weiter.
<li>Das Finden und Beseitigen von subtilen Softwareproblemen in komplizierter Software macht ein Menge Spass. 
</ul>
<p>

Der &Uuml;berpr&uuml;fungsprozess ist noch nicht vorbei, und wie man sehen kann
finden und beseitigen wir weiterhin Sicherheitsprobleme.
<p>

<a name=default></a>
<li><h3><font color=#e00000>"Sicher als Standard"</font></h3><p>

Um sicherzustellen, dass neue Nutzer von OpenBSD nicht &uuml;ber Nacht 
Sicherheitsexperten werden m&uuml;ssen (ein Standpunkt, den andere 
Systeme scheinbar haben), liefern wir unser Betriebssystem standardm&auml;ssig
sicher aus.
Alle nicht-essentiellen Dienste sind deaktiviert. Sobald der Benutzer/Administrator
vertrauter mit dem System ist, wird er entdecken, dass er Daemons und andere 
Teile des Systems aktivieren muss. W&auml;hrend des Lernprozesses, wie man einen
neuen Dienst aktiviert, wird der Anf&auml;nger eher die sicherheitsrelevanten
Dinge lernen.
<p>

Dies ist ein starker Kontrast zu der wachsenden Zahl von Systemen, die mit
laufendem NFS, mountd, Web Servern und verschiedenen anderen Diensten
ausgeliefert werden, was zu sofortigen Sicherheitsproblemen f&uuml;r ihre
Benutzer gleich nach der Installation f&uuml;hrt.
<p>

<a name=crypto></a>
<li><h3><font color=#e00000>Kryptografie</font></h3><p>

Und da das OpenBSD-Projekt in Kanada beheimatet ist, ist es uns m&ouml;glich,
Kryptografie ins das System zu integrieren.
Um mehr Informationen zu erhalten, lesen sie die Seite, die zeigt,
<a href="crypto.html">was wir mit Kryptografie angefangen haben.</a>.</p>

<li><h3><font color=#e00000>Hinweise</font></h3><p>

<dl>

<a name=33></a>

<h3><font color=#e00000>OpenBSD 3.3 Sicherheitshinweise</font></h3>
Dies sind die Sicherheitshinweise f&uuml;r OpenBSD 3.3 -- all diese Probleme sind
in <a href="anoncvs.html">OpenBSD current</a> und dem
<a href="stable.html">patch branch</a> bereits gel&ouml;st

<p>
<ul>
<li><a href=errata.html#asn1>1. Oktober 2003:
	Das Verwenden einer bestimmten ASN.1 Kodierung oder eines
	fehlgeformten public keys kann es einem Angreifer erlauben,
	einen Denial-of-Service Angriff auf Anwendungen, die gegen
	ssl(3) gelinkt sind, aufzusetzen.</a>
<li><a href=errata.html#pfnorm>24. September 2003:
	Zugriff auf freigegebenen Speicher in pf(4) k&ouml;nnte dazu
	benutzt werden, von entfernt auf einer Maschine einen Panic
	zu verursachen, wenn sie scrub Regeln benutzt.</a>
<li><a href=errata.html#sendmail>17. September 2003:
       Ein buffer overflow im address parsing in
       sendmail(8) kann einem Angreifer erlauben root Privilegien zu erlangen.</a>
<li><a href=errata.html#sshbuffer>16. September 2003:
       OpenSSH Versionen vor 3.7 enthalten einen Buffer Management Fehler,
       der potentiell ausnutzbar ist.</a>
<li><a href=errata.html#sysvsem>10. September 2003:
       Root kann den Security Level senken, indem er einen Integer Overflow
       im Falle von sehr gro&szlig;en Semaphoren-Limits ausnutzt.</a>
<li><a href="errata.html#semget">20. August 2003:
       Eine unsaubere &Uuml;berpr&uuml;fung von Grenzen im Kernel kann 
       einem lokalen Angreifer erlauben, eine Kernel Panic zu verursachen.</a>
<li><a href="errata33.html#realpath">4. August 2003:
       Ein off-by-one Fehler in der C-Bibliotheks-Funktion realpath(3)
       k&ouml;nnte einem Angreifer erlauben, erweiterte Rechte zu erlangen.</a>
</ul>

<a name=32></a>

<h3><font color=#e00000>OpenBSD 3.2 Sicherheitshinweise</font></h3>
Dies sind die Sicherheitshinweise f&uuml;r OpenBSD 3.2 -- all diese Probleme sind
in <a href="anoncvs.html">OpenBSD current</a> und dem
<a href="stable.html">patch branch</a> bereits gel&ouml;st

<p>
<ul>
<li><a href=errata32.html#asn1>1. Oktober 2003:
	Das Verwenden einer bestimmten ASN.1 Kodierung oder eines
	fehlgeformten public keys kann es einem Angreifer erlauben,
	einen Denial-of-Service Angriff auf Anwendungen, die gegen
	ssl(3) gelinkt sind, aufzusetzen.</a>
<li><a href=errata32.html#pfnorm>24. September 2003:
	Zugriff auf freigegebenen Speicher in pf(4) k&ouml;nnte dazu
	benutzt werden, von entfernt auf einer Maschine einen Panic
	zu verursachen, wenn sie scrub Regeln benutzt.</a>
<li><a href="errata32.html#sendmail4">17. September 2003:
       Ein buffer overflow im address parsing in
       sendmail(8) kann einem Angreifer erlauben root Privilegien zu erlangen.</a>
<li><a href="errata32.html#sshbuffer">September 16, 2003:
       OpenSSH Versions vor 3.7 enthalten einen buffer management Fehler,
       der potentiell ausnutzbar ist.</a>
<li><a href=errata32.html#sendmail3>25. August 2003:
       M&ouml;gliche Sicherheitsl&uuml;cke in sendmail(8) im Bezug auf
       DNS Maps behoben.</a>
<li><a href="errata32.html#realpath">4. August 2003:
       Ein off-by-one Fehler in der C-Bibliotheks-Funktion realpath(3)
       k&ouml;nnte einem Angreifer erlauben, erweiterte Rechte zu erlangen.</a>
<li><a href="errata32.html#sendmail2">31. M&auml;rz 2003:
       Ein buffer overflow in der Adressenverarbeitung von
       sendmail(8) kann einem Angreifer erlauben root Privilegien 
       zu erlangen.</a>
<li><a href="errata32.html#kerberos">24. M&auml;rz 2003:
       Eine kryptografische Schw&auml;che im Kerberos v4 Protokoll kann 
       kann ebenso in Kerberos v5 ausgenutzt werden.</a>
<li><a href="errata32.html#kpr">19. M&auml;rz 2003:
       OpenSSL ist durch eine Erweiterung des ``Bleichenbacher'' Angriffs, 
       der von den tschechischen Forschern Klima, Pokorny und Rosa 
       entworfen wurde, angreifbar.</a>
<li><a href="errata32.html#blinding">18. M&auml;rz 2003:
       Verschiedene SSL und TLS Operationen in OpenSSL sind durch
       timing attacks angreifbar.</a>
<li><a href="errata32.html#lprm">5. M&auml;rz 2003:
       Ein buffer overflow in lprm(1) kann einem Angreifer erlauben
       seine Privilegien zum User daemon heraufzuschrauben.</a>.
<li><a href="errata32.html#sendmail">3. M&auml;rz 2003:
       Ein buffer overflow in der envelope comments Verarbeitung von 
       sendmail(8) kann einem Angreifer erlauben root Privilegien zu erlangen.</a>
<li><a href="errata32.html#httpd">25. Februar 2003:
       httpd(8) verliert Datei-Inode Nummern via ETag header genauso wie
       Child PIDs in der multipart MIME Boundary Generation. Das kann zum
       Beispiel zu einem NFS exploit f&uuml;hren, weil hier Inode-Nummern als
       Teil des Datei-Handle benutzt werden.</a>
<li><a href="errata32.html#ssl">February 22, 2003:
       In ssl(8) kann ein Informationsleck durch das Timing beim Durchf&uuml;hren einer 
       MAC Berechnung auch dann auftreten, wenn ein inkorrektes Block Cipher Padding 
       gefunden wurde, hier ist eine Gegenmassnahme. &Uuml;berpr&uuml;fe die Werte 
       in den Zuweisungsroutinen auch auf negative Werte.</a>
<li><a href="errata32.html#cvs">20. Januar 2003:
       In cvs(1) existiert ein "double free" dass zu einer "privilege
       escalation" bei cvs Konfigurationen f&uuml;hren k&ouml;nnte, wo das 
       cvs Kommanado als privilegierter User l&auml;uft.</a>
<li><a href="errata32.html#named">14. November 2002:
       Es existiert ein buffer overflow im named(8) der zu einem
       remote crash oder Code-Ausf&uuml;hrung als user named  in einem chroot jail
       f&uuml;hren kann.</a>
<li><a href="errata32.html#pool">6. November 2002:
       Ein Logik-Fehler im pool kernel memory allocator kann eine Korruption des Speichers
       bei wenig Speicher bewirken, was das System abst&uuml;rzen 
       lassen kann.</a>
<li><a href="errata32.html#smrsh">6. November 2002:
       Ein Angreifer kann die Restriktionen der smrsh(8) umgehen und beliebigen Code
       mit den Privilegien seines eigenen Accounts ausf&uuml;hren.</a>
<li><a href="errata32.html#pfbridge">6. November 2002:
       Network bridges, die pf mit eingeschaltetem scrubbing laufen haben, k&ouml;nnen
       wegen einer mbuf corruption abst&uuml;rzen.</a>
<li><a href="errata32.html#kadmin">21. Oktober 2002:
       Ein Buffer Overflow kann im kadmind(8) Daemon passieren, was zu einem
       m&ouml;glichen remote crash oder exploit f&uuml;hren kann.</a>
</ul>

 
<p>

<li>

</dl>
<p>
OpenBSD 3.1 und f&uuml;hrere Versionen werden nicht mehr unterst&uuml;tzt. 
Die folgenden Paragraphen listen nur die Sicherheitshinweise auf, die aktuell
waren, als diese Versionen noch unterst&uuml;tzt wurden; diese Versionen sind
auch von Sicherheitshinweisen in neueren Versionen betroffen. 
<br>
<p>
<dl>
<a name=31></a>

<h3><font color=#e00000>OpenBSD 3.1 Sicherheitshinweise</font></h3>
Dies sind die Sicherheitshinweise f&uuml;r OpenBSD 3.1 -- all diese Probleme sind
in <a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.
Der <a href="stable.html">patch branch</a> f&uuml;r 3.1 wird nicht mehr weiter
gepflegt, Du solltest Deine Maschine updaten.


<p>
<ul>
<li><a href="errata31.html#sendmail2">31. M&auml;rz 2003:
       Ein buffer overflow in der Adressenverarbeitung von
       sendmail(8) kann einem Angreifer erlauben root Privilegien
       zu erlangen.</a>
<li><a href="errata31.html#kerberos">24. M&auml;rz 2003:
       Eine kryptografische Schw&auml;che im Kerberos v4 Protokoll kann
       kann ebenso in Kerberos v5 ausgenutzt werden.</a>
<li><a href="errata.html#kpr">19. M&auml;rz 2003:
       OpenSSL ist durch eine Erweiterung des ``Bleichenbacher'' Angriffs,
       der von den tschechischen Forschern Klima, Pokorny und Rosa
       entworfen wurde, angreifbar.</a>
<li><a href="errata.html#blinding">18. M&auml;rz 2003:
       Verschiedene SSL und TLS Operationen in OpenSSL sind durch
       timing attacks angreifbar.</a>
<li><a href="errata31.html#lprm">5. M&auml;rz 2003:
       Ein buffer overflow in lprm(1) kann einem Angreifer erlauben
       seine Privilegien zum User daemon heraufzuschrauben.</a>.
<li><a href="errata31.html#sendmail">3. M&auml;rz 2003:
       Ein buffer overflow in der envelope comments Verarbeitung von 
       sendmail(8) kann einem Angreifer erlauben root Privilegien zu erlangen.</a>
<li><a href="errata31.html#ssl2">23. Februar 2003:
       In ssl(8) kann ein Informationsleck durch das Timing beim Durchf&uuml;hren einer
       MAC Berechnung auch dann auftreten, wenn ein inkorrektes Block Cipher Padding
       gefunden wurde, hier ist eine Gegenmassnahme. &Uuml;berpr&uuml;fe die Werte
       in den Zuweisungsroutinen auch auf negative Werte.</a>
<li><a href="errata31.html#cvs">20. Januar 2003:
       In cvs(1) existiert ein "double free" dass zu einer "privilege
       escalation" bei cvs Konfigurationen f&uuml;hren k&ouml;nnte, wo das 
       cvs Kommanado als privilegierter User l&auml;uft.
<li><a href="errata31.html#named">14. November 2002:
       Es existiert ein buffer overflow im named(8) der zu einem
       remote crash oder Code-Ausf&uuml;hrung als user named  in einem chroot jail
       f&uuml;hren kann.</a>
<li><a href="errata31.html#kernresource">6. November 2002:
       Nicht korrektes Pr&uuml;fen von Argument im getitimer(2) Systemaufruf 
       kann einem Angreifer erlauben, das System zum Absturz zu bringen.</a>
<li><a href="errata31.html#smrsh">6. November 2002:
       Ein Angreifer kann die Restriktionen der smrsh(8) umgehen und beliebigen Code
       mit den Privilegien seines eigenen Accounts ausf&uuml;hren.</a>
<li><a href="errata31.html#kadmin">21. Oktober 2002:
       Ein Puffer-&Uuml;berlauf kann im kadmind(8) daemon auftreten, was zu einem
       remote Crash oder Exploit f&uuml;hren kann.</a>
<li><a href="errata31.html#kerntime">2. Oktober 2002:
       Nicht korrektes &Uuml;berpr&uuml;fen von Argumenten im setitimer(2) Systemaufruf
       kann einem Angreifer erlauben, in den Kernelspeicher zu schreiben.</a>
<li><a href="errata31.html#scarg">11. August 2002:
       Ein unzureichende &Uuml;berpr&uuml;fung der Grenzen im select Systemaufruf
       erlaubt einem Angreifer, kernel memory zu &uuml;berschreiben und beliebigen
       Code imm Kernel Kontext auszuf&uulm;hren.</a>
<li><a href="errata31.html#ssl">30. Juli 2002:
       Mehrere remote buffer overflows k&ouml;nnen im SSL2 Server und SSL3
       Client der ssl(8) Library auftreten, so wie auch im ASN.1 Parser Code 
       in the crypto(3) Library, alle sind potentiell remote exploitbar.</a>
<li><a href="errata31.html#xdr">29. Juli 2002:
       Es gibt einen buffer overflow im xdr_array(3) RPC Code, was zu einem
       m&ouml;glichen remote crash f&uuml;hren kann.</a>
<li><a href="errata31.html#pppd">29. Juli 2002:
       Es gibt eine race condition im pppd(8) daemon, die ihn dazu bringen kann,
       eigenm&auml;chtig die Dateirechte einer anderen Datei zu &auml;ndern.</a>
<li><a href="errata31.html#isakmpd">5. Juli 2002:
       Der Empfang von IKE payloads, die nicht in der richtigen 
       Reihenfolge ankommen, kann isakmpd(8) zum Absturz bringen.</a>
<li><a href="errata31.html#ktrace">27. Juni 2002:
       Der Kernel l&auml;sst jeden User ktrace Prozesse mit set[ug]id ausf&uuml;hren.</a>
<li><a href="errata31.html#modssl">26. Juni 2002:
       Ein buffer overflow kann im .htaccess Parsing-Code im
       mod_ssl httpd Modul auftreten, was zu einem m&ouml;glichen remote 
       Ein potentieller buffer overflow wurde im  DNS Resolver gefunden.</a>
<li><a href="errata31.html#sshd">24. Juni 2002:
       Alle Versions von OpenSSH's sshd zwischen 2.3.1 und 3.3 enthalten einen
       Eingabe-Validierungs-Fehler, der zu einem Integer Overflow und
       "privilege escalation" f&uuml;hren kann.</a>
<li><a href="errata31.html#httpd">19. Juni 2002:
       Ein buffer overflow kann w&auml;hrend der Interpretation von "chunked
       encoding" im httpd(8) geschehen, was zu einem remote crash 
       f&uuml;hren kann.</a>
<li><a href="errata31.html#sshbsdauth">22. Mai 2002:
        Um bestimmten Umst&auml;nden ist es auf Systemen, die YP mit Netgroups
        in der password database benutzen, m&ouml;glich, dass sshd(8) zwar
        ACL Checks f&uuml;r den nachgefragten Usernamen  durchf&uuml;hrt, aber den password
        database Eintrag eines anderen Users f&uuml;r die Authentifikation benutzt. Das bedeutet,
        dass unberechtigte Leute Zutritt zum System bekommen k&ouml;nnten, w&auml;hrend
        berechtigte ausgeschlossen bleiben k&ouml;nnten.</a>
<li><a href="errata31.html#fdalloc2">8. Mai 2002:
       Es gibt eine race condition die den Schutz des Kernels der
       fd slots 0-2 f&uuml;r setuid Prozesse ausschaltet.</a>
<li><a href="errata31.html#sudo">25. April 2002:
       Ein Bug in sudo kann es einem angreifer erlauben den Heap zu korrumpieren.</a>
<li><a href="errata31.html#sshafs">April 22, 2002:
        Ein lokaler User kann super-user Privilegien wegen eines Buffer
        Overflow in sshd(8) erlangen, falls AFS auf dem System konfiguriert ist
        oder falls KerberosTgtPassing oder AFSTokenPassing in der
        sshd_config Datei eingeschaltet ist.</a>
</ul>


<p>
<li>
<a name=30></a>

<h3><font color=#e00000>OpenBSD 3.0 Sicherheitshinweise</font></h3>
Dies sind die Sicherheitshinweise f&uuml;r OpenBSD 3.0 -- all diese Probleme sind
in <a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.
Der <a href="stable.html">patch branch</a> f&uuml;r 3.0 wird nicht mehr weiter
gepflegt, Du solltest Deine Maschine updaten.

<p>
<ul>
<li><a href="errata30.html#named">14. November 2002:
       Es existiert ein buffer overflow im named(8) der zu einem
       remote crash oder Code-Ausf&uuml;hrung als user named  in einem chroot jail
       f&uuml;hren kann.</a>
<li><a href="errata30.html#kernresource">6. November 2002:
       Nicht korrektes Pr&uuml;fen von Argument im getitimer(2) Systemaufruf     
       kann einem Angreifer erlauben, das System zum Absturz zu bringen.</a>
<li><a href="errata30.html#smrsh">6. November 2002:
       Ein Angreifer kann die Restriktionen der smrsh(8) umgehen und beliebigen Code
       mit den Privilegien seines eigenen Accounts ausf&uuml;hren.</a>
<li><a href="errata30.html#kadmin">21. Oktober 2002:
       Ein Puffer-&Uuml;berlauf kann im kadmind(8) daemon auftreten, was zu einem
       remote Crash oder Exploit f&uuml;hren kann.</a>
<li><a href="errata30.html#kerntime">7. Oktober 2002:
       Inkorrektes Pr&uuml;fen von Argumenten im setitimer(2) Systemaufruf
       kann einem Angreifer erlauben, in den Kernelspeicher zu schreiben.</a>
<li><a href="errata30.html#scarg">11. August 2002:
       Ein unzureichende &Uuml;berpr&uuml;fung der Grenzen im select Systemaufruf
       erlaubt einem Angreifer, kernel memory zu &uuml;berschreiben und beliebigen
       Code imm Kernel Kontext auszuf&uulm;hren.</a>
<li><a href="errata30.html#ssl">30. Juli 2002:
       Mehrere remote buffer overflows k&ouml;nnen im SSL2 Server und SSL3
       Client der ssl(8) Library auftreten, so wie auch im ASN.1 Parser Code in der
       crypto(3) Library, alle sind potentiell remote exploitbar.</a>
<li><a href="errata30.html#xdr">29. Juli 2002:
       Ein buffer overflow kann im xdr_array(3) RPC Code auftreten, was zu einem
       remote crash f&uuml;hren kann.</a>
<li><a href="errata30.html#pppd">29. Juli 2002:
       Eine race condition existiert im pppd(8) daemon, die ihn dazu 
       bringen kann, die Dateirechte einer anderen Datei zu ver&auml;ndern.</a>
<li><a href="errata30.html#isakmpd2">5. Juli 2002:
       Der Empfang von IKE payloads, die nicht in der richtigen Reihenfolge 
       sind, kann beim isakmpd(8) zum Abstirz f&uuml;hren.</a>
<li><a href="errata30.html#ktrace">27. Juni 2002:
       Der Kernel l&auml;sst jeden User ktrace Prozesse mit set[ug]id ausf&uuml;hren.</a>
<li><a href="errata30.html#resolver">25. Juni 2002:
       Ein potentieller buffer overflow wurde im  DNS Resolver gefunden.</a>
<li><a href="errata30.html#sshdauth">24. Juni 2002:
       Alle Versions von OpenSSH's sshd zwischen 2.3.1 und 3.3 enthalten einen
       Eingabe-Validierungs-Fehler, der zu einem Integer Overflow und
       "privilege escalation" f&uuml;hren kann.</a>
<li><a href="errata30.html#modssl">24. Juni 2002:
       Ein buffer overflow kann im .htaccess Parsing-Code im
       mod_ssl httpd Modul auftreten, was zu einem m&ouml;glichen remote 
       crash oder exploit f&uuml;hren kann.</a>
<li><a href="errata30.html#httpd">19. Juni 2002:
       Ein buffer overflow kann w&auml;hrend der Interpretation von "chunked
       encoding" im httpd(8) geschehen, was zu einem remote crash
       f&uuml;hren kann.</a>
<li><a href="errata30.html#fdalloc2">8. Mai 2002:
       Es gibt eine race condition die den Schutz des Kernels der
       fd slots 0-2 f&uuml;r setuid Prozesse ausschaltet.</a>
<li><a href="errata30.html#sudo">25. April 2002:
       Ein Bug in sudo kann es einem angreifer erlauben den Heap zu korrumpieren.</a>
<li><a href="errata30.html#sshafs">April 22, 2002:
        Ein lokaler User kann super-user Privilegien wegen eines Buffer
        Overflow in sshd(8) erlangen, falls AFS auf dem System konfiguriert ist
        oder falls KerberosTgtPassing oder AFSTokenPassing in der
        sshd_config Datei eingeschaltet ist.</a>
<li><a href="errata30.html#mail">11. April 2002:
       mail(1) hat tilde escapes auch dann interpretiert, wenn es nicht im
       interaktiven Modus aufgerufen wurde.  Da mail(1) von cron als root aufgerufen wurde,
       kann das zu einem lokalen root compromise f&uuml;hren.</a>
<li><a href="errata30.html#approval">19. M&auml;rz 2002:
       Unter bestimmten Umst&auml;nden ist auf Systemen mit YP und netgroups in
       der Passwort-Datenbank, f&uuml;r die rexecd(8) und rshd(8)
       Daemons m&ouml;glich, eine Shell aus einem Password-Datenbank-Eintrag f&uuml;r
       einen ganz anderen User auszuf&uuml;hren. &Auml;hnlich kann atrun(8) in ein falsches 
       Home-Verzeichnis wechseln, wenn es seine Jobs ausf&uuml;hrt.</a>
<li><a href="errata30.html#zlib">13. M&auml;rz 2002:
       Ein potentielles double free() existiert in der zlib Library;
       das ist allerdings auf OpenBSD nicht eploitbar.
       Der Kernel enth&auml;lt auch eine Kopie der zlib; momentan ist nicht
       bekannt, ob die Kernel zlib exploitbar ist.</a>
<li><a href="errata30.html#openssh">8. M&auml;rz 2002:
       Ein off-by-one Check in OpenSSH's channel forwarding Code
       k&ouml;nnte einem lokalen User erlauben, sich Super-User Privilegien zu 
       verschaffen.</a>
<li><a href="errata30.html#ptrace">21. Januar 2002:
       Eine race condition zwischen den ptrace(2) und execve(2) Systemaufrufen
       erlaubt einem Angreifer den Speicherinhalt von suid/sgid
       Prozessen zu modifizieren, was zu einer Kompromittierung des super-user account f&uuml;hren kann.</a>
<li><a href="errata30.html#sudo">17. Januar 2002:
       Es gibt ein Sicherheitsloch in sudo(8), das ausgenutzt werden kann,
       wenn der Sendmail-Ersatz Postfix installiert ist und welches einem Angreifer
       erm&ouml;glicht auf dem lokalen host root Privilegien zu erhalten.</a>
<li><a href="errata.html#lpd">28. November 2001:
       Ein Angreifer kann eine Maschine, die einen lpd daemon laufen hat,
       dazu bringen, neue Dateien im root Verzeichnis zu erzeugen.</a>
<li><a href="errata30.html#vi.recover">13. November 2001:
       Das vi.recover Skript kann auf eine Art missbraucht werden, die dazu f&uuml;hrt,
       das beliebige Dateien der L&auml;nge Null gel&ouml;scht werden k&ouml;nnen.</a>
<li><a href="errata30.html#pf">13. November 2001:
       pf(4) konnte mit bestimmten Typen von IPv6 ICMP Paketen nicht richtig umgehen,
       was in einem Crash endete.</a>
<li><a href="errata30.html#sshd">12. November 2001:
       Ein Sicherheitsloch, das einem Angreifer erlaubte, sich teilweise zu athentifizieren, falls --
       und nur falls -- der Administrator KerberosV aktiviert hatte. </a>
</ul>

<p>
<li>
<a name=29></a>

<h3><font color=#e00000>OpenBSD 2.9 Sicherheitshinweise</font></h3>
Dies sind die OpenBSD 2.9 Hinweise -- alle diese Probleme wurden
in <a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.
Der <a href="stable.html">patch branch</a> f&uuml;r 2.9 wird nicht mehr weiter
gepflegt, Du solltest Deine Maschine updaten.

<p>
<ul>
<li><a href="errata29.html#resolver">25. Juni 2002:
       Ein potentieller buffer overflow wurde im  DNS Resolver gefunden.</a>
<li><a href="errata.html#fdalloc2">8. Mai 2002:
       Es gibt eine race condition die den Schutz des Kernels der
       fd slots 0-2 f&uuml;r setuid Prozesse ausschaltet.</a>
<li><a href="errata29.html#sudo">25. April 2002:
       Ein Bug in sudo kann es einem angreifer erlauben den Heap zu korrumpieren.</a>
<li><a href="errata29.html#sshafs">April 22, 2002:
        Ein lokaler User kann super-user Privilegien wegen eines Buffer
        Overflow in sshd(8) erlangen, falls AFS auf dem System konfiguriert ist
        oder falls KerberosTgtPassing oder AFSTokenPassing in der
        sshd_config Datei eingeschaltet ist.</a>
<li><a href="errata29.html#mail">11. April 2002:
       mail(1) hat tilde escapes auch dann interpretiert, wenn es nicht im
       interaktiven Modus aufgerufen wurde.  Da mail(1) von cron als root aufgerufen wurde,
       kann das zu einem lokalen root compromise f&uuml;hren.</a>
<li><a href="errata29.html#zlib">13. M&auml;rz 2002:
       Ein potentielles double free() existiert in der zlib Library;
       das ist allerdings auf OpenBSD nicht eploitbar.
       Der Kernel enth&auml;lt auch eine Kopie der zlib; momentan ist nicht
       bekannt, ob die Kernel zlib exploitbar ist.</a>
<li><a href="errata29.html#openssh">8. M&auml;rz 2002:
       Ein off-by-one Check in OpenSSH's channel forwarding Code
       k&ouml;nnte einem lokalen User erlauben, sich Super-User Privilegien zu 
       verschaffen.</a>
<li><a href="errata29.html#ptrace">21. Januar 2002:
       Eine race condition ziwschen den ptrace(2) und execve(2) Systemaufrufen
       erlaubt einem Angreifer den Speicherinhalt von suid/sgid Prozessen zu ver&auml;ndern,
       was zur Kompromittierung des Super-User Account f&uuml;hren kann.</a>
<li><a href="errata29.html#sudo">17. Januar 2002:
       Es gibt ein Sicherheitsloch in sudo(8), das ausgenutzt werden kann,
       wenn der Sendmail-Ersatz Postfix installiert ist und welches einem Angreifer
       erm&ouml;glicht auf dem lokalen host root Privilegien zu erhalten.</a>
<li><a href="errata.html#lpd">28. November 2001:
       Ein Angreifer kann eine Maschine, die einen lpd daemon laufen hat,
       dazu bringen, neue Dateien im root Verzeichnis zu erzeugen.</a>
<li><a href="errata29.html#vi.recover">13. November 2001:
       Das vi.recover Skript kann auf eine Art missbraucht werden, die dazu f&uuml;hrt,
       das beliebige Dateien der L&auml;nge Null gel&ouml;scht werden k&ouml;nnen.</a>
<LI><A HRef=errata29.html#uucp>11. September, 2001:
       Es existiert ein Sicherheitsloch in uuxqt(8), das einem Angreifer erlauben kann,
       root Privileges zu erlangen.</a>
<li><a href="errata29.html#lpd">29. August 2001:
       Es existiert ein Sicherheitsloch im lpd(8), der einem Angreifer m&ouml;glicherweise erlaubt,
       root Privilegien zu erlangen, wenn der lpd l&auml;uft.</a>
<li><a href="errata29.html#sendmail2">21. August, 2001:
       Es existiert ein Sicherheitsloch in sendmail(8) dass einem lokalen Angreifer
       erlauben kann, root privileges zu erlangen.</a>
<li><a href="errata29.html#nfs">30. Juli 2001:
       Ein Kernel buffer overflow im NFS Code kann ivon Usern mit mount Privilegien 
       dazu benutzt werden b&ouml;sartigen Code auszuf&uuml;hren (standardm&auml;ssig i
       nur root).</a>
<li><a href="errata29.html#kernexec">15. Juni 2001:
       Eine race condition im Kernel kann zu einer lokalen root Kompromittierung f&uuml;hren.</a>
<li><a href="errata29.html#sshcookie">12. Juni 2001:
        sshd(8) erlaubt Usern das L&ouml;schen beliebiger Dateien namens "cookies"
        falls X11 forwarding eingeschaltet ist. X11 forwarding ist standardm&auml;ssig 
	deaktiviert.</a>
<li><a href="errata29.html#fts">30. Mai 2001:
        Programme, die die fts Routinen benutzen, k&ouml;nnen dazu verleitet werden, in das
	falsche Verzeichnis zu wechseln.</a>
<li><a href="errata29.html#sendmail">29. Mai 2001:
       Die Sendmail signal handlers enthalten unsicheren Code,
       was zu zahlreichen race conditions f&uuml;hrt.</a>
</ul>

<p>
<li>
<a name=28></a>

<h3><font color=#e00000>OpenBSD 2.8 Sicherheitshinweise</font></h3>
Dies sind die OpenBSD 2.8 Hinweise -- alle diese Probleme wurden  
in <a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.
Der <a href="stable.html">patch branch</a> f&uuml;r 2.8 wird nicht mehr weiter
gepflegt, Du solltest Deine Maschine updaten.

<p>
<ul>
<li><a href="errata28.html#uucp">11. September, 2001:
       Es existiert ein Sicherheitsloch in uuxqt(8), das einem Angreifer erlauben kann,
       root Privilegien zu erlangen.</a>
<li><a href="errata28.html#lpd">29. August 2001:
       Es existiert ein Sicherheitsloch im lpd(8), der einem Angreifer m&ouml;glicherweise erlaubt, 
       root Privilegien zu erlangen, wenn der lpd l&auml;uft.</a>
<li><a href="errata28.html#sendmail2">21. August, 2001:
       Es existiert ein Sicherheitsloch in sendmail(8) dass einem lokalen Angreifer
       erlauben kann, root privileges zu erlangen.</a>
<li><a href="errata28.html#kernexec">15. Juni 2001:
       Eine race condition im Kernel kann zu einer lokalen root Kompromittierung f&uuml;hren.</a>
<li><a href="errata28.html#fts">30. Mai 2001:
        Programme, die die fts Routinen, k&ouml;nnen dazu verleitet werden, in das 
        falsche Verzeichnis zu wechseln.</a> 
<li><a href="errata28.html#sendmail">May 29, 2001:
       Die Sendmail signal handlers enthalten unsicheren Code,
       was zu zahlreichen race conditions f&uuml;hrt.</a>
<li><a href="errata28.html#ipf_frag">23. Apr. 2001:
       IPF enth&auml;lt einen ernsthaften Fehler in Bezug auf seine Handhabung von "fragment caching".</a>
<li><a href="errata28.html#glob_limit">23. Apr. 2001:
       ftpd(8) enth&auml;lt einen potentiellen DoS durch die Benutzung von glob(3).</a>
<li><a href="errata28.html#glob">10. Apr. 2001:
       Die glob(3) library enth&auml;lt mehrere Puffer-&Uuml;berlauf.</a>
<li><a href="errata28.html#readline">18. M&auml;rz 2001:
       Die readline library erzeugt history files mit permissive modes basierend auf der umask des Users.</a>
<li><a href="errata28.html#ipsec_ah">2. M&auml;rz 2001:
       Unzureichende Checks im IPSEC AH IPv4 option handling Code k&ouml;nnen zu einem
	Puffer&uuml;berlauf im Kernel f&uuml;hren.</a>
<li><a href="errata28.html#userldt">2. M&auml;rz 2001:
       Die <b>USER_LDT</b> Kernel Option erlaubt einem Angreifer Zugriff auf privilegierte Bereiche des 
	Kernelspeicher zu bekommen.</a>
<li><a href="errata28.html#sudo">22. Feb. 2001:
       Ein nicht nutzbarerbarer Puffer&uuml;berlauf in sudo(8) wurde eliminiert.</a>
<li><a href="errata28.html#named">29. Jan. 2001:
       Erg&auml;nze named(8) mit ISC BIND 4.9.8-REL, was einige 'buffer vulnerabilities' beseitigt.</a>
<li><a href="errata28.html#rnd">22. Jan. 2001:
       rnd(4) hat nicht den gesamten Input benutzt, wenn in ihn geschrieben wurde.</a>
<li><a href="errata28.html#xlock">22. Dez. 2000:
       xlock(1)'s Authentifikation wurde &uuml;berarbeitet und  benutzt jetzt eine pipe. (Patch und neue xlock Binaries sind dabei).</a>
<li><a href="errata28.html#procfs">18. Dez. 2000:
       Procfs enth&auml;lt einige overflows. Procfs wird standardm&auml;ssig nicht in OpenBSD benutzt. (Patch beigef&uuml;gt).</a>
<li><a href="errata28.html#kerberos2">10. Dez. 2000:
       Es gibt eine weiteres Problem in den KerberosIV libraries (Patch beigef&uuml;gt).</a>
<li><a href="errata28.html#kerberos">7. Dez. 2000:
       Eine Gruppe von Problemen existierte in KerberosIV (Patch beigef&uuml;gt).</a>
<li><a href="errata28.html#ftpd">4. Dez. 2000:
       Es gibt einen 'single-byte buffer overflow' in ftpd (Patch beigef&uuml;gt).</a>
</ul>

<p>
<li>
<a name=27></a>

<h3><font color=#e00000>OpenBSD 2.7 Sicherheitshinweise</font></h3>
Dies sind die OpenBSD 2.7 Hinweise -- all diese Probleme wurden
in <a href="anoncvs.html">OpenBSD current</a> gel&ouml;st. Nat&uuml;rlich sind alle 
unten aufgef&uuml;hrten OpenBSD 2.6 Hinweise in OpenBSD 2.7 gel&ouml;st.

<p>
<ul>
<li><a href="errata27.html#readline">Mar 18, 2001:
       Die readline library erzeugt history files mit permissive modes basierend auf der umask des Users.</a>
<li><a href="errata27.html#sudo">Feb 22, 2001:
       Ein buffer overflow in sudo(8) wurde beseitigt.</a>
<li><a href="errata27.html#ftpd">Dec 4, 2000:
	Es gibt einen 'single-byte buffer overflow' in ftpd (Patch beigef&uuml;gt).</a>
        Es gibt noch keine bekannten 'exploits' f&uuml;r diesen Bug.
       <li><a href="errata27.html#sshforwarding">10. Nov 2000:
       Andere Server k&ouml;nnen OpenSSH Clients dazu bringen agent oder X11 forwarding zu machen.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#xtrans">Oct 26, 2000:
In den X11 libraries gibt es 2 potentielle Overflows im xtrans Code.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#httpd">18. Okt 2000:
       Die Apache mod_rewrite und mod_vhost_alias Module k&ouml;nnen in bestimmten
       Konfigurationen auf dem Server Dateien offenlegen. 
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#telnetd">10. Okt. 2000:
       Der telnet daemon wertet die TERMINFO, TERMINFO_DIRS,
       TERMPATH und TERMCAP Umgebungsvariablen nicht aus, wie er sollte.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#format_strings">6. Okt. 2000:
       Es gibt einige 'printf format string' Bugs in verschiedenen privilegierten
       Programmen. (Patch beigef&uuml;gt)</a> 
<li><a href="errata27.html#curses">Oct 6, 2000:
       libcurses benutzt Terminal Beschreibungen im $HOME/.terminfo
       Verzeichnis genauso wie in der TERMCAP Umgebungsvariable f&uuml;r
       setuid und setgid Anwendungen.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#talkd">6. Okt. 2000:
       Es gibt einen 'format string' Bug in talkd(8).
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#pw_error">3. Okt. 2000:
       Es gibt einen 'format string' Bug in der pw_error() Funktion der
       'libutil' Library, die zu einem 'localhost root'-Exploit mit Hilfe von chpass(1)
       f&uuml;hren kann.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#ipsec">18. Sept  2000:
       Schlechte ESP/AH Pakete k&ouml;nnen unter bestimmten Umst&auml;nden einen Crash verursachen.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#xlock">16. Aug 2000:
       Eine 'format string' Verwundbarkeit (localhost root) existiert in xlock(1).
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#X11_libs">14. Juli 2000:
       Verschiedene bugs, die in den X11 Libraries gefunden wurden haben verschiedene Seiteneffekte, 
       bis hin zum kompletten Denial of Service von OpenBSD.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#ftpd">5. Juli 2000:
       So wie ziemlich viele der anderen Unix ftp daemons
       auf diesem Planeten hatte ftpd ein remote root hole.
       Gl&uuml;cklicherweise war ftpd nicht standardm&auml;ssig aktiviert.
       Das Problem existiert sobald anonymous ftp aktiviert ist.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#mopd">5. Juli 2000:
       Mopd wird zwar selten benutzt, hat aber trotzdem buffer overflows enthalten.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#libedit">28. Juni 2000:
       libedit w&uuml;rde nach einer <b>.editrc</b> Datei im momentanen Verzeichnis
       suchen.
       Obwohl es zu keinem bekannten Sicherheitsloch f&uuml;hrt, gibt es einen Patch.
       (Patch beigef&uuml;gt)</a>             
<li><a href="errata27.html#dhclient">24. Juni 2000:
       Ein schlimmer Bug im dhclient(8) k&ouml;nnte das Ausf&uuml;hren
       von Strings eines nicht-freundlich-gesonnenen dhcp Server als root
       in der Shell erlauben.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#isakmpd">9. Juni 2000:
       Ein schlimmer Bug im isakmpd(8) Policy Handling, insbesondere 
       in der Policy Verifikation erm&ouml;glicht ein kompletttes Umgehen von isakmpd.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#uselogin">6. Juni 2000:
       Das nicht-voreingestellte flag UseLogin in <b>/etc/sshd_config</b> ist kaputt,
       sollte nicht benutzt werden, und f&uuml;hrt zu Sicherheitsproblemen in anderen 
       Betriebssystemen.</a>
<li><a href="errata27.html#bridge">26. Mai 2000:
       Das bridge(4) <i>learning</i> Flag kann umgangen werden.
       (Patch beigef&uuml;gt)</a>
<li><a href="errata27.html#ipf">25. Mai 2000:
       Unsaubere Benutzung von ipf <i>keep-state</i> rules kann in
       durchdringlichen Firewallregeln resultieren. (Patch beigef&uuml;gt)</a>
      
</ul>

<p>
<li>
<a name=26></a>

<h3><font color=#e00000>OpenBSD 2.6 Sicherheitshinweise</font></h3>
Dies sind die OpenBSD 2.6 Hinweise -- all diese Probleme wurden in
<a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.  Nat&uuml;rlich sind alle Probleme,
die unter 2.5 aufgelistet sind, unter 2.6 gel&ouml;st.

<p>
<ul>
<li><a href="../errata26.html#semconfig">26. Mai 2000:
       'SYSV semaphore' Unterst&uuml;tzung beinhaltete einen undokumentierten 'system call'
       , der 'semaphore-using' Prozesse vom Anhalten abhalten kann. (Patch beigef&uuml;gt)</a>
<li><a href="../errata26.html#ipf">25. Mai 2000:
       Unsaubere Benutzung von ipf <i>keep-state</i> Regeln kann in undichten
       Firewallregeln resultieren.(Patch beigef&uuml;gt)</a>
<li><a href="../errata26.html#xlockmore">25. Mai 2000: 
       xlockmore hat einen Bug, den ein lokaler Angreifer benutzen kann, um Zugang zum
       verschl&uuml;sselten root Passwort-Hash zu erlangen (der aber normalerweise mit Blowfish
       verschl&uuml;sselt ist</a> (siehe
       <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crypt&sektion=3">
       crypt(3)</a>)
       (Patch beigef&uuml;gt).
<li><a href="../errata26.html#procfs">20. Januar 2000: 
	Systeme, die mit eingeschaltetem procfs arbeiten und
	gemounted werden, sind anf&auml;llig f&uuml;r einen besonders
	schwierigen Trick.
	procfs ist standardm&auml;ssig nicht eingeschaltet.
	(patch beigef&uuml;gt).</a>
<li><a href="../errata26.html#sendmail">4. Dez, 1999:
	Sendmail hat jedem User ein "aliases file wrap" erlaubt,
	was zu einer sog. Race-Condition f&uuml;hrt, wenn dieses Alias-File
	nicht da ist.
<li><a href="../errata26.html#sendmail">4. Dez 1999:
       Sendmail erlaubte jedem User ein aliases file wrap zu erzeugen und setzte damit
       das System einer race-Condition aus, bei der die aliases Datei nicht existiert.
	(patch beigef&uuml;gt).</a>
<li><a href="../errata26.html#poll">4. Dez 1999:
       Verschiedene Bugs in poll(2) k&ouml;nnen einen Kernel Crash ausl&ouml;sen.</a>
<li><a href="../errata26.html#sslUSA">2 . Dez, 1999:
	Ein Puffer-&Uuml;berlauf im RSAREF Code aus der USA-Version von
	libssl erm&ouml;glicht Einbr&uuml;che/Ausnutzen in 
	httpd, ssh, oder isakmpd, sobald SSL/RSA Features eingeschaltet sind.
	(patch beigef&uuml;gt).</a><br>
	<strong>Update:</strong> Es hat sich gezeigt, dass dadurch keinerlei Software,
	die in OpenBSD 2.6 beigef&uuml;gt war, dadurch angreifbar war.
<li><a href="../errata26.html#ifmedia">9. Nov 1999: 
       Jeder User konnte die Interface media configurations &auml;ndern, was eine 
       localhost denial of service Attacke m&ouml;glich machte.
	(patch beigef&uuml;gt).</a>
</ul>

<p>
<li>

<a name=25></a>

<h3><font color=#e00000>OpenBSD 2.5 Sicherheitshinweise</font></h3>
Dies sind die OpenBSD 2.5 Hinweise -- all diese Probleme wurden in
<a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.  Nat&uuml;rlich sind alle Probleme,
die unter 2.4 aufgelistet sind, unter 2.5 gel&ouml;st.
<p>
<ul>
<li><a href="../errata25.html#cron">30. Aug, 1999: 
	Stellen sie sicher, dass cron(8) mit NULL terminiert in Bezug auf
	fake popen() . Sendmail sollte man unbedingt als User laufen lassen, nicht als root.
	(patch beigef&uuml;gt).</a>
<li><a href="../errata25.html#miscfs">12. Aug , 1999: Die procfs und fdescfs
	Dateisysteme hatten einen &Uuml;berlauf in der Behandlung des uio_offset
	in ihrer readdir() Routine. Diese Dateisysteme werden 
	standardm&auml;ssig nicht eingeschaltet.
	(patch beigef&uuml;gt).</a>
<li><a href="../errata25.html#profil">9. Aug, 1999: profiling gestoppt
	(see profil(2)), wenn ein neuer Prozess mit exeve() erzeugt wird.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata25.html#ipsec_in_use">6. Aug, 1999: Pakete, die von IPsec
	h&auml;tten verschl&uuml;sselt werden sollen, k&ouml;nnen als Klartext
	&uuml;bermittelt werden. PF_KEY SA abgelaufene Sch&uuml;ssel k&ouml;nnen
	Kernel Ressourcen zum "Auslaufen" bringen.
	(Patch eingef&uuml;gt).</a>
<li><a href="../errata25.html#rc">5. Aug, 1999: In /etc/rc sollte mktemp(1) zum
	Wiederbeschreiben von motd benutzt werden und bei find(1) -execdir.
	(Patch eingef&uuml;gt).</a>
<li><a href="../errata25.html#chflags">30. Jul, 1999: Erlauben sie normalen Usern
	nicht chflags(2) oder fchflfags(2) bei character oder block devices
	zu benutzen, deren Eigent&uuml;mer sie sein k&ouml;nnten.
        (Patch hinzugef&uuml;gt).</a>
<li><a href="../errata25.html#nroff">27. Jul, 1999: Bringen sie groff(1) dazu, mit 
	dem -S flag aufgerufen zu werden, wenn es von nroff(1) aufgerufen wird.
	(Patch beigef&uuml;gt).</a>
</ul>

<p>
<li>
<a name=24></a>
<h3><font color=#e00000>OpenBSD 2.4 Security Advisories</font></h3>
Dies sind die OpenBSD 2.4 Hinweise -- all diese Probleme wurden in
<a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.  Nat&uuml;rlich sind all Probleme,
die unter 2.3 aufgelistet sind, unter 2.4 gel&ouml;st.
<p>
<ul>
<li><a href="../errata24.html#poll">Mar 22, 1999: Das nfds Argument f&uuml;r poll(2)
	muss erzwungen werden, um ein "Verhungern" von kvm zu vermeiden.
	(Patch eingef&uuml;gt).</a>
<li><a href="../errata24.html#tss">21.Mar, 1999: Eine &Auml;nderung im TSS Handling 
	stoppt einen weiteren Kernel-Crash, der vom 
	<strong>crashme</strong>
	Programm hervorgerufen werden kann. (Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#nlink">25. Feb, 1999: Ein nicht begrenztes
	Hochz&auml;hlen des nlink-Wertes in FFS und EXT2FS-Dateisystemen kann 
	einen
	Systemabsturz hervorrufen.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#ping">23. Feb, 1999: Ein weiterer Puffer-&Uuml;berlauf
	in ping(8)
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#ipqrace">19.Feb, 1999: ipintr() hatte eine 
	race-condition w&auml;hrend der Benutzung von ipq, so dass ein Angreifer
	einen Absturz des System h&auml;tte ausl&ouml;sen k&ouml;nnen.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#accept">17. Feb, 1999: Eine race condition im
	Kernel zwischen accept(2) und select(2),die einem Angreifer erlaubt h&auml;tte, Sockets aus der Entfernung aufzuh&auml;ngen. 
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#maxqueue">17.Feb, 1999: IP -Defragmentierung kann die
	Maschine schwer besch&auml;ftigen und Probleme verursachen.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#trctrap">12.Feb, 1999: i386 T_TRCTRAP Handling und
	DDB konnten interagieren und einen Crash verursachen.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#rst">11. Feb, 1999: Das TCP/IP RST Handling war 
	schlampig.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#bootpd">27. Nov, 1998: Es gibt ein Problem in bootpd(8),
	dass sich sogar aus der Ferne ausnutzen l&auml;sst.
	(Patch hinzugef&uuml;gt).</a>

<li><a href="../errata24.html#termcap">19. Nov, 1998: Es gibt ein m&ouml;glicherweise
	lokal ausnutzbares Problem in den "environment"-Variablen in termcap
	und curses.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata24.html#tcpfix">13. Nov, 1998: Es gibt ein Problem im 
	TCP-decoding Teil des Kernels, der sich aus der Ferne ausnutzen 
	l&auml;sst.
	(Patch hinzugef&uuml;gt).</a>
</ul>

<p>
<li>
<a name=23></a>
<h3><font color=#e00000>OpenBSD 2.3 Security Advisories</font></h3>
Dies sind die OpenBSD 2.3 Hinweise -- all diese Probleme wurden in
<a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.  Nat&uuml;rlich sind all Probleme,
die unter 2.2 aufgelistet sind, unter 2.3 gel&ouml;st.

<p>
<ul>
<li><a href="../errata23.html#bootpd">27. Nov, 1998: Es gibt ein Problem in bootpd(8)
, das aus der Ferne ausgenutzt werden kann.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata23.html#tcpfix">13. Nov, 1998: Es gibt ein aus der Ferne
	hervorrufbares Problem, was die Maschine zum Halten bringt. Es steckt
	im TCP-Devocing-Teil im Kernel.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata23.html#resolver">31. August 1998: Ein gutartiger looking resolver
       buffer overflow Bug wurde ungewollte wieder eingef&uuml;gt (Patches beigef&uuml;gt).</a>
<li><a href="../errata23.html#chpass">2. Aug 1998:
       chpass(1) hat ein file descriptor leak das einem Angreider erlaubt,
       /etc/master.passwd zu modifizieren.</a>
<li><a href="../errata23.html#inetd">15. Juli 1998: Inetd hat ein file descriptor leak.</a>
<li><a href="../errata23.html#fdalloc">2. Jul, 1998: setuid und setgid Prozesse
	sollten nicht mit fd slots 0, 1, oder 2 frei ausgef&uuml;hrt werden.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata23.html#xlib">6. Juni, 1998: Weitere Probleme mit den X-Libraries
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata23.html#kill">17. Mai, 1998: kill(2) von setuid/setgid Ziel-
Prozessen zu freundlich. (4.Version des Patches hinzugef&uuml;gt).
	</a>
<li><a href="../errata23.html#immutable">11 .Mai, 1998: mmap() erlaubt teilweises
	Umgehen von unver&auml;nderlichen und nur-hinzuf&uuml;gen Dateiflags.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata23.html#ipsec">5. Mai, 1998: Unkorrekte Behandlung von IPSEC
 	Paketen, wenn IPSEC eingeschaltet ist.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata23.html#xterm-xaw">1. Mai, 1998: 
	Puffer &Uuml;berlauf in xterm und Xaw
	(CERT advisory VB-98.04) (Patch hinzugef&uuml;gt).</a>
</ul>

<p>
<li>
<a name=22></a>
<h3><font color=#e00000>OpenBSD 2.2 Security Advisories</font></h3>
Dies sind die OpenBSD 2.2 Hinweise -- all diese Probleme wurden in
<a href="anoncvs.html">OpenBSD current</a> gel&ouml;st.  Nat&uuml;rlich sind alle Probleme,
die unter 2.1 aufgelistet sind, unter 2.2 gel&ouml;st.

<p>
<ul>
<li><a href="../errata22.html#ipsec">5. Mai, 1998: Inkorrekte Behandlung von IPSEC
	Paketen, wenn IPSEC eingeschaltet ist.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata22.html#xterm-xaw">1. Mai, 1998: Puffer &Uuml;berlauf in xterm 
	und Xaw
	(CERT advisory VB-98.04) (Patch hinzugef&uuml;gt).</a>
<li><a href="../errata22.html#uucpd">22. Apr, 1998: Puffer &Uuml;berlauf in uucpd
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata22.html#rmjob">22. Apr, 1998: Puffer Missmanagement in lprm
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata22.html#ping">31.M&auml;rz, 1998: &Uuml;berlauf in ping -R (Patch hinzugef&uuml;gt).</a>
<li><a href="../errata22.html#named">30. M&auml;rz, 1998: &Uuml;berlauf in named fake-iquery

	(Patch hinzugef&uuml;gt).</a>
<li><a href="../errata22.html#mountd">2. M&auml;rz, 1998: Unbeabsichtigter NFS i
	filesystem Export.
	(Patch hinzugef&uuml;gt).</a>
<li><a href="../advisories/mmap.txt">26. Feb, 1998: Read-write mmap() Fehler.</a>
	Version 3 des Patches ist <a href="../errata22.html#mmap">hier</a> verf&uuml;gbar.
<li><a href="../advisories/sourceroute.txt">19. Feb, 1998: Falsche Pakete werden
	akzeptiert.
	</a>
	Ein Patch ist <a href="../errata22.html#sourceroute">hier</a> verf&uuml;gbar.
<li><a href="../errata22.html#ruserok">13. Feb, 1998: Setuid coredump &amp; Ruserok()
	Problem (Patch hinzugef&uuml;gt).</a>
<li><a href="../errata22.html#ldso">9. Feb, 1998: MIPS ld.so Problem (Patch hinzugef&uuml;gt).</a>
</ul>

<p>
<li>
<a name=21></a>
<h3><font color=#e00000>OpenBSD 2.1 Sicherheitshinweise</font></h3>
Dies sind die OpenBSD 2.1 Hinweise. Alle diese  Probleme gibt es in 
<a href="../22.html">OpenBSD 2.2</a> nicht mehr. Manche dieser Probleme gibt es
noch in anderen Betriebsystemen. (Wenn sie noch OpenBSD 2.1 benutzen,
raten wir sehr zu einem Upgrade zu der neuesten Version, da diese Patch-Liste
nur die wichtigsten Fehler beinhalten kann. Insbesondere behebt OpenBSD 2.2 
viele lokale Sicherheitsprobleme. Viele dieser Probleme wurden in einer Art und
Weise gel&ouml;st, die es schwer f&uuml;r uns macht, Patches bereitzustellen.

<p>
<ul>
<li><a href="../advisories/signals.txt">15. Sep, 1997: Deviant Signals (Patch hinzugef&uuml;gt)</a>
<li><a href="../advisories/rfork.txt">2. Aug, 1997: Rfork() system call Problem
	(Patch hinzugef&uuml;gt)</a>
<li><a href="../advisories/procfs.txt">24. Jun, 1997: Procfs Probleme (Patch hinzugef&uuml;gt)</a>
</ul>

<p>
<li>
<a name=20></a>
<h3><font color=#e00000>OpenBSD 2.0 Sicherheitshinweise</font></h3>
Dies sind die OpenBSD 2.0 Hinweise.  All diese Probleme sind in
<a href="../21.html">OpenBSD 2.1</a> gel&ouml;st.  Manche dieser Probleme existieren
weiterhin in anderen Betriebsystemen. (Wenn sie noch OpenBSD 2.0 benutzen,
bewundern wir sie daf&uuml;r, aber sie verpassen wirklich etwas, wenn sie keine 
neue Version installieren!)

<p>
<ul>
<li><a href="../advisories/res_random.txt">22. April, 1997: Vorhersagbare IDs im
	resolver (Patch hinzugef&uuml;gt)</a> 
<li>Viele andere.. wenn niemand sie l&ouml;sen kann, lasst es mich wissen, wir stellen sie dann hier hinein..
</ul>

</dl>
<p>

<a name=watching></a>
<li><h3><font color=#e00000>Unsere Ver&auml;nderungen beobachten</font></h3><p>

Da wir einen proaktiven Standpunkt in Bezug auf Sicherheit einnehmen, finden
wir fortw&auml;hrend neue Probleme und l&ouml;sen sie. Nicht alle diese Probleme
wurden grossartig ver&ouml;ffentlicht, da (wie schon vorher beschrieben) viele
von ihnen nicht als ausnutzbar best&auml;tigt waren; viele einfache Fehler, die
wir gel&ouml;st haben, haben Sicherheitskonsequenzen, die wir nicht vorhersagen
konnten.
Wir haben einfach nicht die Zeit, um diese &Auml;nderungen im oben verwandten
Format zu ver&ouml;ffentlichen.

Deswegen gibt es sehr kleine Sicherheitsfixes im current-Sourcecode &uuml;ber die
jeweils aktuelle OpenBSD Version hinaus. Wir geben eine begrenzte Garantie, dass
diese Probleme nur minimalen Einfluss haben und deren Ausnutzbarkeit nicht 
bewiesen ist. Sobald wir entdecken, dass ein Problem wirklich 
sicherheitsrelevant ist, gibt es hier 
<strong>SEHR</strong> schnell einen Patch.<p>

Leute, die sich wirklich um Sicherheit k&uuml;mmern, k&ouml;nnen ein paar Dinge tun:
<p>

<ul>
<li>Wenn sie von Sicherheitsdingen etwas verstehen, verfolgen sie unsere
	<a href="mail.html">source-changes Mailingliste</a> und behalten
	sie jeglichen sicherheitsrelevanten Dinge und Fixes im Auge.
	Da die Ausnutzbarkeit vieler "Fixes", die wir machen, nicht 
	bewiesen ist, erwarten sie kein "SECURITY FIX!" auf allen "Fixes".
	Wenn ein bewiesenermassen wichtiges Problem existiert, wird hier
	kurze Zeit sp&auml;ter ein Patch erscheinen.
<li>zus&auml;tzlich zu den source changes kannst du die <a href="mail.html">
       security-announce Mailingliste</a>  verfolgen, die dich &uuml;ber jede 
       sicherheitsrelevante &Auml;nderung informieren wird, dass das OpenBSD Team als
       Bedrohung einstuft, und dir erkl&auml;rt, wie man das Problem "wegpatcht".
<li>Verfolgen sie unseren "current"-Source-Baum, und lernen sie, wie man
	von Zeit zu Zeit ein komplett neues System erzeugt. (Lesen sie
	(/us/src/Makefile sorgf&auml;ltig).
	User k&ouml;nnen davon ausgehen, dass der "current source" immer mehr
	Sicherheit bietet als die vorherige offizielle Version.
	Nichtsdestotrotz ist das Erzeugen eines eigenen Systems aus dem 
	Source Code nicht trivial und Probleme treten auf, w&auml;hrend wir
	mit nahezu 300 MB Source Code von Version zu Version fortschreiten.
<li>Installieren sie einen Snapshot f&uuml;r ihre Architektur, diese werden		recht h&auml;ufig ver&ouml;ffentlicht.
	Ein Snapshot f&uuml;r i386 wird z.B. fast w&ouml;chentlich erstellt.
</ul>

<p>
<a name=reporting></a>
<li><h3><font color=#e00000>Probleme melden</font></h3><p>


<p> Wenn sie ein neues Sicherheitsproblem finden, mailen sie es an:
<a href="mailto:deraadt@openbsd.org">deraadt@openbsd.org</a>.
<br>
Wenn sie es mit PGP verschl&uuml;sseln wollen (bitte nur dann, wenn 
Privatsph&auml;re dringend n&ouml;tig ist), benutzen sie diesen Schl&uuml;ssel:
<a href="../advisories/pgpkey.txt">pgp key</a>.

<p>
<a name=papers></a>
<li><h3><font color=#e00000>Weiterf&uuml;hrende Dokumente</font></h3><p>

Eine Reihe von Kurzabhandlungen wurden von Mitgliedern des OpenBSD-Teams 
&uuml;ber sicherheitsbezogene &Auml;nderungen in OpenBSD geschrieben.
Die Postscript-Versionen dieser Dokumente sind folgendermassen verf&uuml;gbar.
<p>

<ul>
<li>Ein zukunftsorientiertes Passwortschema.<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    by <a href="mailto:provos@openbsd.org">Niels Provos</a>,
    <a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
    <a href="../papers/bcrypt-paper.ps">Papierform</a> und
    <a href="../papers/bcrypt-slides.ps">Folien</a>.
<p>
<li>Kryptografie in OpenBSD: Ein &Uuml;berblick.<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    by <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
    <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
    <a href="mailto:art@openbsd.org">Artur Grabowski</a>,
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/crypt-paper.ps">Papierform</a> und
    <a href="../papers/crypt-slides.ps">Folien</a>.
<p>
<li>strlcpy und strlcat -- zuverl&auml;ssiges, sicheres Kopieren und Verkn&uuml;pfen von Strings.<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    by <a href="mailto:millert@openbsd.org">Todd C. Miller</a>,
    <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
    <a href="../papers/strlcpy-paper.ps">Papierform</a> und
    <a href="../papers/strlcpy-slides.ps">Folien</a>.
<p>
<li> 
 Public Ethernet Jacks-Switches, Gateways, und Authenfizierung.<br>
    <a href="events.html#lisa99">LISA 1999</a>,
    by <a href="mailto:beck@openbsd.org">Bob Beck</a>.<br>
    <a href="../papers/authgw-paper.ps">Papierform</a> und
    <a href="../papers/authgw-slides.ps">Folien</a>.
<p>
<li>Encrypting Virtual Memory<br>
    <a href="events.html#sec2000">Usenix Security 2000</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/swapencrypt.ps">Papierform</a> und
    <a href="../papers/swapencrypt-slides.ps">Folien</a>.
<p>
</ul>

</dl>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border=0 alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>Originally [OpenBSD: security.html,v 1.260 ]
<br>
$Translation: security.html,v 1.117 2003/10/05 23:13:17 grunk Exp $
<br></small>
<small>$OpenBSD: security.html,v 1.105 2003/10/06 00:15:05 horacio Exp $</small>
</body>
</html>
