<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
                 "http://www.w3.org/TR/REC-html40/loose.dtd">
<html>
<head>
<title>Sichtweisen von OpenBSD Usern</title> 
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="description" content="Anwender von OpenBSD sprechen &uuml;ber das System">
<meta name="keywords" content="openbsd,user,anwender,erfahrungen,kommentare">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 2000-2004 by OpenBSD.">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#23238E">
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">OpenBSD: Aus der Sicht von Benutzern</font></h2>
<p>Viele Benutzer haben ihre Erfahrungen mit OpenBSD kommentiert.
Das folgende sind alles unaufgeforderte Kommentare aus unserer &ouml;ffentlichen Mailingliste, oder
manchmal auch anderer Mailinglisten (bei diesen sind Links zu den originalen Artikeln enthalten).
Die Postings wurden gek&uuml;rzt, und etwas in bezug auf Rechtschreibung und Grammatik verbessert,
sind aber ansonsten unver&auml;ndert.

<hr>

<h3><a href="mailto:SKohrman@apu.edu">Shawn Kohrman</a> schreibt:</h3>
<p>
Als Security/Netzwerk Administrator seit &uuml;ber zehn Jahren muss ich
sagen, dass OpenBSD ohne Anstrengungen die besten Voreinstellungen als
Betriebssystem von allen hat. Ich habe mit MS NT/2000, Linux (von seinen
Anf&auml;ngen an), Solaris, etc. gearbeitet. OpenBSD ist einfach, sauber,
sicher und zuverl&auml;ssig. Vielen Dank an die Entwickler f&uuml;r ihre
herausragende Arbeit.

<h3><a href="mailto:kristoff@phatness.net">Kris Wilkinson</a> schreibt:</h3>
<p>
Ich bin schon eine ganze Zeit dabei Netzwerke zu sichern, und wusste bis vor kurzem, als ich 
OpenBSD 3.0 installiert habe, nicht, wie einfach mein Leben sein k&ouml;nnte.
Nachdem ich alle die "anderen" verf&uuml;gbaren Betriebssysteme ausprobiert habe, hat sich 3.0 als
das sicherste, das am leichtesten admnistrierbare und am besten organisierte Paket herausgestellt.
Es nicht nur absolut "cutting edge", es konzentriert sich auch auf die kleinen Punkte in der Sicherheit
zu denen ich einfach keine Lust mehr habe, sie jedesmal zu ver&auml;ndern, wenn ich eine neue
Maschine aufsetze.
<p>
Ich sichere Netzwerke rund um Alberta mit Hilfe eures fantastischen 
Setup. Danke vielmals! Macht mit der hervorragenden Arbeit weiter !

<h3>Matthew Haas sagt:</h3>
<p>
Seit meiner Entscheidung OpenBSD zu installieren, bin ich sehr davon beeindruckt.
Definitiv ein grossartiges System, es erinnert mich etwas an die Tage mit meiner Slackware
, nur noch besser.
<p>
Danke.

<h3>
<a href="mailto:webmaster@2600.org.au">Grant Bayley</a>,
ein IT Manager aus Australien schreibt:</h3>
<p>
Apropos Erfolgs-Stories, seit einige von uns bei '2600 Australien' OpenBSD 
seit etwa 12 Monaten in der einen oder anderen Form benutzen, haben wir
Freunde gesehen, die es auf ihren Machinen installiert haben und schlicht und
einfach verbl&uuml;fft waren, welche Qualit&auml;t es hat, insbesondere auch in bezug auf das 
Vorausdenken, dass die Dinge von Anfang an sicher macht.
<p>
Einer von uns, der bei einem ISP arbeitet, hatte eine Diskussion mit einem SuSE-Eiferer
in bezug auf Kompatibilit&auml;t, Stabilit&auml;t und Sicherheit und sie f&uuml;hrten einen Test durch,
um ein Betriebssystem f&uuml;r ihre Server auszuw&auml;hlen (die bisher mit RedHat liefen und mindestens
einmal kompromittiert wurden, d.h. "gerootet" wurden). OpenBSD bestand den Test mit 
fliegenden Fahnen und im Moment installieren sie 2.6 auf ihren Servern, meist auf Standard-Hardware
und nutzen hautps&auml;chlich Software aus dem ports tree (qmail,cucipop,etc).

<h3>System- und Netzwerk-Administrator Jeff Schneiter bot das hier an:</h3>
<p> Mit einem eingefrorenen Budget versucht man das letzte bisschen
aus der vorhandenen Hardware rauszukitzeln... und genau das habe ich dank
OpenBSD getan.

<h3><a name=sarendal href="mailto:tony@polarcap.org">Tony Sarendal</a> sagt das hier:</h3>
<p>Ich habe es mit OpenBSD wegen der IPsec Unterst&uuml;tzung probiert.
Der Grund warum ich dabei geblieben bin, ist, dass es wirklich gut zu
benutzen ist und es einem ein Gef&uuml;hl von Qualit&auml;t gibt, dass kein
anderes Betriebssystem erreicht.
<p>
Ich habe ein bisschen auf einer OpenBSD Maschine programmiert, danach habe
ich die 'man pages' richtig gesch&auml;tzt. Andere Unice, die ich benutzt habe, hatten einfach
keine so guten 'man pages'.
<p>
Macht weiter so gute Arbeit, Jungs.

<h3>Sicherheitsingenieur Tyler Allison schreibt:</h3>
<p>
Ich habe Linux, Windows NT und OpenBSD in hoch sicheren Umgebungen installiert,
gesichert und verwaltet. (ja, man kann Linux und Windows NT in solchen Umgebungen 
sichern :) ). Nachdem das gesagt ist, muss ich betonen, dass man zu OpenBSD greifen muss,
wenn man ein Minimum an Administration bez&uuml;glich Sicherheit haben will. 
Es ist f&uuml;r viele Leute nicht ungew&ouml;hnlich ihre OpenBSD-Maschinen auch in Produktionsumgebungen
jahrelang nicht upzudaten, weil sie abolut stabil sind und es keinerlei "remote" 
Angiffsm&ouml;glichkeiten gibt. Also gibt es auch keinen Grund upzudaten.
<p>
Ich h&auml;tte keinerlei Probleme damit einen meiner internen (und unge&uuml;bten) Mitarbeiter
eine OpenBSD-Installation auf einem PC machen zu lassen (keine Extra-Sicherheits-Arbeit 
nach der Installation mehr n&ouml;tig) und dann die Kronjuwelen meiner Firma auf diese Maschine
zu packen, um dann f&uuml;r ein Jahr wegzugehen.
Ich bin mir total sicher, dass die Maschine weder gecrashed ist, in sie eingebrochen wurde oder
ein BS-Upgrade braucht. Das kann man &uuml;ber NT oder Linux nicht sagen.
Aber wenn du das sagst, hast du diese Produkte offensichtlich noch nie so benutzt :)
<p>
Noch etwas,was ich den Leute immer sage ist: Pr&uuml;fe deine lokale "exploit site" oder 
"vulnerability alert mailing list" und guck nach, ob du einen "remote"
root level exploit findest, der auf OpenBSD funktioniert. Ich behaupte du findest keinen,
der j&uuml;nger als 12 Monate ist.

<h3>Jan Johansson gab diese Antwort auf die Frage "Wie baue ich einen preiswerten Web Server?" :</h3>
<p>
Ich arbeite heutzutage mit Solaris, OpenBSD, NT Server, NT Workstation und Win 95.
<p>
Nachdem ich einige Wochen 'Bugtraq' gelesen habe w&uuml;rde ich sagen, dass ich nie eine (wichtige)
Maschine ins Internet stellen w&uuml;rde, wenn keine Firewall davor ist und f&uuml;r Packet-Filtering w&uuml;rde ich
OpenBSD nehmen..
<p>
F&uuml;r einen preiswerten Webserver w&uuml;rde ich Hardware von einem bekannteren H&auml;ndler empfehlen und eine
OpenBSD CD-ROM und Apache...


<h3><a href="mailto:wyodlows@nj.devry.edu">
William Yodlowsky</a> vom Devry Institute schrieb:</h3>

<p>[Einige] Jahre zuvor begann ich mit Systemadministration.  Ich lernte
zuerst Linux.  Dann crashte einer unserer alten (Ich meine *wirklich* alt) BSDi Server
,und ich sollte das System wieder aufbauen. 
<p>
I sah mir FreeBSD, NetBSD, OpenBSD und Linux an.  Am Ende lief es auf
"sicher und stabil" mit einem sinnvollen Preis heraus.  OpenBSD 2.1 wurde installiert.
<p>
Seitdem habe ich 2.1 bis 2.5 auf allem von Produktions-Servern bis hin zu
Laptops laufen gehabt.  Wir hatten nie (ich wiederhole: NIE) einen Einbruch.
<p>
Ein Kollege installierte eine RedHat Kiste, um seine F&auml;higkeiten in bezug auf SSL und einer sicheren
Webseite zu testen.
Sie wurde schlicht &uuml;ber Nacht gecrackt, und griff am n&auml;chsten Morgen bereits andere
Sites an.
<p>
Unsere OpenBSD Server wurden getestet und dann in Ruhe gelassen.
<p>
In den vergangenen zwei Jahren wurde dieser originale Server ein paar Mal
auf aktuellen Stand gebracht und Patches eingespielt und das Betriebssystem gab uns
nie Anlass dazu, die Zuverl&auml;ssigkeit und Sicherheit von OpenBSD anzuzweifeln.
<p>
Wir haben eine weitere Maschine, die als Router f&uuml;r etwa 800 Workstations fungiert und
recht einfaches Filtern und NAT &uuml;bernimmt. Das passiert auf einem P120 mit 32MB RAM und typischerweise
sieht die uptime ungef&auml;hr so aus:
<pre>
% uptime
 9:05PM  up 266 days,  4:23, 1 user, load averages: 0.06, 0.06, 0.06
%</pre>
<p>Genauso l&auml;uft OpenBSD auf meinem Laptop.
Ein Gateway Solo 2500 mit einem Xircom Modem, und ein Linksys Fast Ethernet NIC.
<p>
Und er crasht niemals :)
<p>
Ein weiteres Ereignis, dass  mich zu einem Anh&auml;nger macht... wir wurden mit Pings
&uuml;bersch&uuml;ttet [vielleicht ein Vorl&auml;ufer der DDOS Angriff im Fr&uuml;hjahr 2000?].
Ich denke etwa 900 verschiedene Hosts auf verschiedenen Netzwerken haben unsere OpenBSD
2.3 Maschine massenhaft und gleichzeitig angepingt (floodpinging), w&auml;hrend sie Email
ausgeliefert hat und gleichzeitig Webseiten f&uuml;r 3500 User bereitgestellt hat.
<p>
Es war ein P133 mit 64MB RAM.  Aber die Maschine ging nicht unter.  Sie wurde ein bisschen langsamer,
crashte aber niemals :-)

<h3>John J. Adelsberger III sagte das &uuml;ber uns in Bruce Schneier's 
<a href="http://www.counterpane.com/crypto-gram-0004.html#CommentsfromReaders">
Crypto-Gram</a>:</h3>
(Die Kommentare auf die er antwortet sind Schneier's)
<br>
<br>&gt; Reale Systeme zeigen keine Anzeichen daf&uuml;r, dass sie weniger
<br>&gt; komplex werden. Tats&auml;chlich werden sie komplexer, 
<br>&gt; schneller und schneller. Microsoft Windows ist ein deutliches
<br>&gt; Beispiel f&uuml;r diesen Trend der Komplexit&auml;t.
<br>...
<br>&gt; Die andere M&ouml;glichkeit ist langsamer zu werden, zu vereinfachen, 
<br>&gt; und zu versuchen die Sicherheit zu erh&ouml;hen.
<p>
OpenBSD tut das. <i>Mir sind keine anderen Gruppen bekannt, deren Arbeit &ouml;ffentlich bekannt ist,
die das tun</i> [Betonung nachtr&auml;glich hinzugef&uuml;gt], was bedauerlich ist,
weil ich es bevorzugen w&uuml;rdem, wenn das nicht nur eine OpenBSD-Eigenschaft w&auml;re;
mein Anliegen ist es klarzustellen, dass dieser Ansatz nicht nur durchf&uuml;hrbar ist, 
sondern bereits durchgef&uuml;hrt wird.

<h3>Andrew Hermetz kommentierte wie folgt:</h3>
<p>Hey alle,
<p>Ich wollte mit diesen Zeilen nur allen danken, die daran arbeiten OpenBSD zu solch einem sauberen,
coolen, &amp; effizientem Projekt zu machen.
<p>Der Hauptruhm geb&uuml;hrt Theo daf&uuml;r, dass er seiner Zeit so weit voraus ist! ;-)
<p>Da ich anderen Leuten oft erkl&auml;ren muss,  *wieso* Sichherheit &uuml;berhaupt wichtig ist
("wenn du gar nichts zu verbergen hast...", "nichts was du tust, ist wichtig genug, um 
Verschl&uuml;sselung zu rechtfertigen...", "nur Kriminelle und Terroristen m&uuml;ssen irgendwo anonym 
herumschn&uuml;ffeln...", etc. ad nauseam), ganz davon zu schweigen *wieso*  es in diesen Tagen mit 
privaten Netzwerken hinter DSL oder gar T1-Leitungen wichtig ist, liebe ich es sie auf eine 
Seite hinzuweisen, die eine gut begr&uuml;ndete Erkl&auml;rung daf&uuml;r bereith&auml;lt, wieso man 
Computersicherheit ernst nehmen sollte.
<p>[... Die OpenBSD Installtion]
wurde ohne Anstrengung auf einem Pentium 90 Compaq LTE 5100 Laptop angesto&szlig;en -- sogar
die No-Name LAN Karte wurde sofort erkannt und die Installation &uuml;ber die
T1 im B&uuml;ro eines Freundes klappte sofort. Wenn ich die Loblieder singe, dann auch weil ich gerne weiss, wo alles ist,
ohne in irgendwelchen dunklen Ecken schauen zu m&uuml;ssen, wenn auch andere Leute eher das spartanische look &amp; feel
m&ouml;gen.
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="Zur&uuml;ck zur OpenBSD-Hauptseite"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: testimonials.html,v 1.16 ]
<br>
$Translation: testimonials.html,v 1.12 2004/02/21 08:22:22 jufi Exp $
</small>
<br><small>$OpenBSD: testimonials.html,v 1.13 2004/02/21 08:47:14 jufi Exp $</small>
</body>
</html>
