<html>
<head>
<meta name=KEYWORDS content="OpenBSD,commercial,operating system,Unix,Un*x,BSD,linux,secure,secure,secure">
<title>OpenBSD at work</title>
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">
<img alt="[OpenBSD]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color=#e00000>User</font><hr></h2>
Das Wort "Benutzer" hat mehrere Bedeutungen. <EM>Endbenutzer</EM> wollen
oft andere User, also Benutzer, des Systems treffen, um Ideen, Probleme und  L&ouml;sungen auszutauschen,
und bei einem Bier oder Essen &uuml;ber das System zu diskutieren. Einer der besten Wege dazu sind die
<a href="../groups.html">Weltweiten User Groups</a>.
<p>
Eine weitere Bedeutung ist "wer benutzt das System und wof&uuml;r ?", 
und das ist das Thema f&uuml;r den Rest dieser Seite. Diese <a href="#com">Firmen</a> 
und Organisationen vertrauen OpenBSD's rigorosem "code audit" (Untersuchung des Codes)
und seinem 'Sicherheit-zuerst' Entwicklungsmodell.
Sie benutzen das System, um Firewalls, Intrusion Detection Systems oder einfach 
allgemeine Server zu bauen. <a href="#edu">Forscher an Universit&auml;ten</a> und IT-Abteilungs-Entwickler haben
oftmals gleiche Anforderungen an Sicherheit und Stabilit&auml;t und w&auml;hlen daher OpenBSD.
Viele <a href="#isp">Internet Service Provider</a> finden OpenBSD's
Sicherheits Features geradezu unwiderstehlich.
<p>

Wenn du gerne auf dieser Seite erscheinen m&ouml;chtest, schicke die entsprechenden Informationen
an 
<a href="mailto:press@openbsd.org">press@openbsd.org</a> .
<br><br>

<i><b>Hinweis:</b> Aus Sicherheitsgr&uuml;nden k&ouml;nnen uns Firmen darum bitten, ihren Namen oder die
ihrer Klienten nicht zu nennen. Sie w&uuml;rden dann als
"Undisclosed Company" (nicht enth&uuml;llt, bzw. anonym) erscheinen.</i><br><br>
<hr>
<h2><font color=#e00000><a name="edu">Forschung und andere nicht-kommerzielle User</a></font></h2>
<dl>

<li><a href="http://www.amnesty.org/">Amnesty International</a><br>
Amnesty International ist eine weltweite Kampagnen-Bewegung, die an der
Verbreitung all der Menschenrechte arbeitet, die in der
'Universal Declaration of Human Rights' und anderen internationalen Standards festgelegt sind.
Amnesty International benutzt OpenBSD f&uuml;r Netzwerk Firewalls und f&uuml;r
Virtual Private Networks (IPsec) zwischen seinen Sektionen &uuml;berall auf der Welt.<p>

<li><A HREF="http://www.iztacala.unam.mx">ENEP Iztacala</A><br>
ENEP Iztacala ist eine von <A HREF="http://www.unam.mx">UNAM</A>'s Nebenschulen.
UNAM ist Mexiko's gr&ouml;&szlig;te Universit&auml;t, mit &uuml;ber 250,000 Studenten,
und bei ENEP Iztacala haben wir etwas &uuml;ber 10,000 Studenten. Dies ist ein
haupts&auml;chlich gesundheitsorientierter Campus, daher ist der Computerbereich kein 
allzu gro&szlig;er.
<br>
Als Server laufen bei uns zur Zeit zwei OpenBSD, eine Solaris und zwei Linux Boxen.
Mit OpenBSD verwalten wir die Haupt-Web-Seite (und zwar sehr gut auf einer 7-Jahre alten
Sparcstation 5), Teile unserer Mail-Accounts und unsere Firewall.
<br>
Es gibt in unserem Entwicklungsbereich zwei weitere OpenBSD Computer. Einer von ihnen
fungiert als Netzwerk-Monitor (wir benutzen dazu Snort) und wird in K&uuml;rze neben der
Firewall sitzen, und der andere ist ein OpenBSD CVS
mirror (<strong>CVSROOT=anoncvs@anoncvs.mx.openbsd.org:/cvs</strong>).
<br>
Wir haben kein besonders kreatives Zeug laufen, wir benutzen OpenBSD einfach f&uuml;r das, 
was es am besten kann: einfach gut laufen, auch auf &auml;lterer Hardware, was uns
von den meisten Sorgen und N&ouml;ten befreit, die wir mit unseren anderen Betriebssystemen 
haben.
<br>
Wir hosten auch eine spanische OpenBSD Mailingliste (openbsd@tlali.iztacala.unam.mx).
<p>

<li><a href="http://www.hus.fi/group/">Helsinki University Central Hospital, Finland</a><br>
Der Hospital Distrikt von Helsinki und Uusimaa (HUS), der in der Summe etwa 18.000 Angestellte hat,
bietet spezielle medizinische Betreuung f&uuml;r die B&uuml;rger der Hauptstadt und andere
lokale Beh&ouml;rden. OpenBSD wird f&uuml;r DNS, ein Mail Gateway, VPN und Firewall L&ouml;sungen sowohl
im internen Campus Netzwerk, als auch f&uuml;r das Internet benutzt.
<p>


<li><u>INFN Italian Institute of  Nuclear Physics, Florenz, Italien</u><br>
Diese gemeinn&uuml;tzige, regierungseigene, akademische und Forschungs-Institution benutzt OpenBSD
f&uuml;r den 'domain name service' und IPF firewall Paketfilter.
<p>


<li><u>Prague Institute of Chemical Technology, Tschechische Republik</u><br>
Die Universtit&auml;t benutzt OpenBSD auf PCs um Studenten und Mitarbeitern WWW, Mail und Shell 
Zugang zu geben, und auf einem SPARC IPX f&uuml;r einen Time-Server und secondary DNS. 
Auch die Admin Stations sind PCs mit OpenBSD.
<p>

<li><a href="http://www.ceesonora.org.mx">Sonora State Electoral Council,
M&eacute;xico</a><br>
Diese Regierungsbeh&ouml;rde benutzt OpenBSD um ihr Netzwerk zu sch&uuml;tzen, und
zus&auml;tzlich f&uuml;r Intrusion Detection.  Das OpenBSD basierte VPN
stellt online Wahlergebnisse f&uuml;r sowohl interne als auch externe User bereit.
<p>

<li><a href="http://www.ualberta.ca/">The University of Alberta</a><br>
benutzt OpenBSD auf SPARC und Intel Hardware f&uuml;r Proxy Server, Kerberos
Server, Print Server, Service Monitoring, pr&auml;emptives Security
Scanning und daraus erwachsende Konsequenzen, also weitere Absicherung.  OpenBSD auf Intel Hardware wird f&uuml;r
Firewalls und Lan-to-Lan VPN in den gesicherten Subnetzen der Universit&auml;t benutzt,
hinter all denen sich die neuen administrativen Systeme der Universit&auml;t
befinden. OpenBSD wird f&uuml;r <A
HREF="http://www.ualberta.ca/~beck/authgw.html">authenticating
gateways</A> vor &ouml;ffentlichen Labors und &ouml;ffentlichen Ethernetdosen an
ungef&auml;hr 40 Orten benutzt, die &uuml;ber den Campus verteil sind (ungef&auml;hr 1500 Pl&auml;tze) um dabei zu
helfen, einen sicheren &ouml;ffentlichen Interzugang zu gew&auml;hrleisten.
Die Computerabteilung benutzt ein OpenBSD Labor mit etwa 20 Pl&auml;tzen, um
Studenten zu unterrichten.<p>

<li>Das <a href="http://www.citi.umich.edu/"> Center for Information Technology Integration (CITI)</a><br>
Die CITI Laboratorium der University of Michigan benutzt OpenBSD als Basis
f&uuml;r viele intensive Forschungsprojecte.
OpenBSD wird f&uuml;r Entwicklung und Analyse von
<a href= "http://www.citi.umich.edu/projects/sinciti/smartcard/">smart cards</a> 
f&uuml;r Inhalte und Protokolle verwendet, sowohl isoliert als auch in realer Anwendung.
Pl&auml;ne f&uuml;r die Benutzung von Karten, die Secure Tokens f&uuml;r User Logins und Kerberos Ticketaustausch bieten, sind in Arbeit.
OpenBSD wird auch als Testplattform f&uuml;r das
<a href= "http://www.citi.umich.edu/projects/mobile.html">mobile computing</a>
Programm am CITI benutzt. Intern ist "The Packet Vault" eine
OpenBSD Maschine die im lokalen 10 Mbps Ethernet alle Pakete auff&auml;ngt und auf CD speichert.
Paket Inhalte sind verschl&uuml;sselt, um die Privatsp&auml;hre zu wahren.
Dies ist die hier g&auml;ngige Praxis f&uuml;r Intrusion Detection. Zus&auml;tzlich benutzen eine Menge Leute
in der Abteilung OpenBSD als ihr prim&auml;res Betriebssystem.<p>

<li><a href="http://www.umn.edu/">Die University von Minnesota</a><br>
Diese Universit&auml;t benutzt OpenBSD auf Sun Sparc Workstations f&uuml;r Netzwerk&uuml;berwachung
und Kapazit&auml;tsplanung.  Sie fragen 53.000 (Daten vom Mai 1999) verschiedene Interfaces
via SNMP ab, und haben jeden Monat mehr als 250MB SNMP Daten Loginformationen, die an 'concatenated discs'
(mehrere Festplatten, die logisch zu einer einzigen werden)
zur weiteren Verarbeitung &uuml;bergeben werden.<p>

<li><u>Uppsala University Hospital, Department of Infectious Diseases</u><br>
Die Abteilung benutzt OpenBSD f&uuml;r Intranet Server, genauso f&uuml;r Firewalls und 
Gateways zum Internet.
<p>
</dl>

<h2><font color=#e00000><a name="com">Kommerzielle User</a></font></h2>

<dl>

<li><a href="http://www.adobe.com/">Adobe Systems</a><br>
Dieser Software Gigant benutzt OpenBSD in einer Menge seiner Netzwerk Firewalls
und Netzwerk-Test-Systeme.<p>

<li><a href="http://www.alteon.com">Alteon Networks</a><br>
Der Gigabit Ethernet Hardware Hersteller benutzt OpenBSD Maschinen in verschiedenen Kapazitit&auml;ten
, die von Testumgebungen bis Gateways reichen.<p>

<li><a href="http://www.core-sdi.com">CORE SDI S.A.</a><br>
Diese Information Security Firma, die in Buenos Aires, Argentinen beheimatet ist, benutzt OpenBSD
als Hauptplattform f&uuml;r allgemeinen Betrieb und Entwicklung sicherheitsrelevanter Produkte.
 &quot;Die Robustheit, Portabilit&auml;t und Verpflichtung bez&uuml;glich Sicherheit
von OpenBSD, genauso wie die F&auml;higkeit auf verschiedenen Hardwareplattformen zu laufen
bieten ein ideales Betriebssystem f&uuml;r Umgebungen, wo Sicherheit und
hohe Verf&uuml;gbarkeit Hauptpunkte sind&quot;, sagt Ivan Arce, CORE SDI's CEO.<p>

<li><a href="http://www.fscinternet.com">FSC Internet Corp.</a><br>
Eine grosse Informationssicherheits- und Internet-Entwicklungsfirma, die in
Toronto zu Hause ist, hat OpenBSD und seine IPsec Unterst&uuml;tzung benutzt, um
ein sicheres und flexibles VPN f&uuml;r einen Multi-Milliarden Dollar Kunden zu erzeugen.  "Wir sind
begeistert &uuml;ber OpenBSD's Performance, Zuverl&auml;ssigkeit und pro-aktive
Einstellung bez&uuml;glich Sicherheit", sagt ein Firmensprecher. "Wir beabsichtigen
OpenBSD in vielen zuk&uuml;nftigen Projekten zu benutzen.  Wir glauben stark daran
,da&szlig; Open-Source L&ouml;sungen wie OpenBSD am besten in der Lage sind, den hohen Level
an Sicherheit zu bieten, den unsere Kunden wollen -- Closed Source Software
erreicht fast niemals den Level an Code &Uuml;berpr&uuml;fung, den OpenBSD hat."<p>

<li><a href="http://www.netsec.net/">Network Security Technologies, Inc.</a><br>
Diese Netzwerk und Computer-Sicherheits-Firma benutzt OpenBSD f&uuml;r "high speed
intrusion detection", "virtual private networking", und "data warehousing"
Anwendungen.  Network Security Technologies, Inc befindet sich in der
Gegend von Washington DC, und benutzt OpenBSD an verschiedenen
Pl&auml;tzen des Milit&auml;rs und von Regierungsinstitutionen.<p>

<li><a href="http://www.softquad.com/">SoftQuad Software Inc.</a><br>
Dieser Hersteller von HTML und XML editing Software benutzt OpenBSD f&uuml;r ihr
Gateway, f&uuml;r FTP, und f&uuml;r ihre Webdienste.<p>

<li><a href="http://www.xtime.com/">Xtime</a><br>
Xtime's Haupttechnologie ist eine "Time Inventory Management Engine", oder
TIMEngine &#153;.  Diese Technologie bringt die Vorteile des e-commerce zu 
Service-Kaufleuten &uuml;berall hin, macht ihre zeitbasierten Inventare
via Web oder Telefon verf&uuml;gbar, und bietet umfassende Kunden-Management
F&auml;higkeit.  Xtime nutzt die Kraft von OpenBSD f&uuml;r 75%
ihrer "mission-critical" Netzwerk Infrastruktur, welche Mail
Server, DNS Server, verschiedene VPN/Firewalls, sichere logging Hosts,
monitoring/IDS und Produktions Webserver umfasst.  OpenBSD ist das de-facto OS
das von der Xtime Netzwerk-Betriebsabteilung genutzt wird, wobei 100% der
Desktop Workstations der Abteilung unter OpenBSD laufen.
<p>

</dl>

<h2><font color=#e00000><a name="isp">Internet Service Provider</a></font></h2>
<p>
Ein Ziel aller ISPs ist es, die Seiten und Accounts ihrer Kunden von jedem Eindringling
zu sch&uuml;tzen. OpenBSD's Sicherheitsstatistik spricht f&uuml;r sich selbst, daher
benutzen viele ISPs OpenBSD allein schon aus diesem Grund. Andere benutzen OpenBSD f&uuml;r
viele, wenn nicht gar f&uuml;r alle ihre Dienste.
<dl>

<li><a href="http://www.anonix.net/">Anonix</a><br>
Anonix ist ein ISP, der anonymous Email, Shell, und Webhosting 
Services bietet.  All das, plus DNS und Billing, l&auml;uft auf OpenBSD.<br>
<i>"We feel confident in its security, and like its clean, layered approach.  
The basic install doesn't have huge amounts of unnecessary baggage; we can 
be sure that everything on our systems belongs there."</i>
<p>

<li><a href="http://www.bsws.de/">BS Web Services</a><br>
BS Web Services, ein deutscher ISP, benutzt OpenBSD Server f&uuml;r primary und
secondary DNS (djbdns), primary Web hosting (Apache) und
primary Mail Services (qmail-ldap). Sie lassen auch "mission critical"
LDAP Authentifikations-Backends auf OpenBSD (OpenLDAP)laufen, genauso wie MySQL Datenbanken.
Hostmaster Henning Brauer schreibt:<br>
<i>"OpenBSD musste auf diesen Maschinen ein wenig "getunt" werden, insbesondere gr&ouml;ssere 
maxprocs  und maxfiles, aber es kommt auch mit aussergew&ouml;hnlichen Belastungen auf 
gew&ouml;hnlicher Hardware zurecht.
Wir nutzen AMD Athlons (hautps&auml;chlich die neuen Thunderbirds) und AMD K6-III's. Wir haben 
auch einige interne Maschine mit OpenBSD als Testumgebung und Print-Server und alle m&ouml;glichen
weiteren Sorten. Wir planen weitere Maschinen auf OpenBSD umzustellen, insbesondere unsere Firewalls.
Ungl&uuml;cklicherweise setzen wir noch "closed source" Software ein, aber wir w&uuml;rden gerne 
die Linux-Emulation probieren. OpenBSD's Verhalten unter schwerer Last, insbesondere unter 
DoS Angriffen l&auml;sst sich einfach nicht mit denen von Linux vergleichen, das wir vorher benutzt
haben - Linux wurde extrem langsam, w&auml;hrend OpenBSD sich scheinbar gar nicht darum k&uuml;mmert
(gleiche Hardware!)</i>.
<p>
 
<li><a href="http://www.calyx.net">Calyx Internet Access Corp.</a><br>

Diese Firma benutzt OpenBSD f&uuml;r alle kritischen Dienste
inklusive WWW, FTP, email, VPN Verkehr, und Netzwerk&uuml;berwachung in seinen
Datencentern in New York, Los Angeles, und Amsterdam.  Noch gr&ouml;&szlig;ere Websites
wie z.B. 
<a href="http://www.snapple.com">snapple.com</a>,
<a href="http://www.tanqueray.com">tanqueray.com</a> und andere sind keine
Herausforderung f&uuml;r OpenBSD.<p>

<li><a href=http://www.crown.net>Crown.Net</a><br>
Dieser Internet Service Provider l&auml;uft fast komplett auf einer Mixtur von
OpenBSD/sparc und OpenBSD/i386.  Unsere Web Server(2), Mail
Server, Primary und Secondary DNS, und Radius Server laufen alle unter
OpenBSD/sparc und unser Shell Server und mehrere weitere Server vor Ort laufen unter
OpenBSD/i386.<p>


<li><a href="http://www.elixor.net/">Elixor Networks Inc.</a><br> 
Elixor Networks benutzt OpenBSD auf AMD Hardware um Shell Accounts,
Website Hosting, und Domain Name Hosting anzubieten.
<p>


<li><a href="http://www.empirenet.net/">Empire Net</a><br> Ein ISP in Bend,
Oregon, benutzt OpenBSD auf AMD, Intel, und Sun basierter Hardware f&uuml;r Routing,
Firewalling, IPsec (VPN), <A
HREF="http://www.csl.sony.co.jp/person/kjc/software.html#ALTQ">bandwidth
limiting</a>, Web Hosting, Datenbank Server, Netzwerk&uuml;berwachung, Intrusion
Detection, Mail Server, Backup Server, Cache Servers, und Workstations.
Einer ihrer OpenBSD Router verarbeitet den Verkehr zwischen einem T3 und acht Fast
Ethernet Ports, auch mit verschiedenen 802.1Q VLANs um Netzwerke f&uuml;r
Kolokations-Kunden und Gesch&auml;ftspark-P&auml;chtern zu trennen.
Ein OpenBSD Mailserver verarbeitet E-mail Speicherung/Abholen und RADIUS Authentifikation
f&uuml;r &uuml;ber 5000 User. Mehrere OpenBSD Web-Server verwalten jeweils mehr
als 300 Webseiten.<p>

<li><a href="http://www.globalwire.se/">Globalwire Communications</a><br> 
Globalwire Communications  benutzt OpenBSD auf ihren "Short Message
Service" (SMS) Gateway und Datenbank Servern.
<p>

<li><a href="http://www.hobbiton.org/">Hobbiton.org</a><br>
Dieser ISP hat &uuml;ber viele Jahre OpenBSD f&uuml;r ihren freien Shell Server 
genutzt (er wurde im November 2001 aufgrund steigender Kosten
f&uuml;r das Betreiben eines "freien" Service geschlossen).
Sie benutzen OpenBSD auch auf anderen Systemen.
Der Shell Server, ein einzelner AMD Athlon 650, hatte am Ende 101,796
User. "Wir haben OpenBSD ausprobiert, nachdem wir konstant Sicherheitsprobleme
mit anderen Betriebssystemen hatten", sagt Hobbiton's Leif
Pedersen. "Seitdem war Sicherheit im Betriebssystem kein Problem mehr und zus&auml;tzlich
waren die Systeme auch stabiler."
<p>

<li><a href="http://www.hurontario.net">Hurontario.net</a><br>
Im Quellgebiet des Ontario, Canada, benutzt Hurontario.net OpenBSD
auf mehreren eigenen Maschinen und auf einigen ihrer Kunden.
<p>

<li><a href="http://www.ioactive.com/">IOActive</a><br>
IOActive bietet WWW Entwicklern und Hackern einen Platz um auf Testservern zu arbeiten.
Der Service Provider aus Seattle, WA, installiert auch OpenBSD Firewalls,  
VPN und IDS Systemen f&uuml;r regionale Gesch&auml;fte. "OpenBSD ist schnell, zuverl&auml;ssig, und ich
schlafe nachts ein bisschen besser, weil wir es benutzen" sagt der Inhaber Josh Pennell.
"Die andere Sache, die ich daran liebe, ist, dass &uuml;ber die H&auml;lfte der Zeit daran gearbeitet
wird, die Maschine sofort nach der Installtion absolut sicher zu haben, was meiner Firma sehr grosse Mengen
an Zeit erspart.
OpenBSD ist meiner Meinung nach der defacto Standard f&uuml;r sichere Open Source Betriebssysteme
Alle anderen versuchen einfach nur aufzuholen.".<p>

<li><a href=http://www.poppe.com>Poppe Tyson Europe</a>
benutzt OpenBSD als Primary DNS, Mailserver f&uuml;r &uuml;ber
100 Mailboxen, und als ihren Website Entwicklungsserver f&uuml;r &uuml;ber 50
Sites.
<p>

<li><a href="http://www.qpalzm.com">qpalzm.com services</a><br>
qpalzm services nutzt OpenBSD, um Webhosting und shell accounts anzubieten. Die
Website bietet t&auml;gliche Updates &uuml;ber Programmierung, Spiele, IRC und anderes
Technikgebrabbel. Ein online MUD ist ebenso verf&uuml;gbar. Es gibt auch eine
<a href="http://www.jscript.org">JavaScript Mailing List</a>
die OpenBSD benutzt, f&uuml;r alle diejenigen, die an JavaScript
und DHTML interessiert sind. Nebenbei gesagt l&auml;uft qpalzm.com's recht besch&auml;ftigter WWW, FTP und Mail Server
sehr zufriedenstellend mit OpenBSD auf einem 200MHz Pentium Pro.<p>

<li><a href="http://www.rtmx.net">RTMX Networking Services</a><br>
Dieser ISP aus North Carolina benutzt OpenBSD auf multiplen Servern f&uuml;r Web,
DNS und &uuml;ber 1000 e-mail Usern in ihrer Kommune , die ein wenig westlich des
Research Triangle liegt. Es ist ein Mix aus AMD K-6, MicroSPARC-II und
PowerPC Systemen in Benutzung, und weitere Server aus Subnetzen von Kunden werden
angeschlossen. RTMX.NET spiegelt die OpenBSD
<a href="http://openbsd.groupbsd.org">WWW</a>
und <a href="ftp://openbsd.groupbsd.org/pub/OpenBSD/">ftp</a> sites,
und hat auch ein "anonymous CVS repository"
(CVSROOT=anoncvs@openbsd.groupbsd.org:/cvs), alles dank der 47GB
Disk Space und einer dedizierten T1 Leitung.<p>

<li><a href="http://start.swebase.com/?sida=maskiner">Swebase Network</a><br>
Dieser ISP in Sweden benutzt OpenBSD f&uuml;r Web, DNS und Mail Server.
<p>

<li><a href="http://www.wythenet.com">WytheNet, Inc.</a><br>

Dieser ISP aus Virginia benutzt OpenBSD auf allen Servern, inklusive Primary und
Secondary Radius, Primary und Secondary DNS, Mail, Netwerk&uuml;berwachung, und
verschiedener Firewalls.  Sie verkaufen auch auf OpenBSD basierende Router und Firewalls
an ihre Gesch&auml;fts-DSL-Kunden.
<p>

</dl>

<hr>
<a href=index.html><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br><small>
Originally [OpenBSD: users.html,v 1.74 ]
<br>
$Translation: users.html,v 1.22 2002/01/20 11:03:46 jufi Exp $
</small>
<br><small>$OpenBSD: users.html,v 1.22 2002/01/20 11:43:22 jufi Exp $</small>
</body>
</html>
