<html>
<head>
<meta name=KEYWORDS content="OpenBSD,commercial,operating system,Unix,Un*x,BSD,linux,secure,secure,secure">
<title>OpenBSD at work</title>
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">
<img alt="[OpenBSD]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color=#e00000>User</font><hr></h2>
Der Term "User" hat mehrere Bedeutungen. <EM>End User</EM> wollen
oft andere User des Systems treffen, um Ideen, Probleme und  L&ouml;sungen auszutauschen,
und bei einem Bier oder Essen &uuml;ber das System zu diskutieren. Einer der besten Wege dazu sind die
<a href="../groups.html">Weltweiten User Groups</a>.
<p>
Eine weitere Bedeutung ist "wer benutzt das System und wof&uuml;r ?", und das
ist das Thema f&uuml;r den Rest dieser Seite.
Diese Firmen und Organisationen trauen OpenBSD's rigoroser Code-&Uuml;berpr&uuml;fung
und seinem 'Sicherheit-zuerst' Entwicklungsmodell.
Sie benutzen das System, um Firewalls, Intrusion Detection Systems oder einfach 
allgemeine Server zu bauen. Forscher an Universit&auml;ten und IT-Abteilungs-Entwickler haben
oftmals gleiche Anforderungen and Sicherheit und Stabilit&auml;t und w&auml;hlen daher OpenBSD.<p>

Wenn du gerne auf dieser Seite erscheinen m&ouml;chtest, schicke die entpsrechenden Informationen
an 
<a href="mailto:press@openbsd.org">press@openbsd.org</a> .
<br><br>

<i><b>Hinweis:</b> Aus Sicherheitsgr&uuml;nden k&ouml;nnen uns Firmen darum bitten, ihren Namen oder die
ihrer Klienten nicht zu nennen. Sie w&uuml;rden dann als
"Undisclosed Company" (nicht enth&uuml;llt) erscheinen.</i><br><br>
<hr>

<dl>

<li><a href="http://www.amnesty.org/">Amnesty International</a><br>
Amnesty International ist eine weltweite Kampagnen-Bewegung, die an der
Verbreitung all der Menschenrechte arbeitet, die in der
'Universal Declaration of Human Rights' und anderen internationalen Standards festgelegt sind.
Amnesty International benutzt OpenBSD f&uuml;r Netzwerk Firewalls und f&uuml;r
Virtual Private Networks (IPSec) zwischen seinen Sektionen &uuml;berall auf der Welt.<p>

<li><a href="http://www.netsec.net/">Network Security Technologies, Inc.</a><br>
Diese Netzwerk und Computer Sicherheits-Firma benutzt OpenBSD f&uuml;r high speed
intrusion detection, virtual private networking, und data warehousing
Anwendungen.  Network Security Technologies, Inc hat seinen Sitz in der
Washington DC Metro Area, und benutzt OpenBSD in verschiedenen nicht n&auml;her bekannten
milit&auml;rischen Standorten und Regierungsbeh&ouml;rden.<p>

<li><a href="http://www.adobe.com/">Adobe Systems</a><br>
Dieser Software Gigant benutzt OpenBSD in einer Menge seiner Netzwerk Firewalls
und Netzwerk-Test-Systeme.<p>

<li><a href="http://www.ceesonora.org.mx">Sonora State Electoral Council,
M&eacute;xico</a><br>
Diese Regierungsbeh&ouml;rde benutzt OpenBSD als Mittel, um sein Netzwerk zu sch&uuml;tzen, und
genauso f&uuml;r Intrusion Detection.  Das OpenBSD basierte VPN
stellt online Wahlergebnisse f&uuml;r sowohl interne als auch externe User bereit.
<p>

<li><a href="http://www.wythenet.com">WytheNet, Inc.</a><br>

Dieser ISP aus Virginia benutzt OpenBSD auf allen Servern, inklusive Primary und
Secondary Radius, Primary und Secondary DNS, Mail, Netwerk&uuml;berwachung, und
verschiedener Firewalls.  Sie verkaufen auch auf OpenBSD basierende Router und Firewalls 
an ihre Gesch&auml;fts-DSL-Kunden.
<p>

<li><a href="http://www.calyx.net">Calyx Internet Access Corp.</a><br>

Diese Firma benutzt OpenBSD f&uuml;r alle kritischen Dienste 
inklusive WWW, FTP, email, VPN Verkehr, und Netzwerk&uuml;berwachung in seinen 
Datencentern in New York, Los Angeles, und Amsterdam.  Noch gr&ouml;&szlig;ere Websites
wie z.B. <a href="http://www.mitsubishicars.com">mitsubishicars.com</a>,
<a href="http://www.snapple.com">snapple.com</a>,
<a href="http://www.tanqueray.com">tanqueray.com</a> und andere sind keine 
Herausforderung f&uuml;r OpenBSD.<p>

<li><a href="http://www.alteon.com">Alteon Networks</a><br>
Der Gigabit Ethernet Hardware Hersteller benutzt OpenBSD Maschinen in verschiedenen Kapazitit&auml;ten
, die von Testumgebungen bis Gateways reichen.<p>

<li><a href="http://www.core-sdi.com">CORE SDI S.A.</a><br>
Diese Information Security Firma, die in Buenos Aires, Argentinen beheimatet ist, benutzt OpenBSD
als Hauptplattform f&uuml;r allgemeinen Betrieb und Entwicklung sicherheitsrelevanter Produkte.
 &quot;Die Robustheit, Portabilit&auml;t und Verpflichtung bez&uuml;glich Sicherheit
von OpenBSD, genauso wie die F&auml;higkeit auf verschiedenen Hardwareplattformen zu laufen
bieten ein ideales Betriebssystem f&uuml;r Umgebungen, wo Sicherheit und
hohe Verf&uuml;gbarkeit Hauptpunkte sind&quot; , sagt Ivan Arce, CORE SDI's CEO.<p>

<li><a href="http://www.qpalzm.com">qpalzm.com services</a><br>
qpalzm services nutzt OpenBSD um Webhosting und shell accounts anzubieten. Die
Website bietet t&auml;gliche Updates &uuml;ber Programmierung, Spiele, IRC und anderes
Technikgebrabbel. Ein online MUD ist ebenso verf&uuml;gbar. Es gibt auch eine 
<a href="http://www.jscript.org">JavaScript Mailing List</a>
die OpenBSD benutzt, f&uuml;r alle diejenigen, die an JavaScript
und DHTML interessiert sind. Nebenbei gesagt l&auml;uft qpalzm.com's recht besch&auml;ftigter WWW, FTP und Mail Server
sehr zufriedenstellend mit OpenBSD auf einem 200MHz Pentium Pro.<p>

<li><a href="http://www.ioactive.com/">IOActive</a><br>
IOActive bietet WWW Entwicklern und Hackern einen Platz um auf Testservern zu arbeiten.
Der Service Provider aus Seattle, WA, installiert auch OpenBSD Firewalls,
VPN und IDS Systemen f&uuml;r regionale Gesch&auml;fte. "OpenBSD ist schnell, zuverl&auml;ssig, und ich 
schlafe nachts ein bisschen besser, weil wir es benutzen" sagt der Inhaber Josh Pennell.
"Die andere Sache, die ich daran liebe, ist, dass &uuml;ber die H&auml;lfte der Zeit daran gearbeitet
wird, die Maschine sofort nach der Installtion absolut sicher zu haben, was meiner Firma sehr grosse Mengen
an Zeit erspart.
OpenBSD ist meiner Meinung nach der defacto Standard f&uuml;r sichere Open Source Betriebssysteme
Alle anderen versuchen einfach nur aufzuholen.".<p>

<li><a href="http://www.umn.edu/">Die University von Minnesota</a><br>
Diese Universit&auml;t benutzt OpenBSD auf Sun Sparc Workstations f&uuml;r Netzwerk&uuml;berwachung 
und Kapazit&auml;tsplanung.  Sie fragen 53,000 (Daten vom Mai 1999) verschiedene Interfaces
via SNMP ab, und haben jeden Monat mehr als 250MB SNMP Daten Loginformationen, die an 'concatenated disk'
zur weiteren Verarbeitung &uuml;bergeben werden.<p>

<li><a href="http://www.empirenet.net/">Empire Net</a><br> Ein ISP in Bend,
Oregon, benutzt OpenBSD auf AMD, Intel, und Sun basierter Hardware f&uuml;r Routing,
Firewalling, IPSec/VPN, <A
HREF="http://www.csl.sony.co.jp/person/kjc/software.html#ALTQ">bandwidth
limiting</a>, Web Hosting, Datenbank Server, Netzwerk&uuml;berwachung, Intrusion
Detection, Mail Server, Backup Server, Cache Servers, und Workstations.
Einer ihrer OpenBSD Router verarbeitet den Verkehr zwischen einem T3 und acht Fast
Ethernet Ports, auch mit verschiedenen 802.1Q VLANs um Netzwerke f&uuml;r
co-location Kunden und Gesch&auml;ftsparkp&auml;chtern zu trennen.<P>

<li><a href="http://www.rtmx.com">RTMX Incorporated</a><br>
Dieser Anbieter produziert eine von OpenBSD abstammende IEEE POSIX Echtzeit Extended
System L&ouml;sung. RTMX hat dabei die vorher bei ihnen entwickelten 
IEEE POSIX Echtzeiterweiterungen in OpenBSD eingef&uuml;gt.
Nahezu alle der IEEE POSIX Erweiterungen wurden hinzugef&uuml;gt.
Momentan werden fast alle OpenBSD Features unterst&uuml;tzt, aber nur auf
m68k, MIPS und PowerPC CPUs. Pentium und Alpha CPU Versionen werden bald
ver&ouml;ffentlicht. RTMX Inc. ist ausserdem ein lizensiertes OSF Motif Haus, und
hat Motif 1.2.3 auf die meisten der untertst&uuml;tzten Plattformen portiert.<p>

<li><a href="http://www.rtmx.net">RTMX Networking Services</a><br>
Dieser North Carolina ISP benutzt OpenBSD auf multiplen Servern f&uuml;r Web,
DNS und &uuml;ber 1000 e-mail Usern in ihrer Kommune , die ein wenig westlich des
Research Triangle liegt. Es ist ein Mix aus AMD K-6, MicroSPARC-II und
PowerPC Systemen in Benutzung, und weitere Subnetz Server von Kunden werden 
angeschlossen. RTMX.NET spiegelt die OpenBSD
<a href="http://openbsd.groupbsd.org">WWW</a>
und <a href="ftp://openbsd.groupbsd.org/pub/OpenBSD/">ftp</a> sites,
und hat auch ein anonymous CVS repository
(CVSROOT=anoncvs@openbsd.groupbsd.org:/cvs), alles dank der 47GB
Disk Space und einer dedizierten T1 Leitung.<p>

<li><a href=http://www.poppe.com>Poppe Tyson Europe</a>

benutzt OpenBSD als Primary DNS, mailserver f&uuml;r &uuml;ber
100 Mailboxen, und als ihren Website Entwicklungsserver f&uuml;r &uuml;ber 50
Sites.<p>

<li><a href="http://www.citi.umich.edu/">The Center for Information Technology Integration (CITI)</a><br>
Dieses Laboratorium in der University of Michigan benutzt OpenBSD als Basis
f&uuml;r viele intensive Forschungsprojecte.
OpenBSD wird f&uuml;r Entwiclung und Analyse von
<a href= "http://www.citi.umich.edu/projects/sinciti/smartcard/">smart card</a>
f&uuml;r Inhalte und Protokolle, sowohl isoliert als auch in realer Anwendung.
Pl&auml;ne f&uuml;r die Benutzung von Karten, die Secure Tokens f&uuml;r User Logins und Kerberos Ticketaustausch bieten, sind in Arbeit.
OpenBSD wird auch als Testplattform f&uuml;r das
<a href= "http://www.citi.umich.edu/projects/mobile.html">mobile computing</a>
Programm am CITI benutzt. Intern ist "The Packet Vault" eine
OpenBSD Maschine die im lokalen 10 Mbps Ethermet alle Pakete auff&auml;ngt und auf CD speichert.
Paket Inhalte sind verschl&uuml;sselt, um die Privatsp&auml;hre zu wahren.
Dies ist Praxis f&uuml;r Intrusion Detection. Zus&auml;tzlich benutzen eine Menge Leute
in der Abteilung OpenBSD als ihr prim&auml;res Betriebssystem.<p>

<li><a href="http://www.ualberta.ca/">The University of Alberta</a><br>
benutzt OpenBSD auf SPARC und Intel Hardware f&uuml;r Proxy Server, Kerberos
Server, Print Server, Service Monitoring, pr&auml;emptives Security
Scanning und darauf folgende Antworten.  OpenBSD auf Intel Hardware wird f&uuml;r
Firewalls und Lan-to-Lan VPN in den gesicherten Subnetzen der Universit&auml;t benutzt,
hinter all denen sich die neuen administrativen Systeme der Universit&auml;t
befinden. OpenBSD wird f&uuml;r <A
HREF="http://www.ualberta.ca/~beck/authgw.html">authenticating
gateways</A> vor &ouml;ffentlichen Labors und &ouml;ffentlichen Ethernetdosen an
ungef&auml;hr 40 Orten benutzt, die &uuml;ber den Campus verteil sind (ungef&auml;hr 1500 Pl&auml;tze) um dabei zu
helfen, einen sicheren &ouml;ffentlichen Interzugang zu gew&auml;hrleisten.
Die Computerabteilung benutzt ein OpenBSD Labors mit etwa 20 Pl&auml;tzen, um 
Studenten zu unterrichten.<p>

<li><a href=http://www.crown.net>Crown.Net</a><br>
Dieser Internet Service Provider l&auml;uft fast komplett auf einer Mixtur von
OpenBSD/sparc und OpenBSD/i386.  Unsere Web Server(2), Mail
Server, Primary und Secondary DNS, und Radius Server laufen alle unter
OpenBSD/sparc und unser Shell Server und mehrere weitere Server vor Ort laufen unter
OpenBSD/i386.<p>

<li><a href="http://www.fscinternet.com">FSC Internet Corp.</a><br>
Eine grosse Informationssicherheits und Internet Entwicklungsfirma, die in
Toronto zu Hause ist, hat OpenBSD und seine IPsec Unterst&uuml;tzung benutzt, um
ein sicheres und flexibles VPN f&uuml;r ein Multi-Milliarden Dollar Kunden zu erzeugen.  "Wir sind
begeistert &uuml;ber OpenBSD's Performance, Zuverl&auml;ssigkeit und pro-aktive
Einstellung bez&uuml;glich Sicherheit", sagt ein Firmensprecher. "Wir beabsichtigen
OpenBSD in vielen zuk&uuml;nftigen Projekten zu benutzen.  Wir glauben stark daran
,da&szlig; Open-Source L&ouml;sungen wie OpenBSD am besten in der Lage sind, den hohen Level
an Sicherheit zu bieten, den unsere Kunden wollen -- Closed Source Software
erreicht fast niemals den Level an Code &Uuml;berpr&uuml;fung, den OpenBSD hat."<p>

<li><a href="http://www.softquad.com/">SoftQuad Software Inc.</a><br>
Dieser Hersteller von HTML und XML editing Software benutzt OpenBSD f&uuml;r ihr
Gateway, FTP, und ihre Webdienste.<p>

<li><a href="http://www.hobbiton.org/">Hobbiton.org</a><br>
Dieser ISP benutzt OpenBSD f&uuml;r ihren freien Shell Server genauso wie f&uuml;r andere
Systeme.
Der Shell Server, ein einzelner AMD K6/233, verarbeitet die Mail von
10,000 Usern. "Wir haben OpenBSD ausprobiert, nachdem wir konstant Sicherheitsprobleme
mit anderen Betriebssystemen hatten", sagt Hobbiton's Leif
Pedersen. "Seit dem war Sicherheit im Betriebssystem kein Problem mehr und zus&auml;tzlich
waren die Systeme auch stabiler."
<p>

<li>Prague Institute of Chemical Technology, Czech Republic<br>
Die Universit&auml;t benutzt OpenBSD auf PCs um WWW, Mail und Shellzugang
Mitarbeitern und Studenten bereitzustellen, und auf einer SPARC IPX als Time Server und secondary DNS. 
Die Admin Stationen laufen auch auf PCs mit OpenBSD.
<p>

</dl>

<hr>
<a href=index.html><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br><small>
Originally [OpenBSD: users.html,v 1.55 ]
<br>
$Translation: users.html,v 1.4 2000/10/06 14:19:50 jufi Exp $
<br>
</small>
<br><small>$OpenBSD: users.html,v 1.4 2000/10/06 17:39:18 jufi Exp $</small>
</body>
</html>
