<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Performance</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD FAQ page">
<meta name="keywords" content="openbsd,faq,pf">
<meta name="distribution" content="global">
</head>

<!--
Copyright (c) 2003, 2004, Nick Holland <nick@openbsd.org>

Permission to use, copy, modify, and distribute this documentation for
any purpose with or without fee is hereby granted, provided that the
above copyright notice and this permission notice appear in all copies.

THE DOCUMENTATION IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL
WARRANTIES WITH REGARD TO THIS DOCUMENTATION INCLUDING ALL IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE
AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
PERFORMANCE OF THIS DOCUMENTATION
-->


<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<a href="../../../pt/index.html">
<img alt="[OpenBSD]" height=30 width=141 src="../../../images/smalltitle.gif" border="0">
</a>
<p>
[<a href="logging.html">Anterior: Logging</a>]
[<a href="index.html">Conte&uacute;do</a>]
[<a href="ftp.html">Pr&oacute;ximo: Problemas com FTP</a>]

<p>
<h1><font color="#e00000">PF: Performance</font></h1>
<hr>

<h3>
"Quanta largura de banda o PF pode suportar?"<br>
"Que computador eu preciso para controlar minha conex&atilde;o com a Internet?"
</h3>

<p>
N&atilde;o existe resposta simples a estas quest&otilde;es.  Para algumas aplica&ccedil;oes, 
um 486/66 com um par de boas placas de rede ISA pode filtrar e fazer 
NAT em 5Mbps, mas para outras aplica&ccedil;&otilde;es uma m&aacute;quina muito mais r&aacute;pida 
com placas de rede PCI muito melhores pode acabar n&atilde;o sendo suficiente. 
A real quest&atilde;o n&atilde;o &eacute; o n&uacute;mero de bits por segundo mas na verdade o 
n&uacute;mero de pacotes por segundo e a complexidade de todo o conjunto 
de regras.

<p>
A performance do PF &eacute; determinada por uma s&eacute;rie de vari&aacute;veis:
<ul>
<li>N&uacute;mero de pacotes por segundo.  Quase o mesmo poder de 
processamento &eacute; necess&aacute;rio para analisar um pacote com 1500 bytes 
de payload ou um pacote com um byte de payload.  O n&uacute;mero de pacotes 
por segundo determina o n&uacute;mero de vezes que a tabela de estado e, 
caso n&atilde;o seja encontrada uma entrada v&aacute;lida na tabela, as regras 
de filtragem devem ser avaliadas a cada segundo, determinando 
a demanda efetiva no sistema.

<li>Performance do barramento do sistema. O barramento ISA 
tem largura de banda m&aacute;xima de 8MB/seg, e quando o processador o 
acessa, precisa baixar sua velocidade efetiva para um poder 
equivalente a um 80286 rodando a 8MHz, n&atilde;o importa o qu&atilde;o r&aacute;pido 
seja este processador.  O barramento PCI possui largura de banda 
muito maior, causando menor impacto no processador.

<li>Efici&ecirc;ncia de sua placa de rede. Algumas adaptadoras de 
rede s&atilde;o simplesmente mais eficientes que outras.  Placas de rede 
baseadas em Realtek 8139
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rl&amp;sektion=4&amp;manpath=OpenBSD+3.6"
>rl(4)</a>) 
tendem a ter baixa performance enquanto placas baseadas em Intel 21143  
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dc&amp;sektion=4&amp;manpath=OpenBSD+3.6"
>dc(4)</a>)
tendem a responder muito bem.  Para m&aacute;xima performance, considere 
utilizar placas Ethernet gigabit, mesmo que n&atilde;o esteja conectado 
em redes gigabit, j&aacute; que elas possuem um sistema de buffer muito 
mais avan&ccedil;ado.

<li>Complexidade e design de suas regras.  Quanto mais complexo 
o conjunto de regras, mais lento.  Quanto mais pacotes forem filtrados 
por regras <tt>keep state</tt> e <tt>quick</tt>, melhor a performance. 
Quanto mais linhas precisarem ser avalidas para cada pacote, pior 
a performance.

<li>Vale a pena mecionar: CPU e RAM.  Como PF &eacute; um processo 
baseado no kernel (kernel-based), n&atilde;o utilizar&aacute; swap.  Portanto, se 
tiver RAM suficiente funciona, sen&atilde;o, entra em p&acirc;nico devido a 
exaust&atilde;o de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pool&amp;sektion=9&amp;manpath=OpenBSD+3.6"
>pool(9)</a>.  Grandes quantidades de RAM n&atilde;o s&atilde;o necess&aacute;rias 
-- 32MB deve ser suficiente para manter perto de 30,000 estados de conex&atilde;o, 
o que s&atilde;o muitos estados para uma aplica&ccedil;&atilde;o num pequeno escrit&oacute;rio 
ou em casa. 
Para a maior parte dos usu&aacute;rios, um computador "reciclado" &eacute; mais do 
que suficiente para um sistema PF -- um sistema de 300MHz processar&aacute; 
rapidamente um grande n&uacute;mero de pacotes, pelo menos se 
utilizado em conjunto com boas placas de rede e regras bem planejadas.
</ul>

<p>
As pessoas sempre perguntam por benchmarks do PF.  O &uacute;nico benchmark que 
conta &eacute; a performace do <i>seu</i> sistema em <i>seu</i> ambiente.  
Um benchmark que n&atilde;o reproduz seu ambiente n&atilde;o ir&aacute; ajuda-lo a planejar 
seu sistema de firewall. A melhor forma de se fazer um benchmark do PF 
&eacute; voc&ecirc; mesmo faz&ecirc;-lo, no mesmo, ou o mais pr&oacute;ximo poss&iacute;vel 
das condi&ccedil;&otilde;es em que o firewall ir&aacute; trabalhar rodando no mesmo hardware
planejado para o firewall.

<p>
O PF &eacute; usado em algumas aplica&ccedil;&otilde;es grandes e de tr&aacute;fego intenso, e seus 
desenvolvedores s&atilde;o "power users" do PF. Provavelmente seu 
desempenho ser&aacute; satisfat&oacute;rio para voc&ecirc; tamb&eacute;m.

<p>
[<a href="logging.html">Anterior: Logging</a>]
[<a href="index.html">Conte&uacute;do</a>]
[<a href="ftp.html">Pr&oacute;ximo: Problemas com FTP</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[voltar]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: perf.html,v 1.16 ]<br> 
$Translation: perf.html,v 1.1 2005/01/04 17:09:07 dsantos Exp $<br>                 
$OpenBSD: perf.html,v 1.1 2005/01/06 20:03:30 jufi Exp $ 
</small>

</body>
</html>
