<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Scrub (Normaliza&ccedil;&atilde;o de Pacotes)</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD FAQ page">
<meta name="keywords" content="openbsd,faq,pf">
<meta name="distribution" content="global">
</head>

<!--
Copyright (c) 2003, Nick Holland <nick@openbsd.org>
Copyright (c) 2003, 2004, Joel Knight <enabled@myrealbox.com>

Permission to use, copy, modify, and distribute this documentation for
any purpose with or without fee is hereby granted, provided that the
above copyright notice and this permission notice appear in all copies.

THE DOCUMENTATION IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL
WARRANTIES WITH REGARD TO THIS DOCUMENTATION INCLUDING ALL IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE
AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
PERFORMANCE OF THIS DOCUMENTATION
-->

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<a href="../../../pt/index.html">
<img alt="[OpenBSD]" height=30 width=141 src="../../../images/smalltitle.gif" border="0">
</a>
<p>
[<a href="options.html">Anterior: Op&ccedil;&otilde;es em Tempo de Execu&ccedil;&atilde;o</a>]
[<a href="index.html">Conte&uacute;do</a>]
[<a href="anchors.html">Pr&oacute;ximo: &Acirc;ncoras e Subconjuntos de Regras Nomeadas</a>]

<p>
<h1><font color="#e00000">PF: Scrub (Normaliza&ccedil;&atilde;o de Pacotes)</font></h1>
<hr>

<h3>Conte&uacute;do</h3>
<ul>
<li><a href="#intro">Introdu&ccedil;&atilde;o</a>
<li><a href="#options">Op&ccedil;&otilde;es</a>
</ul>

<hr>

<a name="intro"></a>
<h2>Introdu&ccedil;&atilde;o</h2>
"Scrubbing" &eacute; o processo de normaliza&ccedil;&atilde;o de pacotes, para que n&atilde;o haja 
ambiguidades na interpreta&ccedil;&atilde;o pelo destino final do pacote.  A diretiva
scrub tamb&eacute;m remonta pacotes fragmentados, protegendo alguns sistemas 
operacionais de algumas formas de ataque, e descarta pacotes TCP que 
possuam combina&ccedil;&otilde;es de 
<a href="filter.html#tcpflags">flag</a> inv&aacute;lidas.
Uma forma simples de uso da diretiva scrub:
<blockquote>
<tt>
scrub in all
</tt>
</blockquote>

<p>
&Eacute; v&aacute;lida para todos pacotes chegando em todas interfaces.

<p>
Uma raz&atilde;o para n&atilde;o fazer scrub numa interface &eacute; no caso de haver 
tr&aacute;fego NFS atravessando-a.  Algumas plataformas n&atilde;o-OpenBSD enviam (e 
esperam) pacotes estranhos -- pacotes fragmentados com o bit 
"do not fragment" marcado, que s&atilde;o (devidamente) rejeitados pelo 
<tt>scrub</tt>.  Isso pode ser resolvido atrav&eacute;s do uso da op&ccedil;&atilde;o 
<tt>no-df</tt>.  Outra raz&atilde;o &eacute; que alguns jogos multiplayer apresentam 
problemas de conex&atilde;o ao passar por um firewall PF com <tt>scrub</tt> ativado.
Fora estes casos, o uso de scrub em todos pacotes &eacute; 
pr&aacute;tica <i>altamente recomendada</i>.

<p>
A sintaxe da diretiva <tt>scrub</tt> &eacute; muito similar &agrave; sintaxe das 
regras de <a href="filter.html">filtragem</a>, o que torna f&aacute;cil usar scrub de 
maneira seletiva em alguns tipos de pacotes e outros n&atilde;o.
A palavra-chave <tt>no</tt> pode ser usada na frente de <tt>scrub</tt> para 
especificar que pacotes n&atilde;o devem passar por scrub.
Assim como <a href="nat.html#except">regras <tt>nat</tt></a>,
a primeira regra que casar vence.

<p>
Mais informa&ccedil;&otilde;es sobre os princ&iacute;pios e conceitos de scrub podem ser 
encontradas no documento 
<a href="http://www.icir.org/vern/papers/norm-usenix-sec-01-html/index.html">Network Intrusion Detection: Evasion, Traffic Normalization, and
End-to-End Protocol Semantics</a>.

<a name="options"></a>
<h2>Op&ccedil;&otilde;es</h2>
<tt>Scrub</tt> possui as seguintes op&ccedil;&otilde;es:
<dl>
<dt><tt>no-df</tt> 
<dd>Limpa o bit <i>don't fragment</i> no cabe&ccedil;aho IP do pacote.
Alguns sistemas operacionais s&atilde;o conhecidos por gerar pacotes fragmentados 
com o bit <i>don't fragment</i> setado. Isso &eacute; particularmente verdadeiro 
no NFS. <tt>Scrub</tt> ir&aacute; descartar esses pacotes a n&atilde;o ser que a 
op&ccedil;&atilde;o <tt>no-df</tt> seja especificada. Pelo fato de alguns sistemas 
operacionais gerarem pacotes <i>don't fragment</i> com campo de 
identifica&ccedil;&atilde;o IP zero no cabe&ccedil;alho, &eacute; recomendado o uso de 
<tt>no-df</tt> em conjunto com <tt>random-id</tt>.

<dt><tt>random-id</tt> 
<dd>Substitui o campo de identifica&ccedil;&atilde;o IP de pacotes saindo por 
valores aleat&oacute;rios para compensar sistemas operacionais que usam 
valores previs&iacute;veis. Esta op&ccedil;&atilde;o somente se aplica a pacotes saindo 
que n&atilde;o s&atilde;o fragmentados ap&oacute;s a reconstru&ccedil;&atilde;o de pacotes 
opcional.

<dt><tt>min-ttl <i>num</i></tt> 
<dd>For&ccedil;a um valor m&iacute;nimo de Time To Live (TTL)
nos cabe&ccedil;alhos de pacotes IP.

<dt><tt>max-mss <i>num</i></tt> 
<dd>For&ccedil;a tamanho m&aacute;ximo para Maximum Segment
Size (MSS) nos cabe&ccedil;alhos de pacotes TCP.

<dt><tt>fragment reassemble</tt> 
<dd>Armazena em buffer, pacotes fragmentados que chegam e os reconstr&oacute;i 
em pacotes completos antes de passa-los para o sistema de filtragem.
A vantagem &eacute; que regras de filtragem devem lidar apenas com pacotes 
completos, ignorando fragmentos. A desvantagem &eacute; o aumento do uso de 
mem&oacute;ria para armazenar os fragmentos. Este &eacute; o comportamento padr&atilde;o 
quando nenhuma op&ccedil;&atilde;o <tt>fragment</tt> for especificada. Esta tamb&eacute;m 
&eacute; a &uacute;nica op&ccedil;&atilde;o <tt>fragment</tt> que funciona com NAT.

<dt><tt>fragment crop</tt> 
<dd>Descarta fragmentos duplicados e elimina sobreposi&ccedil;&otilde;es.
Diferentemente de <tt>fragment reassemble</tt>, os fragmentos n&atilde;o s&atilde;o 
armazenados em buffer, mas passados adiante assim que chegam.

<dt><tt>fragment drop-ovl</tt> 
<dd>Similar a <tt>fragment crop</tt>
exceto que fragmentos duplicados e sobrepostos ser&atilde;o descartados assim 
como quaisquer fragmentos subsequentes.

<dt><tt>reassemble tcp</tt>
<dd>Normaliza conex&otilde;es TCP dinamicamente.
Ao usar <tt>scrub reassemble tcp</tt> uma dire&ccedil;&atilde;o (in/out) n&atilde;o deve 
ser especificada. 
As seguintes normaliza&ccedil;&otilde;es s&atilde;o realizadas:
	<ul>
	<li>Nenhum lado da conex&atilde;o pode reduzir seu TTL IP. Isso &eacute; feito 
	para proteger contra um atacante enviando pacotes de forma que 
	cheguem ao firewall, afetem a informa&ccedil;&atilde;o de estado da conex&atilde;o, e 
	expire antes de atingir o host de destino. O TTL de todos pacotes 
	&eacute; aumentado para o maior valor poss&iacute;vel para a conex&atilde;o.
	<li>Modula timestamps TCP   
	<a href="http://www.geektools.com/rfc/rfc1323.txt">RFC1323</a>
	em cabe&ccedil;alhos de pacotes para um n&uacute;mero aleat&oacute;rio. Isso pode 
	impedir um observador de deduzir a quanto tempo 
	a m&aacute;quina est&aacute; ligada ou saber quantos hosts existem atr&aacute;s de 
	um gateway NAT.
	</ul>
</dl>

<p>
Exemplos:
<blockquote>
<tt>
scrub in on fxp0 all fragment reassemble min-ttl 15 max-mss 1400<br>
scrub in on fxp0 all no-df<br>
scrub &nbsp;&nbsp; on fxp0 all reassemble tcp
</tt>
</blockquote>

<p>
[<a href="options.html">Anterior: Op&ccedil;&otilde;es em Tempo de Execu&ccedil;&atilde;o</a>]
[<a href="index.html">Conte&uacute;do</a>]
[<a href="anchors.html">Pr&oacute;ximo: &Acirc;ncoras e Subconjuntos de Regras Nomeadas</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[voltar]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: scrub.html,v 1.11 ]<br>                                                      
$Translation: scrub.html,v 1.1 2005/01/04 17:09:07 dsantos Exp $<br>                 
$OpenBSD: scrub.html,v 1.1 2005/01/06 20:03:30 jufi Exp $ 
</small>

</body>
</html>
