<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>1 - Introdu&ccedil;&atilde;o ao OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2007 by
OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<a href="../../pt/index.html">
<img alt="[OpenBSD]" height=30 width=141
src="../../images/smalltitle.gif" border="0">
</a>
<p>
<font color="#0000e0">
<a href= "index.html">[&Iacute;ndice do FAQ]</a>
<a href= "faq2.html">[Para a Se&ccedil;&atilde;o 2 - Conhecendo o
OpenBSD]</a>
</font>

<h1><font color="#e00000">1 - Introdu&ccedil;&atilde;o ao
OpenBSD</font></h1>
<hr>

<p>
<h3>Conte&uacute;do</h3>
<ul>
<li><a href="#WhatIs">1.1 - O que &eacute; OpenBSD?</a>
<li><a href="#Platforms">1.2 - Em que sistemas o OpenBSD opera?</a>
<li><a href="#ReallyFree">1.3 - O OpenBSD &eacute; realmente livre?</a>
<li><a href="#WhyUse">1.4 - Por que eu iria querer utilizar o
OpenBSD?</a>
<li><a href="#Support">1.5 -Como posso ajudar o OpenBSD?</a>
<li><a href="#WhoMaintains">1.6 - Quem mant&eacute;m o OpenBSD?</a>
<li><a href="#Next">1.7 - Quando sair&aacute; a pr&oacute;xima
vers&atilde;o do OpenBSD?</a>
<li><a href="#Included">1.8 - O que &eacute; inclu&iacute;do com o
OpenBSD?</a>
<li><a href="#WhatsNew">1.9 -O que h&aacute; de novo no OpenBSD 4.4?</a>
<li><a href="#Desktop">1.10 - Posso utilizar o OpenBSD como um sistema
desktop?</a>
<li><a href="#HowAbout">1.11 - Por que o <i>ProdutoX</i>
est&aacute;/n&atilde;o est&aacute; inclu&iacute;do?</a>
</ul>

<hr>

<p>
<a name="WhatIs"></a>
<h2>1.1 - O que &eacute; OpenBSD?</h2>

<p>
O projeto <a href="../../pt/index.html">OpenBSD</a> produz um sistema
operacional livre, multi-plataforma, do tipo UNIX baseado no 4.4BSD.
Nossos <a href="../../pt/goals.html">objetivos</a> enfatizam corretude,
<a href="../../security.html">seguran&ccedil;a</a>,
padroniza&ccedil;&atilde;o,
e <a href="../../pt/plat.html">portabilidade</a>. 
O OpenBSD suporta emula&ccedil;&atilde;o bin&aacute;ria da maioria dos
programas do SVR4 (Solaris), FreeBSD, Linux, BSDI, SunOS, e HPUX.

<!-- XXXrelease -->
<p>
Este FAQ cobre especificamente apenas a vers&atilde;o mais recente do
OpenBSD, vers&atilde;o 4.4.

<p>
<a name="Platforms"></a>
<h2>1.2 - Em que sistemas o OpenBSD opera?</h2>
<!-- XXXrelease -->
<p>
O OpenBSD 4.4 opera nas seguintes plataformas:
<ul>
    <li><a href="../../alpha.html">alpha</a> - FTP apenas 
    <li><a href="../../amd64.html">amd64</a> - Dispon&iacute;vel em CD
    <li><a href="../../armish.html">armish</a> - FTP apenas
    <li><a href="../../hp300.html">hp300</a> - FTP apenas
    <li><a href="../../hppa.html">hppa</a> - FTP apenas
    <li><a href="../../i386.html">i386</a> - Dispon&iacute;vel em CD
    <li><a href="../../landisk.html">landisk</a> - FTP apenas
    <li><a href="../../mac68k.html">mac68k</a> - FTP apenas
    <li><a href="../../macppc.html">macppc</a> - Dispon&iacute;vel em CD
    <li><a href="../../mvme68k.html">mvme68k</a> - FTP apenas
    <li><a href="../../mvme88k.html">mvme88k</a> - FTP apenas
    <li><a href="../../sgi.html">sgi</a> - FTP apenas 
    <li><a href="../../socppc.html">socppc</a> - FTP apenas
    <li><a href="../../sparc.html">sparc</a> - FTP apenas
    <li><a href="../../sparc64.html">sparc64</a> - Dispon&iacute;vel em
    CD
    <li><a href="../../vax.html">vax</a> - FTP apenas
    <li><a href="../../zaurus.html">zaurus</a> - FTP apenas
</ul>

<p>
<i>Dispon&iacute;vel em CD</i> significa que o
<a href="../../orders.html">conjunto oficial de CDs</a> inclui essa
plataforma e alguns <a href="../faq15.html">pacotes</a> para a mesma.
Tamb&eacute;m &eacute; poss&iacute;vel fazer o download de imagens ISO
para CD
na maioria das demais plataformas.

<p>
Mais informa&ccedil;&otilde;es sobre as plataformas do OpenBSD podem
ser encontradas na p&aacute;gina de
<a href="../../pt/plat.html">Plataformas</a>.

<p>
As pessoas &agrave;s vezes perguntam porque suportamos tantas
arquiteturas "estranhas". A resposta r&aacute;pida &eacute;, "porque
n&oacute;s queremos". Se h&aacute; pessoas habilidosas em n&uacute;mero
suficiente (algumas vezes, "suficiente" &eacute; uma &uacute;nica pessoa
realmente habilidosa!) que querem manter suporte para uma plataforma,
ela ser&aacute; suportada.
H&aacute; benef&iacute;cios pr&aacute;ticos em manter o OpenBSD
multi-plataforma: quando novas plataformas s&atilde;o lan&ccedil;adas, a
&aacute;rvore de c&oacute;digo est&aacute; relativamente livre de bugs
relacionados com portabilidade e falhas de design.
O OpenBSD suporta plataformas para processadores de 32 bit e 64 bit,
m&aacute;quinas little e big endian, e muitos designs diferentes. E sim,
suportar plataformas "incomuns" ajudou a produzir uma base de
c&oacute;digo de melhor qualidade para plataformas mais "comuns".

<a name="ReallyFree"></a>
<h2>1.3 - O OpenBSD &eacute; realmente livre?</h2>

<p>
O OpenBSD &eacute; completamente livre. Os bin&aacute;rios s&atilde;o
livres. O c&oacute;digo &eacute; livre. Todas as partes do OpenBSD
t&ecirc;m
termos de copyright razo&aacute;veis, permitindo livre
redistribui&ccedil;&atilde;o. Isto inclui a habilidade de REUTILIZAR boa
parte da &aacute;rvore de c&oacute;digo do OpenBSD, seja para uso
pessoal ou comercial. O OpenBSD N&Atilde;O inclui quaisquer
restri&ccedil;&otilde;es al&eacute;m daquelas impl&iacute;citas pela
licen&ccedil;a BSD original. Software licenciado sob licen&ccedil;as
mais
estritas n&atilde;o pode ser inclu&iacute;do na
distribui&ccedil;&atilde;o
padr&atilde;o do OpenBSD.
A inten&ccedil;&atilde;o dessa medida &eacute; salvaguardar a livre
utiliza&ccedil;&atilde;o do OpenBSD.
Por exemplo, o OpenBSD pode ser livremente utilizado para uso pessoal,
acad&ecirc;mico, por institui&ccedil;&otilde;es governamentais, por
organiza&ccedil;&otilde;es sem fins lucrativos e por
organiza&ccedil;&otilde;es
comerciais.

O OpenBSD, ou partes dele, tamb&eacute;m podem ser livremente
incorporadas em <a href="../../products.html">produtos comerciais</a>.

<p>
As pessoas &agrave;s vezes perguntam se nos incomoda o fato de nosso
trabalho volunt&aacute;rio ser utilizado em produtos comerciais.
A resposta &eacute;, n&oacute;s preferimos que nosso c&oacute;digo de
qualidade
seja <i>amplamente utilizado</i> do que as empresas de software
comercial reimplementem e criem solu&ccedil;&otilde;es alternativas,
incompat&iacute;veis e mal codificadas para problemas j&aacute;
resolvidos.
Por exemplo, &eacute; prov&aacute;vel que o SSH seja um protocolo
largamente utilizado devido a essa liberdade, muito mais utilizado do
que se restri&ccedil;&otilde;es tivessem sido colocadas em como as
pessoas utilizam o c&oacute;digo do OpenSSH.

<p>
Isso n&atilde;o quer dizer que rejeitar&iacute;amos
<a href="../../pt/donations.html">ajuda financeira ou de hardware</a>
como agradecimento.
De fato, &eacute; impressionante qu&atilde;o pouco suporte de qualquer
tipo vem de empresas que dependem do OpenBSD para seus produtos, mas
n&atilde;o h&aacute; exig&ecirc;ncias de compensa&ccedil;&atilde;o.

<p>
Para mais informa&ccedil;&otilde;es sobre outras licen&ccedil;as
populares
leia:
<a href="../../policy.html">Pol&iacute;tica de Copyright do OpenBSD</a>.

<p>
Os mantenedores do projeto OpenBSD mant&eacute;m o projeto
principalmente de seus pr&oacute;prios bolsos. Isto inclui o tempo gasto
programando para o projeto, equipamento utilizado para suportar as
v&aacute;rias arquiteturas, os recursos de rede usados para distribuir o
OpenBSD para voc&ecirc;, e o tempo gasto respondendo perguntas e
investigando bug reports dos usu&aacute;rios. Os desenvolvedores do
OpenBSD n&atilde;o s&atilde;o particularmente ricos e mesmo pequenas
contribui&ccedil;&otilde;es de tempo, equipamento, e recursos fazem
uma grande diferen&ccedil;a.

<p>
<a name="WhyUse"></a>
<h2>1.4 - Por que eu iria querer utilizar o OpenBSD?</h2>

<p>
Novos usu&aacute;rios frequentemente querem saber se o OpenBSD &eacute;
superior a algum outro sistema operacional compat&iacute;vel com UNIX.
Esta pergunta n&atilde;o possui resposta, em grande parte, e &eacute;
objeto de incont&aacute;veis (e in&uacute;teis) debates religiosos.
N&atilde;o fa&ccedil;a, sob qualquer circunst&acirc;ncia, uma pergunta
desse tipo em uma lista de discuss&atilde;o do OpenBSD.

<p>
Abaixo h&aacute; algumas raz&otilde;es pelas quais acreditamos que o
OpenBSD &eacute; um sistema operacional &uacute;til. Se o OpenBSD
&eacute; o sistema certo para voc&ecirc;, essa &eacute; uma pergunta que
s&oacute; voc&ecirc; pode responder.

<p>
<ul>
   <li>O OpenBSD opera em muitas <a href="../../pt/plat.html"> plataformas
   de hardware diferentes</a>.
   <li>O OpenBSD &eacute; considerado por muitos profissionais de
   seguran&ccedil;a como um dos mais
   <a href="../../security.html">seguros</a> sistemas operacionais
   compat&iacute;veis com UNIX, resultado de incessantes e abrangentes
   auditorias de seguran&ccedil;a ao c&oacute;digo-fonte.
   <li>O OpenBSD &eacute; um sistema compat&iacute;vel com UNIX repleto
   de funcionalidades, dispon&iacute;vel gratuitamente em
   c&oacute;digo-fonte.
   <li> O OpenBSD integra a mais avan&ccedil;ada tecnologia de
   seguran&ccedil;a, apropriada para a implementa&ccedil;&atilde;o de
firewalls
   e <a href="../../pt/crypto.html#hardware">servi&ccedil;os de rede
   privada</a> em ambientes distribu&iacute;dos.
   <li> O OpenBSD se beneficia de intenso e cont&iacute;nuo
   desenvolvimento em diversas &aacute;reas, oferecendo oportunidades
   para trabalhar com tecnologias emergentes, com uma comunidade
   internacional de programadores e usu&aacute;rios.
   <li>O OpenBSD se esfor&ccedil;a para minimizar a necessidade de
   customiza&ccedil;&atilde;o e modifica&ccedil;&atilde;o. Para a grande
   maioria dos usu&aacute;rios, o OpenBSD funciona sem esfor&ccedil;o em
   seu hardware e aplica&ccedil;&atilde;o. N&atilde;o apenas
   customiza&ccedil;&otilde;es e modifica&ccedil;&otilde;es raramente
s&atilde;o
   necess&aacute;rias, como s&atilde;o ativamente
   <a href="faq5.html#Why">desencorajadas</a>.
</ul>

<p>
<a name="Support"></a>
<h2>1.5 - Como posso ajudar o OpenBSD?</h2>

<p>
Temos uma grande d&iacute;vida com as pessoas e
organiza&ccedil;&otilde;es que contribu&iacute;ram ao projeto OpenBSD.
Eles
s&atilde;o lembrados, por nome, na
<a href="../../pt/donations.html">p&aacute;gina de
doa&ccedil;&otilde;es</a>.

<p>
O OpenBSD tem uma constante necessidade por v&aacute;rios tipos de
suporte da comunidade de usu&aacute;rios. Se voc&ecirc; acha o OpenBSD
&uacute;til, encorajamos fortemente que voc&ecirc; busque uma maneira de
contribuir. Se nenhuma das sugest&otilde;es abaixo adaptam-se a
voc&ecirc;, sinta-se &agrave; vontade para propor uma alternativa
enviando um email para
<a href="mailto:donations@openbsd.org">donations@openbsd.org</a>. 

<p>
<ul>
    <li><a href="../../orders.html">Compre um conjunto de CDs do
    OpenBSD</a>. Ele inclui a vers&atilde;o atual do OpenBSD, completa,
    e pode ser bootada em v&aacute;rias plataformas. Ele tamb&eacute;m
    gera renda para manter o projeto OpenBSD, e reduz a carga sobre os
    recursos de rede utilizados para entregar a
    distribui&ccedil;&atilde;o via Internet. Este acess&iacute;vel
    conjunto de tr&ecirc;s CDs inclui os fontes completos. Lembre, seus
    amigos precisam de suas pr&oacute;prias c&oacute;pias!
    <li><a href="../../pt/donations.html">Doe dinheiro</a>. O projeto tem
    uma constante necessidade de dinheiro para pagar por equipamentos,
    conex&atilde;o de rede, e gastos relacionados &agrave;
    publica&ccedil;&atilde;o de CDs.  Fabricar CDs exige um investimento
    pr&eacute;vio pessoal dos desenvolvedores do OpenBSD, sem retorno
    garantido. Envie um email para
    <a href="mailto:donations@openbsd.org">donations@openbsd.org</a>
    para descobrir como contribuir. Mesmo pequenas doa&ccedil;&otilde;es
    fazem uma profunda diferen&ccedil;a.
    <li><a href="../../want.html">Doe equipamentos e partes</a>. O projeto
    tem uma constante necessidade por hardware geral e
    espec&iacute;fico. Itens como discos IDE e SCSI, e v&aacute;rios
    tipos de RAM s&atilde;o sempre bem-vindos.  Para outros tipos de
    hardware como sistemas completos e placas-m&atilde;e, voc&ecirc;
    deve perguntar sobre a necessidade atual. Escreva para
    <a href="mailto:donations@openbsd.org">donations@openbsd.org</a>
    para preparar o envio.
    <li>Doe seu tempo e habilidade. Programadores que gostam de
    desenvolver sistemas operacionais s&atilde;o naturalmente sempre
    bem-vindos mas h&aacute; literalmente dezenas de outras maneiras
    pelas quais pessoas podem ser &uacute;teis. Acompanhe
    <a href="../../mail.html">listas</a> de discuss&atilde;o e ajude a
    responder perguntas de usu&aacute;rios novatos.
    <li> Ajude a manter a documenta&ccedil;&atilde;o enviando material
    novo para o FAQ (para
    <a href="mailto:faq@openbsd.org">faq@openbsd.org</a>). Forme um
    <a href="../../groups.html">grupo de usu&aacute;rios</a> local e
    mostre o OpenBSD para seus amigos. Converse com seu empregador sobre
    utilizar o OpenBSD no trabalho. Se voc&ecirc; &eacute; um estudante,
    converse com seus professores sobre utilizar o OpenBSD como uma
    ferramenta de aprendizado para cursos de Ci&ecirc;ncia da
    Computa&ccedil;&atilde;o ou Engenharia.
    Tamb&eacute;m vale mencionar uma das mais importantes maneiras pela
    qual voc&ecirc; n&atilde;o deve tentar "ajudar" o projeto OpenBSD:
    n&atilde;o perca seu tempo entrando em discuss&otilde;es ("flame
wars")
    sobre sistemas operacionais. Isto n&atilde;o ajuda o projeto a
    conseguir novos usu&aacute;rios e pode causar dano substancial a
    importantes rela&ccedil;&otilde;es que desenvolvedores t&ecirc;m com
    outros desenvolvedores. 
</ul>


<p>
<a name="WhoMaintains"></a>
<h2>1.6 - Quem mant&eacute;m o OpenBSD?</h2>

<p>
O OpenBSD &eacute; mantido por uma equipe de desenvolvedores espalhada
por diferentes <a href="../../images/map.jpg">pa&iacute;ses</a>. O
projeto &eacute; coordenado por Theo de Raadt, localizado no
Canad&aacute;.

<p>
<a name="Next"></a>
<h2>1.7 - Quando sair&aacute; a pr&oacute;xima vers&atilde;o do
OpenBSD?</h2>

A equipe do OpenBSD libera uma nova vers&atilde;o a cada seis meses, com
datas previstas para Maio e Novembro. Mais informa&ccedil;&atilde;o
sobre o ciclo de desenvolvimento podem ser encontradas
<a href="faq5.html#Flavors">aqui</a>.

<a name="Included"></a>
<h2>1.8 - O que &eacute; inclu&iacute;do com o OpenBSD?</h2>
O OpenBSD &eacute; distribu&iacute;do com algumas
aplica&ccedil;&otilde;es de terceiros, incluindo:
<!-- XXXrelease -->

<ul>
<li><a href="http://www.x.org">X.org 7.3</a>,
o sistema de janelas X Window, com patches locais.
Instalado com os
<a href="faq4.html#FilesNeeded">pacotes de
instala&ccedil;&atilde;o</a>
<tt>x*.tgz</tt>.

<li><a href="http://gcc.gnu.org/">GCC</a> vers&otilde;es 2.95.3 e 3.3.5.
O compilador C GNU. A equipe do OpenBSD adicionou a tecnologia de
prote&ccedil;&atilde;o de pilha
<a href="http://www.trl.ibm.com/projects/security/ssp">Propolice</a>,
habilitada por padr&atilde;o, e utilizada em todo o userland do OpenBSD,
e por padr&atilde;o em aplica&ccedil;&otilde;es compiladas no OpenBSD.
Instalado como parte do
<a href="faq4.html#FilesNeeded">pacote de arquivos</a>
<tt>comp44.tgz</tt>.

<li><a href="http://www.perl.com/">Perl 5.8.8</a>, com patches e
melhorias da equipe do OpenBSD.

<li>Nossa vers&atilde;o melhorada e segura do servidor web Apache 1.3. A
equipe do OpenBSD adicionou <a href="../faq10.html#httpdchroot">chroot
por padr&atilde;o</a>, revoga&ccedil;&atilde;o de privil&eacute;gios, e
outras
melhorias relacionadas &agrave; seguran&ccedil;a. Tamb&eacute;m inclui o
mod_ssl e suporte a DSO.

<li><a href="http://www.openssl.org">OpenSSL 0.9.7j</a>, com patches e
melhorias da equipe do OpenBSD.

<li><a href="http://www.gnu.org/software/groff/groff.html">Groff
1.15</a>
processador de texto.

<li><a href="http://www.sendmail.org/">Sendmail 8.14.3</a> servidor de
email, com libmilter.

<li><a href="http://www.isc.org/products/BIND/">BIND 9.4.2-P2</a>
servidor DNS (com patches).
O OpenBSD implementou muitas melhorias em opera&ccedil;&atilde;o chroot
e outras quest&otilde;es relacionadas &agrave; seguran&ccedil;a.

<li><a href="http://lynx.isc.org/">Lynx 2.8.5rel.4</a> web browser modo
texto. Com suporte a HTTPS adicionado, al&eacute;m de patches da equipe
do OpenBSD.

<li><a href="http://www.courtesan.com/sudo/">Sudo v1.6.9p17</a>,
permitindo a usu&aacute;rios executar comandos individuais como root. 

<li><a href="http://www.gnu.org/software/ncurses/ncurses.html">Ncurses
5.2</a>

<li><a href="http://www.kame.net/">KAME</a> IPv6

<li><a href="http://www.pdc.kth.se/heimdal/">Heimdal 0.7.2</a> com
patches

<li><a href="http://www.stacken.kth.se/projekt/arla/">Arla 0.35.7</a>

<li><a href="http://www.gnu.org/software/binutils/">Binutils 2.15</a> 
com patches

<li><a href="http://www.gnu.org/software/gdb/gdb.html">gdb 6.3</a> com
patches

<li><a href="http://www.openssh.com">OpenSSH 5.1</a>

<li><a href="http://www.openntpd.org">OpenNTPD</a>
implementa&ccedil;&atilde;o segura e simples do Network Time Protocol

<li><a href="http://www.openbgpd.org/">OpenBGPD e OpenOSPFD</a>
aplica&ccedil;&otilde;es de roteamento

</ul>

Como pode ser visto, a equipe do OpenBSD frequentemente aplica patches
a produtos de terceiros para (tipicamente) melhorar a seguran&ccedil;a e
qualidade do c&oacute;digo. Em alguns casos, o usu&aacute;rio n&atilde;o
vai sentir qualquer diferen&ccedil;a na opera&ccedil;&atilde;o, e em
outros
casos, H&Aacute; diferen&ccedil;as operacionais que podem impactar
alguns
usu&aacute;rios. Tenha em mente essas melhorias antes de adicionar
cegamente vers&otilde;es diferentes do mesmo software.
Voc&ecirc; pode obter um n&uacute;mero de vers&atilde;o maior, mas um
sistema menos seguro.

<p>
&Eacute; claro, aplica&ccedil;&otilde;es adicionais podem ser
adicionadas atrav&eacute;s do sistema de
<a href="../faq15.html">packages e ports</a> do OpenBSD. 
<p>

<a name="WhatsNew"></a>
<h2>1.9 - O que h&aacute; de novo no OpenBSD 4.4?</h2>
<!-- XXXrelease -->

A lista completa de modifica&ccedil;&atilde;o feitas ao OpenBSD 4.3 para
criar o OpenBSD 4.4 pode ser vista em
<a href="../../plus44.html">plus44.html</a>, e destaques na
<a href="../../44.html">p&aacute;gina de Informa&ccedil;&otilde;es do
OpenBSD 4.4</a>, embora haja algumas modifica&ccedil;&otilde;es que a
equipe do OpenBSD prev&ecirc; que requeiram ou sejam dignas de nota em
especial para pessoas atualizando ou instalando o OpenBSD 4.4 e que
estejam familiarizadas com vers&otilde;es mais antigas:

<ul>
<li><b>OpenBSD/sparc64:</b><br>
M&aacute;quinas usando o UltraSPARC IV/T1/T2 e Fujitsu SPARC64-V/VI/VII
s&atilde;o agora suportadas.

<p>
<li><b>Nova ferrramenta <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysmerge&amp;sektion=8">sysmerge(8)</a>:</b><br>
Derivada do port Mergemaster, torna muito mais f&aacute;cil unir
modifica&ccedil;&otilde;es a arquivos de configura&ccedil;&atilde;o
durante o processo de upgrade.

<p>
<li><b>Arquivos <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=hostname.if&amp;sektion=5">hostname.*</a>
agora instalados com modo 600</b><br>
para ajudar a manter suas chaves wireless e outras
informa&ccedil;&otilde;es de configura&ccedil;&atilde;o em segredo.

<p>
<li><b><a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=dhcpd&amp;sektion=8">dhcpd(8)</a></b><br>
agora suporta sincroniza&ccedil;&atilde;o do arquivo de leases
atrav&eacute;s de m&uacute;ltiplos servidores para redund&acirc;ncia.
dhcpd(8) tamb&eacute;m j&aacute; n&atilde;o utiliza o arquivo
<tt>dhcp.interfaces</tt>, utilize uma entrada no
<a href="../faq10.html#rc">rc.conf.local</a>.

</ul>


<a name="Desktop"></a>
<h2>1.10 - Posso utilizar o OpenBSD como um sistema desktop?</h2>
Esta pergunta frequentemente &eacute; feita exatamente desta maneira --
sem nenhuma explica&ccedil;&atilde;o sobre o que o questionador entende
por "desktop".
A &uacute;nica pessoa que pode responder essa quest&atilde;o &eacute;
voc&ecirc;, j&aacute; que depende de quais s&atilde;o suas necessidades
e expectativas.

<p>
Muito embora o OpenBSD tenha uma excelente reputa&ccedil;&atilde;o como
sistema operacional "para servidores", e pode ser e &eacute; utilizado
no desktop.
Muitas aplica&ccedil;&otilde;es "desktop" est&atilde;o
dispon&iacute;veis atrav&eacute;s de
<a href="../faq15.html">packages e ports</a>.
Assim como todas as decis&otilde;es acerca de sistemas operacionais, a
quest&atilde;o &eacute;: ele pode executar a tarefa que voc&ecirc;
deseja da forma que voc&ecirc; deseja?
Voc&ecirc; deve responder essa quest&atilde;o por si mesmo.

<p>
Pode ser v&aacute;lido mencionar que boa parte do desenvolvimento do
OpenBSD &eacute; feito em laptops.


<a name="HowAbout"></a>
<h2>1.11 - Por que o <i>ProdutoX</i> est&aacute;/n&atilde;o est&aacute;
inclu&iacute;do?</h2>

As pessoas frequentemente perguntam o porqu&ecirc; de um produto
particular estar ou n&atilde;o estar inclu&iacute;do com o OpenBSD.
A resposta &eacute; baseada em duas coisas: os desejos dos
desenvolvedores e a compatibilidade com os
<a href="../../policy.html">objetivos</a> do projeto.
Um produto n&atilde;o ser&aacute; inclu&iacute;do simplesmente porque
&eacute; "legal" -- ele deve tamb&eacute;m ser "livre" para uso,
distribui&ccedil;&atilde;o e modifica&ccedil;&atilde;o por nossos
padr&otilde;es. Um
produto tamb&eacute;m deve ser est&aacute;vel e seguro -- um
n&uacute;mero de vers&atilde;o maior nem sempre significa um produto
melhor.

<p>
A licen&ccedil;a frequentemente &eacute; o maior problema: n&oacute;s
queremos que o OpenBSD se mantenha utiliz&aacute;vel por qualquer pessoa
em qualquer lugar do mundo para qualquer prop&oacute;sito.

<p>
Outra considera&ccedil;&atilde;o preponderante s&atilde;o os desejos dos
desenvolvedores.
Os desenvolvedores do OpenBSD s&atilde;o os ju&iacute;zes finais do que
entra ou n&atilde;o entra no projeto.
S&oacute; porque uma aplica&ccedil;&atilde;o &eacute; "boa" n&atilde;o
significa que o projeto OpenBSD quer devotar os recursos
necess&aacute;rios para mant&ecirc;-la, ou que eles ir&atilde;o
partilhar do entusiasmo alheio sobre seu lugar no OpenBSD.

<p>
Algumas perguntas comumente feitas sobre produtos de terceiros:
<ul>
<li><i>Por que o Sendmail &eacute; inclu&iacute;do, ele &eacute;
"reconhecidamente inseguro"?</i><br>
O Sendmail teve um hist&oacute;rico de seguran&ccedil;a imperfeito, mas
os autores do Sendmail e seus mantenedores t&ecirc;m sido muito
receptivos em retrabalhar seu c&oacute;digo para torn&aacute;-lo muito
mais seguro (e essa infelizmente &eacute; uma resposta incomum).
O hist&oacute;rico recente de seguran&ccedil;a do Sendmail n&atilde;o
&eacute; muito diferente de algumas das alternativas supostamente "mais
seguras".

<li><i>Por o Postfix n&atilde;o &eacute; inclu&iacute;do?</i><br>
A licen&ccedil;a n&atilde;o &eacute; livre, e portanto n&atilde;o pode
ser
considerada.

<li><i>Por que o qmail ou o djbdns n&atilde;o s&atilde;o
inclu&iacute;dos?</i><br>
Nenhum dos programas &eacute; o que muitos usu&aacute;rios Unix
"esperam" de uma aplica&ccedil;&atilde;o de email ou DNS.

<li><i>Por que o Apache &eacute; inclu&iacute;do? Ele n&atilde;o
&eacute;
necessitado por muitas pessoas!</i><br> 
Porque os desenvolvedores querem.

<li><i>Por que uma vers&atilde;o mais nova do Apache n&atilde;o &eacute;
inclu&iacute;da?</i><br>
A licen&ccedil;a das vers&otilde;es mais recentes &eacute;
inaceit&aacute;vel.

<li><i>Por que o bzip2 n&atilde;o &eacute; inclu&iacute;do em vez do
gzip?</i><br>
A performance &eacute; horr&iacute;vel, e o benef&iacute;cio &eacute;
m&iacute;nimo.
O impacto em plataformas mais lentas, como m68k ou VAX seria
inaceit&aacute;vel.

<li><i>Por que n&atilde;o h&aacute; um instalador gr&aacute;fico ou
baseado em
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=curses&amp;sektion=3">curses(3)</a>?</i><br>
Por um n&uacute;mero de raz&otilde;es, incluindo o objetivo de manter a
m&iacute;dia de boot da instala&ccedil;&atilde;o dentro do tamanho de um
&uacute;nico disquete, o fato de que um instalador pode ser utilizado em
todas as plataformas em todas as configura&ccedil;&otilde;es, e o fato
de que ap&oacute;s a segunda ou terceira instala&ccedil;&atilde;o do
OpenBSD, a
maioria dos usu&aacute;rios passa a achar o sistema de
instala&ccedil;&atilde;o do OpenBSD um dos mais r&aacute;pidos e
f&aacute;ceis
instaladores de qualquer sistema operacional. A maioria dos
desenvolvedores e usu&aacute;rios prefere a velocidade, poder, e
facilidade de uso do instalador atual em rela&ccedil;&atilde;o a alguns
instaladores mais "coloridos" ou "bonitos" de outras plataformas. 

</ul>

Na maioria dos casos, esses t&oacute;picos foram discutidos em detalhe
excruciante nas <a href="../faq2.html#MailLists">listas de
discuss&atilde;o</a>, por favor consulte os arquivos se voc&ecirc;
precisa de mais informa&ccedil;&otilde;es.

<p>
&Eacute; claro, se voc&ecirc; quer utilizar algum desses pacotes e seu
uso &eacute; compat&iacute;vel com a licen&ccedil;a dos produtos,
ningu&eacute;m ir&aacute; impedi-lo (isso n&atilde;o seria muito livre
da nossa parte, n&atilde;o &eacute;?)
No entanto, suas necessidades podem variar -- voc&ecirc; pode n&atilde;o
querer desenvolver uma "Aplica&ccedil;&atilde;o Matadora" que voc&ecirc;
n&atilde;o pode vender, distribuir, ou ficar rico com ela porque
voc&ecirc;
incorporou software n&atilde;o-livre na mesma.


<p>

<font color="#0000e0">
<a href= "index.html">[&Iacute;ndice do FAQ]</a>
<a href= "faq2.html">[Para a Se&ccedil;&atilde;o 2 - Conhecendo o
OpenBSD]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24"
src="../../images/back.gif" border="0" alt="[back]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
<!--
Originally [OpenBSD: faq1.html, v 1.106 ]<br>
$Translation: faq1.html,v 1.15 2009/02/19 01:14:45 dsantos Exp $<br>
-->
$OpenBSD: faq1.html,v 1.12 2009/02/22 20:35:21 tobias Exp $
</small>

</body>
</html> 
