<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>1 - Introdu&ccedil;&atilde;o ao OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2003 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href= "index.html">[&Iacute;ndice do FAQ]</a>
<a href= "../faq2.html">[Para a Se&ccedil;&atilde;o 2 - Outras fontes de informa&ccedil;&otilde;es sobre OpenBSD]</a> 
</font>

<h1><font color="#e00000">1 - Introdu&ccedil;&atilde;o ao OpenBSD</font></h1>
<hr>

<p>
<h3>Conte&uacute;do</h3>
<ul>
<li><a href="#WhatIs">1.1 - O que &eacute; o OpenBSD?</a>
<li><a href="#Platforms">1.2 - Em que sistemas o OpenBSD roda?</a>
<li><a href="#ReallyFree">1.3 - O OpenBSD &eacute; mesmo livre?</a>
<li><a href="#WhyUse">1.4 - Por qu&ecirc; eu iria querer usar o OpenBSD?</a>
<li><a href="#Support">1.5 - Como eu posso ajudar o OpenBSD?</a>
<li><a href="#WhoMaintains">1.6 - Quem mant&eacute;m o OpenBSD?</a>
<li><a href="#Next">1.7 - Quando sai a pr&oacute;xima vers&atilde;o do OpenBSD?</a>
<li><a href="#Included">1.8 - O que &eacute; inclu&iacute;do com o OpenBSD?</a>
</ul>

<hr>

<p>
<a name="WhatIs"></a>
<a name="1.1"></a>
<h2>1.1 - O que &eacute; o OpenBSD?</h2>

<p>
O projeto <a href="../../pt/index.html">OpenBSD</a> produz um sistema operacional
dispon&iacute;vel livremente, multi-plataforma do tipo UNIX baseado no 4.4BSD. 
Nossos <a href="../../pt/goals.html">objetivos</a> d&atilde;o &ecirc;nfase na 
corre&ccedil;&atilde;o, 
<a href="../../security.html">seguran&ccedil;a</a>, padroniza&ccedil;&atilde;o, e
<a href="../../pt/plat.html">portabilidade</a>. 
O <a href="../../pt/index.html">OpenBSD</a> suporta emula&ccedil;&atilde;o 
bin&aacute;ria da maioria dos bin&aacute;rios do 
SVR4 (Solaris), FreeBSD, Linux, BSDI, SunOS, e HPUX. 


<p>
<a name="Platforms"></a>
<a name="1.2"></a>
<h2>1.2 - Em que sistemas o OpenBSD roda?</h2>
<!-- XXXrelease -->
<p>
O OpenBSD 3.3 roda nas seguintes plataformas:
<ul>
    <li><a href="../../i386.html">i386</a> - CD boot&aacute;vel 
    <li><a href="../../sparc.html">sparc</a> - CD boot&aacute;vel
    <li><a href="../../sparc64.html">sparc64</a> - CD boot&aacute;vel 
    <li><a href="../../hp300.html">hp300</a> - somente FTP  
    <li><a href="../../mac68k.html">mac68k</a> - somente FTP
    <li><a href="../../macppc.html">macppc</a> - CD boot&aacute;vel
    <li><a href="../../mvme68k.html">mvme68k</a> - somente FTP 
    <li><a href="../../alpha.html">alpha</a> - somente FTP  
    <li><a href="../../vax.html">vax</a>
    <li><a href="../../hppa.html">hppa</a> - somente FTP <i>* Novo para o 3.3 *</i>
</ul>

<p>
<i>boot&aacute;vel</i> significa que o OpenBSD vai dar boot diretamente do CD.  Os 
CDs v&atilde;o dar boot em v&aacute;rias plataformas de hardware.
Veja o <a href="../faq3.html">cap&iacute;tulo 3</a> deste FAQ para detalhes 
sobre como obter o OpenBSD em CD.

<p>
Vers&otilde;es anteriores do OpenBSD tamb&eacute;m tinham ports para:
<ul>
  <li><a href="../../amiga.html">amiga</a> - removido depois vers&atilde;o 3.2 
  <li><a href="../../sun3.html">sun3</a> - removido depois vers&atilde;o 2.9 
  <li><a href="../../arc.html">arc</a> - removido depois vers&atilde;o 2.3 
  <li><a href="../../mvme88k.html">mvme88k</a>
  <li><a href="../../pmax.html">pmax</a>
</ul>

<p>
O OpenBSD n&atilde;o suporta atualmente mais do que um processador.
Veja o <a href="../faq8.html#SMP">FAQ 8, SMP</a> para maiores 
informa&ccedil;&otilde;es.

<p>
<a name="ReallyFree"></a>
<a name="1.3"></a>
<h2>1.3 - O OpenBSD &eacute; mesmo livre?</h2>

<p>
O OpenBSD &eacute; totalmente livre. Os bin&aacute;rios s&atilde;o livres. O 
c&oacute;digo fonte é livre. 
Todas as partes do OpenBSD t&ecirc;m termos de direitos autorais razo&aacute;veis 
permitindo livre redistribui&ccedil;&atilde;o.  Isso inclui a habilidade de 
REUSAR a maior parte da &aacute;rvore de fontes do OpenBSD, seja para 
prop&oacute;sitos pessoais ou comerciais. 
O OpenBSD NÃO inclui restri&ccedil;&otilde;es al&eacute;m daquelas implicadas 
pela licen&ccedil;a BSD original. Software escrito com licen&ccedil;as mais 
restritivas n&atilde;o pode ser inclu&iacute;do na distribui&ccedil;&atilde;o 
do OpenBSD.  
A inten&ccedil;&atilde;o &eacute; resguardar o uso livre do OpenBSD. 
Por exemplo, o OpenBSD pode ser usado livremente para uso pessoal, uso 
acad&ecirc;mico, por institui&ccedil;&otilde;es governamentais, 
organiza&ccedil;&otilde;es sem fins lucrativos e por organiza&ccedil;&otilde;es
comerciais.

<p>
Para ler mais sobre outras licen&ccedil;as populares, leia:
<a href="../../policy.html">http://www.openbsd.org/policy.html</a>.

<p>
Os mantedores do OpenBSD mant&eacute;m o projeto com dinheiro dos seus 
pr&oacute;prios bolsos.  Isso inclui o tempo que eles gastam programando para o 
projeto, o equipamento usado para suportar os v&aacute;rios ports, os recursos 
de rede usados para distribuir o OpenBSD para voc&ecirc;, e o tempo gasto 
respondendo perguntas e investigando notifica&ccedil;&otilde;es de bugs dos 
usu&aacute;rios. Os desenvolvedores do OpenBSD n&atilde;o s&atilde;o ricos, 
e mesmo pequenas contribui&ccedil;&otilde;es em forma de tempo, equipamento
e recursos fazem uma grande diferen&ccedil;a.


<p>
<a name="WhyUse"></a>
<a name="1.4"></a> 
<h2>1.4 - Por qu&ecirc; eu iria querer usar o OpenBSD?</h2>

<p>
Novos usu&aacute;rios freq&uuml;entemente querem saber se o OpenBSD &eacute;
superior a algum outro sistema operacional livre do tipo UNIX. 
Essa pergunta &eacute; imposs&iacute;vel de ser respondida e &eacute; motivo 
de incont&aacute;veis (e in&uacute;teis) debates religiosos.
N&atilde;o fa&ccedil;a, sob qualquer circunst&acirc;ncia, uma pergunta deste 
tipo em uma lista de discuss&atilde;o do OpenBSD.

<p>
Abaixo est&atilde;o algumas raz&otilde;es de porque n&oacute;s achamos que o 
OpenBSD &eacute; um sistema operacional &uacute;til.  Se o OpenBSD &eacute; o
melhor para voc&ecirc;, isso &eacute; uma quest&atilde;o que s&oacute; 
voc&ecirc; pode responder.

<p>
<ul>
   <li>O OpenBSD roda em muitas <a href="../../pt/plat.html"> plataformas de 
   hardware diferentes</a>. 
   <li>O OpenBSD &eacute; considerado por muitos profissionais de 
   seguran&ccedil;a como o mais <a href="../../security.html">seguro</a> sistema
   operacional do tipo UNIX, resultado de uma intensa auditoria de 
   seguran&ccedil;a no c&oacute;digo fonte de 1 ano e meio feita por 10 membros
   do projeto. 
   <li>O OpenBSD &eacute; um sistema operacional do tipo UNIX funcional
   dispon&iacute;vel em c&oacute;digo fonte sem custos.
   <li>O OpenBSD integra tecnologia de seguran&ccedil;a de &uacute;ltima 
   gera&ccedil;&atilde;o adequada para construir firewalls e 
   <a href="../../pt/crypto.html#hardware">servi&ccedil;os de rede privada</a> 
   em um ambiente distribu&iacute;do. 
   <li>O OpenBSD se beneficia de um forte processo de desenvolvimento em muitas
   &aacute;reas, oferecendo a oportunidade de se trabalhar com tecnologias
   emergentes com uma comunidade internacional de programadores e  
   usu&aacute;rios finais.
   <li>O OpenBSD oferece a oportunidade de pessoas comuns participarem
   no desenvolvimento e testes do produto.
</ul>

<p>
<a name="Support"></a>
<a name="1.5"></a>
<h2>1.5 - Como eu posso ajudar o OpenBSD?</h2>

<p>
N&oacute;s temos uma grande d&iacute;vida com as pessoas e 
organiza&ccedil;&otilde;es que contribu&iacute;ram com o projeto OpenBSD.
Seus nomes est&atilde;o na: <a href="../../pt/donations.html">p&aacute;gina de
doa&ccedil;&otilde;es</a>.


<p>
O OpenBSD tem uma necessidade constante de v&aacute;rios tipos de ajuda da
comunidade de usu&aacute;rios. Se voc&ecirc; acha o OpenBSD &uacute;til, 
voc&ecirc; &eacute; fortemente encorajado a encontrar uma forma de contribuir.
Se nenhuma das sugest&otilde;es abaixo for adequada para voc&ecirc;, sinta-se 
livre para propor uma alternativa enviando um e-mail para 
<a href="mailto:donations@openbsd.org">donations@openbsd.org</a>. 


<p>
<ul>
    <li><a href="../../pt/orders.html">Compre um pacote de CDs do OpenBSD</a>.
    Ele inclui a vers&atilde;o atual completa do OpenBSD, e &eacute; 
    boot&aacute;vel em muitas plataformas. Ele tamb&eacute;m gera receita para
    ajudar o projeto OpenBSD, e reduz a utiliza&ccedil;&atilde;o dos recursos
    de rede usados para entregar a distribui&ccedil;&atilde;o via Internet.
    Este pacote de baixo custo com tr&ecirc;s CDs inclui os fontes completos.
    Lembre-se, seus amigos precisam de suas pr&oacute;prias c&oacute;pias!
    <li><a href="../../pt/donations.html">Doe dinheiro</a>. O projeto tem
    a necessidade constante de dinheiro para pagar por equipamento,
    conectividade e gastos relativos a publica&ccedil;&atilde;o de CDs.
    Fabrica&ccedil;&atilde;o de CDs requer um investimento direto dos bolsos 
    dos desenvolvedores do OpenBSD, sem retorno garantido. Mande um e-mail para
    <a href="mailto:donations@openbsd.org">donations@openbsd.org</a> para
    descobrir como contribuir. Mesmo pequenas quantias fazem uma profunda
    diferen&ccedil;a.
    <li><a href="../../pt/want.html">Doe equipamento</a>. O projeto tem a 
    necessidade constante de hardware geral e espec&iacute;fico. Itens como 
    discos IDE e SCSI, e v&aacute;rios tipos de RAM s&atilde;o sempre 
    bem-vindos.
    Para outros tipos de hardware como sistemas de computador e 
    placas-m&atilde;e, voc&ecirc; deve perguntar sobre as necessidades atuais. 
    Escreva para 
    <a href="mailto:donations@openbsd.org">donations@openbsd.org</a> para
    combinar o envio.
    <li>Doe seu tempo e habilidades. Programadores que gostam de escrever
    sistemas operacionais s&atilde;o naturalmente sempre bem-vindos, mas 
    h&aacute; literalmente d&uacute;zias de outras formas de ser &uacute;til.
    Acompanhe as listas de
    <a href="../../mail.html">discuss&atilde;o</a> e ajude a responder 
    perguntas de novos usu&aacute;rios.
    <li>Ajude a manter a documenta&ccedil;&atilde;o enviando novo material para 
    o FAQ (para <a href="mailto:faq@openbsd.org">faq@openbsd.org</a>). Crie um
    <a href="../../groups.html">grupo de usu&aacute;rios</a> e mostre o OpenBSD
    para os seus amigos. Converse com o seu patr&atilde;o para usar o OpenBSD no
    trabalho. 
    Se voc&ecirc; &eacute; um estudante, fale com os seus professores sobre o 
    OpenBSD como uma ferramenta de aprendizado para cursos de Ci&ecirc;ncia da
    Computa&ccedil;&atilde;o ou Engenharia. &Eacute; v&aacute;lido tamb&eacute;m
    mencionar uma das maneiras que voc&ecirc; n&atilde;o deve tentar "ajudar" o
    projeto OpenBSD: n&atilde;o perca seu tempo se engajando em flame wars sobre
    sistemas operacionais. Isso n&atilde;o ajuda o projeto a encontrar novos
    usu&aacute;rios e pode prejudicar substancialmente importantes 
    rela&ccedil;&otilde;es que os desenvolvedores t&ecirc;m com outros 
    desenvolvedores.    
</ul>


<p>
<a name="WhoMaintains"></a>
<a name="1.6"></a>
<h2>1.6 - Quem mant&eacute;m o OpenBSD?</h2>

<p>
O OpenBSD &eacute; mantido por um time de desenvolvimento espalhado por muitos
<a href="../../images/map.jpg">pa&iacute;ses</a> diferentes. O projeto &eacute; 
coordenado por Theo de Raadt, localizado no Canad&aacute;. 

<p>
<a name="Next"></a>
<h2>1.7 - Quando sai a pr&oacute;xima vers&atilde;o do OpenBSD?</h2>

O time do OpenBSD faz um novo lan&ccedil;amento a cada seis meses, com datas
planejadas para 1 de maio e 1 de novembro.  Mais informa&ccedil;&otilde;es
sobre o ciclo de desenvolvimento pode ser encontrada  
<a href="../faq5.html#Flavors">aqui</a>.

<a name="Included"></a>

<h2>1.8 - O que &eacute; inclu&iacute;do com o OpenBSD?</h2>
O OpenBSD &eacute; distribu&iacute;do com v&aacute;rios softwares de
terceiros, incluindo:

<ul>
<li><a href="http://www.xfree.org">XFree86 4.2.1</a> o ambiente X Window.
Para i386, s&atilde;o inclu&iacute;dos servidores X v3.3 adicionais
para suporte a chipsets gr&aacute;ficos. Instalado com os <a href="faq4.html#FilesNeeded">pacotes de arquivos de instala&ccedil;&atilde;o</a> 
<tt>x*.tgz</tt>.

<li><a href="http://gcc.gnu.org/">GCC 2.95</a> Compilador GNU C. A equipe do 
OpenBSD adicionou a tecnologia de prote&ccedil;&atilde;o de pilha 
<a href="http://www.trl.ibm.com/projects/security/ssp">Propolice</a>
, habilitada por padr&atilde;o, e usada em todo o userland do OpenBSD e por
padr&atilde;o em aplica&ccedil;&otilde;es compiladas no OpenBSD.
Instalado como uma parte do <a href="faq4.html#FilesNeeded">pacote de arquivos</a> 
<tt>comp33.tgz</tt>.

<li><a href="http://www.perl.com/">Perl 5.8.0</a>, com corre&ccedil;&otilde;es e
melhorias da equipe do OpenBSD.

<li><a href="http://www.apache.org/">Apache 1.3.27</a> servidor web. O 
time do OpenBSD adicionou o <a href="../faq10.html#httpdchroot">chrooting por
padr&atilde;o</a>, revoga&ccedil;&atilde;o de privil&eacute;gio, e outras 
melhorias relacionadas a seguran&ccedil;a.
Inclui tamb&eacute;m mod_ssl 2.8 e suporte a DSO.

<li><a href="http://www.openssl.org">OpenSSL 0.9.7beta3</a>, com 
corre&ccedil;&otilde;es e melhorias da equipe do OpenBSD.

<li><a href="http://www.gnu.org/software/groff/groff.html">Groff 1.15</a> processador 
de texto.

<li><a href="http://www.sendmail.org/">Sendmail 8.12.9</a> servidor de email.

<li><a href="http://www.isc.org/products/BIND/">BIND 9.2.2</a> servidor de DNS.
O OpenBSD implementou muitas melhorias na opera&ccedil;&atilde;o do chroot e 
outras quest&otilde;es relacionadas a seguran&ccedil;a.

<li><a href="http://lynx.isc.org/">Lynx 2.8.2rel.1</a> navegador web modo texto.
Com suporte a HTTPS adicionado, mais corre&ccedil;&otilde;es 
da equipe do OpenBSD. 

<li><a href="http://www.courtesan.com/sudo/">Sudo v1.6.7</a>, permitindo 
usu&aacute;rios rodar comandos individuais como root.

<li><a href="http://www.gnu.org/software/ncurses/ncurses.html">Ncurses
5.2.</a>

<li><a href="http://www.kame.net/">KAME</a> IPv6.

<li>KTH Kerberos 1.1.1.

<li>Heimdal 0.4e com corre&ccedil;&otilde;es 

<li><a href="http://www.openssh.com">OpenSSH 3.6</a>

</ul>

Como pode ser visto, a equipe do OpenBSD corrige frequentemente produtos
de terceiros (tipicamente) para melhorar a seguran&ccedil;a ou a
qualidade do c&oacute;digo. Em alguns casos, o usu&aacute;rio n&atilde;o
ver&aacute; diferen&ccedil;a na opera&ccedil;&atilde;o, em outros casos
H&Aacute; diferen&ccedil;as operacionais que podem causar impacto para
alguns usu&aacute;rios. Tenha em mente estas modifica&ccedil;&otilde;es
antes de adicionar vers&otilde;es diferentes do mesmo software.  

<p>
Naturalmente, outras aplica&ccedil;&otilde;es podem ser adicionadas 
atrav&eacute;s dos sistemas de 
<a href="../faq8.html#Packages">pacotes</a> e 
<a href="../faq8.html#Ports">ports</a> do OpenBSD.
<p>
<font color="#0000e0">
<a href= "index.html">[&Iacute;ndice do FAQ]</a>
<a href= "../faq2.html">[Para a Se&ccedil;&atilde;o 2 - Outras fontes de informa&ccedil;&atilde;o sobre o OpenBSD]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[back]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq1.html,v 1.49 ]<br> 
$Translation: faq1.html,v 1.3 2003/07/19 00:31:26 dsantos Exp $<br>
$OpenBSD: faq1.html,v 1.2 2003/07/19 12:29:19 jufi Exp $
</small>
</body>
</html> 
