<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>5 - Compilando o sistema a partir dos Fontes</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2007
by OpenBSD.">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<!-- Passes validator.w3.org.  Please keep it this way -->

<a href="../../pt/index.html">
<img alt="[OpenBSD]" height=30 width=141
src="../../images/smalltitle.gif" border="0">    
</a>
<p>
<font color= "#0000e0">
<a href= "index.html">[&Iacute;ndice do FAQ]</a>
<a href= "faq4.html">[Para a Se&ccedil;&atilde;o 4 - Guia de
Instala&ccedil;&atilde;o]</a>
<a href= "../faq6.html">[Para a Se&ccedil;&atilde;o 6 - Rede]</a>
</font>

<h1><font color="#e00000">5 - Compilando o Sistema a partir dos
Fontes</font></h1>
<hr>

<p>
<h3>Conte&uacute;do</h3>
<ul>
<li><a href="#Flavors">5.1 - Sabores do OpenBSD</a>
<li><a href="#WhySrc">5.2 - Por que eu deveria compilar meu sistema a
partir dos fontes?</a>
<li><a href="#Bld">5.3 - Compilando o OpenBSD a partir dos fontes</a>
<ul>
  <li><a href="#BldOverview">5.3.1 - Vis&atilde;o Geral</a>
  <li><a href="#BldBinary">5.3.2 - Instalar ou atualizar para os
bin&aacute;rios mais recentes dispon&iacute;veis</a>
  <li><a href="#BldGetSrc">5.3.3 - Obtendo o c&oacute;digo-fonte
apropriado</a>
  <li><a href="#BldKernel">5.3.4 - Compilando o kernel</a>
  <li><a href="#BldUserland">5.3.5 - Compilando aplica&ccedil;&otilde;es
de usu&aacute;rio (userland)</a>
</ul>
<li><a href="#Release">5.4 - Construindo uma vers&atilde;o</a>
<li><a href="#Xbld">5.5 - Compilando o X</a>
<li><a href="#Why">5.6 - Por que eu preciso de um kernel
customizado?</a>
<li><a href="#Options">5.7 - Compilando um kernel customizado</a>
<li><a href="#BootConfig">5.8 - Configura&ccedil;&atilde;o em tempo de
boot</a>
<li><a href="#config">5.9 - Usando o config(8) para modificar seu
kernel</a>
<li><a href="#VerboseBoot">5.10 - Obtendo output mais extenso durante o
boot</a>
<li><a href="#buildprobs">5.11 - Problemas comuns ao Compilar e
Construir</a>
   <ul>
   <li><a href="#sig11">5.11.1 - A compila&ccedil;&atilde;o parou com um
erro "Signal 11"</a>
   <li><a href="#snake">5.11.2 - "make build" falha com a mensagem
"cannot open output file snake: is a directory"</a>
   <li><a href="#ProbIPv6">5.11.3 - Meu sistema sem IPv6 n&atilde;o
funciona!</a>
   <li><a href="#ProbObj">5.11.4 - Oops! Esqueci de criar o
diret&oacute;rio <tt>/usr/obj</tt> primeiro!</a>
   <li><a href="#ProbObjPt">5.11.5 - Colocando o diret&oacute;rio
<tt>/usr/obj</tt> em uma parti&ccedil;&atilde;o pr&oacute;pria</a>
   <li><a href="#ProbSKIPDIR">5.11.6 - Como n&atilde;o compilar certas
partes da &aacute;rvore de c&oacute;digo?</a>
   <li><a href="#ProbMoreInfo">5.11.7 - Onde posso aprender mais sobre o
processo de compila&ccedil;&atilde;o?</a>
   <li><a href="#NoSnaps">5.11.8 - N&atilde;o vi nenhum snapshot no
servidor FTP. Para onde eles foram?</a>
   <li><a href="#NewCompiler">5.11.9 - Como dar bootstrap em uma nova
vers&atilde;o do compilador (<i>gcc</i>)?</a>
   <li><a href="#UpdateEtc">5.11.10 - Qual &eacute; a melhor maneira de
atualizar os diret&oacute;rios <tt>/etc</tt>, <tt>/var</tt>, e
<tt>/dev</tt>?</a>
   <li><a href="#Hierarchy">5.11.11 - H&aacute; alguma maneira
f&aacute;cil de fazer todas as modifica&ccedil;&otilde;es na hierarquia
do sistema de arquivos?</a>
   <li><a href="#ProbXComp">5.11.12 - Posso efetuar
compila&ccedil;&atilde;o cruzada (cross-compile)? Por que
n&atilde;o?</a>
   </ul>
</ul>
<hr>
<br>


<a name="Flavors"></a>
<h2>5.1 - Sabores do OpenBSD</h2>
<!-- XXXversion - revise doodle -->
H&aacute; tr&ecirc;s "sabores" do OpenBSD:
<ul>
<li><b>-release:</b> A vers&atilde;o lan&ccedil;ada em CD a cada seis
meses do OpenBSD.
<li><b>-stable:</b>  Release, juntamente com patches considerados
cr&iacute;ticos para seguran&ccedil;a e confiabilidade.
<li><b>-current:</b> &Eacute; onde o trabalho de desenvolvimento
est&aacute; sendo realizado, e, eventualmente, ir&aacute; se tornar o
pr&oacute;ximo release.
</ul>

Graficamente, o desenvolvimento desses sabores se parece com algo assim:

<blockquote>
<pre>
       ,------o-----------o----X                    4.1 Stable
       |      .           .
       |      .    ,------o---------o----X          4.2 Stable
       |      .    |      .         .
       |      .    |      .    ,----o----------o--&gt; 4.3 Stable
       |      .    |      .    |    .          .
       |      .    |      .    |    .    ,-----o--&gt; 4.4 Stable
       |      .    |      .    |    .    |     .
       |      .    |      .    |    .    |     .
 --&gt;4.1Rel-----&gt;4.2Rel-----&gt;4.3Rel-----&gt;4.4Rel----&gt;
Current 

          Time ---&gt;
</pre>
</blockquote>

<p>
<i>-Current</i> &eacute; onde o trabalho de desenvolvimento atual
&eacute; feito, e eventualmente ir&aacute; se tornar o pr&oacute;ximo
<i>-release</i> do OpenBSD. A cada seis meses, quando uma nova
vers&atilde;o do OpenBSD &eacute; lan&ccedil;ada, faz-se uma tag de
<i>-current</i>, e esta se torna <i>-release</i>: um ponto congelado na
hist&oacute;ria da &aacute;rvore de c&oacute;digo.
Cada <i>-release</i> nunca &eacute; alterada; &eacute; o que est&aacute;
dispon&iacute;vel em <a href="../../orders.html">CDs</a> e <a
href="../../ftp.html">servidores FTP</a>.

<p>
<i>-Stable</i> &eacute; baseada em <i>-release</i>, e &eacute; um ramo
da &aacute;rvore principal de desenvolvimento do OpenBSD. Quando
modifica&ccedil;&otilde;es muito importantes s&atilde;o feitas em
<i>-current</i>, elas s&atilde;o "back ported" (agregadas) aos ramos
<i>-stable</i>; por causa disso, <i>-stable</i> tamb&eacute;m &eacute;
conhecido como o "<i>patch branch</i>".
Na ilustra&ccedil;&atilde;o acima, as linhas verticais pontilhadas
denotam corre&ccedil;&otilde;es de bugs sendo incorporadas nos ramos
<i>-stable</i>. Voc&ecirc; tamb&eacute;m ir&aacute; notar que no exemplo
acima, o ramo <i>4.1-stable</i> terminou com o lan&ccedil;amento de
<i>4.3-release</i>, e o ramo <i>4.2-stable</i> terminou com o
lan&ccedil;amento de <i>4.4-release</i> -- vers&otilde;es antigas
s&atilde;o tipicamente suportadas at&eacute; duas vers&otilde;es
anteriores. H&aacute; uma demanda por tempo e recursos para suportar
vers&otilde;es antigas, e mesmo que gostemos de prover suporte
continuado para vers&otilde;es antigas, preferimos focar em novos
recursos. O ramo <i>-stable</i> &eacute;, por design, muito f&aacute;cil
de compilar a partir de <i>-release</i> da mesma vers&atilde;o (i.e.,
indo de <i>4.4-release</i> para <i>4.4-stable</i>).

<p>
O ramo <i>-stable</i> &eacute; <i>-release</i> somado a patches
encontrados na
<a href="../../errata.html">p&aacute;gina de errata</a>.
A opera&ccedil;&atilde;o de <i>-stable</i> &eacute; a mesma que o
<i>-release</i> no qual &eacute; baseado.
Se as <a href="http://www.openbsd.org/cgi-bin/man.cgi">man pages</a>
t&ecirc;m que mudar, essas modifica&ccedil;&otilde;es provavelmente
n&atilde;o ir&atilde;o para <i>-stable</i>. Em outras palavra, suporte a
novos dispositivos e novas funcionalidades N&Atilde;O ser&atilde;o
adicionadas a <i>-stable</i>.

<p>
&Eacute; v&aacute;lido apontar que o nome "<i>-stable</i>" n&atilde;o
quer dizer que <i>-current</i> n&atilde;o seja confi&aacute;vel.
Ao contr&aacute;rio, <i>-current</i> est&aacute; mudando e evoluindo, ao
passo que a opera&ccedil;&atilde;o e APIs de <i>-stable</i> n&atilde;o
ir&atilde;o mudar, ent&atilde;o voc&ecirc; n&atilde;o ter&aacute; que
reaprender seu sistema ou alterar qualquer arquivo de
configura&ccedil;&atilde;o, ou ter qualquer problema adicionando
aplica&ccedil;&otilde;es adicionais ao seu sistema.

<p>
De fato, como esperamos sempre melhorar continuamente o OpenBSD, o
objetivo &eacute; que <i>-current</i> seja mais confi&aacute;vel, mais
seguro, e claro, possua mais funcionalidades que <i>-stable</i>.
Em linguagem simples, a "melhor" vers&atilde;o do OpenBSD &eacute;
<i>-current</i>.

<p>
Aviso: <i>-current</i> &eacute; um alvo em movimento.
Ele muda minuto a minuto, e pode mesmo mudar v&aacute;rias vezes durante
o tempo em que se obt&eacute;m o c&oacute;digo fonte.
Ainda que os desenvolvedores trabalhem duro para assegurar que o sistema
sempre compile e que n&atilde;o haja bugs de grande impacto, &eacute;
completamente poss&iacute;vel obter os fontes de <i>-current</i> e
n&atilde;o conseguir compil&aacute;-los, e cinco minutos depois tudo
estar&aacute; bem.
H&aacute; tamb&eacute;m flag days e grandes mudan&ccedil;as do sistema
nas quais os desenvolvedores navegam com ferramentas de um passo, o que
significa que atualiza&ccedil;&atilde;o por meio dos fontes n&atilde;o
ser&aacute; poss&iacute;vel. <b> Se voc&ecirc; n&atilde;o est&aacute;
preparado para lidar com isto, evite <i>-current</i>.</b>

<p>
A maioria dos usu&aacute;rios deve utilizar ou <i>-stable</i> ou
<i>-release</i>. Dito isso, muitas pessoas mesmo assim utilizam
<i>-current</i> em sistemas de produ&ccedil;&atilde;o, e &eacute;
importante que algumas o fa&ccedil;am para indentificar bugs e testar
novas funcionalidades. No entanto, se voc&ecirc; n&atilde;o sabe como
descrever corretamente, diagnosticar e lidar com um problema, n&atilde;o
diga para voc&ecirc; mesmo (ou qualquer outra pessoa) que voc&ecirc;
est&aacute; "ajudando o projeto" ao utilizar <i>-current</i>.
"N&atilde;o funcionou!" n&atilde;o &eacute; um <a
href="../../report.html#bugtypes">bug report &uacute;til</a>. "As
mudan&ccedil;as recentes ao driver pciide quebraram a compatibilidade
com minha interface IDE baseada em Slugchip, segue dmesg dos sistemas
funcional e inoperante..." pode ser um report &uacute;til.

<p>
H&aacute; momentos em que usu&aacute;rios "normais" podem querer
utilizar o que h&aacute; de mais recente e executar <i>-current</i>. A
raz&atilde;o mais comum &eacute; que o usu&aacute;rio tem um dispositivo
que n&atilde;o &eacute; suportado por <i>-release</i> (e portanto,
tamb&eacute;m n&atilde;o o &eacute; por <i>-stable</i>), ou deseja
utilizar uma nova funcionalidade dispon&iacute;vel em <i>-current</i>.
Neste caso, a escolha pode ser ou <i>-current</i> ou n&atilde;o usar o
dispositivo, sendo <i>-current</i> o menor dos males. Contudo,
n&atilde;o espere que os desenvolvedores sejam prestativos com novatos.

<h3>Snapshots</h3>
Entre vers&otilde;es formais do OpenBSD, <i>snapshots</i> s&atilde;o
disponibilizados atrav&eacute;s dos <a href="../../ftp.html">espelhos
FTP</a>. Como o nome indica, estes s&atilde;o compila&ccedil;&otilde;es
feitas com qualquer c&oacute;digo que estivesse na &aacute;rvore no
momento em que o respons&aacute;vel obteve uma c&oacute;pia do
c&oacute;digo para aquela plataforma em particular. Lembre-se, em
algumas plataformas, DIAS podem transcorrer at&eacute; que a
compila&ccedil;&atilde;o do snapshot esteja completa e seja
disponibilizada para distribui&ccedil;&atilde;o. N&atilde;o h&aacute;
promessas de que os snapshots sejam completamente funcionais, ou mesmo
que instalem. Muitas vezes, uma mudan&ccedil;a que precise ser testada
pode motivar a cria&ccedil;&atilde;o de um snapshot. Algumas plataformas
t&ecirc;m snapshots criados com frequ&ecirc;ncia quase di&aacute;ria,
enquanto outras s&atilde;o muito menos frequentes. Se voc&ecirc; deseja
rodar <i>-current</i>, um snapshot recente &eacute; muitas vezes tudo
que voc&ecirc; precisa, e atualizar para um snapshot &eacute; um ponto
de partida necess&aacute;rio antes de tentar compilar <i>-current</i> a
partir dos fontes.

<p>
Algumas vezes se pergunta se h&aacute; alguma maneira de obter uma
c&oacute;pia exata do c&oacute;digo usado para construir um snapshot. A
resposta &eacute; n&atilde;o. Primeiro, n&atilde;o h&aacute; vantagem em
se fazer isto. Segundo, os snapshots s&atilde;o constru&iacute;dos de
acordo com o desejado, levando-se em conta restri&ccedil;&otilde;es de
tempo e recursos. Em plataformas r&aacute;pidas, v&aacute;rios snapshots
podem ser liberados em um &uacute;nico dia. Em plataformas mais lentas,
pode demorar uma semana ou mais para compilar um snapshot. Prover tags
ou marcadores na &aacute;rvore de c&oacute;digo para cada snapshot seria
muito pouco pr&aacute;tico. Terceiro, snapshots frequentemente
cont&eacute;m c&oacute;digo experimental que ainda n&atilde;o foi
enviado &agrave; &aacute;rvore de c&oacute;digo.

<h3>Upgrades e Updates</h3>
Voc&ecirc; ir&aacute; frequentemente ver refer&ecirc;ncias a "upgrades"
e "updates" feitas a uma instala&ccedil;&atilde;o do OpenBSD.
Muito embora essas palavras possuam significados similares, elas
s&atilde;o usadas de forma ligeiramente diferente no OpenBSD.

<p>
<b>Upgrade</b> &eacute; o processo de instalar uma nova vers&atilde;o do
OpenBSD, com novas funcionalidades.
Por exemplo, indo da vers&atilde;o v4.3 para v4.4, ou indo do snapshot
de 12 de Junho para o snapshot de 20 de Junho.
Ao fazer um upgrade, voc&ecirc; ter&aacute;, tipicamente, que consultar
as p&aacute;ginas <a href="../current.html">Acompanhando -current</a> ou
o <a href="../upgrade44.html">guia de Upgrade</a> (ao mudar de
vers&otilde;es) para fazer as modifica&ccedil;&otilde;es
necess&aacute;rias para executar a vers&atilde;o atualizada (upgraded)
do OpenBSD.

<br>
<b>Update</b> &eacute; o processo de aplicar patches a um sistema para
melhorar sua opera&ccedil;&atilde;o SEM alterar a funcionalidade
b&aacute;sica ou compatibilidade bin&aacute;ria.
Isto &eacute; tipicamente feito seguindo o <a
href="../faq10.html#Patches">processo de patching via fonte</a> ou
seguindo o <a href="../../stable.html">processo stable</a>.
Quando voc&ecirc; efetua um "update" ao seu sistema, ele vai de
<i>-release</i> para <i>-stable</i> (ou <i>-release</i> com patches) da
mesma vers&atilde;o, por exemplo, 4.4-release para 4.4-stable.
Voc&ecirc; pode ent&atilde;o efetuar novos updates para <i>-stable</i>
mais novos da mesma vers&atilde;o.
O processo de update &eacute; tipicamente muito f&aacute;cil, j&aacute;
que nenhum arquivo do <tt>/etc</tt> ou outras
configura&ccedil;&otilde;es do sistema precisam ser alterados.

<p>
Ent&atilde;o, voc&ecirc; pode instalar um sistema (por exemplo,
4.3-release) a partir do CD, ent&atilde;o efetuar updates para
4.3-stable algumas vezes, ent&atilde;o um upgrade para 4.4-release a
partir do CD, e ent&atilde;o alguns updates antes de outro upgrade para
a pr&oacute;xima vers&atilde;o.

<h3>Mantendo tudo em Sincronia</h3>
&Eacute; importante entender que o OpenBSD &eacute; um Sistema
Operacional, que deve ser tomado como um todo, n&atilde;o como um kernel
junto com algumas ferramentas em um grande pacote. Voc&ecirc; deve se
certificar de que o kernel, "userland" (as ferramentas e arquivos
agregados) e a &aacute;rvore de <a
href="../faq15.html#Ports"><tt>ports</tt></a> est&atilde;o todos em
sincronia, ou coisas ruins ir&atilde;o acontecer. Em outras palavras
(porque as pessoas continuam insistindo nesse erro), voc&ecirc;
n&atilde;o pode ter <tt>ports</tt> novos em folha em um sistema defasado
em mais de um m&ecirc;s, ou recompilar um kernel a partir dos fontes de
<i>-current</i> e esperar que funcione com um userland de
<i>-release</i>. Sim, isto significa que voc&ecirc; tem que efetuar um
upgrade em seu sistema se voc&ecirc; quer rodar um novo programa que foi
adicionado hoje &agrave; &aacute;rvore de ports. Desculpe, mas,
novamente, o OpenBSD possui um n&uacute;mero limitado de recursos
dispon&iacute;veis.

<p>
Voc&ecirc; deve tamb&eacute;m compreender que o processo de upgrade
&eacute; suportado <b>em apenas uma dire&ccedil;&atilde;o: do mais
antigo para o mais novo</b>, e de <i>-stable</i> para <i>-current</i>.
Voc&ecirc; n&atilde;o pode rodar <i>4.4-current</i> (ou um snapshot), e
ent&atilde;o decidir que isto &eacute; muito arriscado para voc&ecirc;,
e voltar para <i>4.4-stable</i>. Voc&ecirc; est&aacute; por conta
pr&oacute;pria se decidir por qualquer caminho al&eacute;m da
op&ccedil;&atilde;o suportada de reinstalar seu sistema do zero, e
n&atilde;o espere assist&ecirc;ncia da equipe de desenvolvimento do
OpenBSD.

<p>
Sim, isto significa que voc&ecirc; deve pensar bastante antes de decidir
usar <i>-current</i>.

<a name="WhySrc"></a>
<h2>5.2 - Por que eu deveria compilar meu sistema a partir dos
fontes?</h2>
Na realidade, muito provavelmente voc&ecirc; n&atilde;o deveria.

<p>
Algumas raz&otilde;es para N&Atilde;O compilar a partir dos fontes:
<ul>
<li>Compilar o seu sistema como uma maneira de efetuar upgrade
n&atilde;o &eacute; suportado.
<li>Voc&ecirc; N&Atilde;O ir&aacute; obter melhor performance do sistema
ao compilar seu pr&oacute;prio sistema.
<li>Mudar op&ccedil;&otilde;es do compilador tem mais chance de tornar
seu sistema inutiliz&aacute;vel do que de melhor&aacute;-lo.
</ul>

Algumas raz&otilde;es pelas quais voc&ecirc; pode querer ou precise
compilar a partir dos fontes:
<ul>
<li>Testar ou desenvolver novas funcionalidades.
<li>Compilar o sistema exige muito do computador, e pode ser uma maneira
de certificar que o sistema que voc&ecirc; acaba de montar ou comprar
est&aacute; em boa condi&ccedil;&atilde;o operacional.
<li>Voc&ecirc; deseja acompanhar o <a href="../../stable.html">ramo
stable.</a>
<li>Voc&ecirc; deseja fazer uma vers&atilde;o altamente customizada do
OpenBSD para alguma aplica&ccedil;&atilde;o especial.
</ul>

<p>
A equipe do OpenBSD disponibiliza novos snapshots baseados no
c&oacute;digo de <i>-current</i> regularmente, para todas as
plataformas.
&Eacute; prov&aacute;vel que isto seja tudo que voc&ecirc; precisa para
rodar <i>-current</i>.

<p>
A raz&atilde;o mais comum para compilar a partir dos fontes &eacute;
para acompanhar o ramo <i>-stable</i>, onde compilar a partir dos fontes
&eacute; a &uacute;nica op&ccedil;&atilde;o suportada.

<a name="Bld"></a>
<h2>5.3 - Compilando o OpenBSD a partir dos fontes</h2>

<a name="BldOverview"></a>
<h3>5.3.1 - Vis&atilde;o Geral</h3>

Compilar o OpenBSD a partir dos fontes envolve um n&uacute;mero de
passos:
<ul>
<li><a href="#BldBinary">Atualizar para os bin&aacute;rios mais recentes
dispon&iacute;veis.</a>
<li><a href="#BldGetSrc">Obtendo o c&oacute;digo-fonte apropriado.</a>
<li><a href="#BldKernel">Compilando o novo kernel e efetuando boot a
partir dele.</a>
<li><a href="#BldUserland">Compilando o "userland" ("make build").</a>
</ul>

H&aacute; alguns passos adicionais que alguns usu&aacute;rios podem
querer executar, dependendo do objetivo da compila&ccedil;&atilde;o e se
o X est&aacute; instalado:
<ul>
<li><a href="#Release">Construindo uma "vers&atilde;o".</a>
<li><a href="#Xbld">Compilando o X.</a>
</ul>


<a name="BldBinary"></a>
<h3>5.3.2 - Instalar ou Atualizar para os bin&aacute;rios mais recentes
dispon&iacute;veis</h3>

O primeiro passo ao compilar a partir dos fontes &eacute; se certificar
de que voc&ecirc; possui os bin&aacute;rios mais recentes
dispon&iacute;veis instalados.

Use esta tabela para ver onde voc&ecirc; est&aacute;, onde voc&ecirc;
quer chegar, e com quais bin&aacute;rios voc&ecirc; deve come&ccedil;ar:

<p>
<table border="1" style="empty-cells: show;">
<tr>
  <td><b>Voc&ecirc; est&aacute; em</b></td> <td><b>Objetivo</b></td>
  <td><b>Upgrade bin&aacute;rio para</b></td> <td><b>e ent&atilde;o
...</b></td>
</tr>
<tr>
  <td> Antigo -release </td> <td> Novo release </td> <td> Mais recente
release </td>
  <td> Feito! </td>
</tr>
<tr>
  <td> -release </td> <td> -stable </td> <td> Mais recente release </td>
  <td>Obter &amp; compilar <i>-stable</i></td>
</tr>
<tr>
  <td> Antigo -stable</td> <td> -stable </td> <td> Mais recente release
</td>
  <td>Obter &amp; compilar <i>-stable</i></td>
</tr>
<tr>
  <td> -release </td> <td> -current </td> <td> Mais recente Snapshot
</td>
  <td> (opcional) Obter &amp; compilar <i>-current</i>
</tr>
<tr>
  <td> Antigo -current </td> <td> -current </td> <td> Mais recente
Snapshot </td>
  <td> (opcional) Obter &amp; compilar <i>-current</i>
</tr>
</table>

<p>
&Eacute; recomendado que voc&ecirc; instale os bin&aacute;rios usando a
op&ccedil;&atilde;o "Upgrade" da m&iacute;dia de
instala&ccedil;&atilde;o.
Se isso n&atilde;o for poss&iacute;vel, voc&ecirc; tamb&eacute;m pode
descompactar os bin&aacute;rios como descrito <a
href="../upgrade44.html">aqui</a>.
De qualquer maneira, voc&ecirc; deve executar todo o processo de
upgrade, incluindo a cria&ccedil;&atilde;o de usu&aacute;rios e
quaisquer outras modifica&ccedil;&otilde;es necess&aacute;rias ao
diret&oacute;rio <tt>/etc</tt>.


<a name="BldGetSrc"></a>
<h3>5.3.3 - Obtendo o c&oacute;digo-fonte apropriado</h3>
O c&oacute;digo-fonte do OpenBSD &eacute; gerenciando usando o sistema
de controle de vers&otilde;es <a
href="http://ximbiot.com/cvs/cvshome/">CVS</a>, e <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1">cvs(1)</a>
&eacute; usado para obter uma c&oacute;pia dos fontes desejados para sua
m&aacute;quina local para compila&ccedil;&atilde;o.
Isto pode ser feito usando um servidor <a
href="../../anoncvs.html">AnonCVS</a> (uma m&aacute;quina contendo uma
c&oacute;pia acess&iacute;vel publicamente de todo o reposit&oacute;rio
CVS usado pelo projeto OpenBSD) ou um reposit&oacute;rio CVS local que
voc&ecirc; mantenha usando os programas <a
href="../../cvsup.html">CVSup</a>, ou <a
href="../../cvsync.html">CVSync</a>, dipon&iacute;veis como <a
href="../faq15.html#PkgMgmt">pacotes</a>.
O CVSup tamb&eacute;m pode ser usado em modo "checkout", mas isso
n&atilde;o ser&aacute; coberto aqui.
Se voc&ecirc; tem m&uacute;ltiplas m&aacute;quinas em que voc&ecirc;
deseja manter &aacute;rvores de c&oacute;digo-fonte, voc&ecirc; pode
achar interessante ter um reposit&oacute;rio CVS local, criado e mantido
usando CVSup ou CVSync.

<p>
Ap&oacute;s decidir qual <a href="../../anoncvs.html">servidor
AnonCVS</a> voc&ecirc; deseja utilizar, voc&ecirc; deve fazer um
"checkout" da &aacute;rvore de c&oacute;digo, e ap&oacute;s isso,
voc&ecirc; mant&eacute;m a &aacute;rvore atrav&eacute;s de "updates",
para obter arquivos atualizados para sua &aacute;rvore local.

<p>
O comando
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1">CVS(1)</a>
tem muitas op&ccedil;&otilde;es, algumas delas s&atilde;o
<i><b>requeridas</b></i> para o checkout e update de uma &aacute;rvore
&uacute;til. Outros comandos podem causar uma &aacute;rvore
n&atilde;o-funcional. Seguir e compreender as instru&ccedil;&otilde;es
aqui presentes &eacute; muito importante.

<p>
<b>Acompanhando <i>-current</i></b><br>
<blockquote>
Neste caso, iremos assumir que estamos usando um servidor AnonCVS
p&uacute;blico, <b>anoncvs@anoncvs.example.org:/cvs</b>. Tamb&eacute;m
iremos assumir que voc&ecirc; est&aacute; usando o <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=sh&amp;sektion=1">sh(1)</a>
como seu shell de comando, se voc&ecirc; est&aacute; usando um shell
diferente, ter&aacute; que ajustar alguns desses comandos.

<p>
Para fazer o checkout de uma &aacute;rvore CVS de <i>-current</i>,
voc&ecirc; pode fazer o seguinte:

<pre>
    # <b>cd /usr</b>
    # <b>export CVSROOT=anoncvs@anoncvs.example.org:/cvs</b>
    # <b>cvs -d$CVSROOT checkout -P src</b>
</pre>

<p>
Uma vez que voc&ecirc; possua uma &aacute;rvore, voc&ecirc; pode
atualiz&aacute;-la posteriormente:
<pre>
    # <b>cd /usr/src</b>
    # <b>export CVSROOT=anoncvs@anoncvs.example.org:/cvs</b>
    # <b>cvs -d$CVSROOT up -Pd</b>
</pre>
</blockquote>

<!-- XXXrelease -->
<b>Acompanhando <i>-Stable</i></b><br>
<blockquote>
Se voc&ecirc; deseja fazer o checkout de um "ramo" alternativo da
&aacute;rvore, como o ramo <i>-stable</i>, voc&ecirc; ir&aacute; usar o
modificador "<tt>-r</tt>" em seu checkout:
<pre>
    # <b>cd /usr</b>
    # <b>export CVSROOT=anoncvs@anoncvs.example.org:/cvs</b>
    # <b>cvs -d$CVSROOT checkout -rOPENBSD_4_4 -P src</b>
</pre>

Isto ir&aacute; baixar os arquivos src do ramo OPENBSD_4_4, que &eacute;
tamb&eacute;m conhecido como o "Patch branch" ou "<a
href="../../stable.html">-stable</a>".
Voc&ecirc; atualizaria o c&oacute;digo de forma semelhante:
<pre>
    # <b>cd /usr/src</b>
    # <b>export CVSROOT=anoncvs@anoncvs.example.org:/cvs</b>
    # <b>cvs -d$CVSROOT up -rOPENBSD_4_4 -Pd</b>
</pre>

Na realidade, o CVS &eacute; esperto o suficiente para adicionar uma
"Tag" ao sistema de arquivos que voc&ecirc; acabou de fazer checkout, de
modo que voc&ecirc; n&atilde;o tem que lembrar a parte
"<tt>-rOPENBSD_4_4</tt>" da linha de comando, ele ir&aacute; lembrar
isto pra voc&ecirc; at&eacute; que voc&ecirc; limpe a tag explicitamente
ou configure uma nova usando a op&ccedil;&atilde;o "<tt>-A</tt>" em
"<tt>update</tt>".
No entanto, &eacute; provavelmente melhor fornecer
informa&ccedil;&otilde;es a mais em suas linhas de comando para o CVS do
que a menos.
</blockquote>

<p>
Muito embora apenas a &aacute;rvore "<tt>src</tt>" tenha sido mostrada
at&eacute; agora, voc&ecirc; ir&aacute; fazer os mesmos passos para
"<tt>xenocara</tt>" e "<tt>ports</tt>".
Como todas as parted do OpenBSD devem ser mantidas em sincronia, todas
as &aacute;rvores que voc&ecirc; utilizar devem ter seu checkout e
update feitos ao mesmo tempo.
Voc&ecirc; pode combinar os checkouts em uma linha (<i>-stable</i> no
exemplo):
<pre>
    # <b>export CVSROOT=anoncvs@anoncvs.example.org:/cvs</b>
    # <b>cd /usr</b>
    # <b>cvs -d$CVSROOT checkout -rOPENBSD_4_4 -P src ports xenocara</b>
</pre>

Contudo, updates devem ser feitos diret&oacute;rio-a-diret&oacute;rio.

<p>
Neste ponto, tendo voc&ecirc; seguido <i>-stable</i> ou <i>-current</i>,
voc&ecirc; dever&aacute; ter uma &aacute;rvore de c&oacute;digo
utiliz&aacute;vel.
Tenha muito cuidado ao checar qual &aacute;rvore de c&oacute;digo
voc&ecirc; est&aacute; baixando -- &eacute; f&aacute;cil terminar
compilando <i>-current</i> quanto voc&ecirc; estava almejando
<i>-stable</i>.

<h4>Pr&eacute;-carregando a &aacute;rvore: <tt>src.tar.gz,
sys.tar.gz</tt></h4>
Mesmo que voc&ecirc; possa fazer o download de toda a &aacute;rvore de
c&oacute;digo a partir de um servidor AnonCVS, voc&ecirc; frequentemente
pode economizar muito tempo e banda de rede fazendo um
"pr&eacute;-carregamento" da &aacute;rvore de c&oacute;digo com os
fontes tanto do CD do OpenBSD como de um servidor FTP.
Isto &eacute; particularmente verdadeiro se voc&ecirc; est&aacute;
rodando <a href="../../stable.html"><i>-stable</i></a>, j&aacute; que
relativamente poucos arquivos mudam entre esta vers&atilde;o e
<i>-release</i>, na qual &eacute; baseada.

<p>
Para extrair a &aacute;rvore de fontes a partir do CD para
<i>/usr/src</i> (assumindo que o CD est&aacute; montado em /mnt):
<pre>
    # <b>cd /usr/src; tar xzf /mnt/src.tar.gz</b>
    # <b>cd /usr; tar xzf /mnt/xenocara.tar.gz</b>
    # <b>cd /usr; tar xzf /mnt/ports.tar.gz</b>
</pre>

Os arquivos fonte dispon&iacute;veis para download a partir dos
servidores FTP s&atilde;o separados em dois arquivos para minimizar o
tempo de download para aqueles que desejam trabalhar apenas com uma
parte da &aacute;rvore. Os dois arquivos s&atilde;o <tt>sys.tar.gz</tt>,
que cont&eacute;m arquivos usados para criar o kernel, e
<tt>src.tar.gz</tt> que cont&eacute;m todas as outras ferramentas de
"userland" exceto a &aacute;rvore de ports e os fontes do X11.
Em geral, no entanto, voc&ecirc; geralmente ir&aacute; querer ambos
instalados. Assumindo que os arquivos baixados, <tt>src.tar.gz</tt> e
<tt>sys.tar.gz</tt>, est&atilde;o em <tt>/usr</tt>:
  
<pre>
    # <b>cd /usr/src</b>
    # <b>tar xzf ../sys.tar.gz</b>
    # <b>tar xzf ../src.tar.gz</b>
    # <b>cd /usr</b>
    # <b>tar xzf xenocara.tar.gz</b>
    # <b>tar xzf ports.tar.gz</b>
</pre>

<p>
Nem todas as pessoas ir&atilde;o querer descompactar todos os conjuntos
de arquivos, mas como o sistema deve ser mantido em sincronia,
voc&ecirc; geralmente dever&aacute; configurar todas as partes da
&aacute;rvore.


<a name="CVSTips"></a>
<h4>Dicas comuns para o CVS</h4>

Como indicado anteriormente, algumas op&ccedil;&otilde;es s&atilde;o
obrigat&oacute;rias para obter uma &aacute;rvore <tt>/src</tt>
v&aacute;lida no OpenBSD.
A op&ccedil;&atilde;o "<tt>-P</tt>" acima &eacute; uma dessas: ela faz o
"prune" (remove) diret&oacute;rios vazios.
Ao longo dos anos, diret&oacute;rios foram criados e deletados na
&aacute;rvore de c&oacute;digo do OpenBSD, e algumas vezes os nomes de
antigos diret&oacute;rios s&atilde;o usados atualmente como nomes de
arquivo.
Sem a op&ccedil;&atilde;o "<tt>-P</tt>", a &aacute;rvore de
c&oacute;digo que voc&ecirc; acaba de fazer checkout N&Atilde;O
IR&Aacute; compilar com sucesso.

<p>
Mais ou menos a mesma coisa acontece com a op&ccedil;&atilde;o
<tt>-d</tt> para o comando 'update' -- ela cria novos diret&oacute;rios
que podem ter sido adicionados &agrave; &aacute;rvore desde seu checkout
inicial.
Para fazer um update com sucesso, voc&ecirc; deve usar as
op&ccedil;&otilde;es <tt>-Pd</tt>.

<p>
Usu&aacute;rios experientes do CVS podem estar se perguntando porque o
CVSROOT foi especificado e usado neste exemplo, j&aacute; que o cvs(1)
ir&aacute; gravar a localiza&ccedil;&atilde;o do servidor CVS na
&aacute;rvore de c&oacute;digo cujo checkout foi feito.
Isto est&aacute; correto, mas h&aacute; momentos em que voc&ecirc; pode
precisar alterar o servidor anoncvs padr&atilde;o, e muitas pessoas
recomendam <i>sempre</i> especificar o reposit&oacute;rio
explicitamente.
&Eacute; tamb&eacute;m v&aacute;lido notar que muito embora a
v&aacute;riavel de ambiente CVSROOT possa ser usada diretamente pelo
cvs(1), ela &eacute; usada apenas se nada mais a preceder (i.e., o
cvs(1) terminaria em erro sem ela), enquanto que especific&aacute;-la na
linha de comando do cvs(1) precede qualquer outro valor.

<p>
Em geral, &eacute; &uacute;til usar um arquivo <tt>.cvsrc</tt> em seu
diret&oacute;rio home para especificar valores padr&atilde;o para
algumas dessas op&ccedil;&otilde;es.
Eis um arquivo <tt>.cvsrc</tt> de exemplo:
<pre>
    $ <b>more ~/.cvsrc</b>
    cvs -q -danoncvs@anoncvs.example.org:/cvs
    diff -up
    update -Pd
    checkout -P
</pre>

Este arquivo ir&aacute; fazer o cvs(1) usar o servidor
<tt>anoncvs@anoncvs.example.org:/cvs</tt>, suprimir output geralmente
desnecess&aacute;rio ("<tt>-q</tt>" &eacute; "quieto") para todas as
opera&ccedil;&otilde;es, um comando "cvs up" tem por padr&atilde;o usar
<tt>-Pd</tt>, um comando "cvs diff" tem por padr&atilde;o prover
"unified diffs" devido &agrave; op&ccedil;&atilde;o "<tt>-u</tt>", e um
"cvs checkout" ir&aacute; usar a op&ccedil;&atilde;o "<tt>-P</tt>".
Muito embora isto seja conveniente, se voc&ecirc; esquecer que este
arquivo existe, ou tentar executar comandos aos quais voc&ecirc; se
acostumou em uma m&aacute;quina sem este arquivo, voc&ecirc; ter&aacute;
problemas.

<p>
Como as &aacute;rvores de fontes consistem de um grande n&uacute;mero de
arquivos em sua maioria pequenos, ativar <a
href="../faq14.html#SoftUpdates">soft updates</a> para a
parti&ccedil;&atilde;o na qual se encontra a &aacute;rvore de
c&oacute;digo ir&aacute; frequentemente prover uma performance
significativamente melhor.


<a name="BldKernel"></a>
<a name="Building"></a>  <!-- Old tag -->
<h3>5.3.4 - Compilando o kernel</h3>
Iremos assumir que voc&ecirc; quer compilar um kernel padr&atilde;o
(GENERIC ou GENERIC.MP) aqui.
Normalmente, isto &eacute; o que voc&ecirc; quer fazer.
<i>N&Atilde;O</i> considere a op&ccedil;&atilde;o de compilar um kernel
customizado se voc&ecirc; n&atilde;o estiver acostumado ao processo
padr&atilde;o de compila&ccedil;&atilde;o.

<p>
Obviamente, o kernel &eacute; uma por&ccedil;&atilde;o ALTAMENTE
dependente de hardware do sistema.
O c&oacute;digo do kernel est&aacute; no diret&oacute;rio
<tt>/usr/src/sys</tt>. Algumas partes do c&oacute;digo do kernel do
OpenBSD s&atilde;o usadas em todas as plataformas, outras s&atilde;o
muitos espec&iacute;ficas para um processador ou arquitetura.
Se voc&ecirc; olhar no diret&oacute;rio <tt>/usr/src/sys/arch/</tt>,
poder&aacute; ver algumas coisas que parecer&atilde;o um pouco confusas
-- por exemplo, h&aacute; os diret&oacute;rios <tt>mac68k</tt>,
<tt>m68k</tt> e <tt>mvme68k</tt>. Neste caso, ambos os sistemas mvme68k
e mac68k utilizam o mesmo processador, mas as m&aacute;quinas nas quais
s&atilde;o baseados s&atilde;o muito diferentes, e portanto requerem um
kernel muito diferente (h&aacute; muito mais no design de um computador
do que seu processador!).
Contudo, algumas partes do kernel s&atilde;o comuns a ambos, essas
partes ficam no diret&oacute;rio m68k.
Se voc&ecirc; est&aacute; simplesmente compilando um kernel, os
diret&oacute;rios base de arquitetura como <tt>m68k</tt> n&atilde;o
s&atilde;o nada com que se procupar, voc&ecirc; ir&aacute; trabalhar
exclusivamente com diret&oacute;rios de "arquitetura composta", como
<tt>mvme68k</tt>.

<p>
Kernels s&atilde;o constru&iacute;dos com base nos <a
href="#Options">arquivos de configura&ccedil;&atilde;o do kernel</a>,
que est&atilde;o localizados no diret&oacute;rio
<tt>/usr/src/sys/arch/&lt;<i>sua plataforma</i>&gt;/conf</tt>.
Compilar o kernel consiste em utilizar o programa
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>
para criar e popular um diret&oacute;rio de compila&ccedil;&atilde;o do
kernel, que ir&aacute; ficar em
<tt>/usr/src/sys/arch/&lt;<i>sua
plataforma</i>&gt;/compile/&lt;<i>KernelName</i>&gt;</tt>.
Neste exemplo, iremos assumir que voc&ecirc; est&aacute; usando a
plataforma i386:

<blockquote><pre>
# <b>cd /usr/src/sys/arch/i386/conf</b>
# <b>config GENERIC</b>
# <b>cd ../compile/GENERIC</b>
# <b>make clean && make depend && make</b>
    <i>[...lots of output...]</i>
# <b>make install</b>
</pre></blockquote>

Substitua "<tt>i386</tt>" na primeira linha pelo nome da sua plataforma.
O comando
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=machine&amp;sektion=1">machine(1)</a>
pode lhe dizer qual o nome da sua plataforma, ent&atilde;o uma
generaliza&ccedil;&atilde;o &oacute;bvia seria usar, ao inv&eacute;s
disso, o comando "<tt>cd /usr/src/sys/arch/`machine`/conf</tt>" na
primeira linha.

<p>
Neste ponto, reinicie sua m&aacute;quina para ativar este novo kernel.
Note que o novo kernel deve estar rodando antes do pr&oacute;ximo passo,
mas se voc&ecirc; tiver seguido o conselho <a
href="#BldBinary">acima</a> sobre atualizar para o snapshot mais recente
dispon&iacute;vel, n&atilde;o deve importar tanto. Algumas, vezes, no
entanto, as APIs mudam, e o kernel antigo n&atilde;o ser&aacute; capaz
de executar novas aplica&ccedil;&otilde;es, mas o kernel novo geralmente
ir&aacute; suportar as antigas.

<h4>Varia&ccedil;&atilde;o do processo acima: &aacute;rvore de
c&oacute;digo somente-leitura</h4>
Algumas vezes, voc&ecirc; pode querer assegurar que seu diret&oacute;rio
<tt>/usr/src/sys</tt> permane&ccedil;a intocado.
Isto pode ser feito utilizando o seguinte processo:

<blockquote><pre>
$ <b>cd <i>/somewhere</i></b>
$ <b>cp /usr/src/sys/arch/i386/conf/GENERIC .</b>
$ <b>config -s /usr/src/sys -b . GENERIC</b>
$ <b>make clean && make depend && make</b>
   ... lots of output ...
</pre></blockquote>

Note que voc&ecirc; pode compilar o kernel sem acesso de root, mas
voc&ecirc; deve ter acesso ao root para instalar o kernel.


<a name="BldUserland"></a>
<h3>5.3.5 - Compilando aplica&ccedil;&otilde;es de usu&aacute;rio
(userland)</h3>

H&aacute; um processo espec&iacute;fico usado pelo OpenBSD.
Processos usado em outro SOs com os quais voc&ecirc; esteja
familiriarizado muito provavelmente n&atilde;o ir&atilde;o funcionar no
OpenBSD, e ir&atilde;o rir de voc&ecirc; quando perguntar o
porqu&ecirc;.

<p>
<ul>
<li>Limpe seu diret&oacute;rio <tt>/usr/obj</tt> e reconstrua os links
simb&oacute;licos:
<blockquote><pre>
# <b>rm -rf /usr/obj/*</b>
# <b>cd /usr/src</b>
# <b>make obj</b>
</pre></blockquote>

Note que o uso do diret&oacute;rio <tt>/usr/obj</tt> &eacute;
madat&oacute;rio.
N&atilde;o executar este passo antes de compilar o restante da
&aacute;rvore ir&aacute; provavelmente deixar sua &aacute;rvore
<tt>/src</tt> em um mau estado.

<p>
<li>Certifique-se de que todos os diret&oacute;rios apropriados
est&atilde;o criados.
<blockquote><pre>
# <b>cd /usr/src/etc && env DESTDIR=/ make distrib-dirs</b>
</pre></blockquote>

<p>
<li>Compile o sistema:
<blockquote><pre>
# <b>cd /usr/src</b>
# <b>make build</b>
</pre></blockquote>
Isto compila e instala todas as ferramentas de "userland" na ordem
apropriada.
Este &eacute; um passo um tanto quanto demorado -- um computador muito
r&aacute;pido pode concluir essa tarefa em menos de uma hora, um
m&aacute;quina muito lenta pode levar v&aacute;rios dias.
Quando este passo estiver completo, voc&ecirc; ter&aacute;
bin&aacute;rios rec&eacute;m-compilados posicionados no sistema.

<p>
<li><b>Se compilando <i>-current</i>:</b> Atualize <tt>/dev</tt> e
<tt>/etc</tt>, com as modifica&ccedil;&otilde;es listadas em
<a href="../current.html">current.html</a>.
Se acompanhando -stable ap&oacute;s um <a
href="../upgrade44.html">processo de upgrade</a> apropriado ou uma
instala&ccedil;&atilde;o dos <a href="#BldBinary">bin&aacute;rios
iniciais apropriados</a>, este passo n&atilde;o &eacute;
necess&aacute;rio ou desejado.

</ul>


<a name="Release"></a>
<a name="BldRelease"></a> <!-- old tag -->
<h2>5.4 - Construindo uma vers&atilde;o</h2>
<h3>O que uma "vers&atilde;o", e porque eu iria querer fazer uma?</h3>
Uma vers&atilde;o &eacute; o conjunto completo de arquivos que podem ser
utilizados para instalar o OpenBSD em outro computador.
Se voc&ecirc; tem apenas um computador rodando o OpenBSD, voc&ecirc;
realmente n&atilde;o tem nenhum motivo para fazer uma vers&atilde;o,
j&aacute; que o processo de compila&ccedil;&atilde;o <a
href="#Bld">acima</a> ir&aacute; fazer tudo que voc&ecirc; precisa.
Um exemplo de uso do processo de vers&atilde;o seria a
compila&ccedil;&atilde;o de <i>-stable</i> em uma m&aacute;quina
r&aacute;pida, e ent&atilde;o fazer uma vers&atilde;o para ser instalada
em todas as outras m&aacute;quinas do seu escrit&oacute;rio.

<p>
O processo de vers&atilde;o usa os bin&aacute;rios criados no
diret&oacute;rio <tt>/usr/obj</tt> no processo de
compila&ccedil;&atilde;o acima, ent&atilde;o voc&ecirc; deve completar a
compila&ccedil;&atilde;o com sucesso primeiro, e nada deve estar
atrapalhando o diret&oacute;rio <tt>/usr/obj</tt>.
Um momento em que isto pode ser um problema &eacute; se voc&ecirc; usa
um <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_mfs&amp;sektion=8">disco
em mem&oacute;ria</a> como seu diret&oacute;rio <tt>/usr/obj</tt> para
uma pequena performance extra no processo de compila&ccedil;&atilde;o,
voc&ecirc; n&atilde;o iria querer reiniciar o computador entre os passos
de "build" (compila&ccedil;&atilde;o) e "release" (vers&atilde;o).

<p>
O processo de vers&atilde;o requer dois diret&oacute;rios de trabalho
diferentes, que iremos chamar de DESTDIR e RELEASEDIR.
Todos os arquivos que s&atilde;o parte de uma instala&ccedil;&atilde;o
"limpa" do OpenBSD ser&atilde;o copiados para seus locais apropriados
dentro de DESTDIR.
Eles ser&atilde;o ent&atilde;o empacotados com o tar(1) e colocados em
RELEASEDIR.
No final do processo, RELEASEDIR ir&aacute; conter a vers&atilde;o
completa do OpenBSD.
O processo de vers&atilde;o tamb&eacute;m ir&aacute; usar o
diret&oacute;rio <tt>/mnt</tt>, ent&atilde;o ele n&atilde;o deve ser
usado para nada mais enquanto o processo de vers&atilde;o estiver
executando. Para o prop&oacute;sito deste exemplo, iremos usar um
DESTDIR como <tt>/usr/dest</tt> e um RELEASEDIR como <tt>/usr/rel</tt>.


<p>
O processo de vers&atilde;o envolve algumas ferramentas que n&atilde;o
est&atilde;o presentes no sistema-base do OpenBSD, crunch e
crunchgen(1), que s&atilde;o usados para criar um &uacute;nico arquivo
execut&aacute;vel constru&iacute;do a partir de muitos bin&aacute;rios
individuais. O nome pelo qual este &uacute;nico arquivo
execut&aacute;vel &eacute; invocado determina qual componente
bin&aacute;rio &eacute; executado.
Esta &eacute; a maneira pela qual um n&uacute;mero de arquivos de
programas individuais s&atilde;o colocados dentro do kernel de ramdisk
do disquetes de boot e demais m&iacute;dias de boot. <i>Estas
ferramentas devem ser compiladas antes que o processo de vers&atilde;o
seja iniciado.</i>
Elas devem ser compiladas e instaladas apenas uma vez, mas como as
pessoas frequentemente esquecem este passo, e estes programas s&atilde;o
compilados rapidamente, algumas pessoas optam por compilar crunch e
crunchgen toda vez, como parte do script que usam para construir uma
vers&atilde;o.

<!-- XXX change for rel -->
<p>
<i><b>NOTA:</b> Para -current e vers&atilde;o 4.5 que est&aacute; por
vir, crunch e crunchgen s&atilde;o parte do sistema-base, n&atilde;o
execute os passos separados de compila&ccedil;&atilde;o abaixo.</i>

<p>
Voc&ecirc; deve ter privil&eacute;gios de root para fazer uma
vers&atilde;o.

<p>
<h3>Fazendo uma vers&atilde;o</h3>

Primeiro, se ainda n&atilde;o foi feito nesta m&aacute;quina, compile
crunch e crunchgen:
<blockquote><pre>
# <b>cd /usr/src/distrib/crunch && make obj depend all install</b>
</pre></blockquote>

Agora, definimos as vari&aacute;veis de ambiente DESTDIR e RELEASEDIR:
<blockquote><pre>
# <b>export DESTDIR=/usr/dest</b>
# <b>export RELEASEDIR=/usr/rel</b>
</pre></blockquote>

Agora limpamos DESTDIR e criamos os diret&oacute;rios, se
necess&aacute;rio:
<blockquote><pre>
# <b>test -d ${DESTDIR} && mv ${DESTDIR} ${DESTDIR}.old && rm -rf
${DESTDIR}.old &</b>
# <b>mkdir -p ${DESTDIR} ${RELEASEDIR}</b>
</pre></blockquote>

RELEASEDIR normalmente n&atilde;o precisa estar vazio antes de iniciar o
processo de release, mas, se houver mudan&ccedil;as nos arquivos da
vers&atilde;o ou em seus nomes, arquivos antigos podem sobrar por ali.
Voc&ecirc; pode tamb&eacute;m querer apagar este diret&oacute;rio antes
de come&ccedil;ar.

<p>
Agora fazemos a vers&atilde;o em si:
<blockquote><pre>
# <b>cd /usr/src/etc</b>
# <b>make release</b>
</pre></blockquote>

Feita a vers&atilde;o, &eacute; uma boa id&eacute;ia chec&aacute;-la
para assegurar que os arquivos tar batem com o que h&aacute; em DESTDIR.
O output deste passo deve ser m&iacute;nimo.

<blockquote><pre>
# <b>cd /usr/src/distrib/sets</b>
# <b>sh checkflist</b>
</pre></blockquote>

Voc&ecirc; agora completou e checou os conjuntos de arquivos da
vers&atilde;o em RELEASEDIR. Esses arquivos agora podem ser usados para
instalar ou atualizar o OpenBSD em outras m&aacute;quinas.

<p>
As instru&ccedil;&otilde;es autoritativas sobre como fazer uma
vers&atilde;o est&atilde;o em
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=release&amp;sektion=8">release(8)</a>.

<p>
Nota: se voc&ecirc; deseja distribuir os arquivos resultantes por HTTP
para uso pelo script de atualiza&ccedil;&atilde;o ou
instala&ccedil;&atilde;o, voc&ecirc; dever&aacute; adicionar um arquivo
"index.txt", que cont&eacute;m a lista de todos os arquivos em sua
vers&atilde;o rec&eacute;m-criada.
<blockquote><pre>
# <b>/bin/ls -1 >index.txt</b>
</pre></blockquote>

<a name="Xbld"></a>
<h2>5.5 - Compilando o X (Xenocara)</h2>
Come&ccedil;ando a partir do <a href="http://x.org/">X.org v7,</a> o X
mudou para um sistema de "compila&ccedil;&atilde;o modular", dividindo a
&aacute;rvore de c&oacute;digo do x.org em mais de trezentos pacotes
mais-ou-menos independentes.

<p>
Para simplificar a vida dos usu&aacute;rios do OpenBSD, um "meta-build"
chamado <a href="http://xenocara.org">Xenocara</a> foi desenvolvido.
Este sistema "converte" o X de volta em uma grande &aacute;rvore a ser
compilada em um &uacute;nico processo.
Como b&ocirc;nus adicional, esse processo de compila&ccedil;&atilde;o
&eacute; muito similar ao processo de compila&ccedil;&atilde;o usado
pelo restante do OpenBSD do que as vers&otilde;es anteriores o eram.

<p>
As instru&ccedil;&otilde;es oficiais para compila&ccedil;&atilde;o do X
est&atilde;o no arquivo <tt>/usr/xenocara/README</tt> de sua
m&aacute;quina e em <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=release&amp;sektion=8">release(8)</a>.

<h3>Obtendo o c&oacute;digo-fonte</h3>
O local "usual" para a &aacute;rvore de fontes do xenocara &eacute;
<tt>/usr/xenocara</tt>, e o c&oacute;digo &eacute; guardado no
m&oacute;dulo <tt>xenocara</tt> do CVS.
Ent&atilde;o, o processo de checkout &eacute; assim:
<blockquote><pre>
$ <b>cd /usr</b>
$ <b>cvs -qdanoncvs@anoncvs.example.org:/cvs checkout -P xenocara</b>
</pre></blockquote>

<h3>Compilando o Xenocara</h3>
Para compilar a &aacute;rvore padr&atilde;o do xenocara conforme
suportado pelo OpenBSD, nenhuma ferramenta externa &eacute;
necess&aacute;ria.

<blockquote><pre>
# <b>cd /usr/xenocara</b>
# <b>rm -rf /usr/xobj/*</b>
# <b>make bootstrap</b>
# <b>make obj</b>
# <b>make build</b>
</pre></blockquote>

Se voc&ecirc; deseja fazer modifica&ccedil;&otilde;es efetivas ao
c&oacute;digo-fonte, voc&ecirc; provavelmente ter&aacute; que adicionar
diversos <a href="../faq15.html">pacotes</a>. Detalhes no arquivo
<tt>/usr/xenocara/README</tt>.

<h3>Fazendo uma vers&atilde;o</h3>
Isto &eacute; similar ao processo de vers&atilde;o do sistema principal.
Ap&oacute;s compilar o X com sucesso, voc&ecirc; ir&aacute; definir um
DESTDIR e RELEASEDIR, com os mesmos prop&oacute;sitos que os anteriores.
O RELEASEDIR pode ser o mesmo diret&oacute;rio que o RELEASEDIR do
sistema principal, mas DESTDIR ser&aacute; apagado e reconstru&iacute;do
neste processo.
Se feito cuidadosamente, isso n&atilde;o &eacute; um problema, mas usar
um DESTDIR separado pode ser "mais seguro".

<p>
Para este exemplo, iremos usar DESTDIR e RELEASEDIR como /usr/dest e
/usr/rel, respectivamente.
Isto deve ser feito ap&oacute;s o processo de compila&ccedil;&atilde;o
acima.

<blockquote><pre>
# <b>export DESTDIR=/usr/dest</b>
# <b>export RELEASEDIR=/usr/rel</b>
# <b>test -d ${DESTDIR} && mv ${DESTDIR} ${DESTDIR}- && \</b>
  <b>   rm -rf ${DESTDIR}- &</b>
# <b>mkdir -p ${DESTDIR} ${RELEASEDIR}</b>
# <b>make release</b>
</pre></blockquote>

Quando este processo for completado, voc&ecirc; ir&aacute; ter pacotes
de arquivos da vers&atilde;o em $RELEASEDIR.

<p>
<a name="Why"></a>
<h2>5.6 - Por que eu preciso de um kernel customizado?</h2>

<p>
Na verdade, voc&ecirc; provavelmente n&atilde;o precisa.

<p>
Um kernel customizado &eacute; um kernel compilado com um arquivo de
configura&ccedil;&atilde;o diferente do arquivo <tt>GENERIC</tt>
provido.
Um kernel customizado pode ser baseado em c&oacute;digo de <a
href="#Flavors"><i>-release, -stable</i> ou <i>-current</i></a>, tanto
quanto um kernel <tt>GENERIC</tt> pode s&ecirc;-lo.
Ao compilar seu pr&oacute;prio kernel <tt>GENERIC</tt>, ele &eacute;
suportado pela equipe do OpenBSD, ao passo que compilar seu
pr&oacute;prio kernel customizado <i>n&atilde;o</i>.

<p>
A configura&ccedil;&atilde;o padr&atilde;o do kernel do OpenBSD
(<tt>GENERIC</tt>) &eacute; projetada para se adaptar &agrave; maioria
das pessoas.
Mais pessoas tornaram seus sistemas inutiliz&aacute;veis ao tentar
modificar seus kernels do que melhoraram a opera&ccedil;&atilde;o do
sistema.
H&aacute; algumas pessoas que acreditam que voc&ecirc; deve customizar
seu kernel e sistema para performance otimizada, mas isso n&atilde;o
&eacute; verdade para o OpenBSD. Apenas os usu&aacute;rios mais
avan&ccedil;ados e experientes com as aplica&ccedil;&otilde;es mais
exigentes precisam se preocupar em um sistema ou kernel customizados.

<p>
Algumas raz&otilde;es pelas quais voc&ecirc; pode querer ou precisar
compilar um kernel customizado:
<ul>
  <li>Voc&ecirc; realmente sabe o que est&aacute; fazendo, e quer
espremer o OpenBSD em um computador com pouca RAM atrav&eacute;s da
remo&ccedil;&atilde;o de drivers de dispositivo que voc&ecirc;
n&atilde;o precisa.
  <li>Voc&ecirc; realmente sabe o que est&aacute; fazendo, e quer
remover op&ccedil;&otilde;es padr&atilde;o ou adicionar
op&ccedil;&otilde;es que podem n&atilde;o ter sido habilitadas por
padr&atilde;o (e tem um bom motivo para tal).
  <li>Voc&ecirc; realmente sabe o que est&aacute; fazendo, e quer
habilitar op&ccedil;&otilde;es experimentais.
  <li>Voc&ecirc; realmente sabe o que est&aacute; fazendo, e tem uma
necessidade especial que n&atilde;o &eacute; suprida por
<tt>GENERIC</tt>, e n&atilde;o vai perguntar porque n&atilde;o funcionou
se algo der errado.
</ul>

<p>
Algumas raz&otilde;es pelas quais voc&ecirc; n&atilde;o deveria compilar
um kernel customizado:
<ul>
  <li>Voc&ecirc; n&atilde;o precisa, normalmente.
  <li>Voc&ecirc; n&atilde;o vai obter um sistema mais r&aacute;pido.
  <li>Voc&ecirc; provavelmente tornar&aacute; a m&aacute;quina menos
confi&aacute;vel.
  <li>Voc&ecirc; n&atilde;o ter&aacute; qualquer suporte dos
desenvolvedores.
  <li>Esperar-se-&aacute; que voc&ecirc; reproduza qualquer problema com
um kernel <tt>GENERIC</tt> antes que os desenvolvedores levem qualquer
report de problema a s&eacute;rio.
  <li>Usu&aacute;rios e desenvolvedores ir&atilde;o rir de voc&ecirc;
quando tornar seu sistema inutiliz&aacute;vel.
  <li>Op&ccedil;&otilde;es customizadas do compilador geralmente fazem
um melhor trabalho expondo problemas do compilador do que melhorando a
performance do sistema.

</ul>

<p>
Remover drivers de dispositivo pode aumentar a velocidade do processo de
boot em seu sistema, mas pode complicar a recupera&ccedil;&atilde;o se
voc&ecirc; tiver um problema de hardware, e &eacute; muito
frequentemente feito de forma err&ocirc;nea.
Remover drivers de dispositivo <i>n&atilde;o ir&aacute;</i> fazer seu
sistema operar mais r&aacute;pido de qualquer forma percept&iacute;vel,
muito embora possa produzir um kernel menor.
Remover op&ccedil;&otilde;es de debug e checagem de erros pode resultar
em um ganho de performance mensur&aacute;vel, mas ir&aacute; tornar
imposs&iacute;vel diagnosticar um sistema se algo der errado.


<p>
Mais uma vez, os desenvolvedores geralmente ir&atilde;o ignorar bug
reports lidando com kernels customizados, a n&atilde;o ser que o
problema possa ser reproduzido tamb&eacute;m em um kernel
<tt>GENERIC</tt>.
Voc&ecirc; foi avisado.

<p>
<a name="Options"></a>
<h2>5.7 - Compilando um kernel customizado</h2>
Assume-se que voc&ecirc; leu o texto <a href="#Why">acima</a>, e
realmente gosta de sofrer.
Tamb&eacute;m assume-se que voc&ecirc; tem um objetivo que n&atilde;o
pode ser atingido nem por <a
href="#BootConfig">configura&ccedil;&atilde;o em tempo de boot
(UKC>)</a> ou pelo uso de <a href="#config">config(8) em um kernel
GENERIC</a>.
Se n&atilde;o se apresenta nenhum desses casos, voc&ecirc; deveria
continuar usando GENERIC.
Mesmo.

<p>
A gera&ccedil;&atilde;o do kernel do OpenBSD &eacute; controlada por
arquivos de configura&ccedil;&atilde;o, que est&atilde;o localizados no
diret&oacute;rio <tt>/usr/src/sys/arch/<i>&lt;arch&gt;</i>/conf/</tt>
por padr&atilde;o. Todas as arquiteturas t&ecirc;m um arquivo,
<tt>GENERIC</tt>, que &eacute; usado para gerar o kernel padr&atilde;o
do OpenBSD para aquela plataforma. Tamb&eacute;m pode haver outros
arquivos de configura&ccedil;&atilde;o que s&atilde;o usados para criar
kernels como focos diferenciados, por exemplo, para pouca quantidade de
RAM, esta&ccedil;&otilde;es de trabalho sem disco, etc.

<p>
O arquivo de configura&ccedil;&atilde;o &eacute; processado por <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>,
que cria e popula um diret&oacute;rio de compila&ccedil;&atilde;o em
<tt>../compile</tt>, em uma instala&ccedil;&atilde;o t&iacute;pica esse
local seria <tt>/usr/src/sys/arch/<i>&lt;arch&gt;</i>/compile/</tt>.
config(8) tamb&eacute;m cria um a <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&amp;sektion=1">Makefile</a>,
e outros arquivos requeridos para compilar o kernel com sucesso.

<p>
As Op&ccedil;&otilde;es de Configura&ccedil;&atilde;o do Kernel
s&atilde;o op&ccedil;&otilde;es que voc&ecirc; adiciona &agrave;
configura&ccedil;&atilde;o do seu kernel para adicionar certas
funcionalidades ao seu kernel. Isto permite que voc&ecirc; tenha suporte
exatamente ao que voc&ecirc; deseja, sem oferecer suporte a dispositivos
desnecess&aacute;rios. H&aacute; muitas op&ccedil;&otilde;es que
permitem que voc&ecirc; customize seu kernel. Aqui iremos comentar
apenas algumas delas, as mais comumente usadas. Cheque a man page de <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a>
para uma lista completa de op&ccedil;&otilde;es, e j&aacute; que estas
mudam de tempos em tempos, voc&ecirc; deve se certificar de que
est&aacute; usando uma man page para a mesma vers&atilde;o do OpenBSD
que voc&ecirc; est&aacute; compilando. Voc&ecirc; tamb&eacute;m pode
checar os arquivos de configura&ccedil;&atilde;o de exemplo que
est&atilde;o dispon&iacute;veis para sua arquitetura.

<p>
<b>N&atilde;o adicione, remova, ou mude op&ccedil;&otilde;es em ser
kernel a n&atilde;o ser que voc&ecirc; realmente tenha um motivo para
faz&ecirc;-lo! N&atilde;o edite o arquivo de configura&ccedil;&atilde;o
<tt>GENERIC</tt>!!</b>
A &uacute;nica configura&ccedil;&atilde;o de kernel suportada pela
equipe do OpenBSD &eacute; o kernel GENERIC, a combina&ccedil;&atilde;o
das op&ccedil;&otilde;es em
<tt>/usr/src/sys/arch/&lt;<i>arch</i>&gt;/conf/GENERIC</tt> e
<tt>/usr/src/sys/conf/GENERIC</tt> <i>como empacotado pela equipe do
OpenBSD</i> (i.e., N&Atilde;O editada). Reportar um problema em um
kernel customizado ir&aacute; quase sempre resultar em voc&ecirc; sendo
solicitado a tentar reproduzir o problem com um kernel GENERIC. Nem
todas as op&ccedil;&atilde;o s&atilde;o compat&iacute;veis entre si, e
muitas op&ccedil;&otilde;es s&atilde;o requeridas para o sistema
funcionar. N&atilde;o h&aacute; garantias de que, apenas porque
voc&ecirc; conseguiu fazer um kernel customizado compilar com sucesso,
ele ir&aacute; rodar.
N&atilde;o h&aacute; garantias de que um kernel que pode ser configurado
com config(8) possa ser compilado.

<p>
Voc&ecirc; pode ver os arquivos de configura&ccedil;&atilde;o
espec&iacute;ficos para cada plataforma aqui:
<ul>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/alpha/conf/">Arquivos
de Configura&ccedil;&atilde;o do Kernel alpha</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/i386/conf/">Arquivos
de Configura&ccedil;&atilde;o do Kernel i386</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/macppc/conf/">Arquivos
de Configura&ccedil;&atilde;o do Kernel macppc</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc/conf/">Arquivos
de Configura&ccedil;&atilde;o do Kernel sparc</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc64/conf/">Arquivos
de Configura&ccedil;&atilde;o do Kernel sparc64</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/vax/conf/">Arquivos
de Configura&ccedil;&atilde;o do Kernel vax</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/hppa/conf/">Arquivos
de Configura&ccedil;&atilde;o do Kernel hppa</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/">Outras
Arquiteturas</a>
</ul>

<p>
Observe atentamente estes arquivos e voc&ecirc; ir&aacute; notar uma
linha pr&oacute;xima ao topo similar a:
<pre>
     include "../../../conf/GENERIC"
</pre>
Isto significa que ele est&aacute; referenciando outro arquivo de
configura&ccedil;&atilde;o, um que cont&eacute;m op&ccedil;&otilde;es
independentes de plataforma. Ao criar sua configura&ccedil;&atilde;o de
kernel, n&atilde;o esque&ccedil;a de olhar <a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/conf/GENERIC">sys/conf/GENERIC</a>.

<p>
Op&ccedil;&otilde;es de configura&ccedil;&atilde;o do kernel devem ser
colocadas no arquivo de configura&ccedil;&atilde;o de seu kernel no
seguinte formato:
<blockquote>
<tt>option&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</tt><i>name</i>
</blockquote>
ou
<blockquote><pre>
<tt>option&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</tt><i>name=value</i> 
</pre></blockquote>

Por exemplo, para colocar a op&ccedil;&atilde;o "DEBUG" no kernel,
adicione uma linha como esta:

<blockquote><pre>
option      DEBUG
</pre></blockquote>

Op&ccedil;&otilde;es no kernel OpenBSD s&atilde;o traduzidas em
op&ccedil;&otilde;es ao pr&eacute;-processador do compilador,
ent&atilde;o uma op&ccedil;&atilde;o como DEBUG faria o c&oacute;digo
ser compilado com a op&ccedil;&atilde;o -DDEBUG, que &eacute;
equivalente a declarar <tt>#define DEBUG</tt> em todo o kernel.

<p>
Algumas vezes, voc&ecirc; pode querer desabilitar uma
op&ccedil;&atilde;o que j&aacute; est&aacute; definida, tipicamente no
arquivo "<tt>src/sys/conf/GENERIC</tt>". Muito embora voc&ecirc; possa
modificar uma c&oacute;pia desse arquivo, uma melhor op&ccedil;&atilde;o
seria usar a declara&ccedil;&atilde;o <i>rmoption</i>. Por exemplo, se
voc&ecirc; realmente quisesse desabilitar o debugger interno ao kernel
(<i>n&atilde;o recomendado!</i>), voc&ecirc; adicionaria uma linha como:
<pre>
     rmoption DDB
</pre>
no arquivo de configura&ccedil;&atilde;o do seu kernel. <tt>option
DDB</tt> &eacute; definida em <tt>src/sys/conf/GENERIC</tt>, mas a
op&ccedil;&atilde;o <tt>rmoption</tt> na linha acima a desativa.

<p>
Mais uma vez, por favor veja <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a>
para mais informa&ccedil;&otilde;es sobre as especificidades dessas
op&ccedil;&otilde;es. Note tamb&eacute;m que muitas das
op&ccedil;&otilde;es t&ecirc;m suas pr&oacute;prias p&aacute;ginas de
manual -- sempre leia tudo o que h&aacute; dispon&iacute;vel sobre uma
op&ccedil;&atilde;o antes de adicion&aacute;-la ou remov&ecirc;-la do
seu kernel.

<p> 
<h3>Compilando um kernel customizado</h3>

Neste caso, iremos compilar um kernel que suporte a placa serial
multiporta ISA <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=boca&amp;sektion=4">boca(4)</a>.
Esta placa n&atilde;o est&aacute; no kernel GENERIC, devido a conflitos
com outros drivers.

Outra raz&atilde;o comum para fazer um kernel customizado seria para o
uso de RAIDframe, que &eacute; muito grande para ter no kernel
padr&atilde;o. H&aacute; duas maneiras mais usuais de se fazer um kernel
customizado: copie o arquivo de configura&ccedil;&atilde;o GENERIC com
outro nome e edite-o, ou crie um arquivo "wrapper" que "inclui" o kernel
GENERIC padr&atilde;o e quaisquer outras op&ccedil;&otilde;es que
voc&ecirc; necessite e que n&atilde;o estejam em GENERIC.
Neste caso, nosso arquivo wrapper se parece com isto:
<blockquote><pre>
include "arch/i386/conf/GENERIC"

boca0  at       isa? port 0x100 irq 10     # BOCA 8-port serial cards
pccom* at       boca? slave ?
</pre></blockquote>

As duas linhas referentes &agrave; placa boca(4) foram copiadas das
linhas comentadas em <tt>GENERIC</tt>, com os IRQs ajustados conforme
necess&aacute;rio. A vantagem de usar esse arquivo "wrapper" &eacute;
que quaisquer mudan&ccedil;as n&atilde;o-relacionadas feitas em GENERIC
s&atilde;o atualizadas automaticamente com qualquer
atualiza&ccedil;&atilde;o de c&oacute;digo-fonte. A desvantagem &eacute;
que dessa forma n&atilde;o se pode remover dispositivos (embora, em
geral, isto seja uma m&aacute; id&eacute;ia, de qualquer forma).

<p>
Outra maneira de gerar um kernel customizado &eacute; fazer uma
c&oacute;pia do arquivo <tt>GENERIC</tt> padr&atilde;o, dando-lhe outro
nome, e ent&atilde;o edit&aacute;-lo conforme necess&aacute;rio.
A desvantagem nesse processo &eacute; que updates futuros feitos
&agrave; configura&ccedil;&atilde;o de GENERIC dever&atilde;o ser
integrados &agrave; sua c&oacute;pia, ou ent&atilde;o voc&ecirc;
ter&aacute; que refazer seu arquivo de configura&ccedil;&atilde;o.

<p>
De qualquer forma, ap&oacute;s fazer um arquivo de
configura&ccedil;&atilde;o para seu kernel customizado, use config(8) e
compile o kernel como documentado <a href="#BldKernel">acima</a>.


<p>
Instru&ccedil;&otilde;es completas para cria&ccedil;&atilde;o de seu
pr&oacute;prio kernel customizado est&atilde;o na man page de <a href=
"http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8#EXAMPLES+(kernel">
config(8)</a>.


<a name="BootConfig"></a>
<h2>5.8 - Configura&ccedil;&atilde;o em tempo de Boot</h2>

<p>
Algumas vezes o iniciar o sistema voc&ecirc; pode notar que o kernel
acha seu dispositivo mas talvez com o IRQ errado. E talvez voc&ecirc;
precise usar esse dispositivo de imediato. Bem, sem recompilar o kernel
voc&ecirc; pode usar a configura&ccedil;&atilde;o do kernel em tempo de
boot do OpenBSD. Isto ir&aacute; corrigir seu problema por apenas uma
vez. Se voc&ecirc; reiniciar, voc&ecirc; ter&aacute; que repetir este
procedimento. Ent&atilde;o, isto serve apenas como uma
solu&ccedil;&atilde;o tempor&aacute;ria, e voc&ecirc; deve corrigir o
problema usando <a href="#config">config(8)</a>. Mas seu kernel deve ter
<strong>option BOOT_CONFIG</strong> habilitada, que o kernel GENERIC
tem, na verdade.

<p>
A maior parte deste documento pode ser encontrada na man page <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&amp;sektion=8">boot_config(8)</a>.

<p>
Para bootar no User Kernel Config, ou UKC, use a op&ccedil;&atilde;o -c
em tempo de boot.

<blockquote><pre>
boot&gt; <strong>boot hd0a:/bsd -c</strong>
</pre></blockquote>

Ou qualquer kernel o qual voc&ecirc; queira bootar. Fazendo isso, o
prompt do UKC aparecer&aacute;. A partir daqui, voc&ecirc; pode enviar
comandos diretamente para o kernel especificando dispositivos que
voc&ecirc; queira mudar ou desabilitar ou mesmo habilitar.

<p>
Aqui est&aacute; uma lista dos comandos mais comuns do UKC.

<ul>
<li><tt>add <strong>device</strong></tt> - Adicionar um dispositivo
atrav&eacute;s de c&oacute;pia de algum outro
<li><tt>change <strong>devno | device </strong></tt> - Modificar um ou
mais dispositivos
<li><tt>disable <strong>devno | device </strong></tt> - Desabilitar um
ou mais dispositivos
<li><tt>enable <strong>devno | device </strong></tt> - Habilitar um ou
mais dispositivos
<li><tt>find <strong>devno | device </strong></tt> - Encontrar um ou
mais dispositivos
<li><tt>help</tt> - Curto sum&aacute;rio destes comandos
<li><tt>list</tt> - Listar TODOS os dispositivos conhecidos
<li><tt>exit/quit</tt> - Continuar o Boot 
<li><tt>show <strong>[attr [val]]</strong></tt> - Mostrar dispositivos
com um atributo, ou opcionalmente com um valor especificado
</ul>

<p>
Uma vez que voc&ecirc; tenha configurado seu kernel, use <tt>quit</tt>
ou <tt>exit</tt> e continue o boot.
Ap&oacute;s faz&ecirc;-lo, voc&ecirc; deve tornar a
modifica&ccedil;&atilde;o permanente na imagem do seu kernel, como
descrito em <a href="#config">Using config(8) to change your kernel</a>.


<p>
<a name="config"></a>
<h2>5.9 - Usando config(8) para modificar seu kernel</h2>
<p>
As op&ccedil;&otilde;es <b>-e</b> e <b>-u</b> de
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>
podem ser extremamente &uacute;teis e evitar perda de tempo compilando
seu kernel. A flag <b>-e</b> permite que voc&ecirc; entre no UKC ou User
Kernel Config em um sistema rodando. Estas mudan&ccedil;as ir&atilde;o
acontecer no pr&oacute;ximo reboot. A flag <b>-u</b> testa se alguma
mudan&ccedil;a foi feita ao kernel atual durante o boot, significando
que voc&ecirc; usou <b>boot -c</b> para entrar no UKC durante o boot do
sistema.

<p>
O exemplo a seguir mostra como desabilitar os dispositivos ep* no
kernel. Por seguran&ccedil;a voc&ecirc; deve usar a op&ccedil;&atilde;o
<b>-o</b> que escreve as modifica&ccedil;&otilde;es para o arquivo
especificado. Por exemplo: <strong>config -e -o bsd.new /bsd</strong>
ir&aacute; escrever as modifica&ccedil;&otilde;es para bsd.new. O
exemplo n&atilde;o usa a op&ccedil;&atilde;o <b>-o</b>, ent&atilde;o as
modifica&ccedil;&otilde;es s&atilde;o ignoradas, e n&atilde;o s&atilde;o
escritas no bin&aacute;rio do kernel. Para mais
informa&ccedil;&otilde;es relativas a erros e mensagens de alerta leia a
man page de <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>.

<!--XXXver -->
<blockquote><pre>
$ <strong>sudo config -e /bsd</strong>
OpenBSD 4.4 (GENERIC) #1021: Tue Aug 12 17:16:55 MDT 2008
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
warning: no output file specified
Enter 'help' for information
ukc&gt; ?
        help                            Command help list
        add         dev                 Add a device
        base        8|10|16             Base on large numbers
        change      devno|dev           Change device
        disable     attr val|devno|dev  Disable device
        enable      attr val|devno|dev  Enable device
        find        devno|dev           Find device
        list                            List configuration
        lines       count               # of lines per page
        show        [attr [val]]        Show attribute
        exit                            Exit, without saving changes
        quit                            Quit, saving current changes
        timezone    [mins [dst]]        Show/change timezone
        nmbclust    [number]            Show/change NMBCLUSTERS
        cachepct    [number]            Show/change BUFCACHEPERCENT
        nkmempg     [number]            Show/change NKMEMPAGES
        shmseg      [number]            Show/change SHMSEG
        shmmaxpgs   [number]            Show/change SHMMAXPGS
ukc&gt; <strong>list</strong>
  0 audio* at
sb0|sb*|gus0|pas0|sp0|ess*|wss0|wss*|ym*|eap*|eso*|sv*|neo*|cmpci*
|clcs*|clct*|auich*|autri*|auvia*|fms*|uaudio*|maestro*|esa*|yds*|emu*
flags 0x0
  1 midi* at sb0|sb*|opl*|opl*|opl*|opl*|ym*|mpu*|autri* flags 0x0
  2 nsphy* at
aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  3 nsphyter* at
aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|
vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep
*|ep*|ep* phy -1 flags 0x0
  4 qsphy* at
aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  5 inphy* at
aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  6 iophy* at
aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  7 eephy* at
aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  8 exphy* at
aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
[...snip...]
ukc&gt; <strong>disable ep</strong>
 93 ep0 disabled
 94 ep* disabled
 95 ep* disabled
261 ep0 disabled
262 ep0 disabled
263 ep* disabled
264 ep* disabled
323 ep* disabled
ukc&gt; <strong>quit</strong>
not forced
</pre></blockquote>

<p>
No exemplo acima, todos os dispositivos ep* est&atilde;o desabilitados
no kernel e n&atilde;o ser&atilde;o pesquisados. Assim como em algumas
situa&ccedil;&otilde;es nas quais se usa o UKC durante o boot,
atrav&eacute;s de <b>boot -c</b>, voc&ecirc; precisa que essas
modifica&ccedil;&otilde;es sejam gravadas permanentemente. Para fazer
isso voc&ecirc; deve usar a op&ccedil;&atilde;o <b>-u</b>.
No exemplo a seguir, o computador foi iniciado no UKC e o dispositivo
wi(4) foi desabilitado. Como modifica&ccedil;&otilde;es com boot -c
N&Atilde;O s&atilde;o permanentes, estas modifica&ccedil;&otilde;es
devem ser gravadas. Este exemplo grava as modifica&ccedil;&otilde;es
feitas com boot -c em um novo bin&aacute;rio de kernel com nome bsd.new.

<blockquote><pre>
$ <strong>sudo config -e -u -o bsd.new /bsd</strong>
OpenBSD 4.4 (GENERIC) #1021: Tue Aug 12 17:16:55 MDT 2008
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
Processing history...
105 wi* disabled
106 wi* disabled
Enter 'help' for information
ukc&gt; <strong>quit</strong>
</pre></blockquote>


<a name="VerboseBoot"></a>
<h2>5.10 - Obtendo output mais extenso durante o boot</h2>

Obter output mais extenso (verbose) pode ser muito &uacute;til ao tentar
debugar problemas durante o boot. Se voc&ecirc; tem um problema em que
seu disquete de boot n&atilde;o inicia e precisa obter mais
informa&ccedil;&otilde;es, simplesmente reinicie. Quanto voc&ecirc;
chegar ao prompt de &quot;boot&gt;&quot;, efetue o boot com boot -c.
Isto ir&aacute; lhe levar ao UKC&gt;, ent&atilde;o digite:

<blockquote><pre>
UKC&gt; <strong>verbose</strong>
autoconf verbose enabled
UKC&gt; <strong>quit</strong>
</pre></blockquote>

<p>
Agora voc&ecirc; ter&aacute; um output extremamente extenso durante o
boot.



<p>
<a name="buildprobs"></a>
<h2>5.11 - Problemas comuns, dicas e perguntas ao compilar e
construir</h2>
Na maior parte das vezes, problemas no processo de
compila&ccedil;&atilde;o s&atilde;o causados por n&atilde;o seguir as
instru&ccedil;&otilde;es acima cuidadosamente.
Ocasionalmente, h&aacute; problemas reais ao compilar <i>-current</i> a
partir do snapshot mais recente, mas falhas ao compilar <i>-release</i>
ou <i>-stable</i> s&atilde;o sempre erro do usu&aacute;rio.

<p>
A maioria dos problemas se encaixa em algum dos seguintes:
<ul>
<li>N&atilde;o come&ccedil;ar do <a href="#BldBinary">bin&aacute;rio
apropriado</a>, incluindo tentar upgrade a partir dos fontes ou
assumindo que um snapshot de uma semana atr&aacute;s &eacute; "recente o
suficiente".
<li><a href="#BldGetSrc">Fazer o checkout</a> do ramo errado da
&aacute;rvore.
<li>N&atilde;o seguir o <a href="faq5.html">processo</a>.
<li>Tentar <a href="#Why">customizar</a> ou "otimizar" seu sistema.
</ul>

Aqui est&atilde;o alguns problemas adicionais que voc&ecirc; pode
encontrar, no entanto:

<a name="sig11"></a>
<h3>5.11.1 - A compila&ccedil;&atilde;o parou com um erro "Signal
11"</h3>

<p> Compilar o OpenBSD e outros programas a partir dos fontes &eacute;
uma tarefa que exige do hardware muito al&eacute;m do que a maioria das
outras, fazendo uso intenso de CPU, disco e mem&oacute;ria. Como
resultado, se voc&ecirc; tiver hardware com problemas, o momento mais
prov&aacute;vel para um problema aparecer &eacute; durante a
compila&ccedil;&atilde;o. Falhas com Signal 11 s&atilde;o
<i>tipicamente</i> causadas por problemas de hardware, muito
frequentemente por problemas de mem&oacute;ria, mas tamb&eacute;m podem
ser de CPU, placa-m&atilde;e, ou relacionadas a superaquecimento. Seu
sistema pode ser muito est&aacute;vel em outras atividadaes, mas incapaz
de compilar programas.

<p>
Voc&ecirc; provavelmente ir&aacute; achar melhor consertar ou substituir
os componentes problem&aacute;ticos, j&aacute; que os problemas podem se
revelar de outras formas no futuro. Se voc&ecirc; tiver hardware que
realmente deseja utilizar e n&atilde;o causa nenhum outro tipo de
problema, simplesmente instale um snapshot ou release.

<p>
Para muito mais informa&ccedil;&otilde;es, veja o
<a href="http://www.bitwizard.nl/sig11/">Sig11 FAQ</a>.

<a name="snake"></a>
<h3>5.11.2 - "make build" falha com a mensagem "cannot open output file
snake: is a directory"</h3>

Isto &eacute; resultado de dois erros diferentes: 
<ul>
<li><b>Voc&ecirc; n&atilde;o obteve ou atualizou sua &aacute;rvore CVS
corretamente.</b> Ao fazer uma opera&ccedil;&atilde;o de checkout CVS,
voc&ecirc; deve usar a op&ccedil;&atilde;o "<tt>-P</tt>", e ao atualizar
sua &aacute;rvore de c&oacute;digo com o CVS, deve usar as
op&ccedil;&otilde;es "<tt>-Pd</tt>" no <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1"
>cvs(1)</a>, como documentado <a href="#BldGetSrc">acima</a>.
Essas op&ccedil;&otilde;es asseguram que novos diret&oacute;rios
s&atilde;o adicionados e removidos da &aacute;rvore de acordo com a
evolu&ccedil;&atilde;o do OpenBSD.

<li><b>Voc&ecirc; n&atilde;o criou corretamente o diret&oacute;rio
<tt>obj</tt> antes da compila&ccedil;&atilde;o.</b> Compilar a
&aacute;rvore sem um diret&oacute;rio <tt>/usr/obj</tt> n&atilde;o
&eacute; suportado.

</ul>
&Eacute; importante seguir cuidadosamente as instru&ccedil;&otilde;es ao
<a href="#BldGetSrc">obter</a> e <a href="#Bld">compilar</a> sua
&aacute;rvore.

<a name="ProbIPv6"></a>
<h3>5.11.3 - Meu sistema sem IPv6 n&atilde;o funciona!</h3>
Sim.
Por favor n&atilde;o fa&ccedil;a modifica&ccedil;&otilde;es ao
sistema-base cujas implica&ccedil;&otilde;es voc&ecirc; n&atilde;o
compreende.
Uma "pequena" mudan&ccedil;a no kernel pode ter grande impacto em todo o
restante do sistema.
Por favor leia <a href="#Why">isto</a> novamente.


<a name="ProbObj"></a>
<h3>5.11.4 - Oops! Esqueci de criar o diret&oacute;rio <tt>/usr/obj</tt>
primeiro!</h3>

Ao fazer um "make build" antes de fazer um "make obj", voc&ecirc;
terminar&aacute; tendo todos os arquivos objeto espalhados em seu
diret&oacute;rio <tt>/usr/src</tt>. Isto n&atilde;o &eacute; bom.
Se voc&ecirc; quer evitar refazer o download de toda a &aacute;rvore src
novamente, voc&ecirc; pode tentar o seguinte para limpar os arquivos
obj:

<pre>
    # <b>cd /usr/src</b>
    # <b>find . -type l -name obj | xargs rm</b>
    # <b>make cleandir</b>
    # <b>rm -rf /usr/obj/*</b>
    # <b>make obj</b>
</pre>

<a name="ProbObjPt"></a>
<h3>5.11.5 - Dica: Coloque <tt>/usr/obj</tt> em sua pr&oacute;pria
parti&ccedil;&atilde;o</h3>
Se voc&ecirc; compila com frequ&ecirc;ncia, voc&ecirc; pode achar mais
r&aacute;pido colocar o <tt>/usr/obj</tt> em uma parti&ccedil;&atilde;o
pr&oacute;pria.
O benef&iacute;cio &eacute; simples, &eacute; tipicamente mais
r&aacute;pido fazer:
<pre>
    # <b>umount /usr/obj</b>
    # <b>newfs <i>YourObjPartition</i></b>
    # <b>mount /usr/obj</b>
</pre>
do que "rm -rf /usr/obj/*".

<a name="ProbSKIPDIR"></a>
<h3>5.11.6 - Como n&atilde;o compilar certas partes da &aacute;rvore de
c&oacute;digo?</h3>
Algumas vezes, voc&ecirc; pode querer n&atilde;o compilar certas partes
da &aacute;rvore, tipicamente porque voc&ecirc; instalou um substituto
para uma aplica&ccedil;&atilde;o inclusa a partir dos pacotes, ou quer
fazer uma vers&atilde;o "menor" por qualquer motivo.
A solu&ccedil;&atilde;o para isto &eacute; usar a op&ccedil;&atilde;o
SKIPDIR de <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=mk.conf&amp;sektion=5">/etc/mk.conf</a>.

<p>
Nota: &eacute; poss&iacute;vel fazer um sistema inutiliz&aacute;vel
desta forma.
Os resultados desta op&ccedil;&atilde;o n&atilde;o s&atilde;o suportados
pelo projeto OpenBSD.

<a name="ProbMoreInfo"></a>
<h3>5.11.7 - Onde posso aprender mais sobre o processo de
compila&ccedil;&atilde;o?</h3>
Aqui est&atilde;o algumas outras fontes:
<ul>
<li><a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=release&amp;sektion=8">release(8)</a>
<li><a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8#COMPILING+A">afterboot(8)</a>
<li><a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=mk.conf&amp;sektion=5">mk.conf(5)</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/Makefile"><tt>/usr/src/Makefile</tt></a>
<li><a href="../../stable.html">Patch Branches</a> (<i>-stable</i>)
<li>(para o X) <tt>/usr/X11R6/README</tt> em seu sistema instalado

</ul>

<a name="NoSnaps"></a>
<h3>5.11.8 - N&atilde;o vi nenhum snapshot no servidor FTP. Para onde
eles foram?</h3>

<p>
Snapshots podem ser removidos ao se tornar antigos (ou irrelevantes) ou
pr&oacute;ximo do momento de um novo <i>-release</i>.

<a name="NewCompiler"></a>
<h3>5.11.9 - Como dar bootstrap em uma nova vers&atilde;o do compilador
(<i>gcc</i>)?</h3>

Voc&ecirc; realmente deveria apenas <a href="#BldBinary">instalar o
snapshot mais recente</a>.

<p>
O OpenBSD agora suporta dois compiladores em sua &aacute;rvore, gcc
v3.3.5 usado pela maioria das plataformas, mas tamb&eacute;m o gcc
v2.95.3 usado por algumas poucas plataformas que n&atilde;o foram
convertidas ainda, ou que talvez nunca sejam convertidas devido &agrave;
falta de suporte do gcc3 ou baixa performance do gcc3.

<p>
Os dois compiladores est&atilde;o em partes diferentes da &aacute;rvore:
<ul>
<li>gcc3: <tt>/usr/src/gnu/usr.bin/gcc</tt>
<li>gcc2: <tt>/usr/src/gnu/egcs/gcc</tt>
</ul>

<p>
Porque atualizar um compilador &eacute; um pouco de um problema
o-ovo-ou-a-galinha, mudan&ccedil;as ao compilador interno &agrave;
&aacute;rvore requerem alguma aten&ccedil;&atilde;o extra. Voc&ecirc;
tem que compilar o compilador duas vezes -- a primeira
compila&ccedil;&atilde;o produz um compilador que gera c&oacute;digo
novo mas opera com c&oacute;digo gerado pelo compilador antigo, e a
segunda compila&ccedil;&atilde;o gera um compilador completamente novo.
No geral, voc&ecirc; ir&aacute; querer realizar o seguinte procedimento:

<pre>
    <b>Se sua plataforma usa o gcc 2.95.3:</b>
       # rm -r /usr/obj/gnu/egcs/gcc/*
       # cd /usr/src/gnu/egcs/gcc
        <i>- ou -</i>
    <b>Se sua plataforma usa o gcc 3.3.5:</b>
       # rm -r /usr/obj/gnu/usr.bin/gcc/*
       # cd /usr/src/gnu/usr.bin/gcc

    <b>Procedimento comum de compila&ccedil;&atilde;o para v3.3.5 ou
v2.95.3</b>
    # make -f Makefile.bsd-wrapper clean
    # make -f Makefile.bsd-wrapper obj
    # make -f Makefile.bsd-wrapper depend
    # make -f Makefile.bsd-wrapper
    # make -f Makefile.bsd-wrapper install
    # make -f Makefile.bsd-wrapper clean
    # make -f Makefile.bsd-wrapper depend
    # make -f Makefile.bsd-wrapper
    # make -f Makefile.bsd-wrapper install
</pre>

<p>
E ent&atilde;o execute normalmente um <a href="#BldUserland">make
build</a>.

<a name="UpdateEtc"></a>
<h3>5.11.10 - Qual &eacute; a melhor maneira de atualizar os
diret&oacute;rios <tt>/etc</tt>, <tt>/var</tt>, e <tt>/dev</tt>?</h3>

<p>Como pol&iacute;tica, software da &aacute;rvore do OpenBSD n&atilde;o
modifica os arquivos do <tt>/etc</tt> automaticamente.
Isto significa que <i>sempre</i> fica a cargo do administrador fazer as
modifica&ccedil;&otilde;es necess&aacute;rias l&aacute;.
Upgrades n&atilde;o s&atilde;o exce&ccedil;&atilde;o.
Para atualizar arquivos nesses diret&oacute;rios, primeiro determine
quais mudan&ccedil;as ocorreram aos arquivos base (da
distribui&ccedil;&atilde;o), e ent&atilde;o reaplique manualmente estas
modifica&ccedil;&otilde;es.

<p>
Por exemplo, para ver os arquivos da &aacute;rvore que mudaram mais
recentemente, fa&ccedil;a:

<pre>
    # cd /usr/src/etc
    # ls -lt |more
</pre>

<!-- XXXversion -->
<p>Para ver todas as mudan&ccedil;as feitas ao <tt>/etc</tt> entre
vers&otilde;es arbitr&aacute;rias do OpenBSD, voc&ecirc; pode usar o <a
href="../../anoncvs.html">CVS</a>.
Por exemplo, para ver as mudan&ccedil;as entre 4.3 e 4.4 fa&ccedil;a:

<pre>
    # cd /usr/src/etc
    # cvs diff -u -rOPENBSD_4_3 -rOPENBSD_4_4
</pre>

Para ver as mudan&ccedil;as entre 4.4 e <i>-current</i> ("HEAD"),
fa&ccedil;a:
<pre>
    # cd /usr/src/etc
    # cvs diff -u -rOPENBSD_4_4 -rHEAD
</pre>

O script <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=MAKEDEV&amp;sektion=8&amp;arch=i386">/dev/MAKEDEV</a>
n&atilde;o &eacute; atualizado automaticamente como parte do processo de
make build, mas &eacute; instalado como parte de um <a
href="#BldBinary">upgrade bin&aacute;rio</a>.
Como regra geral, &eacute; uma boa id&eacute;ia copiar (se
necess&aacute;rio) e rodar este script a partir de sua &aacute;rvore de
c&oacute;digo ao fazer um upgrade:

<pre>
    # cd /dev
    # cp /usr/src/etc/etc.`machine`/MAKEDEV ./
    # ./MAKEDEV all
</pre>

<p>
Uma vez que voc&ecirc; tenha identificado as modifica&ccedil;&otilde;es,
reaplique-as &agrave; sua &aacute;rvore local, preservando qualquer
configura&ccedil;&atilde;o local que voc&ecirc; tenha feito.

<p>
Mudan&ccedil;as t&iacute;picas feitas ao <tt>/etc</tt> a serem
observadas entre vers&otilde;es incluem:

<ul>
<li>Adi&ccedil;&otilde;es a <tt>/etc/protocols</tt> e
<tt>/etc/services</tt></li>
<li>Novos sysctls (veja <tt>/etc/sysctl.conf</tt>)</li>
<li>Mudan&ccedil;as aos cron jobs padr&atilde;o. Veja
<tt>/etc/daily</tt>,
  <tt>/etc/weekly</tt>, <tt>/etc/monthly</tt>, e <tt>/etc/security</tt>
<li>Todos os scripts rc, incluindo o netstart</li>
<li>Mudan&ccedil;as a dispositivos, veja acima
<li>Mudan&ccedil;as &agrave; hierarquia de arquivos em
<tt>/etc/mtree</tt>, veja
  <a href="#Hierarchy">abaixo</a>
<li>Novos usu&aacute;rios (<tt>/etc/passwd</tt>) e grupos
(<tt>/etc/group</tt>)
</ul>

<!-- XXXversion -->
Essas mudan&ccedil;as s&atilde;o agrupadas em <a
href="../upgrade44.html">upgrade44.html</a> (indo para 4.4-release) or
<a href="../current.html">current.html</a> (indo para <i>-current</i>).


<a name="Hierarchy"></a>
<h3>5.11.11 - H&aacute; alguma maneira f&aacute;cil de fazer todas as
modifica&ccedil;&otilde;es na hierarquia do sistema de arquivos?</h3>

<p>
De tempos em tempos, arquivos ou diret&oacute;rios s&atilde;o
adicionados a, ou removidos da <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=hier&amp;sektion=7">hierarchy</a>
de arquivos.
Al&eacute;m disso, informa&ccedil;&otilde;es de propriedade para
por&ccedil;&otilde;es do sistema de arquivos podem mudar. Uma maneira
f&aacute;cil de assegurar que sua hierarquia de sistema de arquivos
est&aacute; atualizada &eacute; usar a ferramenta <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=mtree&amp;sektion=8">mtree(8)</a>.

<p>
Primeiro, obtenha os fontes mais recentes, e ent&atilde;o fa&ccedil;a o
seguinte:

<pre>
    # cd /usr/src/etc/mtree
    # install -c -o root -g wheel -m 600 special /etc/mtree
    # install -c -o root -g wheel -m 444 4.4BSD.dist /etc/mtree
    # mtree -qdef /etc/mtree/4.4BSD.dist -p / -u
</pre>

<p>
Sua hierarquia de arquivos deve estar atualizada agora.

<a name="ProbXComp"></a>
<h3>5.11.12 - Posso efetuar compila&ccedil;&atilde;o cruzada
(cross-compile)? Por que n&atilde;o?</h3>
Ferramentas para compila&ccedil;&atilde;o cruzada est&atilde;o no
sistema, para uso dos desenvolvedores trabalhando em uma nova
plataforma.
Contudo, elas n&atilde;o s&atilde;o mantidas para uso geral.

<p>
Quando os desenvolvedores oferecem suporte a uma nova plataforma, um dos
primeiros grandes testes &eacute; uma compila&ccedil;&atilde;o nativa.
Compilar o sistema a partir dos fontes exige consideravelmente do SO e
da m&aacute;quina, e faz um excelente trabalho em testar qu&atilde;o bem
o sistema realmente est&aacute; operando.
Por esta raz&atilde;o, o OpenBSD faz todo o trabalho de
compila&ccedil;&atilde;o na plataforma na qual a vers&atilde;o
est&aacute; sendo usada, tamb&eacute;m conhecido como
"compila&ccedil;&atilde;o nativa". Sem compila&ccedil;&atilde;o nativa,
&eacute; muito mais dif&iacute;cil ter certeza de que as v&aacute;rias
plataformas est&atilde;o na verdade operando confiavelmente, e
n&atilde;o apenas bootando.

<p>
<font color= "#0000e0">
<a href= "index.html">[&Iacute;ndice do FAQ]</a>
<a href= "faq4.html">[Para a Se&ccedil;&atilde;o 4 - Guia de
Instala&ccedil;&atilde;o]</a>
<a href= "faq6.html">[Para a Se&ccedil;&atilde;o 6 - Rede]</a>
</font>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src=
"../../images/back.gif" border= "0" alt= "[back]"></a>
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
<!--
Originally [OpenBSD: faq5.html,v 1.168 ]<br>
$Translation: faq5.html,v 1.2 2009/02/25 14:24:53 dsantos Exp $<br>
-->
$OpenBSD: faq5.html,v 1.1 2009/03/02 19:44:49 tobias Exp $
</small>
</body>
</html>
