<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Fonctionnalit&eacute;s de OpenSSH</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2004 by OpenBSD.">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">
<img alt="[OpenSSH]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Fonctionnalit&eacute;s</font></h2>
<hr>
OpenSSH est une suite libre du protocole SSH/SecSH, fournissant des
fonctionnalit&eacute;s de cryptage pour les services r&eacute;seau tels
que le login ou le transfert de fichiers distants.
<p> La liste suivante pr&eacute;sente des fonctionnalit&eacute;s OpenSSH : 
<p>

<ul>
  <li>Projet Open Source 
  <li>Licence Libre 
  <li>Cryptage Fort (3DES, Blowfish) 
  <li>X11 Forwarding (crypte le trafic X Window System) 
  <li>Port Forwarding (cr&eacute;e des canaux crypt&eacute;s pour les protocoles 
    usuels)
  <li>Authentification Forte (Cl&eacute; Publique, Mot de passe &agrave; usage 
    unique et Authentification Kerberos) 
  <li>Agent Forwarding (Single-Sign-On)
  <li>Interop&eacute;rabilit&eacute; (Conformit&eacute; aux standards des protocoles 
    SSH 1.3, 1.5, et 2.0) 
  <li>Support client et serveur SFTP pour les protocoles SSH1 et SSH2
  <li>Transmission des Tickets Kerberos et AFS 
  <li>Compression des Donn&eacute;es
</ul>
<p>

<hr>
&nbsp;<strong>Project Open Source</strong>
<p> Le code source OpenSSH est disponible librement pour tout le monde &agrave; 
  travers Internet. Ce qui encourage la r&eacute;utilisation et l'audit du code. 
  L'examen du code assure la d&eacute;couverte de bogues et leur correction par 
  n'importe qui. Ce qui aboutit &agrave; un code s&ucirc;r. 
<p> &nbsp;<strong>Licence Libre</strong> 
<p> OpenSSH n'est couvert par aucune licence restrictive. Il peut &ecirc;tre utilis&eacute; 
  pour tout motif, et cela inclut explicitement l'utilisation commerciale. <a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE?rev=HEAD">La 
  licence</a> pour OpenSSH est incluse dans la distribution. Nous avons le sentiment 
  que le monde serait meilleur si les routeurs, les appareils r&eacute;seau, les 
  syst&egrave;mes d'exploitation, et tout autre &eacute;quipement r&eacute;seau 
  int&eacute;graient ssh. 
<p> Tous les composants de nature restrictive (i.e. brevets, voir <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl</a>) 
  ont &eacute;t&eacute; supprim&eacute;s du code source; tous les composants sous 
  licence ou brevet&eacute;s sont choisis &agrave; partir de librairies externes 
  (<a href="http://www.openssl.org">OpenSSL</a> par exemple). Le code de cryptage 
  symm&eacute;trique IDEA n'est plus disponible, vu qu'il est brevet&eacute; dans 
  plusieurs pays. Nous recommandons aux gens d'utiliser un des autres algorithmes 
  disponibles. (Nous ne voyons aucune justification &agrave; l'utilisation d'un 
  algorithme symm&eacute;trique brevet&eacute;, &eacute;tant donn&eacute; qu'il 
  existe plusieurs algorithmes libres). 
<p> &nbsp;<strong>Cryptage Fort</strong> 
<p> OpenSSH utilise 3DES et Blowfish comme algorithmes de cryptage. Ils sont tous 
  les deux libres. Triple DES est un algorithme &eacute;prouv&eacute; et bien 
  compris fournissant un cryptage fort. Blowfish est un algorithme en blocs rapide 
  invent&eacute; par Bruce Schneier qui peut &ecirc;tre utilis&eacute; par les 
  personnes n&eacute;cessitant une rapidit&eacute; de cryptage. Le cryptage a 
  lieu avant l'authentification et aucun mot de passe ou toute autre information 
  n'est transmis en clair. Le cryptage est aussi utilis&eacute; pour se pr&eacute;munir 
  contre les paquets usurp&eacute;s. 
<p>
&nbsp;<strong>X11 Forwarding</strong>
<p> X11 forwarding permet le cryptage du trafic distant X windows, de telle fa&ccedil;on 
  &agrave; &eacute;viter le furetage de vos xterms distants ou l'insertion de 
  commandes malicieuses. Le programme positionne automatiquement DISPLAY sur le 
  serveur, et fait suivre toutes les connexions X11 &agrave; travers le canal 
  s&eacute;curis&eacute;. Des informations Xauthority simul&eacute;es sont g&eacute;n&eacute;r&eacute;es 
  automatiquement et envoy&eacute;es &agrave; la machine distante; le client local 
  examine automatiquement les connexions X11 en entr&eacute;e et remplace les 
  donn&eacute;es d'autorisation simul&eacute;es avec les donn&eacute;es r&eacute;elles 
  (en ne donnant jamais &agrave; la machine distante les informations r&eacute;elles). 
<p>
&nbsp;<strong>Port Forwarding</strong>
<p> Port forwarding permet de faire suivre des connexions TCP/IP &agrave; une 
  machine distante &agrave; travers un canal crypt&eacute;. Des applications Internet 
  usuelles telles que POP peuvent &ecirc;tre s&eacute;curis&eacute;es de cette 
  mani&egrave;re. 
<p> &nbsp;<strong>Authentification Forte</strong>
<p> L'authentification forte prot&egrave;ge contre plusieurs probl&egrave;mes 
  de s&eacute;curit&eacute; comme l'usurpation IP, les fausses routes, et l'usurpation 
  DNS. Les m&eacute;thodes d'authentification sont : .rhosts avec authentification 
  d'h&ocirc;te bas&eacute;e sur RSA, authentification RSA pure, mots de passe 
  &agrave; usage unique avec s/key, et finalement authentification <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kerberos&amp;sektion=8">Kerberos</a>. 
<p>
&nbsp;<strong>Agent Forwarding</strong>
<p> Un agent d'authentification s'ex&eacute;cutant sur le portable ou la station
de travail de l'utilisateur, peut &ecirc;tre utiliser pour retenir les
cl&eacute;s d'authentification RSA ou DSA de l'utilisateur. OpenSSH fait suivre
automatiquement la connexion &agrave; l'agent d'authentification &agrave;
travers n'importe quelle connexion, et il n'y a pas besoin de stocker les
cl&eacute;s d'authentification RSA ou DSA sur une machine du r&eacute;seau (mis
&agrave; part la propre machine de l'utilisateur). Les protocoles
d'authentification ne r&eacute;v&egrave;lent jamais les cl&eacute;s; ils peuvent
&ecirc;tre seulement utilis&eacute;s pour v&eacute;rifier que l'agent d'un
utilisateur a une cl&eacute; donn&eacute;e.  Eventuellement, l'agent peut
s'appuyer sur une carte &agrave; puce pour effectuer toutes les
op&eacute;rations d'authentification.

<p> &nbsp;<strong>Interop&eacute;rabilit&eacute;</strong>
<p> Les versions OpenSSH ant&eacute;rieures &agrave; 2.0 supportent les protocoles 
  SSH 1.3 et SSH 1.5 permettant ainsi la communication avec les plupart des UNIX, 
  Windows et d'autres impl&eacute;mentations ssh commerciales. 
<p> A partir de OpenSSH 2.0, en plus du support de protocoles SSH 1.3 et SSH 1.5, 
  OpenSSH supporte aussi le protocole SSH 2.0. Ce protocole &eacute;vite d'utiliser 
  l'algorithme RSA -- puisqu'au moment de l'invention du protocole 2.0, le brevet 
  RSA &eacute;tait encore d'actualit&eacute; -- et emploie, au lieu de cela, les 
  algorithmes libres d'utilisation DH et DSA. 
<p> Ainsi, OpenSSH vous fournit le meilleur des deux mondes. Vous pouvez interagir 
  avec les <strong>deux</strong> types de clients et serveurs ssh !
<p>
&nbsp;<strong>Support client et serveur SFTP pour les protocoles SSH1 et SSH2
</strong>
<p> A partir de OpenSSH 2.5.0, un support complet de SFTP est inclus, utilisant 
  la commande <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sftp&amp;sektion=1">sftp(1)</a> 
  en client. Le sous-syst&egrave;me <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sftp-server&amp;sektion=8"> 
  sftp-server(8)</a> fonctionne automatiquement pour les protocoles SSH1 et SSH2. 
<p>
&nbsp;<strong>Transmission des Tickets Kerberos et AFS</strong>
<p> OpenSSH transmet aussi les tickets pour Kerberos et AFS &agrave; la machine 
  distante. Un utilisateur peut donc acc&eacute;der &agrave; tous ses services 
  Kerberos et AFS sans avoir besoin de ressaisir son mot de passe.
<p> &nbsp;<strong>Compression des Donn&eacute;es</strong> 
<p> La compression des donn&eacute;es avant le cryptage am&eacute;liore les performances 
  sur les liens r&eacute;seau de faible capacit&eacute;. 
<p>
<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt=OpenSSH></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: features.html,v 1.19 ]<br>
$Translation: features.html,v 1.4 2004/03/04 18:59:46 saad Exp $<br>
$OpenBSD: features.html,v 1.4 2004/03/05 07:16:17 jufi Exp $
</small>

</body>
</html>
