<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Histoire du projet OpenSSH et cr&eacute;dits</title>
<link rev=made href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2004 by OpenBSD."> </head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">
<img alt="[OpenSSH]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><strong><font color="#e00000">Histoire du projet et cr&eacute;dits</font></strong></h2>
<hr>

OpenSSH d&eacute;rive de la version originale libre 1.2.12 de ssh &eacute;crite par Tatu Yl&ouml;nen. 
Cette version fut la derni&egrave;re &agrave; &ecirc;tre suffisamment libre pour &ecirc;tre r&eacute;utilisable
par notre projet. Des parties de OpenSSH sont encore sous la licence de Tatu qui
&eacute;tait contenue dans cette version. Cette version, ainsi que les pr&eacute;c&eacute;dentes,
utilisaient des fonctions math&eacute;matiques de la biblioth&egrave;ques libgmp. Cette
biblioth&egrave;que &eacute;tait aussi inclue avec les versions pr&eacute;c&eacute;dentes de ssh. La
biblioth&egrave;que libgmp est disponible sous licence LGPL (Lesser GNU Public
Licence), bien que les versions de l'&eacute;poque &eacute;taient sous la licence GPL (GNU
Public Licence) classique.
</p>

Une licence combin&eacute;e pour tous ces morceaux est disponible &agrave; l'adresse 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE?rev=HEAD">
http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE</a>.
<p>

Rapidement apr&egrave;s la sortie de la 1.2.12, les versions suivantes ont &eacute;t&eacute; mises
sous des licences de plus en plus restrictives, m&ecirc;me si la libgmp &eacute;tait encore
inclue et n&eacute;cessaire pour utiliser le logiciel. Les premi&egrave;re licences
restrictives interdisaient aux gens de faire une version Windows ou DOS. Les
suivantes restreignaient l'utilisation de ssh dans un environnement commercial,
obligeant les entreprises &agrave; acheter plut&ocirc;t une version on&eacute;reuse chez
Datafellows.
<p>

D&eacute;but 1999, Bj&ouml;rn Gr&ouml;nvall red&eacute;couvrit cette version particuli&egrave;re et
commen&ccedil;a &agrave; r&eacute;parer des bogues. Sa version de ssh s'appelle
<a href="ftp://ftp.pdc.kth.se/pub/krypto/ossh/">OSSH</a> et ne supportait que le
protocole SSH 1.3. On raconte que OSSH a &eacute;t&eacute; int&eacute;gr&eacute; dans des produits
commerciaux en Su&egrave;de. Au jour d'aujourd'hui, OSSH ne supporte toujours pas le
protcole SSH 2.
<p>
Les membres du projet OpenBSD ont eu connaissance du travail de Bj&ouml;rn moins
de deux mois avant la sortie de <a href="http://www.openbsd.org/fr/26.html">
version 2.6 d'OpenBSD</a>. Nous voulions &ecirc;tre s&ucirc;rs que cela serait parfait. En
cons&eacute;quence, nous avons d&eacute;cid&eacute; de nous s&eacute;parer de la version OSSH et de
poursuivre un d&eacute;veloppement rapide, de la m&ecirc;me fa&ccedil;on que le processus originel 
d'audit de s&eacute;curit&eacute; d'OpenBSD avait eu lieu. Ainsi, au moment de la sortie, de
nombreux fichiers source en &eacute;taient d&eacute;j&agrave; &agrave; la version RCS 1.34, et m&ecirc;me pour 
certains &agrave; la version 1.66. Le d&eacute;veloppement a en effet &eacute;t&eacute; tr&egrave;s rapide, puisque
nous avions une &eacute;ch&eacute;ance &agrave; respecter.
<p>

Les personnes suivantes ont particip&eacute; au d&eacute;veloppement : 
<p>

<ul>
<li>Theo de Raadt (CANADA) a commenc&eacute; par supprimer les choses non portables qui
rendaient le code plus difficile &agrave; lire (le but &eacute;tant un code source plus
simple, afin de d&eacute;tecter plus facilement les trous de s&eacute;curit&eacute; et autres
probl&egrave;mes).
<li>Niels Provos (ALLEMAGNE mais vivant aux USA) supprima rapidement les
composants cryptographiques, ainsi que ceux sous licence GPL, en faisant des
allers-retours au Canada, de fa&ccedil;on &agrave; ce que nous puissions aboutir &agrave; un code
source de base compl&egrave;tement r&eacute;utilisable librement. 
<li>Markus Friedl (ALLEMAGNE) s'est joint au projet et a tr&egrave;s rapidement r&eacute;ussi
&agrave; remplacer le code du protocole SSH 1.3 venant de la version 1.2.12 avec une
mise en oeuvre du protocole SSH 1.5 compatible avec les s&eacute;ries modernes "ssh
1.2.27" (cette modification &eacute;tait n&eacute;cessaire pour interop&eacute;rer avec de nombreux
clients Windows compatibles SSH qui n'avaient pas le support du protocole SSH
1.3). Son impl&eacute;mentation est d&eacute;sormais utilis&eacute;e dans OSSH.
Il ajouta le support du protocole SSH 1.5 de telle fa&ccedil;on que le support du
protocole SSH 1.3 demeure op&eacute;rationnelle. Plus tard, il ajouta aussi le support
pour le protocole SSH 2 et SFTP. 
<li>Bob Beck (CANADA) assura, gr&acirc;ce &agrave; astuces de Makefile, que nous pouvions
compiler OpenSSL sans algorithmes brevet&eacute;s ; puisque OpenBSD 2.6 sortait avant
la d&acirc;te d'expiration du brevet RSA, nous devions placer sur notre CD des
biblioth&egrave;ques partag&eacute;es libssl et libcrypto sans le support de RSA. Au moment de
l'installation, l'utilisateur pouvait remplacer ces biblioth&egrave;ques par
t&eacute;l&eacute;chargement en FTP/HTTP sur l'Internet. Par chance, ce genre d'astuce n'est
plus n&eacute;cessaire.
<li>Aaron Campbell (CANADA) a am&eacute;lior&eacute; de nombreuses faiblesses dans la
documentation et quelques autres probl&egrave;mes de code. C'est principalement gr&acirc;ce &agrave;
lui que les pages de manuel sont si compl&egrave;tes.
<li>Dug Song (USA) a aid&eacute; avec des probl&egrave;mes d'authentification dans le cas de
KerberosIV (ses modifications ont &eacute;t&eacute; v&eacute;rifi&eacute;es avec attention, pour s'assurer
qu'elles ne concernaient que des probl&egrave;mes d'authentification et pas de
cryptographie).
</ul>
<p>

Ainsi, la version d'OpenSSH &eacute;tait bas&eacute;e sur les versions pr&eacute;c&eacute;dant ssh 1.2.12,
mais avec de nombreux bogues supprim&eacute;s et de nouvelles fonctionnalit&eacute;s
r&eacute;-ajout&eacute;es : 
<p>

<ul>

<li>
Tous les composants de nature restrictive (i.e les brevets, voir
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl</a>)
&eacute;taient direcement supprim&eacute;s du code source ; tout composant sous licence or
sous le coup d'un brevet provenait de biblioth&egrave;ques ext&eacute;rieures
(par exemple, <a href="http://www.openssl.org/">OpenSSL</a>).

<li>
Ajoute le support de l'authentification
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kerberos&amp;sektion=8">KerberosIV</a>
et la transmission de tickets.

<li>
Supporte l'authentification par mot de passe &agrave; validit&eacute; unique avec
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&amp;sektion=1">skey</a>

<li> Et de centaines d'autres modifications que les gens peuvent observer dans
les nouvelles pages de manuel, ainsi que dans les modifications du code source.
</ul>
<p>

Cette version sortit sous le nom d'OpenSSH 1.2.2 et fut fournie avec OpenBSD
2.6, le premier d&eacute;cembre 1999. A cette &eacute;poque, la plupart du d&eacute;veloppement
d'OpenSSH avait &eacute;t&eacute; r&eacute;alis&eacute; par Aaron Campbell, Bob Beck, Markus Friedl, 
Niels Provos, Theo de Raadt et Dug Song.
Nous remercions les nombreuses personnes qui ont trouv&eacute; des bogues et nous les
ont rapport&eacute;s.
<p>

<a name="portable">
<h3>Portage d'OpenSSH</h3>
Presque imm&eacute;diatement apr&egrave;s que nous ayons sorti notre mise en oeuvre du
protocole 1, divers groupes non-OpenBSD ont &eacute;t&eacute; tr&egrave;s, tr&egrave;s int&eacute;ress&eacute;s. Damien
Miller, Philip Hands et beaucoup d'autres ont commenc&eacute; &agrave; porter OpenSSH sur
Linux et d'autres syst&egrave;mes d'exploitation Unix. Depuis le d&eacute;but de notre propre
effort, nous avions trouv&eacute; que m&ecirc;me le code originel de ssh &eacute;tait trop
compliqu&eacute;, il avait tout simplement trop de d&eacute;pendances sur le syst&egrave;me
d'exploitation &agrave; g&eacute;rer. Notre approche qui consiste &agrave; &eacute;crire du code
compl&egrave;tement s&ucirc;r et tr&egrave;s fiables &eacute;vite de s'occuper de diff&eacute;rences excessives
comme cela. Ainsi, pour rendre le processus d&eacute;veloppement plus facile pour tous,
nous avons d&eacute;cid&eacute; de s&eacute;parer nos effort de d&eacute;veloppement sur le noyau dur et
ceux concernant la portabilit&eacute;. Cela a tr&egrave;s bien march&eacute; pour nous (Pour vous
faire une id&eacute;e, comparez le nombre de ligne des version de base et portables).
<p>

<h3>Support du protocole SSH 2 </h3>
Apr&egrave;s la sortie d'OpenBSD 2.6, Markus Friedl d&eacute;cida de poursuivre le support du
<a href="goals.html">protocole SSH 2</a>. Travaillant d'arrache-pied pendant des
mois, il a r&eacute;ussi &agrave; garder OpenSSH l&eacute;ger, tout en en faisant un logiciel capable
de supporter &agrave; la fois les protocoles SSH 1 et 2. Cette versions, appel&eacute;e
OpenSSH 2.0, fut distribu&eacute;e dans OpenBSD 2.7, le 15 Juin 2000. La plupart des
v&eacute;rifications des modifications de Markus ont &eacute;t&eacute; faites par Niels Provos et
Theo de Raadt. Bob Beck peut &ecirc;tre remerci&eacute; pour avoir mis &agrave; jour OpenSSL &agrave; une
version plus r&eacute;cente.
<p>

<h3>Support de SFTP </h3>
Le support c&ocirc;t&eacute; serveur du sous-protocole SFTP a &eacute;t&eacute; &eacute;crit par Markus Friedl et
publi&eacute; dans la version 2.3.0, en novembre 2000. Peu de temps apr&egrave;s, Damien
Miller a commenc&eacute; &agrave; travailler sur un client sftp, qui a &eacute;t&eacute; publi&eacute; dans la
2.5.0.
<p>

<h3>Tester les versions des serveurs SSH</h3>
Pour faciliter le contr&ocirc;le des serveurs SSH d&eacute;ploy&eacute;s, par exemple pour une
entreprise, Niels Provos a &eacute;crit l'outil
<a href="http://www.monkey.org/~provos/scanssh/">scanssh</a>.
scanssh chercher parmi une liste d'adresses et de r&eacute;seaux des serveurs SSH et
leurs num&eacute;ros de version. Il supporte la s&eacute;lection al&eacute;atoire d'adresses IP parmi
une large plage d'adresses et est utile pour rassembler des statistiques sur
l'utilisation de serveurs SSH dans une entreprise ou sur tout l'Internet. Les
statistiques incluent le protocole SSH support&eacute; et les versions logicielles
utilis&eacute;es.
<p>

scanssh est utilis&eacute; pour rassembler des <a href="../usage/index.html">statistiques</a> 
sur le d&eacute;ploiement et l'utilisation du protocole SSH sur l'Internet. Ces
chiffres offrent des &eacute;claircissements sur le distribution des diff&eacute;rents
protocoles SSH et la part de march&eacute; d'une version donn&eacute;e de serveur.
<hr>
<h2><font color="#e00000">SSH: Finalement compl&egrave;tement libre.</font></h2>

<img width=764 height=500 src="../images/quiet.jpg" 
alt="SSH... Don't Tell Anyone It's Free">

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt=OpenSSH></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: history.html,v 1.33 ]<br>
$Translation: history.html,v 1.7 2004/03/04 19:46:47 saad Exp $<br>
$OpenBSD: history.html,v 1.6 2004/03/05 07:16:17 jufi Exp $
</small>

</body>
</html>
