<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenSSH Security</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="OpenSSH advisories">
<meta name="keywords" content="security,openssh,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2002 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<img alt="[OpenSSH]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">S&eacute;curit&eacute;</font></h2>
<hr>
OpenSSH est d&eacute;velopp&eacute; avec le m&ecirc;me, rigoureux, processus s&eacute;curit&eacute; 
que celui pour lequel est bien connu le groupe OpenBSD. 
<p> Pour plus d'informations, consultez <a href="http://www.openbsd.org/security.html">La 
  page s&eacute;curit&eacute; OpenBSD</a>.
<p>

<ul>
  <li>OpenSSH n'a pas &eacute;t&eacute; vuln&eacute;rable aux attaques de <a href="http://www.kb.cert.org/vuls/id/565052">cassure 
    de mots de passe</a>, de <a href="http://www.kb.cert.org/vuls/id/665372">rejeu</a>, 
    ou de <a href="http://www.kb.cert.org/vuls/id/25309">modification</a> contre 
    le code RC4. Au moment o&ugrave; OpenSSH f&ucirc;t initi&eacute;, l'utilisation 
    incorrecte du code RC4 au sein de SSH 1 &eacute;tait d&eacute;j&agrave; connue, 
    et le support RC4 a donc &eacute;t&eacute; supprim&eacute;. 
    <p> 
  <li>OpenSSH n'a pas &eacute;t&eacute; vuln&eacute;rable aux <a href="http://www.kb.cert.org/vuls/id/684820">attaques 
    &quot;client forwarding&quot;</a> sur les connexions non chiffr&eacute;es, 
    vu que le support des connexions non chiffr&eacute;es a &eacute;t&eacute; 
    supprim&eacute; au d&eacute;but du projet OpenSSH. 
    <p> 
  <li>OpenSSH n'a pas &eacute;t&eacute; vuln&eacute;rable aux <a href="http://www.kb.cert.org/vuls/id/315308">attaques 
    sur le dernier paquet</a> contre l'algorithme de chiffrement IDEA, vu que 
    l'algorithme IDEA n'est pas support&eacute;. Le statut du brevet utilis&eacute; 
    par IDEA le rend peu appropri&eacute; &agrave; une inclusion dans OpenSSH. 
    <p> 
  <li>OpenSSH ne permet &agrave; localhost d'&ecirc;tre exempt&eacute; de la v&eacute;rification 
    de la cl&eacute; d'h&ocirc;te, ce qui le rend invuln&eacute;rable &agrave; 
    l'attaque par <a href="http://www.kb.cert.org/vuls/id/786900">contournement 
    de l'authentification de la cl&eacute; d'h&ocirc;te</a>. 
    <p> 
  <li>OpenSSH n'a pas &eacute;t&eacute; vuln&eacute;rable aux attaques dites <a href="http://www.kb.cert.org/vuls/id/118892">&quot;uncontrollable 
    X11 forwarding&quot;</a> car le &quot;X11-forwarding&quot; est d&eacute;sactiv&eacute; 
    par d&eacute;faut et l'utilisateur peut l'activer ou le d&eacute;sactiver. 
    <p> 
  <li>OpenSSH poss&egrave;de la d&eacute;fience au niveau du protocole SSH 1 qui 
    rendrait une attaque par insertion difficile mais possible. Le <a 
    href="http://www2.corest.com/common/showdoc.php?idx=131&amp;idxseccion=10">m&eacute;canisme 
    &quot;deattack&quot;</a> de CORE-SDI <a href="http://www.core-sdi.com/soft/ssh/ssh-advisory.txt"></a> 
    est utilis&eacute; pour &eacute;liminer le cas commun. Des mani&egrave;res 
    de r&eacute;soudre ce probl&egrave;me sont en cours d'investigation, &eacute;tant 
    donn&eacute; que le protocole SSH 1 n'est pas encore tomb&eacute; en obsolescence. 
    <p> 
  <li>OpenSSH n'a jamais &eacute;t&eacute; sensible &agrave; la vuln&eacute;rabilit&eacute; 
    dite "Feb 5, 2001: SSH-1 Brute Force Password Vulnerability", <a href="http://www.crimelabs.net/">Crimelabs 
    Security Note CLABS200101</a>. 
    <p> 
  <li>OpenSSH 2.1.0 et les versions post&eacute;rieures ne permettent pas &agrave; 
    un attaquant distant d'<a href="http://www.kb.cert.org/vuls/id/40327">ex&eacute;cuter 
    des commandes arbitraires avec les privil&egrave;ges de sshd si UseLogin</a> 
    est activ&eacute; par l'administrateur. UseLogin est d&eacute;sactiv&eacute; 
    par d&eacute;faut. Ce probl&egrave;me a &eacute;t&eacute; corrig&eacute; sur 
    la version OpenSSH 2.1.0. 
    <p> 
  <li>OpenSSH 2.2.0 et les versions post&eacute;rieures ne sont pas sensibles 
    &agrave; la vuln&eacute;rabilit&eacute; dite "Feb 7, 2001: SSH-1 Session Key 
    Recovery Vulnerability", CORE-SDI Advisory CORE-20010116. OpenSSH impose des 
    limites au niveau du taux de connexions, rendant l'attaque infaisable. De 
    plus, l'oracle de Bleichenbacher a &eacute;t&eacute; compl&egrave;tement ferm&eacute; 
    depuis le 29 janvier 2001. </li>
</ul>
<blockquote> 
  <p>&nbsp; </p>
</blockquote>
<ul>
  <li>OpenSSH 2.3.0 et les versions post&eacute;rieures ne sont pas sensibles 
    &agrave; l'attaque par compensation plus connue sous le nom de "Feb 8, 2001: 
    SSH-1 Daemon CRC32 Compensation Attack Detector Vulnerability", <a href="http://razor.bindview.com/publish/advisories/adv_ssh1crc.html">RAZOR 
    Bindview Advisory CAN-2001-0144</a>. Un d&eacute;passement de tampon dans 
    le d&eacute;tecteur d'attaques par compensation CRC32 peut conduire &agrave; 
    un acc&egrave;s distant root. Ce probl&egrave;me a &eacute;t&eacute; corrig&eacute; 
    dans OpenSSH 2.3.0. Cependant, tout version ant&eacute;rieure &agrave; 2.3.0 
    est vuln&eacute;rable. 
    <p> 
  <li>OpenSSH 2.3.0 et les versions post&eacute;rieures ne permettent pas aux 
    <a href="http://www.kb.cert.org/vuls/id/363181">serveurs malicieux d'acc&egrave;der 
    &agrave; l'affichage X11 ou au ssh-agent du client</a>. Ce probl&egrave;me 
    a &eacute;t&eacute; corrig&eacute; dans OpenSSH 2.3.0. 
    <p> 
  <li>OpenSSH 2.3.1, un snapshot de d&eacute;veloppement jamais publi&eacute;, 
    &eacute;tait sensible &agrave; la vuln&eacute;rabilit&eacute; dite "Feb 8, 
    2001: Authentication By-Pass Vulnerability in OpenSSH-2.3.1", <a href="http://www.openbsd.org/advisories/ssh_bypass.txt">OpenBSD 
    Security Advisory</a>. Dans le protocole 2, l'authentification peut &ecirc;tre 
    contourn&eacute;e si l'authentification par cl&eacute; publique &eacute;tait 
    permise. Ce probl&egrave;me est sp&eacute;cifique &agrave; OpenSSH 2.3.1, 
    une version de d&eacute;veloppement interne de 3 semaines. OpenSSH 2.3.0 et 
    les version plus r&eacute;centes que 2.3.1 ne sont pas vuln&eacute;rables 
    &agrave; ce probl&egrave;me. 
    <p> 
  <li>OpenSSH 2.9.9 et les versions post&eacute;rieures ne permettent pas aux 
    utilisateurs d'<a href="http://www.kb.cert.org/vuls/id/655259"> effacer les 
    fichiers nomm&eacute;s "cookies" si le &quot;X11 forwarding&quot; est activ&eacute;</a>. 
    le &quot;X11 forwarding&quot; est d&eacute;sactiv&eacute; par d&eacute;faut. 
    <p> 
  <li>OpenSSH 2.9.9 et les versions post&eacute;rieures ne sont pas sensibles 
    &agrave; la vuln&eacute;rabilit&eacute; dite "Sep 26, 2001: Weakness in OpenSSH's 
    source IP based access control for SSH protocol v2 public key authentication.", 
    <a href="http://www.openbsd.org/advisories/ssh_option.txt">OpenSSH Security 
    Advisory</a>. 
    <p> 
      
  <li>OpenSSH 3.0.2 et les versions post&eacute;rieures ne permettent pas aux 
    utilisateurs de <a href="http://www.kb.cert.org/vuls/id/157447"> communiquer 
    des variables d'environnement &agrave; login(1) si UseLogin est activ&eacute;</a>. 
    L'option UseLogin est d&eacute;sactiv&eacute;e par d&eacute;faut dans toutes 
    les version publi&eacute;es d'OpenSSH. </li>
</ul>
<blockquote>
  <p>&nbsp; </p>
</blockquote>
<ul>
  <li>OpenSSH 3.1 et les versions post&eacute;rieures n'&eacute;taient pas sensibles 
    &agrave; la vuln&eacute;rabilit&eacute; dite "March 7, 2002: Off-by-one error 
    in the channel code", <a href="http://www.openbsd.org/advisories/ssh_channelalloc.txt">OpenSSH 
    Security Advisory</a>. 
    <p> 
  <li>OpenSSH 3.2.1 et les versions post&eacute;rieures ne sont pas sensibles 
    &agrave; la vuln&eacute;rabilit&eacute; dite "April 21, 2002: Buffer overflow 
    in AFS/Kerberos token passing code", <a href="http://www.openbsd.org/advisories/ssh_afstoken.txt">OpenSSH 
    Security Advisory</a> : Les versions ant&eacute;rieures &agrave;OpenSSH 3.2.1 
    autorisent un acc&egrave;s privil&eacute;gi&eacute; si &quot;AFS/Kerberos 
    token passing&quot; est compil&eacute; et activ&eacute; (soit dans le syst&egrave;me 
    soit dans sshd_config). 
    <p> 
  <li>OpenSSH 3.4 et les versions post&eacute;rieures ne sont pas sensibles &agrave; 
    la vuln&eacute;rabilit&eacute; dite "June 26, 2002: OpenSSH Remote Challenge 
    Vulnerability", <a href="http://www.openssh.com/txt/preauth.adv">OpenSSH Security 
    Advisory</a>. 
<p>

<li>OpenSSH 3.7.1 et les versions post&eacute;rieures ne sont pas vuln&eacute;rables
&agrave; la vuln&eacute;rabilit&eacute; dite "September 16, 2003: OpenSSH Buffer Management bug",
<a href="http://www.openssh.com/txt/buffer.adv">OpenSSH Security Advisory</a>.
</ul>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt="OpenSSH"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: security.html,v 1.28 ]<br>
$Translation: security.html,v 1.4 2003/09/17 05:54:14 saad Exp $<br>
$OpenBSD: security.html,v 1.3 2003/09/17 20:06:56 horacio Exp $
</small>

</body>
</html>
