<html>
<head>
<title>Alternatives &agrave; OpenSSH pour Unix</title>
<link rev="made href=mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> 
<meta name="description" content="the OpenSSH project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2004 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<img alt="[OpenSSH]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color=#e00000>Alternatives Unix</font><hr></h2>

Si vous choisissez de ne pas utiliser OpenSSH sous Unix, les clients
"libres" suivants sont disponibles pour interagir avec OpenSSH:
<p>

<ul>
<li><a href="ftp://ftp.pdc.kth.se/pub/krypto/ossh/">OSSH</a>
impl&eacute;mente SSH1 uniquement. Licence BSD.
<p> 
Bj&ouml;rn Gr&ouml;nvall &eacute;tait la premi&egrave;re personne
&agrave; avoir d&eacute;velopp&eacute; ssh, pour rappeler &agrave; notre
communaut&eacute; que les versions tr&egrave;s anciennes du vrai ssh
avaient une licence libre. Ceci est sa propre impl&eacute;mentation,
bas&eacute;e sur l'ancien code de Tatu. OpenSSH &eacute;tait bas&eacute;
sur une premi&egrave;re version d'OSSH, mais OpenSSH a ajout&eacute;
SSH2 et a am&eacute;lior&eacute; le support du protocole SSH1.
<p>

<li><a href="http://www.net.lut.ac.uk/psst/">LSH/psst</a>
impl&eacute;mente SSH2 uniquement, par Niels M&ouml;ller en Sweden,
Licence GPL.
<p>

"ssh utilise des techniques cryptographiques pour augmenter la
s&eacute;curit&eacute; des t&acirc;ches quotidiennes comme des transfers
de fichiers, connexions &agrave; distances, et ex&eacute;cution de
commande &agrave; distance. C'est destin&eacute; a &ecirc;tre une
alternative (plus) s&eacute;curis&eacute;e par rapport &agrave; telnet,
ftp, rsh, login et rexec - et qui n&eacute;cc&eacute;ssite moins
d'&eacute;ffort &agrave; mettre en place que Kerberos ou IPSEC."
<p>

<li><a href="http://www.fressh.org/">FreSSH</a>
impl&eacute;mente SSH, &eacute;crit &agrave; l'origine par Eric
Haszlakiewicz et Thor Lancelot Simon, et actuellement
d&eacute;velopp&eacute; par Jason R. Thorpe. La licence est de type BSD,
cependant elle doit &ecirc;tre lue attentivement car elle contient des
parties d&eacute;velopp&eacute;es par d'autres personnes et sous une
licence diff&eacute;rente.
<p>

<li><a href="http://matt.ucc.asn.au/dropbear/dropbear.html">Dropbear</a>
est une petite impl&eacute;mentation serveur de SSH2 &eacute;crite par
Matt Johnston. Elle est disponible sous licence de type MIT.
<p>

</ul>

<p>
<hr>
<a href="index.html"><img height=24 width=24 src="../../back.gif" border=0 alt=OpenSSH></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a> <br>
<small>
Originally [OpenBSD: unix.html,v 1.13 ]<br>
$Translation: unix.html,v 1.3 2004/01/25 23:20:26 saad Exp $<br>
$OpenBSD: unix.html,v 1.3 2004/02/08 11:58:49 jufi Exp $
</small>

</body>
</html>
