<html>
<head>
<title>Alternatives &agrave; OpenSSH pour Windows & Mac</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="the OpenSSH project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2003 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<img alt="[OpenSSH]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color=#e00000>Windows & Mac</font><hr></h2>

Les clients "libres" suivants sont recommand&eacute;s pour interagir avec OpenSSH 
pour les machines sous Windows: 
<p>

<ul>
<li><a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/">PuTTY</a>
impl&eacute;mente SSH1+SSH2.  PSCP, un programme type
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>
pour Windows, est aussi disponible.
    <p> PuTTY est disponible sous licence MIT (type BSD). 
    <p>

"PuTTY est une impl&eacute;mentation libre de Telnet et SSH pour les
plates-formes Win32, &eacute;crite et maintenue principalement par Simon Tatham,
 qui vit en Grande-Bretagne."
<p>

<li><a href="http://www.zip.com.au/~roca/ttssh.html">TTSSH (SSH1)</a>
impl&eacute;mente SSH1 uniquement, par Robert O'Callahan.
    <p> "TTSSH est un client SSH libre pour Windows. Il est sous la forme d'une 
      extension DLL pour Teraterm Pro. Teraterm Pro est un excellent client telnet/&eacute;mulateur 
      libre sous windows, et les sources sont disponibles. TTSSH ajoute la possibilit&eacute; 
      &agrave; Teraterm Pro de pouvoir faire du SSH sans sacrifier aucune des 
      fonctionnalit&eacute;s existantes de TeraTerm. TTSH est aussi libre &agrave; 
      t&eacute;l&eacute;charger et &agrave; utiliser et les sources sont aussi 
      disponibles, avec une licence open source. En outre, TTSSH a &eacute;t&eacute; 
      enti&egrave;rement d&eacute;velopp&eacute; en Australie [...]." 
    <p>

<li><a href="http://www.cygwin.com">Cygwin (logiciel POSIX sous Windows)</a>
    <p> OpenSSH (protocole SSH1 et SSH2) peut fonctionner avec Cygwin sous Windows 
      en utilisant la <a href="../portable.html">version portable d'OpenSSH</a>. 
    <p>

<li><a href="http://cs.mscd.edu/MSSH/index.html">MSSH</a>
<p> MSSH du Metropolitan State College de Denver supporte le protocole SSH1 
et fonctionne sous Windows 95 et Windows 98. 
<p>

<li><a href="http://www.i-tree.org/ixplorer.htm">Secure iXplorer</a>
<p>
Secure iXplorer est une interface graphique pour pscp.exe de <a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/">PuTTY</a>.
<p>

<li><a href="http://winscp.vse.cz/eng">WinSCP</a>
<p>
WinSCP est un programme type scp(1) pour Windows, avec PuTTY int&eacute;gr&eacute;.
</ul>

Mac OS X inclut OpenSSH par d&eacute;faut. On recommande les clients suivants
pour interagir avec OpenSSH &agrave; partir de machines Mac OS 9 :
<p>

<ul>
<li><a href="http://www.lysator.liu.se/~jonasw/freeware/niftyssh/">NiftyTelnet 1.1 SSH</a>
impl&eacute;mente SSH1 uniquement avec un programme
type <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>.
Ecrit par Jonas Wallden.<p>

"NiftyTelnet 1.1 SSH r3 est une version am&eacute;lior&eacute;e de
l'application NiftyTelnet de Chris Newman qui ajoute le support du 
chiffrage des sessions en utilisant le protocole SSH (Secure Shell). 
Lisez s'il vous pla&icirc;t le fichier Readme inclut avant
de distribuer cette version."
<p>

<li><a href="http://www.macssh.com/">MacSSH</a> impl&eacute;mente SSH2 uniquement.
    <p> "MacSSH est une version modifi&eacute; de BetterTelnet avec le support SSH2.[...] 
      Le seul client SSH2 pour MacOS que j'ai pu trouver est un produit commercial 
      qui coute plus de 100$, et celui-ci plante mon Mac quand je ferme une session... 
      Puisque le mieux est de faire les choses soi-m&ecirc;me, voici MacSSH." 
<li><a href="http://rsug.itd.umich.edu/software/fugu/">Fugu</a> est une
impl&eacute;mentation de SFTP et de SCP.
implementation of SFTP and SCP.
<p>

"Fugu SSH est une interface graphique pour l'application Secure File
Transfer (SFTP) de OpenSSH. Il vous permet de b&eacute;n&eacute;ficier
de la s&eacute;curit&eacute; de SFTP sans devoir sacrifier la
facilit&eacute; d'utilisation offerte par une interface utilisateur
graphique. Fugu contient aussi le support des transferts de fichiers
SCP, et la possibilit&eacute; de cr&eacute;er des tunnels
s&eacute;curis&eacute;s &agrave; travers SSH".

  </ul>

<p>
<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt=OpenSSH></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: windows.html,v 1.26 ]<br>
$Translation: windows.html,v 1.5 2003/08/18 20:14:05 saad Exp $<br>
$OpenBSD: windows.html,v 1.4 2003/08/22 20:35:15 jufi Exp $
</small>

</body>
</html>
