<!doctype html public "-//W3C//DTD HTML 4.0 Transitional//EN"
                 "http://www.w3.org/TR/REC-html40/loose.dtd">
<html>
<head>
<title>Az OpenBSD projekt c&eacute;ljai</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD projekt c&eacute;lok weblap">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2002 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">A projekt c&eacute;ljai</font></h2>
<hr>

<p>
Minden fejleszt&otilde;nknek megvannak a maga c&eacute;ljai, de vannak olyanok is, amelyeket
mindannyian fontosnak tartunk:<p>

<ul>
<li>A lehet&otilde; legjobb fejleszt&otilde;i platformot pr&oacute;b&aacute;ljuk adni.  <a href=anoncvs.html>
	A fejleszt&otilde;knek &eacute;s a felhaszn&aacute;l&oacute;knak a teljes forr&aacute;sk&oacute;dot, illetve
	az ebben t&ouml;rt&eacute;nt v&aacute;ltoz&aacute;sokat el&eacute;rhet&otilde;v&eacute; tessz&uuml;k</a>.
	A felhaszn&aacute;l&oacute;k <a
	href="http://www.openbsd.org/cgi-bin/cvsweb">k&ouml;zvetlen&uuml;l a weben</a>
	is belen&eacute;zhetnek a forr&aacute;sba &eacute;s a v&aacute;ltoztat&aacute;sokba!<p>
<li>Be&eacute;p&iacute;tj&uuml;k a sz&aacute;munkra <a href=../policy.html>elfogadhat&oacute; licensz&ucirc; (a
	Berkeley t&iacute;pus&uacute;t el&otilde;nyben r&eacute;szes&iacute;tj&uuml;k, a GPL-t elfogadjuk, az NDA-t,
	azaz a Non Disclosure Agreementet nem)</a>, j&oacute;nak tal&aacute;lt k&oacute;dot.
	Olyan forr&aacute;sk&oacute;dot szeretn&eacute;nk el&eacute;rhet&otilde;v&eacute; tenni, amit b&aacute;rki haszn&aacute;lhat
	B&Aacute;RMILYEN c&eacute;lra, megk&ouml;t&eacute;sek n&eacute;lk&uuml;l.
	<strong>Arra t&ouml;reksz&uuml;nk, hogy a szoftver, amit k&eacute;sz&iacute;t&uuml;nk robusztus
	&eacute;s biztons&aacute;gos legyen, tov&aacute;bb&aacute; arra b&aacute;tor&iacute;tjuk a c&eacute;geket, hogy 
	haszn&aacute;lj&aacute;k a program azon r&eacute;sz&eacute;t amelyiket csak akarj&aacute;k.</strong>
	Sz&aacute;mos OpenBSD-n alapul&oacute; <a href=../products.html>kereskedelmi
	term&eacute;k kaphat&oacute;</a>.<p>
<li>Nagy gondot ford&iacute;tunk a <a href=../security.html>biztons&aacute;gi hib&aacute;kra &eacute;s
	arra, hogy mindenkin&eacute;l hamarabb jav&iacute;tsuk azokat</a>. (A
	legbiztons&aacute;gosabb oper&aacute;ci&oacute;s rendszert szeretn&eacute;nk kiadni).<p>
<li><a href=../crypto.html>Kriptografikus programok integr&aacute;l&aacute;sa.</a>
	Ez alatt az IPsec, IPv6, kulcs motorok, Kerberos, szabad-AFS &eacute;s egy&eacute;b 
	er&otilde;s kriptogr&aacute;fia, vagy kriptogr&aacute;fiai rendszereket &eacute;rtj&uuml;k.
	Az OpenBSD-t Kanad&aacute;ban fejlesztik &eacute;s adj&aacute;k ki, &iacute;gy az ott &eacute;rv&eacute;nyben
	l&eacute;v&otilde; t&ouml;rv&eacute;nyeknek k&ouml;sz&ouml;nhet&otilde;en terjeszt&eacute;se nem okoz probl&eacute;m&aacute;t.
	(L&aacute;sd:
	<a href="http://insight.mcmaster.ca/org/efc/pages/doc/crypto-export.html">
	"A summary of Canada's export controls on cryptographic software</a>, illetve <a
	href="http://axion.physics.ubc.ca/ECL.html">Excerpts from the Export
	Control List of Canada</a>).
	Az OpenBSD fejleszt&otilde;k akt&iacute;v kutat&oacute;- &eacute;s fejleszt&otilde;munk&aacute;t v&eacute;geznek az
	IPsec-kel &eacute;s a <a
	href="http://www.physnet.uni-hamburg.de/provos/photuris">Photuris key
	engine</a>-nel kapcsolatban.<p>
<li>Szabv&aacute;nyok k&ouml;vet&eacute;se &eacute;s implement&aacute;l&aacute;sa (ANSI, POSIX, X/Open r&eacute;szek, stb.)<p>
<li>Min&eacute;l g&eacute;pf&uuml;ggetlenebb forr&aacute;sfa kialak&iacute;t&aacute;sa.
	<a href=plat.html>Min&eacute;l t&ouml;bb k&uuml;l&ouml;nb&ouml;z&otilde; rendszer &eacute;s hardware
	t&aacute;mogat&aacute;sa.</a><p>
<li>Pr&oacute;b&aacute;lunk politikamentesek lenni; a megold&aacute;sok technikai &eacute;rdem&uuml;k
	szerint legyenek kiv&aacute;lasztva.<p>
<li>Ne maradjanak s&uacute;lyos hib&aacute;k megoldatlanul.<p>
<li>J&oacute; cross compile/fejleszt&otilde;i platformot biztos&iacute;tsunk.<p>
<li>A k&uuml;ls&otilde; csomagokat min&eacute;l kisebb v&aacute;ltoztat&aacute;sokkal &eacute;p&iacute;ts&uuml;k be a
	rendszerbe, &iacute;gy biztos&iacute;tva a k&ouml;nnyebb verzi&oacute;k&ouml;vet&eacute;st, tov&aacute;bb&aacute; az
	&aacute;ltalunk eszk&ouml;z&ouml;lt v&aacute;ltoztat&aacute;sokat visszak&uuml;ldj&uuml;k a fejleszt&otilde;knek.<p>
<li>Egy CDROM-on alapul&oacute; kiad&aacute;s megjelentet&eacute;se f&eacute;l&eacute;vente a projekt anyagi
	seg&iacute;t&eacute;se &eacute;rdek&eacute;ben...<p>
</ul>

<h2>
<a name=funding><font color="#e00000">A projekt seg&iacute;t&eacute;se</font></a></h2>

Term&eacute;szet&eacute;n&eacute;l fogva az OpenBSD projekt m&ucirc;k&ouml;dtet&eacute;s&eacute;hez p&eacute;nz kell, az Internet
el&eacute;r&eacute;s &eacute;s a hardver fejleszt&eacute;sek biztos&iacute;t&aacute;s&aacute;ra. Ennek megteremt&eacute;s&eacute;nek
&eacute;rdek&eacute;ben a projekt CDROM-okat, illetve p&oacute;l&oacute;kat &aacute;rus&iacute;t. Teh&aacute;t ha &Ouml;n egy
OpenBSD CD-t, vagy p&oacute;l&oacute;t v&aacute;s&aacute;rol p&eacute;ld&aacute;ul a <a href=../orders.html>CDROM
megrendel&otilde; lapon</a> hozz&aacute;j&aacute;rul ahhoz, hogy az OpenBSD projekt nagyobb es&eacute;llyel
jelentethessen meg a j&ouml;v&otilde;ben &uacute;j verzi&oacute;kat.
<p>
Anyagi, illetve <a href="../want.html">hardver</a> adom&aacute;nyoz&aacute;s szint&eacute;n
lehets&eacute;ges, aminek folyt&aacute;n az &Ouml;n neve szerepelni fog az <a
href=../donations.html>adom&aacute;nyok oldalunkon</a>.
Tov&aacute;bbi inform&aacute;ci&oacute;&eacute;rt k&eacute;rem l&eacute;pjen kapcsolatba <a
href="mailto:deraadt@openbsd.org">Theo de Raadt</a>-tal, vagy k&uuml;ldje adom&aacute;ny&aacute;t
Kanadai vagy Amerikai Doll&aacute;rban a k&ouml;vetkez&otilde; c&iacute;mre:<p>

OpenBSD<br>
812 23rd Ave SE<br>
Calgary, Alberta<br>
Canada<br>
T2G 1N8<br>
(A csekken a kedvezm&eacute;nyezett "Theo de Raadt" legyen, mivel az "OpenBSD" n&eacute;vre
ki&aacute;ll&iacute;tottakat nem tudjuk bev&aacute;ltani.)<br>

<p>
Mostant&oacute;l a projektet az Interneten kereszt&uuml;l is lehet t&aacute;mogatni az
obsdpaypal@openbsd.org c&iacute;men a <a href="https://secure.paypal.x.com/refer/pal=obsdpaypal%40openbsd.org">paypalon</a> kereszt&uuml;l.
<p>

<!-- This does no apply for Hungary

While donations are not US tax deductible as charitable contribution,
they may be deductible as an operating expense, and if someone is so
inclined, they should ask for the advice of their accountant.  The
same applies to other countries, where corporations can make deductable
donations under the terms of "Good Will".

-->

<p>
Theo de Raadt t&ouml;bb mint 30000 Kanadai Doll&aacute;rt k&ouml;lt&ouml;tt az OpenBSD projekt
elind&iacute;t&aacute;s&aacute;ra, ami legink&aacute;bb a magas kanadai h&aacute;l&oacute;zat-el&eacute;r&eacute;s k&ouml;lts&eacute;gei miatt
ilyen sok (az amerikai k&oacute;dol&aacute;ssal kapcsolatos politika miatt a projektet nem
lehet &aacute;tk&ouml;lt&ouml;ztetni oda). Id&aacute;ig egyetlen c&eacute;gt&otilde;l, vagy oktat&aacute;si int&eacute;zm&eacute;nyt&otilde;l
sem &eacute;rkezett komolyabb anyagi t&aacute;mogat&aacute;s.
Theo f&otilde;&aacute;ll&aacute;sban dolgozik az OpenBSD t&ouml;k&eacute;letes&iacute;t&eacute;s&eacute;n &eacute;s a befolyt &ouml;sszeg nagy
r&eacute;sz&eacute;t k&uuml;l&ouml;nb&ouml;z&otilde; r&eacute;szegys&eacute;gekre k&ouml;lti, &iacute;gy a fejleszt&otilde;k hozz&aacute;f&eacute;rhetnek a
leg&uacute;jabb hardverekhez is (az OpenBSD indul&aacute;sa &oacute;ta csak Ethernet h&aacute;l&oacute;zati
k&aacute;rty&aacute;b&oacute;l t&ouml;bb mint 20 &uacute;j t&iacute;pus jelent meg a piacon).

Az anyagi t&aacute;mogat&aacute;sra teh&aacute;t mindig sz&uuml;ks&eacute;g&uuml;nk van. A felhaszn&aacute;l&oacute;k folyamatos
t&aacute;mogat&aacute;sa az, ami lehet&otilde;v&eacute; teszi, hogy az OpenBSD l&eacute;tezzen.
<hr>

<h2><font color="#e00000">Hol &eacute;lnek a fejleszt&otilde;ink?</font></h2>

Ezen a t&eacute;rk&eacute;pen l&aacute;thatja, hogy hol &eacute;lnek OpenBSD fejleszt&otilde;k. Megpr&oacute;b&aacute;ljuk
min&eacute;l frissebben tartani...

<p align=center>
<img src="../images/map.jpg" height=508 width=950 alt= "Vil&aacute;gt&eacute;rk&eacute;p">
</p>

<hr>
<a href=index.html><img height=24 width=24 src="../back.gif" border=0 alt=OpenBSD></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>Originally [OpenBSD: goals.html,v 1.55 2002/06/18 01:44:05 jsyn Exp ]<br>
$Translation: goals.html,v 1.14 2002/06/27 08:00:58 attila Exp $<br>
$OpenBSD: goals.html,v 1.6 2002/06/27 08:47:20 jufi Exp $
</small>

</body>
</html>
