<!doctype html public "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">

<html>

<head>
<title>Sicurezza in OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD advisories">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997,1998 by OpenBSD.">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">
<img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif">

<p><h2><font color="#E00000">Sicurezza</font><hr></h2>

<p>
<strong>AVVISO: questa pagina &egrave; obsoleta, vedete
<a href="../security.html">la pagina in inglese</a> per gli
avvisi di sicurezza.</strong>
</p>

<table width="100%">
<tr>
<td colspan="2"><strong>Indice</strong></td>
</tr>
<tr>
<td valign="top">
<a href="#goals">Gli Obiettivi del Progetto riguardo alla Sicurezza</a><br>
<a href="#disclosure">Strategia di Esposizione Totale</a><br>
<a href="#process">Il processo di &quot;audit&quot; sul codice sorgente</a><br>
<a href="#default">&quot;Sicuro di Default&quot;</a><br>
<a href="#crypto">L'uso di Crittografia</a><br>
<p>
<a href="#watching">Osservare le Modifiche</a><br>
<a href="#reporting">Segnalare i problemi di sicurezza</a><br>
<a href="#papers">Ulteriori Letture</a><br>
<p>
</td>
<td valign="top">
<a href="#29">Avvisi di sicurezza per la versione 2.9</a><br>
<a href="#28">Avvisi di sicurezza per la versione 2.8</a><br>
<a href="#27">Avvisi di sicurezza per la versione 2.7</a><br>
<a href="#26">Avvisi di sicurezza per la versione 2.6</a><br>
<a href="#25">Avvisi di sicurezza per la versione 2.5</a><br>
<a href="#24">Avvisi di sicurezza per la versione 2.4</a><br>
<a href="#23">Avvisi di sicurezza per la versione 2.3</a><br>
<a href="#22">Avvisi di sicurezza per la versione 2.2</a><br>
<a href="#21">Avvisi di sicurezza per la versione 2.1</a><br>
<a href="#20">Avvisi di sicurezza per la versione 2.0</a><br>
</td>
</tr>
</table>

<hr>
<dl>

<a name="goals"></a>
<li><h3><font color="#E00000">Obiettivi</font></h3><p>

OpenBSD crede in una sicurezza robusta.  La nostra aspirazione &egrave; quella
di essere il NUMERO UNO del mercato in fatto di sicurezza (se non siamo
gi&agrave; in tale posizione).  Il nostro modello di sviluppo &quot;aperto&quot;
ci permette di adottare una strategia meno incline ai compromessi di quella
adottata da Sun, SGI, IBM, HP ed altri marchi commerciali.  Possiamo effettuare
cambi che altri marchi non effettuerebbero.  Inoltre, dato che OpenBSD &egrave;
esportato con vario <a href="../crypto.html">software crittografico</a>, siamo
in grado di affrontare problemi di sicurezza utilizzando la crittografia.<p>


<a name="disclosure"></a>
<li><h3><font color="#E00000">Esposizione Totale</font></h3><p>

Come molti lettori della
<a href="http://www.securityfocus.com/bugtraq/archive">mailing list BUGTRAQ</a>,
crediamo nell'esposizione totale (&quot;full disclosure&quot;) dei problemi di
sicurezza.  Nel mondo dei sistemi operativi siamo stati probabilmente i primi
ad aver abbracciato tale concetto.  Molti marchi, anche tra quelli che producono
software gratuito, cercano tuttora di nascondere i difetti ai propri utenti.<p>

Le informazioni riguardanti la sicurezza si muovono molto velocemente negli
ambienti dei &quot;cracker&quot;.  D'altra parte, la nostra esperienza ci ha
insegnato che il risolvere un problema di sicurezza e rilasciare una soluzione
richiede mediamente un'ora circa di lavoro -- &egrave; possibile risolvere
il problema rapidamente.  Per questo siamo convinti che l'esposizione totale
aiuti chi &egrave; veramente interessato alla sicurezza.<p>


<a name="process"></a>
<li><h3><font color="#E00000">Il processo di &quot;audit&quot;</font></h3><p>

Il nostro team di &quot;audit&quot; &egrave; composto normalmente da 6-12
membri che ricercano e risolvono costantemente nuovi problemi di sicurezza sul
sistema.  Abbiamo compiuto ricerche in questo senso sin dall'estate del 1996.
Il processo che seguiamo per migliorare la sicurezza consiste semplicemente in
un'approfondita analisi, file dopo file, di ogni componente critico del
software.  Non cerchiamo solamente effettive vulnerabilit&agrave; nella
sicurezza, quanto piuttosto bug nel software: se eventualmente qualcuno, anni
pi&ugrave; tardi, scoprisse che un determinato problema da noi risolto
semplicemente come bug nel software si sarebbe potuto rivelare un buco di
sicurezza, tanto meglio.  Problemi vengono trovati in ogni area del sistema.
Intere nuove categorie di problemi di sicurezza sono state scoperte durante le
nostre ricerche, e ci&ograve; ha reso spesso necessario ricontrollare, tenendo
conto di questi nuovi problemi, codice sorgente che era stato controllato in
precedenza.  Il codice viene spesso controllato varie volte e da pi&ugrave;
persone, ognuna con le proprie abilit&agrave; specifiche.<p>

Alcuni membri del nostro team per il controllo della sicurezza del codice
lavorarono alla Secure Networks, la compagnia che produsse il pacchetto software
&quot;Ballista&quot;, leader del mercato per lo scanning di sicurezza delle reti
(la Secure Network fu acquistata dalla Network Associates e Ballista fu
ribattezzato Cybercop Scanner).  La suddetta compagnia fu attivamente impegnata
in ricerche nel campo della sicurezza, risultando cos&igrave; in sintonia con
gli obiettivi del progetto OpenBSD.  OpenBSD super&ograve; alla grande i test
del software Ballista sin dal primo giorno.<p>

La nostra procedura di controllo del codice &egrave; inoltre
&quot;pro-attiva&quot;.  Abbiamo stabilito che nella maggior parte dei casi
un determinato problema non &egrave; importante soltanto se sfruttabile
attraverso &quot;exploit&quot; -- se &egrave; un effettivo buco di sicurezza.
Durante il nostro processo di audit troviamo numerosi bug, e ci prefiggiamo di
eliminarli anche se non &egrave; provato che possano costituire un'effettiva
vulnerabilit&agrave;.  Correggiamo il problema, e continuiamo il processo alla
ricerca di ulteriori bug da eliminare.  Abbiamo corretto una grande
quantit&agrave; di semplici ed ovvi errori dovuti a poca cura nella
programmazione, e solo mesi pi&ugrave; tardi fu scoperto che questi sarebbero
potuti essere veri e propri buchi di sicurezza (oppure qualcuno su
<a href="http://www.securityfocus.com/bugtraq/archive">BUGTRAQ</a>
segnal&ograve; che altri sistemi operativi erano vulnerabili a causa di un
&quot;nuovo problema&quot;, per poi scoprire che in OpenBSD il medesimo problema
era gi&agrave; stato sistemato in una vecchia versione).  In altri casi il
sistema non &egrave; risultato completamente vulnerabile ad attacchi complessi,
suddivisi in pi&ugrave; passi, perch&eacute; avevamo trovato una soluzione per
uno dei passi intermedi.  Un esempio di un nostro successo di questo tipo
&egrave; offerto dall'avviso di sicurezza riguardante lpd, che Secure Networks
fece uscire.<p>


<li><h3><font color="#E00000">Il risultato</font></h3><p>

Il nostro processo di controllo del codice ha prodotto davvero grandi risultati.
Affermazioni come &quot;questo problema fu corretto in OpenBSD circa 6 mesi
fa&quot; sono diventate ordinarie nei forum sulla sicurezza come
<a href="http://www.securityfocus.com/bugtraq/archive">BUGTRAQ</a>.<p>

La parte pi&ugrave; intensa del nostro processo di audit
precedette la versione 2.0 di OpenBSD e continu&ograve; durante tutto
il periodo tra le versioni 2.0 e 2.1, in un arco di tempo che comprese gli
ultimi quattro mesi del 1996 e la prima met&agrave; del 1997.  Migliaia (proprio
cos&igrave;, migliaia) di problemi di sicurezza, come i noti buffer overflow,
debolezze nell'implementazione dei protocolli, debolezze che permettevano la
raccolta d'informazioni, e &quot;race&quot; nel filesystem furono eliminati in
questo periodo lungo un anno.  In tal modo si trov&ograve; una soluzione alla
maggioranza dei problemi di sicurezza prima della versione 2.1, e nella versione
2.2 il numero di problemi che necessitavano una soluzione scese di molto.
Se oggigiorno non vengono pi&ugrave; trovati molti problemi &egrave;
anche grazie all'intenso lavoro compiuto in quel periodo.  Le
vulnerabilit&agrave; nella sicurezza che abbiamo trovato nei tempi pi&ugrave;
recenti sono di norma molto pi&ugrave; oscure o complicate.  Proseguiamo
tuttavia l'attivit&agrave; di controllo, per una serie di ragioni:<p>

<ul>
<li>Beh, occasionalmente troviamo un problema che non avevamo notato!
<li>La sicurezza &egrave; come una corsa agli armamenti; i migliori strateghi
    dell'attacco cercheranno vulnerabilit&agrave; sempre pi&ugrave; complicate,
    e noi faremo altrettanto.
<li>Cercare ed eliminare debolezze insospettabili in un software complesso
    &egrave; estremamente divertente.
</ul><p>

Il processo di controllo del codice non &egrave; terminato, e come potete
vedere proseguiamo la nostra opera di ricerca ed eliminazione delle
vulnerabilit&agrave; nella sicurezza del sistema.<p>


<a name="default"></a>
<li><h3><font color="#E00000">&quot;Sicuro di Default&quot;</font></h3><p>

Per assicurare che i nuovi utenti di OpenBSD non siano costretti a diventare
esperti di sicurezza informatica nel giro d'una notte (pare invece che altri
marchi vogliano esattamente ci&ograve;), distribuiamo il sistema operativo
configurato &quot;Sicuro di Default&quot;.  Tutti i servizi non essenziali sono
disabilitati.  Man mano che l'utente/amministratore acquister&agrave;
familiarit&agrave; con il sistema operativo, scoprir&agrave; la necessit&agrave;
di abilitare i demoni ed altre parti del sistema.  Apprendendo come abilitare un
nuovo servizio, il nuovo utente imparer&agrave; anche a tener conto delle
problematiche legate alla sicurezza.<p>

Ci&ograve; &egrave; in forte contrasto con il crescente numero di sistemi che
vengono distribuiti con NFS, mountd, server web, e vari altri servizi abilitati
di default e che causano agli utenti problemi di sicurezza gi&agrave; pochi
minuti dopo l'installazione.<p>


<a name="crypto"></a>
<li><h3><font color="#E00000">Crittografia</font></h3><p>

E naturalmente, dato che il progetto OpenBSD &egrave; sviluppato in Canada,
abbiamo la possibilit&agrave; d'integrare il sistema con software
crittografico.  Per ulteriori informazioni, date un'occhiata a
<a href="../crypto.html">ci&ograve; che abbiamo realizzato con la
crittografia</a>.<p>


<li><h3><font color="#E00000">Avvisi</font></h3><p>

<dl>

<a name="29"></a>

<li><h3><font color="#e00000">Avvisi di sicurezza per OpenBSD 2.9</font></h3>
Questi sono gli avvisi di sicurezza per OpenBSD 2.9 -- tutti questi
problemi sono gi&agrave; stati risolti in
<a href="../anoncvs.html">OpenBSD current</a>
e nel <a href="../anoncvs.html#using">ramo delle patch</a>.<p>

<p>
<ul>
<li>Niente ancora.
</ul>

<p>
<a name="28"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.8</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.8 -- tutti questi
problemi sono gi&agrave; stati risolti in
<a href="../anoncvs.html">OpenBSD current</a>
e nel <a href="../anoncvs.html#using">ramo delle patch</a>.<p>

<ul>
<li><a href="../errata28.html#ipf_frag">23 Aprile 2001:
    IPF contiene un errore con il suo maneggio di cache di fragmenti.</a>
<li><a href="../errata28.html#glob_limit">23 Aprile 2001:
    ftpd(8) contiene un DoS potenziale collegato a glob(3).</a>
<li><a href="../errata28.html#glob">10 Aprile 2001:
    La chiamata della biblioteca glob(3) contiene numerosi buffer
    overflows.</a>
<li><a href="../errata28.html#readline">18 Marzo 2001:
    La libreria readline genera files storici con modi tolleranti
    basati sul umask del utente.</a>
<li><a href="../errata28.html#ipsec_ah">2 Marzo 2001:
    Insufficienti controlli nella scelta di maneggio di codice IPSEC AH
    IPv4 pu&ograve; causare un buffer overrun nel kernel.</a>
<li><a href="../errata28.html#userldt">2 Marzo 2001:
    La scelta dil kernel <b>USER_LDT</b> permette un assalitore
    accedere delle zone privilegiate della memoria del kernel.</a>
<li><a href="../errata28.html#sudo">22 Febbraio 2001:
    Riparato un buffer overflow non-exploitable in sudo(8).</a>
<li><a href="../errata28.html#named">29 Gennaio 2001:
    Unito named(8) con ISC BIND 4.9.8-REL, che ripara qualcune
    vulnerabilit&agrave; dil buffer.</a>
<li><a href="../errata28.html#rnd">22 Gennaio 2001:
    rnd(4) non usaba tutto il suo input.</a>
<li><a href="../errata28.html#xlock">Dec 22, 2000:
    l'autenticazione di xlock(1) &egrave; stata riscritta
    affinch&eacute; avvenga tramite una pipe con nome (la patch ed i
    nuovi file binari di xlock sono inclusi).</a>
<li><a href="../errata28.html#procfs">18 Dicembre 2000:
    procfs contiene numerosi overflow.  Di default, procfs non &egrave;
    abilitato in OpenBSD (la patch &egrave; inclusa).</a>
<li><a href="../errata28.html#kerberos2">10 Dicembre 2000:
    c'&egrave; un altro problema nelle librerie di KerberosIV (la patch &egrave;
    inclusa).</a>
<li><a href="../errata28.html#kerberos">7 Dicembre 2000:
    alcuni problemi sono presenti in KerberosIV (la patch &egrave; inclusa).</a>
<li><a href="../errata28.html#ftpd">4 Dicembre 2000:
    un buffer overflow di un singolo byte &egrave; presente in ftpd (la patch
    &egrave; inclusa).</a>
</ul><p>


<a name="27"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.7</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.7 -- tutti questi problemi
sono gi&agrave; stati risolti in <a href="../anoncvs.html">OpenBSD current</a>.
Ovviamente, tutti i problemi elencati pi&ugrave; sotto per la versione 2.6
sono stati risolti in OpenBSD 2.7.<p>

<ul>
<li><a href="../errata27.html#ftpd">4 Dicembre 2000:
    un buffer overflow di un singolo byte &egrave; presente in ftpd (la patch
    &egrave; inclusa).</a>
<li><a href="../errata27.html#sshforwarding">10 Novembre 2000:
    server ostili possono costringere client OpenSSH all'agent o X11
    forwarding (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#xtrans">26 Ottobre 2000:
    le librerie di X11 hanno due potenziali overflow nel codice di xtrans
    (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#httpd">18 Ottobre 2000:
    se usati sotto alcune configurazioni, i moduli mod_rewrite e
    mod_vhost_alias di Apache possono esporre dei file presenti sul server
    (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#telnetd">10 Ottobre 2000:
    il demone telnet, contrariamente al dovuto, non elimina le variabili
    d'ambiente TERMINFO, TERMINFO_DIRS, TERMPATH e TERMCAP (la patch
    &egrave; inclusa).</a>
<li><a href="../errata27.html#format_strings">6 Ottobre 2000:
    ci sono bug del tipo format string, &quot;stile printf&quot;, in vari
    programmi privilegiati (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#curses">6 Ottobre 2000:
    libcurses rilasciava informazioni riguardanti i terminali, nella directory
    $HOME/.terminfo e nella variabile d'ambiente TERMCAP, per applicazioni
    setuid e setgid (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#talkd">6 Ottobre 2000:
    una vulnerabilit&agrave; del tipo format string &egrave; presente in
    talkd(8) (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#pw_error">3 Ottobre 2000:
    una vulnerabilit&agrave; del tipo format string &egrave; presente nella
    funzione pw_error() della libreria libutil, con conseguente
    vulnerabilit&agrave; locale a livello root attraverso chpass(1) (la
    patch &egrave; inclusa).</a>
<li><a href="../errata27.html#ipsec">18 Settembre 2000:
    in certe condizioni pacchetti ESP/AH errati possono causare un crash
    (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#xlock">16 Agosto 2000:
    una vulnerabilit&agrave; del tipo format string (vulnerabilit&agrave;
    locale a livello root) &egrave; presente in xlock(1) (la patch &egrave;
    inclusa).</a>
<li><a href="../errata27.html#X11_libs">14 Luglio 2000:
    diversi bug nelle librerie di X11 con vari effetti indesiderati possono
    causare un quasi completo denial of service su OpenBSD (la patch
    &egrave; inclusa).</a>
<li><a href="../errata27.html#ftpd">5 Luglio 2000:
    come quasi tutti i demoni ftp del pianeta, ftpd ha una
    vulnerabilit&agrave; remota a livello root.  Fortunatamente ftpd non
    &egrave; abilitato di default.  Il problema sussiste se &egrave;
    abilitato l'accesso ftp anonimo (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#mopd">5 Luglio 2000:
    mopd, usato molto raramente, contiene alcuni buffer overflow (la patch
    &egrave; inclusa).</a>
<li><a href="../errata27.html#libedit">28 Giugno 2000:
    libedit legge il file <b>.editrc</b> nella directory corrente.  Non
    &egrave; chiaro se ci&ograve; possa creare reali problemi alla
    sicurezza, ma &egrave; in ogni caso disponibile una patch (la patch
    &egrave; inclusa).</a>
<li><a href="../errata27.html#dhclient">24 Giugno 2000:
    un grave bug in dhclient(8) pu&ograve; consentire a server dhcp
    &quot;maligni&quot; l'esecuzione di stringhe nella shell come
    utente root (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#isakmpd">9 Giugno 2000:
    nelle procedure di gestione di isakmpd(8) c'&egrave; un grave bug che
    permette di aggirare completamente le verifiche sulla gestione in isakmpd
    (la patch &egrave; inclusa).</a>
<li><a href="../errata27.html#uselogin">6 Giugno 2000:
    il flag UseLogin in <b>/etc/sshd_config</b>, di default non abilitato,
    &egrave; difettoso e si consiglia di non utilizzarlo.  Su altri sistemi
    operativi pu&ograve; causare problemi di sicurezza.</a>
<li><a href="../errata27.html#bridge">26 Maggio 2000:
    il flag <i>learning</i> di bridge(4) pu&ograve; essere aggirato (la
    patch &egrave; inclusa).</a>
<li><a href="../errata27.html#ipf">25 Maggio 2000:
    l'uso improprio di regole <i>keep-state</i> in ipf pu&ograve; far
    s&igrave; che le regole del firewall vengano aggirate (la patch &egrave;
    inclusa).</a>
</ul><p>


<a name="26"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.6</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.6 -- tutti questi problemi
sono gi&agrave; stati risolti in <a href="../anoncvs.html">OpenBSD current</a>.
Ovviamente, tutti i problemi elencati pi&ugrave; sotto per la versione 2.5
sono stati risolti in OpenBSD 2.6.<p>

<ul>
<li><a href="../errata26.html#semconfig">26 Maggio 2000:
    nel supporto per semafori SYSV era presente una chiamata di sistema non
    documentata che poteva precludere l'uscita dai processi che usano
    semafori (la patch &egrave; inclusa).</a>
<li><a href="../errata26.html#ipf">25 Maggio 2000:
    l'uso improprio di regole <i>keep-state</i> in ipf pu&ograve; far
    s&igrave; che le regole del firewall vengano aggirate (la patch &egrave;
    inclusa).</a>
<li><a href="../errata26.html#xlockmore">25 Maggio 2000:
    in xlockmore &egrave; presente un bug attraverso il quale un utente
    locale pu&ograve; lanciare un attacco ed accedere alla password
    crittata di root (che normalmente &egrave; crittata con blowfish -- vedi
    </a><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crypt&sektion=3">crypt(3)</a><a href="../errata26.html#xlockmore">) (la
    patch &egrave; inclusa).</a>
<li><a href="../errata26.html#procfs">20 Gennaio 2000:
    i sistemi con procfs abilitato e sul quale &egrave; eseguito un mount
    sono vulnerabili ad un attacco molto complesso.  Di default, procfs
    &egrave; disabilitato (la patch &egrave; inclusa).</a>
<li><a href="../errata26.html#ifmedia">9 Novembre 1999:
    qualsiasi utente pu&ograve; modificare le configurazioni di interface media,
    e ci&ograve; rende possibile un denial of service sull'host locale (la patch
    &egrave; inclusa).</a>
<li><a href="../errata26.html#sslUSA">2 Dicembre 1999:
    c'&egrave; un buffer overflow nel codice RSAREF della versione USA di
    libssl, e ci&ograve; potrebbe causare una vulnerabilit&agrave; nella
    sicurezza attraverso httpd, ssh, o isakmpd se le opzioni SSL/RSA sono
    abilitate (la patch &egrave; inclusa).</a><br>
    <strong>Aggiornamento:</strong> &egrave; ora stato chiarito che il
    problema non causava vulnerabilit&agrave; attraverso alcun software
    incluso in OpenBSD 2.6.
<li><a href="../errata26.html#sendmail">4 Dicembre 1999:
    sendmail consentiva ad ogni utente la creazione di un file nuovo per gli
    alias, esponendo cos&igrave; il sistema ad un &quot;race&quot; laddove il
    file degli alias non fosse presente (la patch &egrave; inclusa).</a>
</ul><p>


<a name="25"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.5</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.5 -- tutti questi problemi
sono gi&agrave; stati risolti in <a href="../anoncvs.html">OpenBSD current</a>.
Ovviamente, tutti i problemi elencati pi&ugrave; sotto per la versione 2.4
sono stati risolti in OpenBSD 2.5.<p>

<ul>
<li><a href="../errata25.html#cron">30 Agosto 1999:
    in cron(8), assicurarsi che argv[] termini con NULL nel falso popen() ed
    eseguire sendmail come utente, non come root (la patch &egrave;
    inclusa).</a>
<li><a href="../errata25.html#miscfs">12 Agosto 1999: i filesystem procfs e
    fdescfs avevano un overrun nella gestione di uio_offset presente nelle
    routine readdir() (di default questi filesystem non sono abilitati) (la
    patch &egrave; inclusa).</a>
<li><a href="../errata25.html#profil">9 Agosto 1999: non proseguire il profiling
    (vedi profil(2)) quando eseguiamo un nuovo processo con execve() (la patch
    &egrave; inclusa).</a>
<li><a href="../errata25.html#ipsec_in_use">6 Agosto 1999: pacchetti che devono
    essere gestiti da IPsec possono essere trasmessi in chiaro.  La scadenza
    di PF_KEY SA pu&ograve; accidentalmente rivelare risorse del kernel (la
    patch &egrave; inclusa).</a>
<li><a href="../errata25.html#rc">5 Agosto 1999: in /etc/rc, usare mktemp(1) per
    riscrivere motd e cambiare il comando find(1) affinch&eacute; usi -execdir
    (la patch &egrave; inclusa).</a>
<li><a href="../errata25.html#chflags">30 Luglio 1999: non permettere ai normali
    utenti di eseguire chflags(2) o fchflags(2) sulle device a blocchi od a
    caratteri delle quali possono attualmente essere i possessori (la patch
    &egrave; inclusa).</a>
<li><a href="../errata25.html#nroff">27 Luglio 1999: far s&igrave; che groff(1)
    sia invocato con il flag -S quando chiamato da nroff(1) (la patch
    &egrave; inclusa).</a>
</ul><p>


<a name="24"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.4</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.4 -- tutti questi problemi
sono gi&agrave; stati risolti in <a href="../anoncvs.html">OpenBSD current</a>.
Ovviamente, tutti i problemi elencati pi&ugrave; sotto per la versione 2.3
sono stati risolti in OpenBSD 2.4.<p>

<ul>
<li><a href="../errata24.html#poll">22 Marzo 1999: l'argomento nfds di poll(2)
    va limitato, per evitare che il sistema soffra la mancanza di kvm (la patch
    &egrave; inclusa).</a>
<li><a href="../errata24.html#tss">21 Marzo 1999: una modifica nella gestione
    di TSS evita un ulteriore crash del kernel causato dal programma
    <strong>crashme</strong> (la patch &egrave; inclusa).</a>
<li><a href="../errata24.html#nlink">25 Febbraio 1999: un incremento
    incontrollato nel valore di nlink nei filesystem FFS e EXT2FS pu&ograve;
    causare un crash al sistema (la patch &egrave; inclusa).</a>
<li><a href="../errata24.html#ping">23 Febbraio 1999: un ulteriore buffer
    overflow &egrave; presente in ping(8) (la patch &egrave; inclusa).</a>
<li><a href="../errata24.html#ipqrace">19 Febbraio 1999: ipintr() aveva un
    &quot;race&quot; nell'utilizzo dell'ipq, e ci&ograve; permetteva di mandare
    in crash il sistema (la patch &egrave; inclusa).</a>
<li><a href="../errata24.html#accept">17 Febbraio 1999: una condizione di
    &quot;race&quot; nel kernel tra accept(2) e select(2) permetteva un attacco
    in grado di disconnettere socket da remoto (la patch &egrave; inclusa).</a>
<li><a href="../errata24.html#maxqueue">17 Febbraio 1999: l'assemblaggio di
    frammenti IP pu&ograve; caricare eccessivamente il sistema e causare
    problemi (la patch &egrave; inclusa).</a>
<li><a href="../errata24.html#trctrap">12 Febbraio 1999: la gestione di
    T_TRCTRAP sotto i386 e DDB potevano interagire e causare un crash (la patch
    &egrave; inclusa).</a>
<li><a href="../errata24.html#rst">11 Febbraio 1999: la gestione di RST TCP/IP
    era poco fluida (la patch &egrave; inclusa).</a>
<li><a href="../errata24.html#bootpd">27 Novembre 1998: c'&egrave; un buco di
    sicurezza sfruttabile da remoto in bootpd(8) (la patch &egrave;
    inclusa).</a>
<li><a href="../errata24.html#termcap">19 Novembre 1998: c'&egrave; un problema
    che interessa le variabili d'ambiente in termcap e curses e che potrebbe
    essere sfruttabile come buco di sicurezza locale (la patch &egrave;
    inclusa).</a>
<li><a href="../errata24.html#tcpfix">13 Novembre 1998: &egrave; possibile
    provocare un blocco remoto della macchina per via d'un bug nel kernel per
    la decodifica TCP (la patch &egrave; inclusa).</a>
</ul><p>


<a name="23"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.3</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.3 -- tutti questi problemi
sono gi&agrave; stati risolti in <a href="../anoncvs.html">OpenBSD current</a>.
Ovviamente, tutti i problemi elencati pi&ugrave; sotto per la versione 2.2
sono stati risolti in OpenBSD 2.3.<p>

<ul>
<li><a href="../errata23.html#bootpd">27 Novembre 1998: c'&egrave; un buco di
    sicurezza sfruttabile da remoto in bootpd(8) (la patch &egrave;
    inclusa).</a>
<li><a href="../errata23.html#tcpfix">13 Novembre 1998: &egrave; possibile
    provocare un blocco remoto della macchina per via d'un bug nel kernel per
    la decodifica TCP (la patch &egrave; inclusa).</a>
<li><a href="../errata23.html#fdalloc">2 Luglio 1998: i processi setuid e setgid
    non andrebbero eseguiti con i descrittori dei file 0, 1, o 2 liberi (la
    patch &egrave; inclusa).</a>
<li><a href="../errata23.html#resolver">31 Agosto 1998: un buffer overflow nel
    resolver, all'apparenza innocuo, fu reintrodotto accidentalmente (patch
    incluse).</a>
<li><a href="../errata23.html#xlib">6 Giugno 1998: ulteriori problemi con le
    librerie di X (patch incluse).</a>
<li><a href="../errata23.html#pctr">4 Giugno 1998: su macchine i386 non Intel
    qualsiasi utente pu&ograve; usare pctr(4) per causare un crash al
    sistema.</a>
<li><a href="../errata23.html#kill">17 Maggio 1998: il kill(2) di processi
    setuid/setgid &egrave; troppo permissivo (la 4&#170; versione della patch
    &egrave; inclusa).</a>
<li><a href="../errata23.html#immutable">11 Maggio 1998: mmap() consente di
    aggirare parzialmente i flag di immutabilit&agrave; e append-only sui
    file (la patch &egrave; inclusa).</a>
<li><a href="../errata23.html#xterm-xaw">1 Maggio 1998: buffer overflow in xterm
    e Xaw (CERT advisory VB-98.04) (la patch &egrave; inclusa).</a>
<li><a href="../errata23.html#ipsec">5 Maggio 1998: errata gestione di pacchetti
    IPSEC se IPSEC &egrave; abilitato (la patch &egrave; inclusa).</a>
</ul><p>


<a name="22"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.2</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.2.  Tutti questi problemi sono
gi&agrave; stati risolti in <a href="../23.html">OpenBSD 2.3</a>.  Alcuni
di questi problemi sono tuttora presenti in altri sistemi operativi (le patch
accluse sono applicabili su OpenBSD 2.2, e non si garantisce il funzionamento
su OpenBSD 2.1).<p>

<ul>
<li><a href="../errata22.html#ipsec">5 Maggio 1998: errata gestione di pacchetti
    IPSEC se IPSEC &egrave; abilitato (la patch &egrave; inclusa).</a>
<li><a href="../errata22.html#xterm-xaw">1 Maggio 1998: buffer overflow in xterm
    e Xaw (CERT advisory VB-98.04) (la patch &egrave; inclusa).</a>
<li><a href="../errata22.html#uucpd">22 Aprile 1998: buffer overflow in uucpd
    (la patch &egrave; inclusa).</a>
<li><a href="../errata22.html#rmjob">22 Aprile 1998: errata gestione dei buffer
    in lprm (la patch &egrave; inclusa).</a>
<li><a href="../errata22.html#ping">31 Marzo 1998: overflow in ping -R (la patch
    &egrave; inclusa).</a>
<li><a href="../errata22.html#named">30 Marzo 1998: overflow nell'opzione
    fake-iquery di named (la patch &egrave; inclusa).</a>
<li><a href="../errata22.html#mountd">2 Marzo 1998: filesystem NFS esportato
    accidentalmente (la patch &egrave; inclusa).</a>
<li><a href="../advisories/mmap.txt">26 Febbraio 1998: difetto di mmap() in
    lettura-scrittura.</a>
    La terza versione della patch &egrave; disponibile
    <a href="../errata22.html#mmap">qui</a>.
<li><a href="../advisories/sourceroute.txt">19 Febbraio 1998: vengono accettati
    pacchetti su cui &egrave; stato fatto un route alla sorgente.</a>
    Una patch &egrave; disponibile
    <a href="../errata22.html#sourceroute">qui</a>.
<li><a href="../errata22.html#ruserok">13 Febbraio 1998: coredump di processi
    setuid e difetto in ruserok() (la patch &egrave; inclusa).</a>
<li><a href="../errata22.html#ldso">9 Febbraio 1998: difetto in ld.so per MIPS
    (la patch &egrave; inclusa).</a>
<li><a href="../errata22.html#f00f">10 Dicembre 1997: blocco causato dal bug P5
    f00f di Intel (la patch &egrave; inclusa).</a>
</ul><p>


<a name="21"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.1</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.1.  Tutti questi problemi sono
gi&agrave; stati risolti in <a href="../22.html">OpenBSD 2.2</a>.  Alcuni di
questi problemi sono tuttora presenti in altri sistemi operativi (se utilizzate
OpenBSD 2.1 vi raccomandiamo vivamente di aggiornare il vostro sistema alla
versione pi&ugrave; recente, perch&eacute; il seguente elenco traccia soltanto i
problemi di sicurezza pi&ugrave; importanti.  In particolare, in OpenBSD 2.2
sono stati risolti numerosi problemi di sicurezza relativi all'host locale.
Molti dei suddetti problemi furono risolti in maniera tale da rendere difficile
la disponibilit&agrave; di patch).<p>

<ul>
<li><a href="../advisories/signals.txt">15 Settembre 1997: segnali anomali (la
    patch &egrave; inclusa).</a>
<li><a href="../advisories/rfork.txt">2 Agosto 1997: difetto nella chiamata di
    sistema rfork() (la patch &egrave; inclusa).</a>
<li><a href="../advisories/procfs.txt">24 Giugno 1997: difetti in procfs (la
    patch &egrave; inclusa).</a>
</ul><p>


<a name="20"></a>
<li><h3><font color="#E00000">Avvisi di sicurezza per OpenBSD 2.0</font></h3>

Questi sono gli avvisi di sicurezza per OpenBSD 2.0.  Tutti questi problemi sono
gi&agrave; stati risolti in <a href="../21.html">OpenBSD 2.1</a>.  Alcuni di
questi problemi sono tuttora presenti in altri sistemi operativi (se utilizzate
OpenBSD 2.0 vi lodiamo per la vostra volont&agrave; di rimanere ancorati ai
vecchi tempi, ma vi perdete davvero molto se non installate una nuova
versione!).<p>

<ul>
<li><a href="../advisories/res_random.txt">22 Aprile 1997: ID prevedibili nel
    resolver (la patch &egrave; inclusa).</a>
<li>Molti altri... se ritenete di essere in grado di tracciarli tutti vi
    preghiamo di segnalarcelo, e li trascriveremo in questa pagina.
</ul>

</dl><p>


<a name="watching"></a>
<li><h3><font color="#E00000">Osservare le Modifiche</font></h3><p>

Dato che &egrave; nostra volont&agrave; approcciare la sicurezza in modo
&quot;pro-attivo&quot;, cerchiamo e correggiamo continuamente nuovi problemi di
sicurezza.  Non tutti questi problemi sono ampiamente riportati perch&eacute;
(come abbiamo gi&agrave; detto) molti non sono sfruttabili come effettive
vulnerabilit&agrave;; tuttavia molti semplici problemi da noi eliminati sono in
seguito identificati come sorgenti di conseguenze reali per la sicurezza, fino
al momento sconosciute.  Non abbiamo il tempo e le risorse necessari per
rendere disponibili tutte le modifiche effettuate nel formato riportato qui
sopra.<p>

Di conseguenza, nel codice sorgente pi&ugrave; recente sono normalmente presenti
piccole correzioni di sicurezza non presenti nell'ultima versione ufficiale di
OpenBSD.  Vi garantiamo che, limitatamente alle nostre conoscenze, i problemi
interessati da tali correzioni sono d'impatto minimo e non sono identificabili
come veri e propri buchi di sicurezza.  Se scopriamo problemi che hanno davvero
un impatto sulla sicurezza, le patch appariranno su questa pagina
<strong>MOLTO</strong> rapidamente.<p>

Coloro che hanno particolari esigenze di sicurezza possono scegliere varie
opzioni:<p>

<ul>
<li>Se avete esperienza riguardo alle problematiche di sicurezza, seguite la
    nostra <a href="../mail.html">mailing list riguardante le modifiche al
    codice sorgente</a> e tenete d'occhio tutto ci&ograve; che pare avere
    implicazioni con la sicurezza.  Poich&eacute; molte delle correzioni che
    applichiamo non sono dovute ad effettive vulnerabilit&agrave;, non
    aspettatevi messaggi del tipo &quot;SECURITY FIX!&quot; (&quot;CORREZIONE
    DI SICUREZZA!&quot;).  Se un problema &egrave; serio e costituisce una
    vulnerabilit&agrave;, una patch sar&agrave; disponibile su questa pagina in
    breve tempo.
<li>Inoltre i canvi nei sorgenti, pu&ograve; guardare il nostro
    <a href="../mail.html">elenco security-announce</a> che la
    notificher&agrave; di ogni problema di sicurezza che la squadra di
    OpenBSD creda sia una possibile minacia, e come soluzionare il
    problema.
<li>Tenete traccia del nostro albero dei sorgenti, e di tanto in tanto
    cimentatevi con l'impresa di un completo build del sistema (leggete
    attentamente /usr/src/Makefile).  Gli utenti possono assumere come dato di
    fatto che il codice sorgente pi&ugrave; recente sia pi&ugrave; sicuro
    dell'ultima versione ufficiale.  Ricostruire l'intero sistema dal codice
    sorgente non &egrave; tuttavia impresa facile; sono quasi 300 megabyte di
    codice, e durante il periodo di transizione tra le versioni ufficiali si
    verificano parecchi problemi.
<li>Installate una versione snapshot binaria, disponibile spesso e regolarmente
    per la vostra architettura.  Per esempio, una versione snapshot per i386
    viene solitamente rilasciata ogni settimana.
</ul><p>


<a name="reporting"></a>
<li><h3><font color="#E00000">Segnalare i problemi</font></h3><p>

<p> Se trovate un nuovo problema di sicurezza, potete segnalarlo a
<a href="mailto:deraadt@openbsd.org">deraadt@openbsd.org</a>.
<br>
Se volete crittare il messaggio con PGP (ma vi preghiamo di farlo solo se avete
necessit&agrave; di privacy, perch&eacute; non &egrave; pratico), usate questa
<a href="../advisories/pgpkey.txt">chiave pubblica</a>.

<p>
<a name="papers"></a>
<li><h3><font color="#E00000">Ulteriori Letture</font></h3><p>

Vari documenti che descrivono le novit&agrave; presenti in OpenBSD e
riguardanti la sicurezza sono stati scritti dai membri del team OpenBSD.  Le
versioni postscript di tali documenti sono disponibili qui sotto.<p>

<ul>
<li>A Future-Adaptable Password Scheme.<br>
    (<i>Uno Schema per le Password Adattabile in Futuro.</i>)<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    di <a href="mailto:provos@openbsd.org">Niels Provos</a>,
    <a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
    <a href="../papers/bcrypt-paper.ps">Documento</a> e
    <a href="../papers/bcrypt-slides.ps">proiezioni</a>.<br>
    In inglese.
<p>
<li>Cryptography in OpenBSD: An Overview.<br>
    (<i>Crittografia in OpenBSD: Panoramica.</i>)<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    di <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
    <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
    <a href="mailto:art@openbsd.org">Artur Grabowski</a>,
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/crypt-paper.ps">Documento</a> e
    <a href="../papers/crypt-slides.ps">proiezioni</a>.<br>
    In inglese.
<p>
<li>strlcpy and strlcat -- consistent, safe, string copy and concatenation.<br>
    (<i>strlcpy e strlcat -- copia e concatenazione di stringhe consistente e
    sicura.</i>)<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    di <a href="mailto:millert@openbsd.org">Todd C. Miller</a>,
    <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
    <a href="../papers/strlcpy-paper.ps">Documento</a> e
    <a href="../papers/strlcpy-slides.ps">proiezioni</a>.<br>
    In inglese.
<p>
<li>Dealing with Public Ethernet Jacks-Switches, Gateways, and
    Authentication.<br>
    (<i>Avere a che fare con Jack-Switch Ethernet Pubblici, Gateway, ed
    Autenticazione.</i>)<br>
    <a href="../events.html#lisa99">LISA 1999</a>,
    di <a href="mailto:beck@openbsd.org">Bob Beck</a>.<br>
    <a href="../papers/authgw-paper.ps">Documento</a> e
    <a href="../papers/authgw-slides.ps">proiezioni</a>.<br>
    In inglese.
<p>
<li>Encrypting Virtual Memory<br>
    (<i>Crittare la Memoria Virtuale.</i>)<br>
    <a href="../events.html#sec2000">Usenix Security 2000</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/swapencrypt.ps">Documento</a> e
    <a href="../papers/swapencrypt-slides.ps">proiezioni</a>.<br>
    In inglese.
<p>
</ul>

</dl>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: security.html,v 1.173 2001/04/24 06:59:18 deraadt Exp ]<br>
$Translation: security.html,v 1.7 2003/12/16 11:09:10 openbeer Exp $<br>
$OpenBSD: security.html,v 1.6 2004/01/19 13:33:19 jufi Exp $
</small>

</body>
</html>
