<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>12 - Cuestiones sobre plataformas espec&iacute;ficas</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas y respuestas sobre OpenBSD">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq11.html">[Secci&oacute;n 11 - C&oacute;mo mejorar el
rendimiento]</a>
<a href="faq14.html">[Secci&oacute;n 14 - Configuraci&oacute;n del
disco]</a>
</font>

<h1><font color="#e00000">12 - Cuestiones sobre plataformas
espec&iacute;ficas</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#General">12.1 - Notas gen&eacute;ricas sobre
<i>hardware</i></a>
  <ul>
  <li><a href="#GenPCI">12.1.1 - PCI</a>
  <li><a href="#GenISA">12.1.2 - ISA</a>
  </ul>
<li><a href="#alpha">12.2 - DEC Alpha </a>
<li><a href="#hp300">12.3 - HP 9000 series 300, 400</a>
<li><a href="#hppa" >12.4 - HP Precision Architecture (PA-RISC)</a>
<li><a href="#i386" >12.5 - i386</a>
  <ul>
  <li><a href="#ISANIC">12.5.1 - Interfaces de red ISA</a>
  <li><a href="#FPU">12.5.2 - OpenBSD no funciona en mi sistema
  80386/80386SX/80486SX</a>
  <li><a href="#IrqShare">12.5.3 - La salida de dmesg muestra varios
  dispositivos compartiendo un mismo interruptor</a>
  </ul>
<li><a href="#mac68k">12.6 - Mac68k</a>
  <ul>
  <li><a href="#mac68kSupport">12.6.1 - Problemas de funcionamiento en
  un sistema Mac68k</a>
  <li><a href="#mac68kTime">12.6.2 - &iquest;Por qu&eacute; se retrasa
  tanto el reloj del Mac68k?</a>
  <li><a href="#mac68k2disks">12.6.3 - Problemas de funcionamiento de un
  sistema Mac68k con dos discos</a>
  <li><a href="#mac68kInstCrash">12.6.4 - El instalador colapsa durante
  la instalaci&oacute;n</a>
  </ul>
<li><a href="#macppc">12.7 - MacPPC</a>
<li><a href="#mvme68k">12.8 - MVME68k</a>
<li><a href="#sparc">12.9 - SPARC</a>
<li><a href="#sparc64">12.10 - UltraSPARC</a>
  <ul>
  <li><a href="#sparc64Floppy">12.10.1 - Problemas de arranque de
  UltraSPARC con una imagen de disquete</a>
  </ul>
<li><a href="#vax">12.11 - DEC VAX</a>
</ul>

<hr>

<a name="General"></a>
<h2>12.1 - Notas gen&eacute;ricas sobre <i>hardware</i></h2>

<a name="GenPCI"></a>
<h3>12.1.1 - Dispositivos PCI</h3>

<ul>
<li>La mayor&iacute;a de dispositivos PCI son autoconfigurables;  la
m&aacute;quina y el sistema operativo reparten los recursos entre las
interfaces seg&uacute;n sea necesario.

<li>Los dispositivos de interrupci&oacute;n del bus PCI son
compartibles;  no s&oacute;lo se pueden compartir, sino que
generalmente el sistema funcionar&aacute; mejor cuando se compartan las
IRQ, especialmente en sistemas i386.

<li>Existen varios bus PCI est&aacute;ndar diferentes.  En ocasiones se
puede encontrar una tarjeta con la especificaci&oacute;n PCI2.2 que no
funcione en un sistema con la especificaci&oacute;n PCI2.1.
Adem&aacute;s, muchas tarjetas con puentes integrados (como por ejemplo
las tarjetas de red multi-puertos) no funcionan bien en sistemas viejos.

<li>El bus PCI tiene soporte para dos niveles de se&ntilde;ales, 3.3v y
5v.  Las tarjetas que funcionan con el sistema de se&ntilde;ales 3.3v
tienen una segunda muesca en su conector PCI.  La mayor&iacute;a de
tarjetas PCI usan el sistema de se&ntilde;ales 5v, que es el que
utilizan la mayor&iacute;a de ordenadores.  Las m&aacute;quinas de una
sola placa de Soekris (Net45x1 y Net4801) se suelen encontrar en
m&aacute;quinas que s&oacute;lo tienen soporte para el sistema de
se&ntilde;ales 3.3v.

</ul>

<a name="GenISA"></a>
<h3>12.1.2 - Dispositivos ISA</h3>
<ul>
<li>Los dispositivos ISA no pueden compartir recursos y, por lo general,
se deben configurar manualmente de modo que no tengan conflictos con
otros dispositivos del sistema.

<li>Algunos dispositivos ISA son &quot;Plug and Play&quot;
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isapnp&amp;sektion=4">isapnp(4)</a>);
ante cualquier problema con estos dispositivos hay que verificar la
configuraci&oacute;n en la salida de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>...
ISAPnP no siempre funciona como se desea.

<li>En general, si se puede elegir, es recomendable evitar las tarjetas
ISA en favor de las PCI.  Las tarjetas ISA son m&aacute;s
dif&iacute;ciles de configurar y tienen un impacto negativo mucho mayor
sobre el funcionamiento y rendimiento del sistema.
</ul>


<p> <a name="alpha"></a>
<h2>12.2 - DEC Alpha</h2> [nothing yet]

<a name="hp300"></a>
<h2>12.3 - HP300</h2>
[nothing yet]

<a name="hppa"></a>
<h2>12.4 - HPPA</h2>
[nothing yet]

<a name="i386"></a>
<h2>12.5 - i386</h2>

<a name="ISANIC"></a>
<h3>12.5.1 - NICs: Interfaces de red ISA</h3>
Como OpenBSD funciona bien sobre <i>hardware</i> viejo, hay usuarios que
suelen utilizar tarjetas de red ISA en sistemas OpenBSD.  Los
componentes ISA requieren una configuraci&oacute;n m&aacute;s complicada
que los componentes PCI.  En general, no se puede instalar una tarjeta
ISA en el ordenador y esperar que funcione por arte de magia.  En muchas
m&aacute;quinas, si el dispositivo ISA que se instala no est&aacute; en
modo &quot;Plug 'n' Play&quot; (PNP), hay que reservar en la BIOS del
sistema los recursos que utilice la tarjeta.

<h4>3Com 3C509B ep(4)</h4>
&Eacute;sta es una tarjeta de red ISA que ofrece un rendimiento
excelente, y que tiene soporte en el controlador
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ep&amp;sektion=4">
ep(4)</a>.  La versi&oacute;n 'B' se puede distinguir de la otra por la
etiqueta que hay sobre la tarjeta y porque tiene un <i>chip</i>
&quot;principal&quot; m&aacute;s grande (aproximadamente unos 2'5cm por
un lado en la versi&oacute;n 'B', mientras que en la versi&oacute;n
m&aacute;s antigua tiene unos 2cm), y su rendimiento es mejor en un
sistema con dos tarjetas de red.  La 3C509B viene configurada de
f&aacute;brica en modo PNP, lo que por desgracia no cumple con las
especificaciones y causa problemas en el soporte de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isapnp&amp;sektion=4">isapnp(4)</a> de OpenBSD.
El sistema reconoce el adaptador como un dispositivo PNP en primera
instancia, y despu&eacute;s como PNP, por lo que la salida de dmesg
muestra un NIC de m&aacute;s.  Esta tarjeta puede funcionar bien o puede
dar problemas.  Es muy recomendable desactivar el modo PNP en las
tarjetas 3C509B y configurarlas manualmente para que no haya conflictos,
antes de la configuraci&oacute;n en el sistema y mediante las utilidades
de configuraci&oacute;n basadas en DOS.

<p>
El controlador ep(4) reconoce las tarjetas con cualquier
configuraci&oacute;n de <i>hardware</i> siempre que no existan
conflictos con otros dispositivos en el sistema.

<p>
Si se instalan varias tarjetas 3C509 en un mismo sistema es recomendable
etiquetarlas con la direcci&oacute;n MAC, y usar dmesg para poder
identificarlas.

<p>
N&oacute;tese que la 3C509, la 3C905 y la 3C590 se suelen confundir.  La
3C509 es una tarjeta ISA a 10Mbps, y la 3C905 y la 3C590 son tarjetas
PCI.


<p>
<h4>NE2000</h4>
La interfaz de red NE2000 original fue desarrollada a mediados de los 80
por Novell.  Desde entonces, muchos fabricantes han sacado tarjetas muy
parecidas que se conocen como compatibles con NE2000 o cl&oacute;nicas.
El rendimiento de estas tarjetas cl&oacute;nicas var&iacute;a mucho.
Aunque algunas de las tarjetas compatibles con NE2000 m&aacute;s
antiguas funcionan muy bien, muchas de las que est&aacute;n disponibles
hoy en d&iacute;a ofrecen un rendimiento muy bajo.  El soporte para las
tarjetas compatibles con NE2000 en OpenBSD se encuentra en el
controlador
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ne&amp;sektion=4">
ne(4)</a>.

<p>
OpenBSD puede manejar bien algunas de las tarjetas compatibles con
NE2000 con capacidad para ISAPNP si est&aacute; activado el modo ISAPNP.
Otras tarjetas es necesario configurarlas usando <i>jumpers</i> o una
utilidad de configuraci&oacute;n basada en DOS.  Como las tarjetas
NE2000 originales no inclu&iacute;an un programa de configuraci&oacute;n
o soporte para ISAPNP, no existe ning&uacute;n est&aacute;ndar para
esto, y es necesario usar la utilidad original que venga incluida con la
tarjeta espec&iacute;fica, que suele ser dif&iacute;cil de obtener.

<p>
El controlador ne(4) dispone de soporte para tres configuraciones de la
tarjeta NE2000 ISA en el n&uacute;cleo GENERIC de OpenBSD:
<pre>
     ne0:  port 0x240 irq 9
     ne1:  port 0x300 irq 10
     ne2:  port 0x280 irq 9
</pre>
Si estas configuraciones no son v&aacute;lidas por cualquier motivo, se
pueden ajustar usando la
<a href="faq5.html#BootConfig">Configuraci&oacute;n del N&uacute;cleo de
Usuario (UKC)</a> o <a href="faq5.html">compilando un n&uacute;cleo
personalizado</a>.

<p>
N&oacute;tese que el controlador ne(4) es bastante &laquo;tonto&raquo;;
s&oacute;lo sondea el puerto de E/S, y si detecta alguna de las
direcciones de E/S anteriores, <i>asume</i> el IRQ correspondiente. La
salida de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>
no refleja el IRQ del adaptador en el caso de las controladoras ne(4)
ISA.  Si no es el IRQ que est&aacute; utilizando la tarjeta, no
funcionar&aacute;.

<p>
N&oacute;tese asimismo que hay tarjetas no ISA, algunas PCI y PCMCIA,
que usan el controlador ne(4).  Las referencias en esta secci&oacute;n
no son aplicables para estas tarjetas, ya que son auto-configurables.

<a name="80386"></a>
<a name="FPU"></a>
<h3>12.5.2 - OpenBSD no funciona en mi sistema
80386/80386SX/80486SX</h3>

<h4>80386sx</h4>
El 80386sx tiene un rango m&aacute;ximo de direccionamiento de 16M, lo
que es muy bajo para el soporte de OpenBSD/i386.  Adem&aacute;s, la
mayor&iacute;a de sistemas 80386sx no tienen soporte para m&aacute;s de
8M de RAM, por lo que la instalaci&oacute;n es &laquo;S&oacute;lo Para
Expertos&raquo;, ya que para ello es necesario ejecutar algunos pasos
complicados y utilizar una segunda m&aacute;quina.  V&eacute;ase
tambi&eacute;n la siguiente secci&oacute;n:

<h4>80386</h4>
OpenBSD 3.4 funcionar&aacute; en un sistema 80386 &oacute; 80386sx SI
tiene un coprocesador matem&aacute;tico 80387 &oacute; 80387sx (Unidad
de Punto Flotante, o FPU).  Por desgracia estas FPU no son muy comunes,
y la mayor&iacute;a de sistemas 80386 no los tienen.  OpenBSD no
funcionar&aacute; sin el FPU en la plataforma i386.  Hay que tener en
cuenta que esto supone muy poco procesador para un sistema operativo de
ejecuci&oacute;n criptogr&aacute;fica intensiva como OpenBSD.  El
rendimiento de una m&aacute;quina de este tipo con fines
gen&eacute;ricos es poco probable que satisfaga a ning&uacute;n usuario.

<h4>80486SX</h4>
El <i>chip</i> 80486SX era una versi&oacute;n de bajo coste del 80486
que no ten&iacute;a soporte de FPU (como el 80386) que requiere OpenBSD
3.4.  Por suerte, existe una amplia disponibilidad de <i>chips</i>
80486DX, y son f&aacute;ciles de instalar en la mayor&iacute;a de las
m&aacute;quinas.

<a name="IrqShare"></a>
<h3>12.5.3 - La salida de dmesg muestra varios dispositivos compartiendo
un mismo interruptor (IRQ)</h3>
Esto es algo totalmente aceptable, y hasta deseable, para dispositivos
PCI.  Se trata de una funcionalidad en el dise&ntilde;o del bus PCI.
Algunas personas afirman que compartir requerimientos de
interrupci&oacute;n es negativo, pero esto se debe a que confunden la
situaci&oacute;n con el bus ISA, en donde no se permite compartir IRQ, o
a que han tenido una mala experiencia anterior con alg&uacute;n
<i>hardware</i> o <i>software</i> err&oacute;neo.

<p>
Los dispositivos ISA no pueden compartir IRQ, y si lo hicieran
tendr&iacute;amos que corregir este problema.

<a name="mac68k"></a>
<h2>12.6 - Mac68k</h2>

<a name="mac68kSupport"></a>
<h3>12.6.1 - Problemas de funcionamiento en un sistema Mac68k</h3>
Los desarrolladores de OpenBSD disponen de un n&uacute;mero limitado de
modelos diferentes de Mac68k, y en consecuencia s&oacute;lo funcionan
con fiabilidad unos cuantos modelos.  Agradecemos el env&iacute;o de
c&oacute;digo que ayude a restaurar el soporte de cualquier modelo que
no funcione correctamente.

<a name= "mac68kTime"></a>
<h3>12.6.2 - &iquest;Por qu&eacute; se retrasa tanto el reloj del
Mac68k?</h3>
Esto se debe a un error del <i>hardware</i>.  OpenBSD usa interruptores
del reloj para llevar un seguimiento de la hora actual, pero estos
interruptores tienen una prioridad muy baja en la arquitectura de
<a href="../../es/mac68k.html">Mac68k</a>.  Por lo tanto, bajo una
carga intensa como pueda ser la actividad del disco o de la red, los
interruptores del reloj se pierden y el reloj de Unix no avanza como
deber&iacute;a hacerlo.  Este problema no existe en los sistemas
<a href="../../es/macppc.html">MacPPC</a>.

<p>
MacOS circunvala este problema leyendo siempre el reloj de la
m&aacute;quina.  OpenBSD s&oacute;lo lee el reloj de la m&aacute;quina
durante el arranque, y a partir de ah&iacute; lo ignora.  Cuando se
cierra el sistema se puede ver que Unix duda al grabar la hora de vuelta
al reloj de la m&aacute;quina, ya que este problema es de sobra
conocido.

<p>
Una soluci&oacute;n simple a este problema es ejecutar rdate(8) con
regularidad, mediante una entrada de crontab(8).  Otro sitio desde donde
se puede lanzar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&amp;sektion=8">rdate (8)</a>
es desde el fichero <i>/etc/ppp/ppp.linkup</i> si se es un usuario de
PPP que no est&aacute; permanentemente conectado.

<p>
V&eacute;ase tambi&eacute;n:
<a href="http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17">
http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17</a>


<a name="mac68k2disks"></a>
<h3>12.6.3 - Problemas de funcionamiento de un sistema Mac68k con dos
discos</h3>
Esto, desafortunadamente, es un problema bien conocido.  Suele
manifestarse mediante una ca&iacute;da del sistema poco despu&eacute;s
de iniciarse el modo multi-usuario, y no siempre parece obvio que esta
ca&iacute;da est&eacute; relacionada con el disco.  La &uacute;nica
soluci&oacute;n es usar un solo dispositivo en los sistemas Mac68k.  El
env&iacute;o de c&oacute;digo que solucione este problema ser&aacute;
bien recibido.

<a name="mac68kInstCrash"></a>
<h3>12.6.4 - El instalador colapsa durante la instalaci&oacute;n</h3>
El instalador de MacOS en los Mac68k no instala los archivos en una
partici&oacute;n &laquo;grande&raquo;.  Si una de las particiones en las
que se est&eacute; instalando es de m&aacute;s de 500M, lo m&aacute;s
seguro es que se vea un error extra&ntilde;o:
<pre>
    Error on SCSIRead(), #5
    pos = 0, i = 22, fs = /
    alloccgblk: can't find blk in cyl
</pre>
La soluci&oacute;n est&aacute; en instalar antes un sistema
m&iacute;nimo en una partici&oacute;n ra&iacute;z
&laquo;peque&ntilde;a&raquo;, y luego iniciar OpenBSD y reubicar el
sistema de archivos como se desee.

<p>
Digamos, por ejemplo, que queremos tener una partici&oacute;n / de 200M.
Para ello crearemos la partici&oacute;n ra&iacute;z, el resto de
particiones que queramos, y ejecutaremos newfs sobre ellas usando las
utilidades de MacOS.  Despu&eacute;s instalaremos etc34.tgz y base34.tgz
en la partici&oacute;n /.

<p>
A continuaci&oacute;n montaremos el resto de particiones en un punto de
montaje temporal y copiaremos los directorios deseados sobre
&eacute;stas, tal y como se muestra
<a href="faq10.html#DupFS">aqu&iacute;</a>.

<p>
Finalmente modificaremos /etc/fstab, reiniciaremos, y desempaquetaremos
el resto de archivos *.tgz tal y como se muestra
<a href="faq4.html#AddFileSet">aqu&iacute;</a>.

<p>
Siguiendo este proceso se puede obtener cualquier tama&ntilde;o de
partici&oacute;n para las particiones que no sean la partici&oacute;n
ra&iacute;z.


<a name="macppc"></a>
<h2>12.7 - MacPPC</h2>
[nothing yet]

<a name="mvme68k"></a>
<h2>12.8 - MVME68k</h2>
[nothing yet]

<a name="sparc"></a>
<h2>12.9 - SPARC</h2>
[nothing yet]

<a name="sparc64"></a>
<h2>12.10 - UltraSPARC (sparc64)</h2>

<a name="sparc64Floppy"></a>
<h3>12.10.1 - Problemas de arranque de UltraSPARC con una imagen de
disquete</h3>
Los modelos Ultra 1/1e y Ultra 2 son los &uacute;nicos que pueden
arrancar <i>cualquier</i> sistema operativo desde un disquete.  Para el
resto hay que usar el CD-ROM, Miniroot, o una instalaci&oacute;n de
arranque por red.


<a name="vax"></a>
<h2>12.11 - DEC VAX</h2>
[nothing yet]


<p>
<font color= "#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq11.html">[Secci&oacute;n 11 - C&oacute;mo mejorar el
rendimiento]</a>
<a href="faq14.html">[Secci&oacute;n 14 - Configuraci&oacute;n del
disco]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq12.html,v 1.45 ]<br>
$Translation: faq12.html,v 1.20 2003/11/02 19:29:50 horacio Exp $<br>
$OpenBSD: faq12.html,v 1.20 2003/11/03 14:45:36 horacio Exp $
</small>
</body>
</html>
