<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>13 - Uso de IPsec</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD FAQ">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 2000-2003 de OpenBSD">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq12.html">[Secci&oacute;n 12 - Para usuarios avanzados]</a>
<a href="faq14.html">[Secci&oacute;n 14 - Uso de discos en OpenBSD]</a>
</font>

<h1><font color="#e00000">13 - Uso de IPsec (Protocolo de Seguridad
IP)</font></h1>

<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#What">13.1 - &iquest;Qu&eacute; es IPsec?</a>
<li><a href="#Why">13.2 - Muy bien pero, &iquest;para qu&eacute;
querr&iacute;a usar IPsec?</a>
<li><a href="#Protocols">13.3 - &iquest;Cu&aacute;les son los protocolos
que conforman IPsec?</a>
<li><a href="#Wire">13.4 - Sobre el formato &quot;wire&quot;</a>
<li><a href="#Config">13.5 - Configuraci&oacute;n de IPsec</a>
<li><a href="#ManKey">13.6 - &iquest;C&oacute;mo configuro IPsec con el
sistema de &laquo;claves manuales&raquo;?</a>
<li><a href="#isakmpd">13.7 - &iquest;C&oacute;mo configuro isakmpd?</a>
<li><a href="#x509">13.8 - &iquest;C&oacute;mo uso isakmpd con
certificados X.509?</a>
<li><a href="#IKEcl">13.9 - &iquest;Qu&eacute; clientes IKE son
compatibles con isakmpd?</a>
<li><a href="#Trouble">13.10 - Resoluci&oacute;n de problemas de
IPsec/VPN</a>
<li><a href="#SeeAlso">13.11 - Documentaci&oacute;n relacionada</a>
</ul>
<p>
<font size="-1">
Partes de este contenido han sido extra&iacute;das de:
</font>
<ul style="font-size: small">
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&amp;sektion=4">ipsec(4)</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vpn&amp;sektion=8">vpn(8)</a>
<li><a href="http://www.freebsd.org/~julian/IPSEC_4_Dummies.html">IPsec for Dummies</a>, por Julian Elischer
<li><a href="http://www.secureops.com/vpn/vpn.html">ISAKMP Howto</a>, por Patrick Ethier
<li><a href="http://hem.passagen.se/hojg/isakmpd/">X.509v3 certificates with isakmpd</a>, por J&ouml;rgen Granstam
</ul>

<hr>


<p>
<a name="What"></a>
<a name="13.1"></a>
<h2>13.1 - &iquest;Qu&eacute; es IPsec?</h2>

<p>
IPsec es un grupo de extensiones de la familia del protocolo IP.  IPsec
provee servicios criptogr&aacute;ficos de seguridad.  Estos servicios
permiten la autenticaci&oacute;n, integridad, control de acceso, y
confidencialidad.  IPsec provee servicios similares a SSL, pero a nivel
de redes, de un modo que es completamente transparente para sus
aplicaciones y mucho m&aacute;s robusto.  Es transparente porque sus
aplicaciones no necesitan tener ning&uacute;n conocimiento de IPsec para
poder usarlo.  Se puede usar
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/etc/protocols?rev=1.13">cualquier protocolo IP</a>
sobre IPsec.  Se pueden crear t&uacute;neles cifrados (VPN), o simple
cifrado entre computadoras (ordenadores).  Debido a que dispone de
tantas opciones, IPsec es m&aacute;s bien complejo (&iexcl;mucho
m&aacute;s que SSL!).

<p>
Antes de empezar a usar IPsec es absolutamente necesario repasar la
&laquo;lectura recomendada&raquo; de la 
<a href="faq6.html">secci&oacute;n 6</a> de las preguntas
frecuentes.  En particular, si todav&iacute;a no se entiende el
funcionamiento de Internet, el documento 
<a href="http://www.3com.com/corpinfo/en_US/technology/tech_paper.jsp?DOC_ID=135">Understanding IP Addressing</a>
es muy recomendable (tambi&eacute;n disponible desde
<a href="http://www.3com.com/other/pdfs/infra/corpinfo/en_US/501302.pdf">
este enlace</a>).

<p>
De un modo l&oacute;gico, IPsec funciona en cualquiera de estos tres
modos:

<ul>
<li>Anfitri&oacute;n-a-Anfitri&oacute;n
<li>Anfitri&oacute;n-a-Red
<li>Red-a-Red
</ul>

<p>
En cualquier escenario en el que haya una red, el concepto de enrutador
est&aacute; impl&iacute;cito, como en Anfitri&oacute;n-a-Enrutador (y
este enrutador controla y cifra el tr&aacute;fico para una <i>Red</i>
particular).

<p>
Como se puede ver, IPsec se puede usar como t&uacute;nel de
tr&aacute;fico para conexiones de &laquo;redes privadas virtuales&raquo;
(VPN, <i>Virtual Private Networks</i>).  Sin embargo, su utilidad va
m&aacute;s all&aacute; de las VPN.  Con un registro central de
&laquo;intercambio de claves de Internet&raquo; (IKE, <i>Internet Key
Exchange</i>), cada m&aacute;quina en Internet podr&iacute;a comunicarse
con otra y usar cifrado y autenticaci&oacute;n de alto grado.


<p>
<a name="Why"></a>
<a name="13.2"></a>
<h1>13.2 - Muy bien pero, &iquest;para qu&eacute; querr&iacute;a usar
IPsec?</h1>

<p>
El protocolo de Internet, IP, tambi&eacute;n conocido como IPv4, no
provee por s&iacute; mismo de ninguna protecci&oacute;n a las
transferencias de datos.  Ni siquiera puede garantizar que el remitente
sea quien dice ser.  IPsec intenta remediarlo.  Estos servicios vienen
tratados como dos servicios distintos, pero IPsec ofrece soporte para
ambos de un modo uniforme.

<p>
<h4>Confidencialidad</h4>

Es necesario asegurarse de que los datos enviados sean dif&iacute;ciles
de comprender para todos excepto para el receptor.  Por ejemplo, hay que
estar seguro de que las contrase&ntilde;as que se usan al ingresar en
una m&aacute;quina remota a trav&eacute;s de Internet se mantienen en
secreto.

<p>
<h4>Integridad</h4>

Hay que garantizar que los datos no puedan ser cambiados durante el
trayecto.  Si alguien se encuentra en una l&iacute;nea que lleve datos
sobre facturaci&oacute;n, querr&aacute; estar seguro de que las
cantidades y cifras de contabilidad son las correctas, y que no han
podido ser alteradas durante el tr&aacute;nsito.

<p>
<h4>Autenticidad</h4>

Los datos deben firmarse para que otros puedan verificar qui&eacute;n es
realmente quien los ha enviado.  Es agradable saber que los documentos
no son falsos.

<p>
<h4>Protecci&oacute;n a la r&eacute;plica</h4>

Necesitamos modos para asegurarnos de que unos datos enviados se
procesan una sola vez, al margen del n&uacute;mero de veces que se
reciban.  O sea, que un atacante no pueda registrar una
transacci&oacute;n (como por ejemplo una transacci&oacute;n bancaria) y
m&aacute;s tarde replicarla al pie de la letra de modo que la otra parte
de la conexi&oacute;n piense que se ha recibido un nuevo mensaje (una
nueva transacci&oacute;n).  <i>AVISO: seg&uacute;n se especifica en los
est&aacute;ndares, la protecci&oacute;n a la r&eacute;plica no se
realizar&aacute; cuando se use el sistema de claves manuales de IPsec
(v.g., cuando se est&eacute; usando 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsecadm&amp;sektion=8">ipsecadm(8)</a>)</i>.


<p>
<a name="Protocols"></a>
<a name="13.3"></a>
<h2>13.3 - &iquest;Cu&aacute;les son los protocolos que conforman
IPsec?</h2>

<p>
IPsec provee confidencialidad, integridad, autenticidad, y
protecci&oacute;n a la r&eacute;plica a trav&eacute;s de dos nuevos
protocolos.  Estos protocolos se llaman &laquo;Cabecera de
Autenticaci&oacute;n&raquo; (AH, <i>Authentication Header</i>) y
&laquo;Carga &Uacute;til de Seguridad Encapsulada&raquo; (ESP,
<i>Encapsulating Security Payload</i>).

<p>
AH provee auntenticaci&oacute;n, integridad, y protecci&oacute;n a la
r&eacute;plica (pero no confidencialidad).  La diferencia principal
entre las funcionalidades de autenticaci&oacute;n de AH y ESP es que AH
siempre autentica partes de la cabecera IP del paquete (como las
direcciones de origen/destino).  ESP s&oacute;lo autentica la carga
&uacute;til (<i>payload</i>) del paquete.

<p>
ESP puede proveer autenticaci&oacute;n, integridad, protecci&oacute;n a
la r&eacute;plica, y confidencialidad de los datos (asegura todo lo que
sigue a la cabecera en el paquete).  La protecci&oacute;n a la
r&eacute;plica requiere autenticaci&oacute;n e integridad (estas dos van
siempre juntas).  La confidencialidad (cifrado) se puede usar con o sin
autenticaci&oacute;n y/o integridad.  Del mismo modo, se puede usar la
autenticaci&oacute;n y/o la integridad con o sin la confidencialidad.

<p>
En la pr&aacute;ctica, se recomienda que se use ESP para la
mayor&iacute;a de aplicaciones.

<p>
<a name="Wire"></a>
<a name="13.4"></a>
<h2>13.4 - Sobre el formato &quot;wire&quot;</h2>

<p>
La <b>Cabecera de Autenticaci&oacute;n</b> (AH) viene de la cabecera
b&aacute;sica IP y contiene res&uacute;menes criptogr&aacute;ficos
(<i>hash</i>) de los datos e informaci&oacute;n de
identificaci&oacute;n.  Los res&uacute;menes criptogr&aacute;ficos
tambi&eacute;n pueden cubrir las partes invariables de la misma cabecera
de IP.  Hay varios RFC diferentes que ofrecen una elecci&oacute;n de
algoritmos para AH, sin embargo todos deben seguir las l&iacute;neas
especificadas en el
<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2402.html">
RFC2402</a>.

<p>
La cabecera de la <b>Carga &Uacute;til de Seguridad Encapsulada</b>
(<i>Encapsulated Security Payload</i>, ESP) permite reescribir la carga
&uacute;til de forma cifrada.  La cabecera ESP no considera los campos
de la cabecera IP que van delante, y por lo tanto no garantiza nada
excepto la carga &uacute;til del paquete.  Los distintos tipos de ESP
aplicables deben ser conformes con el
<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2406.html">
RFC2406</a>.  Una cabecera ESP tambi&eacute;n puede proveer
autenticaci&oacute;n para el carga &uacute;til (pero no la cabecera
exterior).

<p>
Una divisi&oacute;n ortogonal (en su mayor parte) de funcionalidad de
IPsec se aplica dependiendo de si el extremo que est&aacute; llevando a
cabo la encapsulaci&oacute;n IPsec es la fuente original de los datos o
una pasarela:

<ul>
<li>El modo <b>transporte</b> es el que usa un anfitri&oacute;n que
genera los paquetes.  En modo transporte, las cabeceras de seguridad se
a&ntilde;aden antes que las cabeceras de la capa de transporte (v.g.,
TCP, UDP), antes de que la cabecera IP sea a&ntilde;adida al paquete.
En otras palabras, un AH a&ntilde;adido al paquete cubrir&aacute; el
resumen criptogr&aacute;fico de la cabecera TCP y algunos campos de la
cabecera IP de extremo a extremo, y una cabecera ESP cubrir&aacute; el
cifrado de la cabecera TCP y los datos, pero no la cabecera IP de
extremo a extremo.

<li>El modo <b>T&uacute;nel</b> se usa cuando la cabecera IP de extremo
a extremo ya ha sido adjuntada al paquete, y uno de los extremos de la
conexi&oacute;n segura es solamente una pasarela.  En este modo, las
cabeceras AH y ESP se usan para cubrir todo el paquete, incluida la
cabecera de extremo a extremo, y se a&ntilde;ade una nueva cabecera IP
al paquete que cubre s&oacute;lo el salto al otro extremo de la
conexi&oacute;n segura (aunque eso puedan ser varios saltos de
distancia).
</ul>

<p>
Los enlaces seguros de IPsec se definen en t&eacute;rminos de
&laquo;Asociaciones de Seguridad&raquo; (<b>SA</b>s).  Cada SA viene
definida por un &uacute;nico flujo unidireccional de datos, y por regla
general (ignorando multicast) desde un &uacute;nico punto hasta otro,
cubriendo el tr&aacute;fico que se distingue por alg&uacute;n
&laquo;selector &uacute;nico&raquo;.  Todo el flujo de tr&aacute;fico
sobre un &uacute;nico SA se trata del mismo modo.  Algo del
tr&aacute;fico puede estar sujeto a varios SAs, cada uno de los cuales
aplica alg&uacute;n tipo de transformaci&oacute;n criptogr&aacute;fica.
Un grupo de SAs se conoce como un &laquo;Haz&raquo; (&quot;SA
Bundle&quot;).  Los paquetes entrantes se pueden asignar a un SA
particular por medio de los tres campos de definici&oacute;n:

<ul>
<li>&laquo;Direcci&oacute;n IP de destino&raquo; (&quot;destination IP
address&quot;)
<li>&laquo;&Iacute;ndice del Par&aacute;metro de Seguridad&raquo; (SPI,
&quot;Security Parameter Index&quot;)
<li>&laquo;Protocolo de seguridad&raquo; (&quot;security protocol&quot;)
</ul>

<p>
SPI se puede considerar como un &quot;cookie&quot; manejado por el
receptor del SA, cuando se negocian los par&aacute;metros de la
conexi&oacute;n.  El protocolo de seguridad debe ser AH o ESP.  Debido a
que la direcci&oacute;n IP del receptor es parte del tr&iacute;o,
&eacute;sta es un valor &uacute;nico garantizado.  Se pueden encontrar
desde la cabecera IP exterior y la primera cabecera de seguridad (que
contiene el SPI y el protocolo de seguridad).

<p>
Un ejemplo de un paquete AH en modo t&uacute;nel es:

<p>
<table border="1">
<tr>
<td><b>IPhdr</b></td>
<td><b>AH</b></td>
<td>IPhdr2</td>
<td>TCPhdr</td>
<td>datos</td>
</tr>
</table>

<p>
Un ejemplo de un paquete AH en modo transporte es:

<p>
<table border="1">
<tr>
<td><b>IPhdr</b></td>
<td><b>AH</b></td>
<td>TCPhdr</td>
<td>datos</td>
</tr>
</table>

<p>
Debido a que una cabecera ESP no puede autenticar la cabecera IP
exterior, es &uacute;til combinar una cabecera AH y una ESP para obtener
lo siguiente:

<p>
<table border="1">
<tr>
<td><b>IPhdr</b></td>
<td><b>AH</b></td>
<td><b>ESP</b></td>
<td><i>TCPhdr</i></td>
<td><i>datos</i></td>
</tr>
</table>

<p>
Esto se conoce como &laquo;Adyacencia de Transporte&raquo;.  La
versi&oacute;n del t&uacute;nel ser&iacute;a algo as&iacute;:

<p>
<table border="1">
<tr>
<td><b>IPhdr</b></td>
<td><b>AH</b></td>
<td><b>ESP</b></td>
<td><i>IPhdr2</i></td>
<td><i>TCPhdr</i></td>
<td><i>datos</i></td>
</tr>
</table>

<p>
Sin embargo no se menciona en el RFC.  Como ocurre con la Adyacencia de
Transporte, esto autenticar&iacute;a todo el paquete excepto unas
cuantas cabeceras de la cabecera IP, y tambi&eacute;n cifrar&iacute;a la
carga (en el ejemplo, en bastardilla).  Cuando una cabecera AH y una ESP
se aplican juntas directamente como en este caso, el orden de las
cabeceras deber&iacute;a ser que el que se muestra en el ejemplo.  En
modo t&uacute;nel es posible hacer encapsulaci&oacute;n recursiva
arbitraria para que no se especifique el orden.


<p>
<a name="Config"></a>
<a name="13.5"></a>
<h2>13.5 - Configuraci&oacute;n de IPsec</h2>

<p>
La forma en la que se configuran los sistemas IPsec y las pasarelas es,
hasta un cierto punto, trabajo del diseñador; sin embargo, el RFC
contiene algunas recomendaciones importantes sobre c&oacute;mo se
deber&iacute;a implementar para evitar al m&aacute;ximo la
confusi&oacute;n.

<p>
Existen dos entidades administrativas que controlan lo que le ocurre a
un paquete.  Una es la &laquo;Base de Datos de Asociaci&oacute;n de la
Seguridad&raquo; (SAD, <i>Security Association Database</i>, llamado TDB
o tabla TDB en el c&oacute;digo fuente de IPsec de OpenBSD), y el otro
es la &laquo;Base de Datos de Pol&iacute;tica de la Seguridad&raquo;
(SPD, <i>Security Policy Database</i>).

<p>
Las dos se parecen en que, dado un n&uacute;mero de selectores que
describan algo de tr&aacute;fico, entregar&aacute;n una entrada que
describa el proceso necesario.  Sin embargo, SPD se elimina a dos pasos
del proceso:  SPD se usa para paquetes salientes, para decidir
qu&eacute; entradas SAD se deben usar, y qu&eacute; entradas SAD
describen el proceso y sus par&aacute;metros.  Las entradas SPD
especifican las entradas SAD existentes a usar (si es un
&laquo;haz&raquo; puede haber m&aacute;s de una), pero si no hay una que
se pueda usar, entonces se usa para crear otras nuevas.  Los campos de
SA que se crean se pueden tomar de la entrada SPD o del paquete que
inici&oacute; la creaci&oacute;n.

<p>
Los paquetes salientes van desde la entrada SPD a la especificada de SA,
para obtener par&aacute;metros de codificaci&oacute;n.  Los paquetes
entrantes obtienen la SA correcta directamente, usando el tr&iacute;o
SPI/DestIP/Protocolo, y de ah&iacute; van a la entrada SPD.

<p>
SPD tambi&eacute;n puede especificar qu&eacute; tr&aacute;fico
deber&iacute;a circunvalar IPsec, y cu&aacute;l se deber&iacute;a dejar
caer, as&iacute; que tambi&eacute;n debe ser consultado para
tr&aacute;fico no IPsec entrante.  Las entradas SPD se deben ordenar de
forma expl&iacute;cita, ya que varias podr&iacute;an coincidir con un
paquete particular, y el proceso debe ser reproducible.

<p>
Se puede pensar en SPD como algo parecido a un filtro de paquetes, en el
que las acciones que se deciden son la activaci&oacute;n de procesos SA.
Los selectores pueden incluir direcciones de origen y destino,
n&uacute;meros de puertos si fueran relevantes, nombres de anfitriones,
niveles de sensibilidad de seguridad, protocolos, etc...

<p>
Una entrada SAD incluye:

<ul>
<li>Direcci&oacute;n IP de destino
<li>Protocolo IPsec (AH o ESP)
<li>SPI (cookie)
<li>Contador de secuencias
<li>Indicador de secuencia O/F
<li>Ventana de informaci&oacute;n anti-r&eacute;plica
<li>Tipo de AH e informaci&oacute;n
<li>Tipo de ESP e informaci&oacute;n
<li>Informaci&oacute;n sobre el tiempo de vida
<li>Indicadores de modos t&uacute;nel/transporte
<li>Informaci&oacute;n sobre el camino MTU
</ul>

<p>
Una entrada SPD contiene:

<ul>
<li>Puntero a SAs activas
<li>Campos de selector
</ul>

<p>
Cada SA puede definir una cabecera ESP y una cabecera AH.  Una
sesi&oacute;n de IPsec debe tener una de las dos o ambas, pero no se
puede definir sin ninguna de las dos (en caso contrario no habr&iacute;a
cabeceras para especificar el SPI que deba buscar la SA).  El RFC no
dice qu&eacute; suceder&iacute;a si las cabeceras AH y ESP estuvieran en
desacuerdo sobre el valor de SPI.  Se puede pensar que esto
implicar&iacute;a m&uacute;ltiples SAs en un haz.

<p>
En OpenBSD, SPD se gestiona a trav&eacute;s de la orden <tt>ipsecadm
flow</tt> (s&oacute;lo se cambiar&iacute;a si estuviera usando el
sistema de claves manual).  Las entradas de SAD se pueden configurar
manualmente con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsecadm&amp;sektion=8">ipsecadm(8)</a>,
sin embargo el IETF tambi&eacute;n ha definido mecanismos
autom&aacute;ticos para la iniciaci&oacute;n de sesiones y otras cosas
como el intercambio de claves.  OpenBSD implementa el intercambio
autom&aacute;tico de claves ISAKMP
(<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2407.html">RFC2407</a>,
<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2408.html">RFC2408,</a> y
<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2409.html">RFC2409</a>)
en el d&aelig;mon
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd&amp;sektion=8">isakmpd(8)</a>.


<p>
<a name="ManKey"></a>
<a name="13.6"></a>
<h2>13.6 - &iquest;C&oacute;mo configuro IPsec con el sistema de
&laquo;claves manuales&raquo;?</h2>

<p>
El sistema de claves manuales es el m&aacute;s sencillo para empezar con
IPsec.  Con este m&eacute;todo puede activar los sistemas
criptogr&aacute;ficos de cifrado entre redes y crear una VPN.
Despu&eacute;s de leer esta secci&oacute;n se puede investigar
c&oacute;mo configurarlo de forma autom&aacute;tica mediante el uso de
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/share/ipsec/rc.vpn?rev=1.15">/usr/share/ipsec/rc.vpn</a>.

<p>
Antes que nada hay que asegurarse de que el protocolo ESP IP est&aacute;
activado en el n&uacute;cleo de OpenBSD.  Aunque se encuentra activado
por definici&oacute;n, es aconsejable verificarlo del modo siguiente:

<blockquote><tt>
# <b>sysctl net.inet.esp.enable</b><br>
net.inet.esp.enable = 1<br>
</tt></blockquote>
 
<p>
De igual modo, si se requiere AH, tambi&eacute;n se verificar&aacute;
que est&eacute; activado:

<blockquote><tt>
# <b>sysctl net.inet.ah.enable</b><br>
net.inet.ah.enable = 1
</tt></blockquote>

<p>
Si fuera necesario, estos protocolos se pueden activar usando la
opci&oacute;n <i>-w</i> con la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8">sysctl(8)</a>.

<p>
Tambi&eacute;n se puede modificar directamente el fichero
<tt>/etc/sysctl.conf</tt> para activarlos (o desactivarlos) durante el
arranque.  Para ello hay que eliminar la marca <i>#</i> que aparece
delante de la l&iacute;nea <i>net.inet.esp.enable</i> y/o la
l&iacute;nea <i>net.inet.ah.enable</i> (dependiendo de cu&aacute;l se va
a usar) y asegurarse de que est&aacute;n configuradas con el valor 1.


<p>
N&oacute;tese que en la mayor&iacute;a de casos, como en el gui&oacute;n
<i>rc.vpn</i> o en el ejemplo de m&aacute;s abajo, s&oacute;lo se
requiere ESP.  En estos casos <i>no es necesario activar AH</i>.  De
hecho pueden existir problemas de seguridad relacionados con la
activaci&oacute;n de AH si no se est&aacute; utilizando.

<p>
A continuaci&oacute;n habr&aacute; que generar las claves manuales.
Como la seguridad del VPN se basa en que estas claves no se puedan
&laquo;adivinar&raquo;, es muy importante escoger las claves usando una
fuente aleatoria fuerte.  Un m&eacute;todo pr&aacute;ctico de generarlas
es usar el dispositivo
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=random&amp;sektion=4">random(4)</a>.
Por ejemplo, para producir 160 bits (20 bytes) de aleatoriedad:

<blockquote><tt>
# <b>openssl rand 20 | hexdump -e '20/1 "%02x"'</b>
</tt></blockquote>

<p>
El n&uacute;mero de bits producidos es importante.  Tipos de cifrado
diferentes pueden requerir claves de tama&ntilde;os tambi&eacute;n
diferentes.

<pre>
Algoritmo	Tama&ntilde;o
de cifrado	de la Clave
----------	-----------
DES		56 bits
3DES      	168 bits
BLF	        Variable (160 bits recommended)
CAST    	Variable (40-128 bits recommended)
SKIPJACK  	80 bits
</pre>

<p>
Ahora hay que configurar las SAs (&laquo;Asociaciones de
Seguridad&raquo;).  Una SA es una combinaci&oacute;n de las direcciones
IP, un SPI, y del protocolo de seguridad (AH y/o ESP).  Las direcciones
IP ser&aacute;n la de origen (la nuestra) y la de su destino.  El SPI
(&laquo;&Iacute;ndice del Par&aacute;metro de Seguridad&raquo;) es un
n&uacute;mero que OpenBSD usa para clasificar distintas SAs.

<p>
<i>En estos ejemplos s&oacute;lo se usa ESP para cifrar su
tr&aacute;fico.  ESP incluye la autenticaci&oacute;n de los datos
cifrados contenidos, pero no autentica la cabecera IP a su alrededor.
Esta &laquo;autenticaci&oacute;n limitada&raquo; es, sin embargo,
suficiente para la mayor&iacute;a de casos, especialmente para ESP en un
entorno de t&uacute;neles.</i>

<blockquote><tt>
# <b>ipsecadm new esp -spi SPI_OUT -src MY_EXTERNAL_IP -dst PEER_EXTERNAL_IP -forcetunnel -enc blf -auth sha1 -key ENC_KEY -authkey AUTH_KEY</b>
</tt></blockquote>

<p>
Llev&eacute;moslo a la pr&aacute;ctica con dos enrutadores, 192.168.5.1
y 192.168.25.9.

<p>
En el anfitri&oacute;n 192.168.5.1:

<blockquote><tt>
# <b>ipsecadm new esp -spi 1000 -src 192.168.5.1 -dst 192.168.25.9 -forcetunnel -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 6a20367e21c66e5a40739db293cf2ef2a4e6659f</b>
<br>
# <b>ipsecadm new esp -spi 1001 -dst 192.168.5.1 -src 192.168.25.9 -forcetunnel -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 6a20367e21c66e5a40739db293cf2ef2a4e6659f</b>
</tt></blockquote>

<p>
En el anfitri&oacute;n 192.168.25.9:

<blockquote><tt>
# <b>ipsecadm new esp -spi 1001 -src 192.168.25.9 -dst 192.168.5.1 -forcetunnel -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 6a20367e21c66e5a40739db293cf2ef2a4e6659f</b>
<br>
# <b>ipsecadm new esp -spi 1000 -dst 192.168.25.9 -src 192.168.5.1 -forcetunnel -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 6a20367e21c66e5a40739db293cf2ef2a4e6659f</b>
</tt></blockquote>

<p>
N&oacute;tese que los SPI son distintos.  V&eacute;se la secci&oacute;n
sobre el <a href="#Wire">formato &quot;wire&quot;</a> para una
descripci&oacute;n completa sobre qu&eacute; es el SPI y sobre
d&oacute;nde se est&aacute; usando.

<p>
Ahora que ya tenemos las Asociaciones de Seguridad en su sitio;  pasemos
a configurar los flujos.

<p>
En 192.168.5.1:

<p>
Aqu&iacute; se crear&aacute;n <b>dos</b> flujos, uno ser&aacute; la
direcci&oacute;n de origen local, que cubrir&aacute; todos los paquetes
que originen del anfitri&oacute;n local hacia el destino, y el otro
ser&aacute; el flujo de vuelta desde el destino hasta el
anfitri&oacute;n local.

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 192.168.25.9 -spi 1000 -addr 192.168.5.1 255.255.255.255 192.168.25.9 255.255.255.255</b>
</tt></blockquote>

En 192.168.25.9:

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 192.168.5.1 -spi 1001 -addr 192.168.25.9 255.255.255.255 192.168.5.1 255.255.255.255</b>
</tt></blockquote>

<p>
Si no se necesita tanta carga en las VPN Hu&eacute;sped-a-Hu&eacute;sped
se puede crear el SPI sin <tt>-forcetunnel</tt>, lo que le
permitir&aacute; usar el modo de transporte (mientras que
<tt>-forcetunnel</tt> asegura que todo en el paquete IP, incluida la
cabecera IP, sea encapsulado por SPI).  Si el origen o el destino es una
red, ser&aacute; necesario usar el modo de t&uacute;nel.  Crear una SA
hacia o desde una red asegurar&aacute; autom&aacute;ticamente que se
est&eacute;n creando los SPI en modo t&uacute;nel.

<p>
&Eacute;ste es un m&eacute;todo simple para empezar a usar IPsec.

<p>
Se puede usar IPsec para pasar los espacios de direcciones IP privados
por t&uacute;neles en Internet.  He aqu&iacute; un buen ejemplo:
Queremos pasar 192.168.99.0/24 (que se encuentra detr&aacute;s de
208.1.1.1) por t&uacute;neles a 208.1.2.0/24 y 208.1.5.0/24 (que
est&aacute;n detr&aacute;s de 208.2.2.2).  Estos ejemplos se han
generado usando el gui&oacute;n de ejecuci&oacute;n
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/share/ipsec/rc.vpn?rev=1.3">rc.vpn</a>.

<p>
Como se puede ver, cuando se usa el sistema de claves manuales con IPsec
hay que especificar <b>con exactitud</b> lo que se desea hacer.  No lo
adivinar&aacute; por nosotros.  V&eacute;anse los siguientes ejemplos:


<p>
<h2>En 208.1.1.1:</h2>

<p>
Primero configuramos las asociaciones de seguridad (SA):<br>
(esto configura los SPI, m&eacute;todos de cifrado y claves)

<blockquote><tt>
# <b>ipsecadm new esp -src 208.1.1.1 -dst 208.2.2.2 -forcetunnel -spi 1001 -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 67e21c66e5a40739db293cf2ef2a4e6659f</b>
<br>
# <b>ipsecadm new esp -src 208.2.2.2 -dst 208.1.1.1 -forcetunnel -spi 1000 -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 67e21c66e5a40739db293cf2ef2a4e6659f</b>
</tt></blockquote>

<p>
A continuaci&oacute;n configuramos un flujo desde 208.1.1.1 hasta
208.2.2.2

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.2.2.2 -spi 1001 -addr 208.1.1.1 255.255.255.255 208.2.2.2 255.255.255.255</b>
</tt></blockquote>

Luego configuramos un flujo desde 208.1.2.0/24 (que est&aacute;
detr&aacute;s de 208.2.2.2) hasta 192.168.99.0/24

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.2.2.2 -spi 1001 -addr 192.168.99.0 255.255.255.0 208.1.2.0 255.255.255.0</b>
</tt></blockquote>

<p>
Despu&eacute;s un flujo desde 208.1.5.0/24 (que est&aacute;
detr&aacute;s de 208.2.2.2) hasta 192.168.99.0/24

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.2.2.2 -spi 1001 -addr 192.168.99.0 255.255.255.0 208.1.5.0 255.255.255.0</b>
</tt></blockquote>

Despu&eacute;s un un flujo desde 208.1.2.0/24 (que est&aacute;
detr&aacute;s de 208.2.2.2) hasta el enrutador 208.1.1.1

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.2.2.2 -spi 1001 -addr 208.1.1.1 255.255.255.255 208.1.2.0 255.255.255.0</b>
</tt></blockquote>

<p>
Despu&eacute;s un un flujo desde 208.1.5.0/24 (que est&aacute;
detr&aacute;s de 208.2.2.2) hasta el enrutador 208.1.1.1

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.2.2.2 -spi 1001 -addr 208.1.1.1 255.255.255.255 208.1.5.0 255.255.255.0</b>
</tt></blockquote>

<p>
Y finalmente configuramos un flujo desde el enrutador 208.2.2.2 hasta el
192.168.99.0/24

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.2.2.2 -spi 1001 -addr 192.168.99.0 255.255.255.0 208.2.2.2 255.255.255.255</b>
</tt></blockquote>


<p>
<h2>En 208.2.2.2:</h2>

<p>
Al igual que antes, configuramos las SA...

<blockquote><tt>
# <b>ipsecadm new esp -src 208.2.2.2 -dst 208.1.1.1 -forcetunnel -spi 1000 -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 67e21c66e5a40739db293cf2ef2a4e6659f</b>
<br>
# <b>ipsecadm new esp -src 208.1.1.1 -dst 208.2.2.2 -forcetunnel -spi 1001 -enc blf -auth sha1 -key 7762d8707255d974168cbb1d274f8bed4cbd3364 -authkey 67e21c66e5a40739db293cf2ef2a4e6659f</b>
</tt></blockquote>

Ahora, &eacute;sta es la parte al inverso...  Configuramos un flujo
desde el enrutador 208.2.2.2 hasta el 208.1.1.1

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.1.1.1 -spi 1000 -addr 208.2.2.2 255.255.255.255 208.1.1.1 255.255.255.255</b>
</tt></blockquote>

<p>
Despu&eacute;s configuramos un flujo desde la red 192.168.99.0/24 (que
est&aacute; detr&aacute;s de 208.1.1.1) hasta 208.1.2.0/24

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.1.1.1 -spi 1000 -addr 208.1.2.0 255.255.255.0 192.168.99.0 255.255.255.0</b>
</tt></blockquote>

<p>
Despu&eacute;s configuramos un flujo desde la red 192.168.99.0/24 (que
est&aacute; detr&aacute;s de 208.1.1.1) hasta 208.1.5.0/24

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.1.1.1 -spi 1000 -addr 208.1.5.0 255.255.255.0 192.168.99.0 255.255.255.0</b>
</tt></blockquote>

<p>
Despu&eacute;s configuramos un flujo desde 192.169.99.0/24 (que
est&aacute; detr&aacute;s de 208.1.1.1) hasta el enrutador 208.2.2.2

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.1.1.1 -spi 1000 -addr 208.2.2.2 255.255.255.255 192.168.99.0 255.255.255.0</b>
</tt></blockquote>

<p>
Ya casi hemos terminado...  Quedan dos flujos para obtener 208.1.2.0/24
y 208.1.5.0/24 desde el enrutador 208.2.2.2 hasta el enrutador 208.1.1.1

<blockquote><tt>
# <b>ipsecadm flow -proto esp -dst 208.1.1.1 -spi 1000 -addr 208.1.2.0 255.255.255.0 208.2.2.2 255.255.255.255 -ingress</b>
<br>
# <b>ipsecadm flow -proto esp -dst 208.1.1.1 -spi 1000 -addr 208.1.5.0 255.255.255.0 208.2.2.2 255.255.255.255 -ingress</b>
</tt></blockquote>

<p>
Si hemos usado ipsecadm, y queremos librarnos de cualquier trabajo que
hayamos hecho y empezar desde cero, haremos lo siguiente:

<blockquote><tt>
# <b>ipsecadm flush</b>
</tt></blockquote>

<p>
Esto limpiar&aacute; toda la informaci&oacute;n de IPsec (SPIs, flujos,
entradas de enrutamiento) del sistema.


<p>
<a name="isakmpd"></a>
<h2>13.7 - &iquest;C&oacute;mo configuro isakmpd?</h2>

<p>
Si se est&aacute; pensando en &laquo;redes privadas virtuales&raquo;
(VPN) u otras aplicaciones tradicionales de IPsec, probablemente se va a
usar ISAKMP.  Algunas implementaciones comerciales de IPsec no proveen
ning&uacute;n tipo de sistema de claves manual, y en su lugar requieren
que se use alg&uacute;n tipo de ISAKMP.

<p>
<h3>13.7.1 - &iquest;Qu&eacute; es isakmpd?</h3>

ISAKMP, tambi&eacute;n conocido como &laquo;Intercambio de Claves por
Internet&raquo; (IKE, <i>Internet Key Exchange</i>) es el mecanismo de
intercambio para la VPN.  ISAKMP aborda los problemas de seguridad
usando los m&eacute;todos mencionados en los RFC 2407, 2408 y 2409.
ISAKMP gestiona el intercambio de claves criptogr&aacute;ficas que
ISAKMP es el Protocolo de Asociaci&oacute;n de Seguridad y de
Gesti&oacute;n de Claves de Internet (<i>Internet Security Association
and Key Management Protocol</i>).  Tambi&eacute;n se conoce como IKE, o
Intercambio de Claves por Internet (<i>Internet Key Exchange</i>).  Es
el mecanismo est&aacute;ndar en IPsec para el intercambio de claves.
Se encarga de los problemas de seguridad mencionados en
<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2407.html">
RFC 2407</a>,
<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2408.html">
RFC 2408,</a> y
<a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2409.html">
RFC 2409</a>.  ISAKMP gestiona el intercambio de claves
criptogr&aacute;ficas que de otra forma tendr&iacute; que gestionar el
usuario con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsecadm&amp;sektion=8">ipsecadm(8)</a>.
Para ello hace uso de un proceso en dos fases con el fin de establecer
par&aacute;metros de IPsec entre dos nodos de IPsec.

<p>
<b>Fase 1</b> - Los dos extremos de las conexiones ISAKMP establecen un
canal seguro, autenticado, sobre el cual se comunican entre dos
d&aelig;mons.  Esto establece una Asociaci&oacute;n de Seguridad (SA)
entre ambos anfitriones.  Los m&eacute;todos usados para establecer este
canal son el <b>Main Mode</b> (modo principal) y el <b>Agressive
Mode</b> (modo agresivo).  El Modo Principal env&iacute;a la variada
informaci&oacute;n sobre autenticaci&oacute;n en una cierta secuencia,
al tiempo que provee protecci&oacute;n para la identidad.  El Modo
Agresivo no provee esta protecci&oacute;n a la identidad porque toda la
informaci&oacute;n sobre la autenticaci&oacute;n se env&iacute;a al
mismo tiempo.  El modo agresivo s&oacute;lo se deber&iacute;a usar en
casos en los que preocupe el ancho de banda de la red, ya que puede
exponer informaci&oacute;n sobre la identidad a alguien que estuviera a
la escucha.

<p>
<b>Fase 2</b> - Las Asociaciones de Seguridad se negocian en nombre de
IPsec.  La fase 2 establece t&uacute;neles o Asociaciones de Seguridad
(SA) t&eacute;rminos entre anfitriones IPsec.  El <b>Quick Mode</b>
(modo r&aacute;pido) se usa en la fase 2 porque no es necesario repetir
una autenticaci&oacute;n total;  la fase 1 ya ha establecido las SA.

<p>
Resumiendo, la fase 1 se usa para obtener un canal seguro en el que
llevar a cabo las configuraciones (m&aacute;s r&aacute;pidas) de la fase
2.  Puede haber m&uacute;ltiples configuraciones de la fase 2 en el
mismo canal que la fase 1.  La fase 2 se usa para configurar los
t&uacute;neles.  En la fase 1, sus nodos de IPsec establecen una
conexi&oacute;n en la que intercambian autenticaci&oacute;n (bien sea un
certificado X.509 &oacute; un secreto precompartido).  Esto permite que
cada extremo se asegure de que el otro extremo sea autenticado.  La fase
2 es un intercambio de claves que determinan c&oacute;mo se cifran los
datos entre los dos.

<p>
<h3>13.7.2 - &iquest;C&oacute;mo empiezo con isakmpd?</h3>

<p>
OpenBSD incluye los binarios necesarios para ISAKMP y para la pila de
IPsec por definici&oacute;n.  Se pueden encontrar unos ficheros de
configuraci&oacute;n de ejemplo en <tt>/usr/share/ipsec/isakmpd</tt>.
Para este ejemplo hay que copiar <i>policy</i> a
<tt>/etc/isakmpd/isakmpd.policy</tt>, y <i>VPN-east.conf</i> a
<tt>/etc/isakmpd/isakmpd.conf</tt>.  Intentaremos mostrar c&oacute;mo
configurar una VPN (t&uacute;nel).  Si se quiere usar isakmpd entre
anfitriones &uacute;nicos, hay otros ficheros de configuraci&oacute;n en
el directorio <i>samples</i>.  Las p&aacute;ginas de manual contienen
informaci&oacute;n detallada.  No hay que olvidar la lectura de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.conf&amp;sektion=5">isakmpd.conf(5)</a> e
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.policy&amp;sektion=5">isakmpd.policy(5)</a>.

<p>
El primer paso es activar ESP.  En el <a href="#ManKey">principio de la
secci&oacute;n 13.6</a> se explica c&oacute;mo hacerlo, tanto en tiempo
de arranque como con el sistema funcionando.  Despu&eacute;s hay que
editar <tt>/etc/isakmpd/isakmpd.policy</tt>.
Aunque ambos protocolos, ESP y AH, se encuentran activados por
definici&oacute;n en el n&uacute;cleo, hay que verificar que
est&eacute;n disponibles los protocolos que se vayan a necesitar por el
procedimiento que se detalla en la secci&oacute;n sobre
<a href="#ManKey">Claves Manuales</a>.  A continuaci&oacute;n hay que
modificar el fichero <tt>/etc/isakmpd/isakmpd.policy</tt>.  Este fichero
indica a ISAKMP qui&eacute;n puede acceder a IPsec.  En este ejemplo, el
fichero <i>policy</i> indica que cualquiera que env&iacute;e datos
usando ESP, y que se haya autenticado con la contrase&ntilde;a
<i>mekmitasdigoat</i> (o cualquier otra contrase&ntilde;a que
determinemos), puede comunicarse con isakmpd.  Se puede modificar este
fichero para indicar a ISAKMP que s&oacute;lo se desea permitir datos
firmados con ciertos certificados digitales o usando una cierta
transformaci&oacute;n de cifrado.  Tambi&eacute;n se puede permitir el
acceso a IPsec a cualquiera.  Esto s&oacute;lo es recomendable para
pruebas.  Para ello hay que editar el fichero <i>policy</i> para que
contenga s&oacute;lo las siguientes l&iacute;neas:

<blockquote><pre>
KeyNote-Version: 2
Authorizer: &quot;POLICY&quot;
</pre></blockquote>

<p>
El mismo fichero <i>policy</i> contiene dos l&iacute;neas que empiezan
con el car&aacute;cter $.  Esas l&iacute;neas se deben eliminar antes de
usarlo, son s&oacute;lo para cvs.

<p>
Un fichero <i>policy</i> m&aacute;s &uacute;til para este ejemplo
ser&iacute;a:

<blockquote><pre>
KeyNote-Version: 2
Comment: This policy accepts ESP SAs from a remote that uses the right password
Authorizer: &quot;POLICY&quot;
Licensees: &quot;passphrase:mekmitasdigoat&quot;
Conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; -&gt; &quot;true&quot;; 
</pre></blockquote>

<p>
Implementando esto se obtendr&aacute; solamente una VPN (t&uacute;nel)
b&aacute;sica que use ESP.  En el anfitri&oacute;n A editaremos
<tt>/etc/isakmpd/isakmpd.conf</tt>.  La direcci&oacute;n IP de muestra
249.2.2.2, debe ser reemplazada con la direcci&oacute;n IP externa del
anfitri&oacute;n A.

<blockquote><pre>
[General] 
Retransmits=		5
Exchange-max-time=	120
Listen-on=		249.2.2.2
</pre></blockquote>

<p>
Haremos algo parecido con isakmpd.conf en el anfitri&oacute;n B.
249.3.3.3 representa la direcci&oacute;n IP externa para el
anfitri&oacute;n B.

<blockquote><pre>
[General]
Retransmits=		5
Exchange-max-time=	120
Listen-on=		249.3.3.3
</pre></blockquote>

<p>
Aqu&iacute; es donde se pueden configurar las variables que
afectar&aacute;n al comportamiento principal de isakmpd.  El uso de los
predefinidos aqu&iacute; es correcto.  El valor <b>Listen-on</b>=
especifica el IP en el que isakmpd debe estar a la escucha.  S&oacute;lo
es necesario el IP de Internet de nuestra pasarela.  Si tenemos
interfaces m&uacute;ltiples externas en nuestra pasarela,
podr&iacute;amos especificar una lista de las interfaces en las que
queremos que est&eacute; a la escucha, introduci&eacute;ndolas,
separadas por comas, en una lista.

<p>
A continuaci&oacute;n, en el anfitri&oacute;n A, editaremos isakmpd.conf
otra vez:

<blockquote><pre>
[Phase 1]
249.3.3.3=		HostB
</pre></blockquote>

<p>
Y en el anfitri&oacute;n B:

<blockquote><pre>
[Phase 1]
249.2.2.2=		HostA
</pre></blockquote>

<p>
Esta secci&oacute;n describe qu&eacute; direcciones IP se deben aceptar
para negociar la conexi&oacute;n de la fase 1.  Su valor se&ntilde;ala a
la secci&oacute;n de m&aacute;s abajo (recu&eacute;rdese que la fase 1
s&oacute;lo autentica la conexi&oacute;n remota para asegurar que sean
quienes afirman ser).  Podemos dar una lista de m&uacute;ltiples
direcciones con l&iacute;neas adicionales en el formato IP_Address=<i>
&lt;PEER-NAME&gt;.</i>.

<p>
A continuaci&oacute;n, en el anfitri&oacute;n A:

<blockquote><pre>
[Phase 2]
Connections=		HostA-HostB
</pre></blockquote>

<p>
Y en el anfitri&oacute;n B:

<blockquote><pre>
[Phase 2]
Connections=		HostB-HostA
</pre></blockquote>

<p>
Esto describe la fase 2 de la conexi&oacute;n.  &Eacute;sta es la fase
que determina qu&eacute; protocolos usar&aacute;n las dos partes para
comunicarse.

<p>
El indicador <b>Connections</b>= se refiere a la secci&oacute;n de
m&aacute;s abajo.  Inicia los requisitos o los m&eacute;todos aceptados
para activar la fase 2.  Tambi&eacute;n le indica a ISAKMPD qu&eacute;
conexiones debe iniciar una vez haya comenzado.  Podemos tener secciones
m&uacute;ltiples, como se ilustra abajo, si vamos a conectar con
m&uacute;ltiples anfitriones.

<p>
Si no tenemos la direcci&oacute;n IP del anfitri&oacute;n remoto,
podemos especificar un <b>Default</b>= que se&ntilde;ale a una
secci&oacute;n que describa una entrada gen&eacute;rica que
servir&aacute; de referencia para cualquier IP entrante que no
est&eacute; en la lista del indicador <b>Connections</b>=.

<p>
En el anfitri&oacute;n A:

<blockquote><pre>
[HostB]
Phase=			1
Transport=		udp
Local-address=		249.2.2.2
Address=		249.3.3.3
Configuration=		Default-main-mode
Authentication=		mekmitasdigoat
#Flags=
</pre></blockquote>

<p>
En el anfitri&oacute;n B:

<blockquote><pre>
[HostA]
Phase=			1
Transport=		udp
Local-address=		249.3.3.3
Address=		249.2.2.2
Configuration=		Default-main-mode
Authentication=		mekmitasdigoat
#Flags=
</pre></blockquote>

<p>
&Eacute;stas representan las secciones a las que se refiere en la
secci&oacute;n anterior sobre la fase 1.  Cada una de ellas describe los
requisitos que debe cumplir la pasarela del extremo que intenta
conectar, para proceder a la fase 2.  Aqu&iacute; hay muchas otras
opciones, pero las que se mencionan son los requisitos m&iacute;nimos.
<!-- Buscar una traducción para `peer' y revisar arriba y abajo -->

<ul>
<li><b>Fase=1</b> se requiere porque el c&oacute;digo ISAKMPD usa los
mismos procedimientos para procesar Fase 1 y Fase 2.  Debe ser <b>1</b>
o no funcionar&aacute; nada.

<li><b>Transport=</b> ofrece diferentes posiblidades para diferentes
anfitriones que vayan a conectar.  Se sugiere que aqu&iacute; se use
UDP, as&iacute; que lo dejaremos en este punto.  Algunos anfitriones que
vayan a conectar pueden estar detr&aacute;s de un cortafuegos que no
permita pasar tr&aacute;fico UDP.  Esto debe ser determinado antes de
activarlo.

<li><b>Local-address</b> es la direcci&oacute;n de destino a la que
se&ntilde;alan los paquetes entrantes.  En algunos casos, puede estar
escuchando conexiones para Fase 1 en distintas interfaces.  En esta
muestra, s&oacute;lo hay una interfaz escuchando, por tanto &eacute;ste
es el IP de la interfaz de escucha en este extremo de la
conexi&oacute;n.

<li><b>Address=</b> es la direcci&oacute;n que se&ntilde;ala al origen
IP de los paquetes entrantes.  Generalmente esto se&ntilde;ala a la
pasarela del extremo conectado.  Esto necesita ser explicado en
m&aacute;s detalle, porque la direcci&oacute;n IP de origen del otro
extremo puede ser desconocida.

<li><b>Configuration=</b> se&ntilde;ala a la secci&oacute;n de abajo.
Puede especificar m&uacute;ltiples secciones como &eacute;sta.
Aqu&iacute; usamos la secci&oacute;n predefinida, especificada en el
fichero de muestra.

<li><b>Authentication=</b> es el secreto precompartido que va a usar
este extremo de la conexi&oacute;n en particular.  Es, m&aacute;s o
menos, una contrase&ntilde;a que usa cada extremo de la conexi&oacute;n.
Esta contrase&ntilde;a se pasa al fichero <i>policy</i> para verificar
si tiene permiso para usar IPsec con este anfitri&oacute;n.  Si
cambiamos esta contrase&ntilde;a, tambi&eacute;n debemos cambiarla en el
fichero <i>policy</i>, porque el fichero de muestra contiene una
contrase&ntilde;a.  Si se ha decidido utilizar un fichero <i>policy</i>
m&iacute;nimo, entonces se puede especificar lo que se quiera
aqu&iacute;.

<li><b>Flags=</b> no se usa en la actualidad.  Los RFC dejan lugar para
que se especifiquen opciones adicionales para la fase 1.
<p>
Hay otros indicadores que permiten configurar otras opciones.
V&eacute;nse las descripciones en la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.conf&amp;sektion=5">isakmpd.conf(5)</a>.
</ul>

<p>
En el anfitri&oacute;n A:

<blockquote><pre>
[HostA-HostB]
Phase=			2
ISAKMP-peer=		HostB
Configuration=		Default-quick-mode
Local-ID=		Net-A
Remote-ID=		Net-B
</pre></blockquote>

<p>
En el anfitri&oacute;n B:

<blockquote><pre>
[HostB-HostA]
Phase=			2
ISAKMP-peer=		HostA
Configuration=		Default-quick-mode
Local-ID=		Net-B
Remote-ID=		Net-A
</pre></blockquote>

<p>
&Eacute;stas representan las secciones a las que se refiere en la
secci&oacute;n anterior sobre la fase 2.  Son las configuraciones
individuales que ISAKMPD debe usar para hablar entre las dos pasarelas
de la conexi&oacute;n.

<ul>
<li><b>Phase=2</b> es necesaria porque el c&oacute;digo de ISAKMPD usa
las mismas funciones para autenticar las Fase 1 y la Fase 2.  Se
requiere para que funcione la VPN.

<li><b>ISAKMPD-Peer=</b> es el nombre de la secci&oacute;n del
anfitri&oacute;n.  Esto significa que estamos hablando con ese extremo
de la conexi&oacute;n en particular para establecer una conexi&oacute;n
de Fase 2.  Se provee para que pueda tener secciones m&uacute;ltiples
que describan conexiones isakmp.

<li><b>Configuration=</b> se refiere a la secci&oacute;n que describe
las normativas que este anfitri&oacute;n y el extremo de la
conexi&oacute;n en concreto deben cumplir.

<li><b>Local-ID=</b> se refiere a una secci&oacute;n IPsec-ID que
describe su Red Privada a la pasarela del otro extremo de la
conexi&oacute;n.  &Eacute;sta es la porci&oacute;n que se pasa para que
la otra pasarela pueda configurar la tabla de enrutamiento concreta, que
transferir&aacute; datos a trav&eacute;s de la VPN a nuestra red.

<li><b>Remote-ID=</b> hace referencia a una secci&oacute;n IPsec-ID que
describe lo que se supone que la Red Privada remota es para nuestro
anfitri&oacute;n.  Esta porci&oacute;n debe ser interpretada para la
correcta configuraci&oacute;n de las tablas de enrutamiento que
transferir&aacute;n datos desde nuestra Red Privada, a trav&eacute;s de
la VPN, hacia la Red Privada remota.
<p>
Hay otro indicador que tiene soporte aqu&iacute; llamado <b>Flags=</b>.
Si se necesita usar este indicador, l&eacute;se antes la p&aacute;gina
del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.conf&amp;sektion=5">isakmpd.conf(5)</a>.
</ul>

<p>
&Eacute;sta es la secci&oacute;n de IPsec-ID.  Estas entradas deben
existir en los ficheros isakmpd.conf del anfitri&oacute;n A y del
anfitri&oacute;n B.  Este ejemplo configurar&aacute;
192.168.1.0/255.255.255.0 para el anfitri&oacute;n A (que se
conect&oacute; arriba a Net-A) y 192.168.20.0/255.255.255.0 para el
anfitri&oacute;n B (arriba Net-B).

<blockquote><pre>
[Net-A]
ID-type=		IPV4_ADDR_SUBNET
Network=		192.168.1.0
Netmask=		255.255.255.0

[Net-B]
ID-type=		IPV4_ADDR_SUBNET
Network=		192.168.20.0
Netmask=		255.255.255.0
</pre></blockquote>

<p>
Estas dos secciones est&aacute;n en el fichero de
<b>configuraci&oacute;n</b> de cada anfitri&oacute;n.  Son las secciones
a las que se hace referencia en los identificadores <b>Local-ID</b> y
<b>Remote-ID</b>.  Describen las rutas que se deben configurar para
permitir el paso del tr&aacute;fico desde una red privada hasta otra.
<b>ID-type</b>= puede ser <b>IPV4_ADDR_SUBNET</b> o <b>IPV4_ADDR</b>
(RFC2708 menciona m&aacute;s valores posibles.  En la actualidad
s&oacute;lo hay soporte en la implementaci&oacute;n de OpenBSD para
IPv4.  El soporte para IPv6 puede estar en OpenBSD-current).
 
<p>
Ahora, en ambos anfitriones, el fichero de muestra deber&iacute;a ser:

<blockquote><pre>
[Default-main-mode]
DOI=			IPSEC
EXCHANGE_TYPE=		ID_PROT
Transforms=		3DES-SHA
</pre></blockquote>

<p>
Esta secci&oacute;n describe los requisitos para los m&eacute;todos de
cifrado de las conexiones de la fase 1.  El nombre refleja el valor de
la variable <i>Configuration=</i>.  Como se puede ver aqu&iacute;,
estamos indicando nuestro Dominio de Inter&eacute;s, que es IPsec.  La
variable <b>EXCHANGE_TYPE</b> est&aacute; configurada con el valor
<b>ID_PROT</b> para la fase 1, que identifica los protocolos que
cubrir&aacute; esta autenticaci&oacute;n.  <b>Transforms=</b> es la
transformaci&oacute;n criptogr&aacute;fica requerida (o asignada) para
este intercambio.  En este caso se&ntilde;ala a la secci&oacute;n de
abajo en el fichero de configuraci&oacute;n, que indica que estamos
recibiendo un paquete cifrado con 3DES y una suma de comprobaci&oacute;n
verificable con SHA.  Hay muchas transformaciones criptogr&aacute;ficas
definidas en el fichero de muestra <b>VPN-east.conf</b>.  &Eacute;stas
se proveen porque 3DES y SHA no siempre tienen soporte en las diferentes
plataformas.  Para OpenBSD no hay raz&oacute;n para cambiar esta
configuraci&oacute;n b&aacute;sica.  Si deseamos crear copias de esta
secci&oacute;n y cambiar la variable <b>Transforms</b>=, poemos hacerlo.
El &uacute;nico requisito es que cambiemos la variable
<b>Configuration</b>=.

<blockquote><pre>
[Default-quick-mode]
DOI=			IPSEC
EXCHANGE_TYPE=		QUICK_MODE
Suites=			QM-ESP-3DES-SHA-PFS-SUITE,QM-ESP-DES-MD5-PFS-SUITE
</pre></blockquote>

<p>
En esta secci&oacute;n se han descrito los requisitos para el cifrado de
los datos que se env&iacute;an a trav&eacute;s de la VPN, y la
referencia a ella est&aacute; arriba en <i>Configuration</i>.
N&oacute;tese que la diferencia entre esta secci&oacute;n y su
equivalente en la fase 1 anterior es que <b>EXCHANGE_TYPE</b> es
<b>QUICK_MODE</b>.  <b>Suites=</b> se&ntilde;ala a una secci&oacute;n
Suite de IPsec que describe los distintos esquemas de cifrado
disponibles entre los dos anfitriones.  Se podr&iacute;a decir mucho
m&aacute;s sobre ISAKMP e IPsec, pero usando las descripciones
b&aacute;sicas que hemos mencionado se deber&iacute;a poder crear una
VPN simple pero s&oacute;lida, que cuidara de s&iacute; misma.  Esto es
el <i>m&iacute;nimo indispensable</i> de <b>isakmpd.conf</b> para ambos
anfitriones.
 
<p>
<h3>13.7.3 - Iniciar isakmpd</h3>

<p>
Podemos usar

<blockquote><tt>
# <b>isakmpd -d -DA=90</b>
</tt></blockquote>

<p>
la primera vez que decidamos invocar este d&aelig;mon.  El d&aelig;mon
no funcionar&aacute; en modo d&aelig;mon, sino como un proceso regular
(en primer plano).  Grabar&aacute; todo en nuestro terminal.  Para parar
isakmpd y limpiar las rutas hay que matar el proceso isakmpd en cada
modo, y ejecutar <b>ipsecadm flush</b>.


<p>
<a name="x509"></a>
<h2>13.8 - &iquest;C&oacute;mo uso isakmpd con certificados X.509?</h2>

<p>
Configurar isakmpd para el uso de certificados en lugar de claves
precompartidas no es mucho m&aacute;s dif&iacute;cil en una gran red con
muchas conexiones entrantes no fiables de lo que ser&iacute;a en una
peque&ntilde;a red.  En realidad podemos simplificar la
configuraci&oacute;n y, m&aacute;s importante, hace que la
gesti&oacute;n de claves sea m&aacute;s flexible.


<p>
<h2>Generaci&oacute;n de cerfificados</h2>

<p>
Hay una buena descripci&oacute;n sobre c&oacute;mo generar claves y
certificados en el fichero
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sbin/isakmpd/README.PKI?rev=1.7">README.PKI</a>
del directorio de fuentes de isakmpd.  Debemos disponer de una clave CA,
el correspondiente certificado CA X.509, una clave privada para cada
m&aacute;quina en la red que use isakmpd, y un certificado X.509 para
cada una de esas claves.

<p>
Para que puedan ser utilizados por isakmpd, los certificados X.509 deben
tener una extensi&oacute;n Subject Alternative Name (subjectAltName)
a&ntilde;adida.  Esta extensi&oacute;n describe la identidad del
poseedor del certificado, y se puede a&ntilde;adir usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=certpatch&amp;sektion=8">certpatch(8)</a>,
o un fichero de configuraci&oacute;n de openssl personalizado como
<tt>/etc/ssl/x509v3.cnf</tt>. En los ejemplo que hay en
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sbin/isakmpd/README.PKI?rev=1.7">README.PKI</a>
se describe este proceso usando direcciones IP como identificadores
subjectAltName.

<p>
Aunque el mecanismo predeterminado para las extensiones subjectAltName
sean las direcciones IP, certpatch tambi&eacute;n admite el uso de
&laquo;Nombres de Dominio Totalmente Cualificados&raquo; (FQDN, <i>Fully
Qualified Domain Name</i>) o UFQDN (FQDN de Usuario).  Estos
&uacute;ltimos pueden ser &uacute;tiles para los usuarios de
port&aacute;tiles.  Un ejemplo de FQDN podr&iacute;a ser
<tt>www.openbsd.org</tt>.  Un ejemplo de UFQDN podr&iacute;a ser una
direcci&oacute;n de correo electr&oacute;nico como
<tt>Jorgen.Granstam@abc.se</tt>.  N&oacute;tese que, a diferencia de los
identificadores basados en IP, isakmpd no verifica los datos que se
presentan en las identificaciones basadas en FQDN o UFQDN, y los
identificadores se tratan como simples cadenas.

<p>
En los siguientes ejemplos se usar&aacute;n FQDNs como subjectAltNames.

<p>
Para introducir un subjectAltName FQDN en un certificado,
har&iacute;amos algo como esto:

<blockquote><tt>
$ <b>/usr/sbin/certpatch -t fqdn -i home.mysite.se -k ca.key originalcert.crt nuevocert.crt</b>
</tt></blockquote>

<p>
Aqu&iacute;, ca.key es la clave privada de la &laquo;Autoridad de
Certificaci&oacute;n&raquo; (CA), por lo tanto esto s&oacute;lo lo puede
hacer quien tenga acceso a la clave privada del CA.  home.mysite.se es
el FQDN que se introduce en el certificado.  Los nombres de los ficheros
originalcert.crt y nuevocert.crt podr&iacute;an tener el mismo nombre,
en cuyo caso el fichero original ser&iacute;a anulado por el certificado
modificado nuevo.

<p>
Estas claves y certificados se deben copiar a sus directorios
correspondientes.  La ubicaci&oacute;n predeterminada para las claves y
cerficados es como sigue:

<p>
<table>
<tr><td><tt>/etc/isakmpd/ca</tt></td>
<td>certificados de clave p&uacute;blica (en formato PEM) de Autoridades
Certificadoras (CA) de confianza</td></tr>
<tr><td><tt>/etc/isakmpd/certs</tt></td>
<td>certificados (con extensiones subjectAltName) de claves
p&uacute;blicas (en formato PEM) de confianza</td></tr>
<tr><td><tt>/etc/isakmpd/private</tt></td>
<td>claves privadas;  &eacute;stas deben tener sus correspondientes
claves p&uacute;blicas en el directorio <tt>cert</tt> que se ha indicado
anteriormente</td></tr>
</table>

<p>
Estas ubicaciones se pueden anular mediante valores en la secci&oacute;n
[X509-certificates] de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.conf&amp;sektion=5">isakmpd.conf(5)</a>.

<p>
N&oacute;tese que si se va a confiar en la infraestructura de CA, la
clave privada de CA (<tt>/etc/isakmpd/ca/ca.key</tt>) se deber&iacute;a
guardar en un sitio seguro, deber&iacute;a ser de un tama&ntilde;o en
bits apropiado (o sea, 2048 bits), y deber&iacute;a cifrarse con una
contrase&ntilde;a fuerte.


<p>
<h2>Configuraci&oacute;n de isakmpd</h2>
  
<p>
Ahora veamos el fichero de configuraci&oacute;n
<tt>/etc/isakmpd/isakmpd.conf</tt>.  Esta configuraci&oacute;n se
tom&oacute; originalmente del fichero de ejemplo en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.conf&amp;sektion=5">isakmpd.conf(5)</a>,
pero se ha modificado mucho.  Tambi&eacute;n usaremos un fichero mucho
m&aacute;s corto que el fichero del ejemplo de la p&aacute;gina del
manual, para que sea m&aacute;s f&aacute;cil de entender.
Adem&aacute;s, he a&ntilde;adido algunos comentarios (algunos
comentarios los he dejado como estaban en isakmpd.conf(5)), y he
cambiado algunos nombres.  Ninguno de los nombres de dominio aqu&iacute;
usados existen (que yo sepa).

<p>
En realidad, puesto que todo el que lea esto ya tendr&aacute; una
configuraci&oacute;n que funcione del caso de claves precompartidas (ver
la secci&oacute;n anterior), no habr&aacute; muchas sorpresas en este
fichero.  No lo explicar&eacute; en detalle;  en la p&aacute;gina del
manual de isakmpd.conf(5) est&aacute;n las descripciones de las partes
que no comente.

<p>
Asumamos que nuestra configuraci&oacute;n es parecida a &eacute;sta:

<center>
<pre>
one.mysite.se                                        one.worksite.se
 192.168.1.2--+    10.0.0.1====/======10.0.0.2     +--192.168.2.2 
              |  gw.mysite.se       gw.worksite.se |
              +--192.168.1.1         192.168.2.1---+
two.mysite.se |                                    | two.worksite.se
 192.168.1.3--+                                    +--192.168.2.3
</pre>
</center>

<p>
O sea, dos redes que deben conectarse usando un t&uacute;nel IPsec sobre
una red de otro modo insegura.  Ignoraremos el hecho de que aqu&iacute;
se est&eacute;n usando direcciones IP reservadas para Internets privadas
(RFC1918), debo usar algo.  No explicar&eacute; c&oacute;mo usar isakmpd
en combinaci&oacute;n con NAT ni nada parecido (ya que no lo he
probado).

<p>
Ahora, veamos el fichero de configuraci&oacute;n.  &Eacute;ste es el
fichero para la pasarela de seguridad gw.mysite.se:

<blockquote><pre>
# *****************************************************************
# ************* Fichero isakmpd.conf de gw.mysite.se **************
# *****************************************************************

# Una configuraci&oacute;n de muestra para el d&aelig;mon isakmpd de
# ISAKMP/Oakley (conocido como IKE)
[General]
Policy-File=            /etc/isakmpd/isakmpd.policy
Retransmits=            5
Exchange-max-time=      120
Listen-on=              10.0.0.1


# Aqu&iacute;, el nombre work-gw se usa s&oacute;lo como un nombre de
# secci&oacute;n y una etiqueta para usarlo en este fichero de
# configuraci&oacute;n, y no tiene porqu&eacute; ser el nombre real del
# anfitri&oacute;n ni el nombre de dominio del extremo de la
# conexi&oacute;n (pero podr&iacute;a serlo).  Fase 1, como ya
# sabr&aacute;, es la negociaci&oacute;n de una asociaci&oacute;n de
# seguridad ISAKMP (SA).  Deber&iacute;a haber un IP y un nombre por
# cada extremo con el que queramos comunicarnos.
[Phase 1]
10.0.0.2=               work-gw


# Fase 2 es la negociaci&oacute;n de SAs de IPsec.  Como en fase 1,
# aqu&iacute; el nombre es un nombre de secci&oacute;n que se
# usar&aacute; m&aacute;s tarde.  Puede ser una lista de nombres de
# secci&oacute;n separados por comas.  De este modo, si el
# tr&aacute;fico desde muchas redes (o anfitriones individuales)
# tuviera que ser reenviado a trav&eacute;s de este t&uacute;nel, la
# mayor&iacute;a de nombres de secci&oacute;n ser&iacute;an
# a&ntilde;adidos (y las correspondientes secciones nuevas m&aacute;s
# abajo).
[Phase 2]
Connections=            work-gw-my-gw


# Los siguientes par&aacute;metros son para negociaciones de SA de
# ISAKMP.  El nombre de secci&oacute;n es el anterior de la fase 1.  La
# etiqueta m&aacute;s interesante es la de ID.  La etiqueta ID
# est&aacute; configurada con el nombre de la secci&oacute;n, en donde
# se puede encontrar la informaci&oacute;n de la identidad sobre este
# anfitri&oacute;n, que se presentar&aacute; a los extremos que
# conecten.  Si la etiqueta ID no se encontrara disponible, isakmpd
# asumir&aacute; que se debe identificar a s&iacute; mismo usando la
# direcci&oacute;n IP.  N&oacute;tese que ya no hay ninguna etiqueta de
# autenticaci&oacute;n en esta configuraci&oacute;n.  Los datos de
# autenticaci&oacute;n se usan s&oacute;lo en el caso de claves
# precompartidas.
[work-gw]
Phase=                  1
Transport=              udp
Local-address=          10.0.0.1                # Local address
Address=                10.0.0.2                # Peer address
ID=                     my-ID
Configuration=          Default-main-mode


# &Eacute;stos son los datos de identidad.  ID-type tambi&eacute;n
# puede ser IPV4_ADDR (por definici&oacute;n), IPV4_ADDR_SUBNET o
# UFQDN.  La etiqueta Name se usa paraa FQDN y UFQDN;  para IPV4_ADDR
# se usar&iacute;a una etiqueta Address.  Para IPV4_ADDR_SUBNET se
# usar&iacute;a una etiqueta Network y Netmask.
[my-ID]
ID-type=                FQDN
Name=                   gw.mysite.se


# &Eacute;sta es la secci&oacute;n para la conexi&oacute;n IPsec.  El
# nombre de la secci&oacute;n viene de la lista en la secci&oacute;n
# anterior de fase 2.  ISAKMP-peer es, por supuesto, la etiqueta de
# nuestro extremo de conexi&oacute;n en la secci&oacute;n fase 1
# anterior.  Las etiquetas Local-ID y Remote-ID deben ser los nombres
# de las secciones que describen qu&eacute; paquetes se deben reenviar
# por el t&uacute;nel IPsec hacia la red remota.
[work-gw-my-gw]
Phase=                  2
ISAKMP-peer=            work-gw
Configuration=          Default-quick-mode
Local-ID=               Net-west
Remote-ID=              Net-east

# Cualquier paquete cuyo origen sea una m&aacute;quina en la red
# aqu&iacute; descrita...
[Net-west]
ID-type=                IPV4_ADDR_SUBNET
Network=                192.168.1.0
Netmask=                255.255.255.0

# ... y cuyo destino coincida con la red descrita aqu&iacute;,
# ser&aacute; cifrado y reenviado por el t&uacute;nel IPsec al sistema
# remoto.
[Net-east]
ID-type=                IPV4_ADDR_SUBNET
Network=                192.168.2.0
Netmask=                255.255.255.0

# Descripciones del modo principal


# Aqu&iacute; est&aacute;n los datos para el modo principal.  Usar
# aqu&iacute; DES no es una buena idea, ya que DES ya no est&aacute;
# considerado como un algoritmo de cifrado seguro.  3DES est&aacute;
# considerado como mucho m&aacute;s seguro debido a que tiene
# suficientes bits en la clave como para ser seguro.  Transforms es una
# lista de etiquetas que describen las transformaciones
# criptogr&aacute;ficas del modo principal.  En este ejemplo
# s&oacute;lo tenemos una.
[Default-main-mode]
DOI=                    IPSEC
EXCHANGE_TYPE=          ID_PROT
Transforms=             3DES-MD5


# Certificados almacenados en formato PEM.  Esta parte es importante
# cuando se usen certificados.  Los certificados CA deben estar en
# CA-directory (pero no la clave privada CA).  Cert-directory debe
# tener, al menos, el certificado para el anfitri&oacute;n local, pero
# tambi&eacute;n est&aacute;n permitidos otros certificados.  La clave
# privada debe ser la clave privada del anfitri&oacute;n local.
[X509-certificates]
CA-directory=           /etc/isakmpd/ca/
Cert-directory=         /etc/isakmpd/certs/
Private-key=            /etc/isakmpd/private/local.key

# Transformaciones criptogr&aacute;ficas del modo principal
####################################################

# Aqu&iacute; va nuestra transformaci&oacute;n del modo principal;  lo
# m&aacute;s importante aqu&iacute; es usar RSA_SIG como m&eacute;todo
# de autenticaci&oacute;n cuando se usen certificados.  Por el momento,
# es el &uacute;nico m&eacute;todo que tiene soporte cuando se usan
# certificados.  Las entidades comerciales en los EE.UU. tendr&aacute;n
# que esperar hasta septiembre de 2.000 para usarlo, debido a la
# patente de RSA.  Por suerte, yo no vivo en los EE.UU.  Tambi&eacute;n
# es importante la etiqueta GROUP_DESCRIPTION.  Debe coincidir con la
# etiqueta GROUP_DESCRIPTION en las transformaciones
# criptogr&aacute;ficas del modo r&aacute;pido descritas m&aacute;s
# adelante.  Aqu&iacute; la etiqueta Life se podr&iacute;a modificar.
# LIFE_60_SECS podr&iacute;a ser m&aacute;s corta de lo necesario para
# el uso normal.

[3DES-MD5]
ENCRYPTION_ALGORITHM=   3DES_CBC
HASH_ALGORITHM=         MD5
AUTHENTICATION_METHOD=  RSA_SIG
GROUP_DESCRIPTION=      MODP_1024
Life=                   LIFE_60_SECS,LIFE_1000_KB

# Descripci&oacute;n del modo r&aacute;pido
#############################

[Default-quick-mode]
DOI=                    IPSEC
EXCHANGE_TYPE=          QUICK_MODE
Suites=                 QM-ESP-3DES-MD5-PFS-SUITE

# Grupos de protecci&oacute;n del modo r&aacute;pido
######################################
# 3DES

[QM-ESP-3DES-MD5-PFS-SUITE]
Protocols=              QM-ESP-3DES-MD5-PFS

# 3DES

[QM-ESP-3DES-MD5-PFS]
PROTOCOL_ID=            IPSEC_ESP
Transforms=             QM-ESP-3DES-MD5-PFS-XF

# Transformaciones criptogr&aacute;ficas del modo r&aacute;pido

# No lo olvide.  GROUP_DESCRIPTION debe coincidir con GROUP_DESCRIPTION
# en el modo principal anterior.  Para reenviar paquetes entre dos
# redes (o desde un anfitri&oacute;n a una red) usamos el modo TUNNEL.
# Entre dos anfitriones tambi&eacute;n podemos usar el modo TRANSPORT.
[QM-ESP-3DES-MD5-PFS-XF]
TRANSFORM_ID=           3DES
ENCAPSULATION_MODE=     TUNNEL
AUTHENTICATION_ALGORITHM=       HMAC_MD5
GROUP_DESCRIPTION=      MODP_1024
Life=                   LIFE_60_SECS


# Como ya sabemos por la p&aacute;gina de manual de isakmpd.config,
# aqu&iacute; LIFE_DURATION es un valor de oferta (60), un valor
# m&iacute;nimo aceptable, y un valor m&aacute;ximo aceptable.  El
# ejemplo de isakmpd.conf tiene configurado esto a 600,450/720.  Este
# valor puede ser mejor para un uso normal.
[LIFE_60_SECS]
LIFE_TYPE=              SECONDS
LIFE_DURATION=          60,45:72

[LIFE_1000_KB]
LIFE_TYPE=              KILOBYTES
LIFE_DURATION=          1000,768:1536

# *****************************************************************
# ********* Fin del fichero isakmpd.conf de gw.mysite.se **********
# *****************************************************************
</pre></blockquote>

<p>
Hasta aqu&iacute; la configuraci&oacute;n para el sistema local.  El
sistema remoto se configura exactamente del mismo modo, s&oacute;lo que
al rev&eacute;s.  Por lo tanto, la primera parte del fichero
isakmpd.conf es diferente.  Echemos un vistazo a esa primera parte del
fichero isakmpd.conf para la pasarela de seguridad de gw.worksite.se:

<blockquote><pre>
# *****************************************************************
# ************* Fichero isakmpd.conf de gw.worksite.se ************
# *****************************************************************

[General]
Policy-File=            /etc/isakmpd/isakmpd.policy
Retransmits=            5
Exchange-max-time=      120
Listen-on=              10.0.0.2

[Phase 1]
10.0.0.1=               my-gw

[Phase 2]
Connections=            work-gw-my-gw

[my-gw]
Phase=                  1
Transport=              udp
Local-address=          10.0.0.2                # Local address
Address=                10.0.0.1                # Peer address
ID=                     work-ID
Configuration=          Default-main-mode

[work-ID]
ID-type=                FQDN
Name=                   gw.worksite.se

[work-gw-my-gw]
Phase=                  2
ISAKMP-peer=            my-gw
Configuration=          Default-quick-mode
Local-ID=               Net-east
Remote-ID=              Net-west

# *****************************************************************
# ************************ ... continuar&aacute; *************************
# *****************************************************************
</pre></blockquote>

<p>
No ha sido tan dif&iacute;cil, tal vez algo aburrido de leer.  La
siguiente parte es algo m&aacute;s interesante.


<p>
<h2>El fichero policy</h2>

<p>
El fichero <i>policy</i> puede ser algo confuso para alguien que no lo
haya usado con anterioridad, especialmente si las cosas no funcionan
como se espera.  La p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.policy&amp;sektion=5">isakmpd.policy(5)</a>
no est&aacute; tan mal.  Tal vez sea poco clara en algunas partes, pero
en general es buena.

<p>
El fichero <i>policy</i> m&aacute;s simple ser&iacute;a uno que
contuviera una &uacute;nica l&iacute;nea:

<blockquote><pre>
authorizer: &quot;POLICY&quot;
</pre></blockquote>

<p>
B&aacute;sicamente, esto significa que no hay limitaciones en
<i>policy</i> sobre qui&eacute;n puede conectar.  Por lo tanto, no es
una configuraci&oacute;n muy segura.  La etiqueta authorizer es para
indicar qui&eacute;n tiene la autorizaci&oacute;n para decidir la
pol&iacute;tica a seguir.  El autorizador especial &quot;POLICY&quot;
tiene la autoridad total sobre <i>policy</i>.  Cualquier otro authorizer
debe primero ser autorizado por &quot;POLICY&quot; para poder tener
cualquier autoridad.

<p>
Tambi&eacute;n puede haber un grupo de condiciones sobre qu&eacute;
est&aacute; autorizado.  El siguiente <i>policy</i> vendr&iacute;a a
decir que s&oacute;lo alguien que use el protocolo ESP con algo de
cifrado real, estar&iacute;a autorizado (bueno, alguien que usara DES
tambi&eacute;n estar&iacute;a autorizado aqu&iacute;, aunque DES casi
est&aacute; considerado como muy inseguro, se deja como ejercicio para
el lector el cambiar este fichero <i>policy</i> para no permitir tampoco
DES).  N&oacute;tese que cualquiera que cifre con ESP todav&iacute;a
estar&iacute;a autorizado.

<blockquote><pre>
authorizer: &quot;POLICY&quot;
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
Tambi&eacute;n se puede &laquo;sublicenciar&raquo; la autoridad a
alguien m&aacute;s (podr&iacute;a ser una o m&aacute;s entidades).  El
caso simple ser&iacute;a el caso de la clave precompartida.  En ese
caso, cualquiera que sepa que la contrase&ntilde;a precompartida,
estar&aacute; autorizado.  Por lo tanto:

<blockquote><pre>
authorizer: &quot;POLICY&quot;
licensees:  &quot;contrase&ntilde;a:algo muy secreto&quot;
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
Esto autorizar&iacute;a a cualquiera que supiera esta contrase&ntilde;a
para conectar y cumplir con las condiciones (pero hay que recordar que
la contrase&ntilde;a tambi&eacute;n se debe activar en la etiqueta
Authentication de isakmpd.conf).

<p>
Hasta ahora, nada complicado.  Ahora viene la parte interesante.
Primero, puede haber muchos con licencias, aunque deben estar todos
autorizados por &quot;POLICY&quot;.  Adem&aacute;s, aqu&eacute;llos que
dispongan de licencias y est&eacute;n autorizados, pueden
&laquo;sublicenciar&raquo; a otros.  Un licenciado puede ser simplemente
una cadena si est&aacute; m&aacute;s descrito en el fichero
<i>policy</i>:

<blockquote><pre>
authorizer: &quot;POLICY&quot;
licensees:  &quot;subpolicyAH&quot; ||  &quot;subpolicyESP&quot;
conditions: app_domain ==&quot;IPsec policy&quot; -&gt; &quot;true&quot;;

authorizer: &quot;subpolicyESP&quot; 
licensees:  &quot;contrase&ntilde;a:algo muy secreto&quot;
conditions: esp_present ==&quot;yes&quot; -&gt; &quot;true&quot;;

authorizer: &quot;subpolicyAH&quot; 
licensees:  &quot;contrase&ntilde;a:algo muy secreto&quot;
conditions: ah_present ==&quot;yes&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
Y ahora, a por lo que todos estaban esperando.  <i>policy</i>
tambi&eacute;n se puede sublicenciar o delegar a una clave.  En este
caso suele ser un certificado X.509.  El uso m&aacute;s simple de
certificados ser&iacute;a usarlos como las contrase&ntilde;as.
Simplemente introducimos certificados de usuarios individuales en el
fichero <i>policy</i>:

<blockquote><pre>
keynote-version: 2
comment: This is an example of a policy delegating to a key.
authorizer: &quot;POLICY&quot;
licensees: &quot;x509-base64:\
        MIIBsTCCARoCAQAwDQYJKoZIhvcNAQEEBQAwITELMAkGA1UEBhMCc2UxEjAQBgNV\
        BAMTCUlLRUxBQiBDQTAeFw0wMDAxMjgxNzQyMTZaFw0wMTAxMjcxNzQyMTZaMCEx\
        CzA           Esto es un certificado de usuario             AQEB\
        BQA                                                         IUuz\
        eOW8P5UGJUH2JVkiA2CTDryFf0CHYwd2P003dtVYw5RvET7XLMpRZiCcWtBdxneW\
        ct+016zUBP/cQMMl+KownxAUq9ezA8GvTyUWC97SOMOgoVj/QR3FHmEjpUi3AgMB\
        AAEwDQYJKoZIhvcNAQEEBQADgYEALGShaAxHvGncev0iFnKrJI4x5T4vlaMP1ad+\
        iWLV5q9H3wickVGN0NPerq0YLwx/VA9WaecYN8V+ALtNKYPuDiT11zwvE8GQeaai\
        NuzgmQ9hh3GifEgN9VEiC3j4kTytonKr0Q+vTLM7xYzheOxvrtUErRwZ9Xs1KzHe\
        yiXHSU8=&quot;
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
Esto, obviamente, es una idea est&uacute;pida si hay muchos usuarios.
Los certificados que isakmpd lee de los directorios CA- y Certificate, y
los certificados recibidos desde el otro extremo de la conexi&oacute;n
se convierten en pseudocredenciales.  Estos certificados convertidos en
pseudocredenciales ser&iacute;an algo as&iacute;:

<blockquote><pre>

authorizer: &quot;x509-base64:\
        MIIBsTCCARoCAQAwDQYJKoZIhvcNAQEEBQAwITELMAkGA1UEBhMCc2UxEjAQBgI2\
	CzA    Esto es la clave/certificado p&uacute;blico del firmante    AQEB\
        BQA      del certificado de usuario (El certificado CA)     IUuz\
        eOW8P5UGJUH2JVkiA2CTDryFf0CHYwd2P003dtVYw5RvET7XLMpRZiCcWtBdxneW\
        ct+016zUBP/cQMMl+KownxAUq9ezA8GvTyUWC97SOMOgoVj/QR3FHmEjpUi3AgMB\
        AAEwDQYJKoZIhvcNAQEEBQADgYEALGShaAxHvGncev0iFnKrJI4x5T4vlaMP1ad+\
        iWLV5q9H3wickVGN0NPerq0YLwx/VA9WaecYN8V+ALtNKYPuDiT11zwvE8GQeaai\
        NuzgmQ9hh3GifEgN9VEiC3j4kTytonKr0Q+vTLM7xYzheOxvrtUErRwZ9Xs1KzHe\
        yiXHSU8=&quot;
licensees:  &quot;x509-base64:\
        MIIBsTCCARoCAQAwDQYJKoZIhvcNAQEEBQAwITELMAkGA1UEBhMCc2UxEjAQBgNV\
        BAMTCUlLRUxBQiBDQTAeFw0wMDAxMjgxNzQyMTZaFw0wMTAxMjcxNzQyMTZaMCEx\
        CzA              Esto es la clave del asunto del            AQEB\
        BQA                        certificado                      IUuz\
        eOW8P5UGJUH2JVkiA2CTDryFf0CHYwd2P003dtVYw5RvET7XLMpRZiCcWtBdxneW\
        ct+016zUBP/cQMMl+KownxAUq9ezA8GvTyUWC97SOMOgoVj/QR3FHmEjpUi3AgMB\
        AAEwDQYJKoZIhvcNAQEEBQADgYEALGShaAxHvGncev0iFnKrJI4x5T4vlaMP1ad+\
        iWLV5q9H3wickVGN0NPerq0YLwx/VA9WaecYN8V+ALtNKYPuDiT11zwvE8GQeaai\
        NuzgmQ9hh3GifEgN9VEiC3j4kTytonKr0Q+vTLM7xYzheOxvrtUErRwZ9Xs1KzHe\
        yiXHSU8=&quot;
conditions: app_domain ==&quot;IPsec policy&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
N&oacute;tese que &eacute;stos no est&aacute;n autorizados por
&quot;POLICY&quot; y por lo tanto no tendr&aacute;n ning&uacute;n efecto
sin que est&eacute;n de alguna manera autorizados.  Adem&aacute;s, esto
muestra lo que le ocurre internamente a los certificados.  La credencial
anterior no se ve en el fichero <i>policy</i>.  Sin embargo, se puede
dar una sublicencia a tales credenciales.  Recu&eacute;rdese el tema
sobre sublicencias.  Es posible dar licencias a todos los certificados
que est&eacute;n firmados por una cierta CA, poniendo el certificado de
la CA como un licenciado de &quot;POLICY&quot;:

<blockquote><pre>
keynote-version: 2
comment: This is an example of a policy delegating to a key.
authorizer: &quot;POLICY&quot;
licensees: &quot;x509-base64:\
        MIIBsTCCARoCAQAwDQYJKoZIhvcNAQEEBQAwITELMAkGA1UEBhMCc2UxEjAQBgNV\
        BAMTCUlLRUxBQiBDQTAeFw0wMDAxMjgxNzQyMTZaFw0wMTAxMjcxNzQyMTZaMCEx\
        CzA                 Esto es un certificado CA               AQEB\
        BQA                                                         IUuz\
        eOW8P5UGJUH2JVkiA2CTDryFf0CHYwd2P003dtVYw5RvET7XLMpRZiCcWtBdxneW\
        ct+016zUBP/cQMMl+KownxAUq9ezA8GvTyUWC97SOMOgoVj/QR3FHmEjpUi3AgMB\
        AAEwDQYJKoZIhvcNAQEEBQADgYEALGShaAxHvGncev0iFnKrJI4x5T4vlaMP1ad+\
        iWLV5q9H3wickVGN0NPerq0YLwx/VA9WaecYN8V+ALtNKYPuDiT11zwvE8GQeaai\
        NuzgmQ9hh3GifEgN9VEiC3j4kTytonKr0Q+vTLM7xYzheOxvrtUErRwZ9Xs1KzHe\
        yiXHSU8=&quot;
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
El fichero <i>policy</i> que hemos visto es un simple ejemplo de fichero
<i>policy</i> que delega en una CA.  Cualquier usuario que tenga un
certificado firmado por la CA de este certificado, y que adem&aacute;s
cumpla las otras condiciones configuradas en <i>policy</i> y en el
fichero de configuraci&oacute;n, estar&aacute; autorizado.


<p>
<h2>Casi seguro... &iexcl;no es seguro!</h2>

<p>
Desafortunadamente, esto no es suficiente para estar realmente seguro.
Hay formas para atacar una pasarela de seguridad configurada de esta
forma.  Si alguien no quiere leer los detalles, puede pasar a la
secci&oacute;n siguiente ahora.  Para el resto, intentaremos entender
porqu&eacute; esto no es seguro.  No es dif&iacute;cil.

<p>
Consideremos a qu&eacute; informaci&oacute;n tiene acceso en este
momento uno de los isakmpd.  Del fichero de configuraci&oacute;n,
isakmpd sabemos cu&aacute;l es el IP-address desde el que se
conectar&aacute;n (en la secci&oacute;n Fase 1).  De la
informaci&oacute;n que obtiene durante la negociaci&oacute;n de la fase
1, sabe el ID con el que el extremo que se conecta presenta a s&iacute;
mismo y el certificado que obtiene desde ese extremo de la
conexi&oacute;n prueba que que ese ID le pertenece.

<p>
Si la informaci&oacute;n del ID era el IP (si no ponemos una
secci&oacute;n ID en fase 1, &eacute;sta es la
situaci&oacute;n por definici&oacute;n), todo va bien.  La CA
habr&aacute; vinculado el IP al certificado, y el IP en la
configuraci&oacute;n ser&aacute; toda la informaci&oacute;n que
necesitemos.  Un impostor podr&iacute;a usar el mismo IP de otra
m&aacute;quina en algunos casos (por ejemplo, si ambas m&aacute;quinas
estuvieran en la misma red local y la m&aacute;quina que tuviera este IP
estuviera fuera de servicio por cualquier motivo).  Sin embargo, el
impostor no podr&iacute;a tener un certificado y la correspondiente
clave privada que probara que este IP pertenece al impostor.

<p>
Si esto ocurriera alguna vez, el impostor habr&iacute;a conseguido robar
la clave privada del aut&eacute;ntico propietario del IP, o el impostor
habr&iacute;a conseguido enga&ntilde;ar la CA para que le diera un
certificado que contuviera informaci&oacute;n falsa.  En el primer caso
significar&iacute;a que la clave privada no se habr&iacute;a protegido
lo suficientemente bien, y en el segundo la CA habr&iacute;a fallado al
comprobar la identidad del impostor como debiera (o la
informaci&oacute;n del ID del certificado) o la clave privada de la CA
no habr&iacute;a estado bien protegida.  Como todo esto son
prerrequisitos para que la seguridad funcione, ninguna de estas
situaciones deber&iacute;a suceder nunca.

<p>
En nuestro ejemplo la situaci&oacute;n es diferente.  Aqu&iacute;
tenemos un FQDN en el certificado en lugar de una direcci&oacute;n IP.
Como todav&iacute;a tenemos una direcci&oacute;n IP en la secci&oacute;n
de fase 1, tenemos por tanto un posible problema de seguridad.  Lo que
ocurrir&iacute;a durante la negociaci&oacute;n de fase 1 de ISAKMP
ser&iacute;a que podr&iacute;amos comprobar que el extremo de la
conexi&oacute;n se hubiera llevado a cabo desde el IP supuesto (pero
como hemos explicado anteriormente, en algunos casos se podr&iacute;a
falsificar).  Podr&iacute;amos comprobar que ese ID que presenta nuestro
extremo de la conexi&oacute;n realmente pertenece a &eacute;ste.  Pero
lo que no podr&iacute;amos comprobar ahora ser&iacute;a si ese ID es
realmente el ID que suponemos, porque isakmpd nunca ha sabido qu&eacute;
ID deber&iacute;a ser.

<p>
Alguien podr&iacute;a decir que el sistema de DNS ata el IP al FQDN para
el anfitri&oacute;n.  Es cierto, sin embargo el sistema de DNS actual no
es seguro y se le puede, bajo ciertas circunstancias, enga&ntilde;ar
para que entregue informaci&oacute;n falsa (o podr&iacute;a ser
v&iacute;ctima de una ataque de &laquo;denegaci&oacute;n de
servicio&raquo; (DoS, &quot;Denial of Service&quot;) por parte de un
atacante, y la m&aacute;quina del atacante podr&iacute;a falsificar la
respuesta del servidor de DNS).  DNS seguro aparecer&aacute; en el
futuro, pero todav&iacute;a no est&aacute; aqu&iacute; (o por lo menos
la mayor&iacute;a de servidores de DNS todav&iacute;a no son seguros);
por lo tanto, hoy en d&iacute;a, el uso de DNS para comprobar si el FQDN
en el certificado corresponde al IP supuesto, no es una garant&iacute;a.
De hecho, isakmpd no lo comprueba con DNS.  Aun cuando DNS fuera seguro,
la comprobaci&oacute;n no servir&iacute;a en el caso de usar un UFQDN.

<p>
As&iacute; pues, en caso de tener un FQDN como ID, ser&iacute;a posible
que un atacante obtuviese su propia clave privada y que &eacute;sta
estuviera firmada por la misma CA que usamos nosotros (pero con el FQDN
del atacante).  Y podr&iacute;a lanzar un ataque DoS sobre nuestra
conexi&oacute;n para hacerla caer (de hecho, existen unos agujeros en el
mismo protocolo ISAKMP, que probablemente se podr&iacute;n usar para
lanzar un ataque DoS remoto contra la conexi&oacute;n y hacerla caer,
aunque no s&eacute; qu&eacute; sensibles a estos ataques ser&iacute;a
isakmpd).  Entonces, el atacante podr&iacute;a configurar su propia
m&aacute;quina del mismo modo que la de nuestra conexi&oacute;n,
conectarla a la red de nuestra conexi&oacute;n, e intentar conectarse
mediante su ID, clave privada y certificado propios.

<p>
Nuestro isakmpd no habr&iacute;a sido informado sobre qu&eacute; ID por
nuestra conexi&oacute;n (debido a que el atacante est&aacute;
configurado de forma id&eacute;ntica a nuestra conexi&oacute;n, aparte
del certificado, ID y clave privada).  Nuestro isakmpd podr&iacute;a
comprobar que el certificado estuviera firmado por la misma CA (pero la
mayor&iacute;a de CAs firman muchos certificados, y un certificado no es
tan dif&iacute;cil de conseguir), y que el ID presentado fuera el mismo
que el ID en el certificado.  Sin embargo, con la configuraci&oacute;n
presentada hasta ahora, no comprobar&iacute;a que este ID fuera el
supuesto.  Por lo tanto, el atacante tendr&iacute;a permiso para
conectar.

<p>
<h3>Prevenir el ataque</h3>

<p>
Ahora la cuesti&oacute;n es, &iquest;c&oacute;mo podemos informar a
isakmpd sobre qu&eacute; ID debe esperar?  Por suerte esto es
f&aacute;cil, y est&aacute; documentado en la p&aacute;gina del manual
de <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.policy&amp;sektion=5">isakmpd.policy(5)</a>.
Debemos hacer la comprobaci&oacute;n en <i>policy</i>, como sigue:

<blockquote><pre>
keynote-version: 2
comment: This is an example of a policy delegating to a key.
authorizer: &quot;POLICY&quot;
licensees: &quot;x509-base64:\
        MIIBsTCCARoCAQAwDQYJKoZIhvcNAQEEBQAwITELMAkGA1UEBhMCc2UxEjAQBgNV\
        BAMTCUlLRUxBQiBDQTAeFw0wMDAxMjgxNzQyMTZaFw0wMTAxMjcxNzQyMTZaMCEx\
        CzA                Esto es un certificado CA                AQEB\
        BQA                                                         IUuz\
        eOW8P5UGJUH2JVkiA2CTDryFf0CHYwd2P003dtVYw5RvET7XLMpRZiCcWtBdxneW\
        ct+016zUBP/cQMMl+KownxAUq9ezA8GvTyUWC97SOMOgoVj/QR3FHmEjpUi3AgMB\
        AAEwDQYJKoZIhvcNAQEEBQADgYEALGShaAxHvGncev0iFnKrJI4x5T4vlaMP1ad+\
        iWLV5q9H3wickVGN0NPerq0YLwx/VA9WaecYN8V+ALtNKYPuDiT11zwvE8GQeaai\
        NuzgmQ9hh3GifEgN9VEiC3j4kTytonKr0Q+vTLM7xYzheOxvrtUErRwZ9Xs1KzHe\
        yiXHSU8=&quot;
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; &amp;&amp;
            remote_id ==&quot;gw.worksite.se&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
Ahora s&oacute;lo gw.worksite.se podr&iacute;a obtener una
conexi&oacute;n IPsec.  Se pueden a&ntilde;adir m&aacute;s permisos para
otros IDs, a&ntilde;adiendo m&aacute;s comprobaciones remote_id
alternativas, o sea, teniendo condiciones en el fichero <i>policy</i>
como &eacute;sta:

<blockquote><pre>
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; &amp;&amp;
            (remote_id ==&quot;gw.worksite.se&quot;  ||
               remote_id ==&quot;gw.whatsite.se&quot;) -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
Con esta <i>policy</i> podr&iacute;an conectar tanto gw.worksite.se,
como gw.somesite.se, como gw.whatsite.se.

<p>
Algunos afirman que es desafortunado que tengan que haber certificados
enteros introducidos en <i>policy</i>.  Reformatear los certificados en
el formato de <i>policy</i> requiere algo de esfuerzo, y hace que
<i>policy</i> sea poco legible.  Si alguien substituyera por error, un
certificado de usuario con el correspondiente certificado de CA en
alguna parte de un fichero <i>policy</i> complejo, podr&iacute;a
provocar que usuarios no autorizados obtuvieran permiso para conectar en
algunos casos y, a&uacute;n peor, no ser&iacute;a f&aacute;cilmente
detectable leyendo el fichero <i>policy</i> (porque los certificados
X.509 no est&aacute;n en un formato humano legible).

<p>
Para aquellos a quienes les gusta estar al borde del precipicio, existe
una soluci&oacute;n a este problema.  Ahora se puede usar el certificado
&laquo;Nombre Distinguido&raquo; (DN, &quot;Distinguished Name&quot;) en
lugar de un certificado en <i>policy</i> (por supuesto que el
correspondiente certificado debe estar disponible desde los directorios
cert o ca del disco, de modo que isakmpd lo pueda encontrar).  Con este
formato, el fichero <i>policy</i> anterior acabar&iacute;a siendo algo
as&iacute;:

<blockquote><pre>  
keynote-version: 2
comment: This is an example of a policy delegating to a key.
authorizer: &quot;POLICY&quot;
licensees: &quot;DN:/C=se/CN=IKELAB CA&quot;
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; &amp;&amp;
            (remote_id ==&quot;gw.worksite.se&quot;  ||
             remote_id ==&quot;gw.somesite.se&quot;  ||
             remote_id ==&quot;gw.whatsite.se&quot;) -&gt; &quot;true&quot;;
</pre></blockquote>

<p>
Mucho m&aacute;s legible, &iquest;o no?  La informaci&oacute;n sobre lo
que es el exacto DN para un certificado se puede encontrar mirando al
certificado, usando la utilidad openssl:

<blockquote><tt>
$ <b>openssl x509 -text &lt; ca.crt</b>
</tt></blockquote>

<p>
Se pueden hacer configuraciones de <i>policy</i> m&aacute;s complicadas
pero esto es suficiente para empezar, y todav&iacute;a hay otro ejemplo
en la siguiente secci&oacute;n.

<p>
Esto deber&iacute;a proveer de la informaci&oacute;n necesaria sobre el
certificado en ca.crt.  Esto ser&aacute; bueno siempre que tengamos un
fichero <i>policy</i> peque&ntilde;o o, por lo menos, uno razonable.
Sin embargo, todav&iacute;a no es suficiente si tenemos un sitio enorme
con muchos usuarios que deban tener permiso de conexi&oacute;n.


<p>
<h2>Configuraciones de multiusuario y/o autorizaci&oacute;n
centralizada</h2>

<p>
Veamos ahora algunas caracter&iacute;sticas interesantes de isakmpd.
Hasta ahora hemos asumido que el supuesto extremo remoto de la
conexi&oacute;n era conocido y ten&iacute;a una direcci&oacute;n IP
est&aacute;tica.  Esto no siempre es as&iacute;.  Muchas personas usan
IPs asignados de forma din&aacute;mica, o usan muchas m&aacute;quinas
diferentes.  En otros casos, como en el caso de los servidores,
podr&iacute;amos no estar seguros de qui&eacute;n quiere conectar.

<p>
Por lo tanto, una funcionalidad interesante de isakmpd es que puede usar
en la secci&oacute;n de fase 1 una etiqueta predefinida en lugar de un
IP, permitiendo de este modo negociaciones isakmpd desde cualquier IP.
Esto se har&iacute;a del siguiente modo:

<blockquote><pre>
[phase 1]
Default=        work-gw
</pre></blockquote>

<p>
Primero, hay que decir que esta configuraci&oacute;n podr&iacute;a no
ser segura frente a ataques de DoS.  Como se ha dicho anteriormente,
existen algunos agujeros en los protocolos ISAKMP/IKE.  De todos modos,
el uso de una secci&oacute;n de fase 1 predefinida tambi&eacute;n nos
permite usar un tipo de &laquo;certificados de
autorizaci&oacute;n&raquo;.

<p>
Imaginemos que tuvi&eacute;ramos muchos usuarios autorizados, pero que
no acept&aacute;ramos a cualquier usuario, como podr&iacute;a ocurrir en
una compa&ntilde;&iacute;a.  Nos gustar&iacute;a que los empleados
tuvieran permiso para conectar, pero nadie m&aacute;s.  Ahora imaginemos
que la compa&ntilde;&iacute;a tuviera miles de empleados, y que
quisi&eacute;ramos que todos ellos pudieran conectar desde cualquier
m&aacute;quina (no s&oacute;lo desde dentro de la red de la
compa&ntilde;&iacute;a), pero que no todos tuvieran permiso para hacer
cualquier cosa.  Se podr&iacute;a escribir un fichero <i>policy</i> como
&eacute;ste:

<blockquote><pre>
keynote-version: 2
authorizer: &quot;POLICY&quot;
licensees: &quot;telnet@work&quot; || &quot;telnet@lab&quot; || &quot;pop3@work&quot; 
conditions: app_domain ==&quot;IPsec policy&quot; &amp;&amp;
            esp_present ==&quot;yes&quot; &amp;&amp;
            esp_enc_alg !=&quot;null&quot; &amp;&amp;
            remote_id_type ==&quot;UFQDN&quot; &amp;&amp;
            (remote_id ==&quot;telnet@worksite.se&quot;  ||
             remote_id ==&quot;pop3@worksite.se&quot;  ||
             remote_id ==&quot;telnet@lab.worksite.se&quot;) -&gt; &quot;true&quot;;

authorizer: &quot;telnet@work&quot;
licensees: &quot;DN:/C=se/CN=IKELAB CA&quot;
conditions: remote_id ==&quot;telnet@worksite.se&quot; &amp;&amp;
            local_filter_type ==&quot;IPv4 address&quot; &amp;&amp;
            local_filter_port ==&quot;23&quot; &amp;&amp;
            local_filter ==&quot;192.168.002.003&quot;

authorizer: &quot;telnet@lab&quot;
licensees: &quot;DN:/C=se/CN=IKELAB CA&quot;
conditions: remote_id ==&quot;telnet@lab.worksite.se&quot; &amp;&amp;
            local_filter_type ==&quot;IPv4 address&quot; &amp;&amp;
            local_filter_port ==&quot;23&quot; &amp;&amp;
            local_filter ==&quot;192.168.002.002&quot; -&gt; &quot;true&quot;;

authorizer: &quot;pop3@work&quot;
licensees: &quot;DN:/C=se/CN=IKELAB CA&quot;
conditions: local_filter_type ==&quot;IPv4 address&quot; &amp;&amp;
            local_filter_port ==&quot;110&quot; &amp;&amp;
            local_filter ==&quot;192.168.002.003&quot; &amp;&amp;
            remote_id ==&quot;telnet@worksite.se&quot; -&gt; &quot;true&quot;;
</pre></blockquote>

<p> 
Puede que esto no sea exactamente como deber&iacute;a ser.  Por lo que
s&eacute;, no est&aacute; comprobado (de hecho, estas condiciones de
filtros podr&iacute;an no funcionar como espero).  Adem&aacute;s, un
fichero <i>policy</i> como &eacute;ste (cualquiera con un IP del extremo
de la conexi&oacute;n predefinido) requerir&iacute;a reescribir partes
del fichero isakmpd.conf tambi&eacute;n.  Esto conllevar&iacute;a
algunas implicaciones en la seguridad.  Para este tipo de conexiones en
las que cualquiera debe tener permiso para conectar, es probablemente
deseable grabar el DN de cualquiera que conecte.  Que yo sepa, isakmpd
todav&iacute;a no tiene soporte para esto.  Adem&aacute;s,
tambi&eacute;n podr&iacute;a tener otras implicaciones en la seguridad.
De cualquier modo la idea b&aacute;sica est&aacute; clara.

<p> 
Por si acaso alguien no ha visto las interesantes posibilidades que esto
tiene: Si todas la m&aacute;quinas que usan ISAMKP/IKE de este modo
tuvieran un grupo de condiciones est&aacute;ndar para todos los
servicios que los usuarios quisieran usar de forma remota, la CA
podr&iacute;a autorizar a los usuarios poniendo las extensiones
subjectAltName correctas en sus certificados.  Adem&aacute;s, la fecha
de caducidad para estos certificados se podr&iacute;a configurar para
que caducara a menudo, aunque los usuarios podr&iacute;an obtener nuevos
certificados cuando sus certificados actuales estuvieran a punto de
caducar.  Si los usuarios hicieran un mal uso de sus autorizaciones,
bastar&iacute;a con no volver a emitir los certificados para que no
pudieran acceder despu&eacute;s de la fecha de caducidad.  No
ser&iacute;a necesario cambiar los ficheros <i>policy</i> en todas las
m&aacute;quinas simplemente porque un empleado, por ejemplo, dejara el
trabajo.  El mismo esquema podr&iacute;a funcionar para
prop&oacute;sitos distintos a ISAKMP/IPsec (¡incluida la
autorizaci&oacute;n para sistemas fuera de la conexi&oacute;n!), aunque
eso requerir&iacute;a un software especial.  En cualquier caso,
cualquier organizaci&oacute;n que hiciera esto es probable que
tambi&eacute;n quisiera ser su propia CA.

<p>
Las configuraciones de multiusuarios (usuarios m&oacute;viles) como
&eacute;sta, tambi&eacute;n son posibles con claves precompartidas, pero
entonces se requiere que se use el modo AGGRESSIVE en lugar del modo
ID_PROT, ya que en este caso necesitaremos poder escoger la frase de la
contrase&ntilde;a correcta basada en el ID, debido a que en este caso no
lo podemos saber por el ID (en modo AGGRESSIVE el ID se env&iacute;a
durante un estado m&aacute;s temprano de la negociaci&oacute;n, pero se
env&iacute;a descifrado, por lo tanto el modo AGGRESSIVE es m&aacute;s
r&aacute;pido porque necesita menos intercambios de mensajes, pero
tambi&eacute;n es un poco menos seguro debido a que el ID se
env&iacute;a en claro).


<p>
<a name="IKEcl"></a>
<h2>13.9 - &iquest;Qu&eacute; clientes IKE son compatibles con
isakmpd?</h2>

<p>
<code>isakmpd</code> es el d&aelig;mon de la gesti&oacute;n de claves de
ISAKMP/Oakley que viene con OpenBSD.  Sospechamos que interacciona, por
lo menos en parte, con la mayor&iacute;a de implementaciones ISAKMP,
pero s&oacute;lo los siguientes han sido comprobados.  N&oacute;tese que
algunos software isakmp que puede encontrar est&aacute;n basados en el
d&aelig;mon iskamp de OpenBSD.

<p>
Los siguientes clientes para MS-Windows son compatibles seg&uacute;n los
informes recibidos:

<ul>
<!--  <li><a href="http://www.timestep.com/">TimeStep</a> PERMIT/Client -->
<li><a href="http://www.ashleylaurent.com/">Ashley Laurent</a> VPN
software
<li><a href="http://www.pgp.com/">PGP VPN</a> software
<li><a href="http://www.ssh.com/">SSH Sentinel</a> IPsec client
<li><a href="http://www.cisco.com/">Cisco</a> IRE client
<li><a href="http://www.microsoft.com">Microsoft</a> Windows 2000 y XP
</ul>

<p>
Las siguientes pasarelas/enrutadores son compatibles seg&uacute;n los
informes recibidos:

<ul>
<li><a href="http://www.cisco.com/">Cisco</a> IOS
<li><a href="http://www.cisco.com/">Cisco</a> PIX
<li><a href="http://www.intel.com/">Intel</a> LanRover
<!-- <li><a href="http://www.timestep.com/">TimeStep</a> PERMIT/Gate -->
<li><a href="http://www.cendio.com/">Cendio</a> Fuego
<li><a href="http://www.kame.net/">KAME</a> para FreeBSD
<li><a href="http://www.xs4all.nl/~freeswan/">FreeS/WAN</a> para Linux
<li><a href="http://www.symantec.com/">Symantec</a> Raptor
<li><a href="http://www.ericsson.com/">Ericsson</a> eBox
<li><a href="http://www.f-secure.com/">F-Secure</a> VPN+
<li><a href="http://www.teamware.com/">Teamware</a> TWISS
<li><a href="http://www.3com.com/">3com</a> Pathbuilder
<li><a href="http://www.nortelnetworks.com/">Nortel</a> Contivity
<li><a href="http://www.checkpoint.com/">CheckPoint</a> FW-1
<li><a href="http://www.watchguard.com/">Watchguard</a> Firebox III
<li><a href="http://www.lucent.com/">Lucent</a> Access Point
</ul>


<p>
<a name="Trouble"></a>
<h2>13.10 - Resoluci&oacute;n de problemas de IPsec/VPN</h2>

<p>
Para resolver problemas, la primera herramienta que se debe usar es
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=tcpdump&amp;sektion=8">tcpdump(8)</a>.
Usaremos <code>tcpdump</code> para buscar varias cosas.

<p>
Si estamos usando tcpdump en OpenBSD, disponemos de una versi&oacute;n
mejorada de tcpdump que puede mostrarnos algo de informaci&oacute;n
sobre paquetes ESP y AH.  Si estamos usando tcpdump desde OpenBSD 2.5 o
desde otro sistema operativo, es posible que tengamos una versi&oacute;n
anticuada que s&oacute;lo nos muestre el n&uacute;mero del protocolo
para AH o ESP (el protocolo IP de ESP es 50, y el de AH es 51).

<ul>
<li>Con tcpdump podemos mirar si el tr&aacute;fico est&aacute; usando
AH/ESP o texto en claro.  Si nuestro tr&aacute;fico es en texto en
claro, entonces nuestro flujos est&aacute;n configurados de modo
incorrecto, o nuestro isakmp no est&aacute; negociando como debiera.  En
tal caso usaremos
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ping&amp;sektion=8">ping(8)</a>
para generar tr&aacute;fico simple.
<p>
Por ejemplo, yo tengo dos m&aacute;quinas anfitrionas, 208.1.1.1 y
208.2.2.2.  Ingreso en 208.2.2.2 y hago lo siguiente:
<pre>
# <b>ping -c 3 208.1.1.1</b>
PING esp.mil (208.1.1.1): 56 data bytes
64 bytes from 208.1.1.1: icmp_seq=0 ttl=255 time=190.155 ms
64 bytes from 208.1.1.1: icmp_seq=1 ttl=255 time=201.040 ms
64 bytes from 208.1.1.1: icmp_seq=2 ttl=255 time=165.481 ms
--- esp.mil ping statistics ---
3 packets transmitted, 3 packets received, 0% packet loss
round-trip min/avg/max = 165.481/185.558/201.040 ms
</pre>
<p>
Y en otra sesi&oacute;n puedo ver mis &quot;pings&quot; encapsulados:
<pre>
# <b>tcpdump -ni fxp7 host 208.1.1.1</b>
tcpdump: listening on fxp7
14:12:19.630274 esp 208.2.2.2 &gt; 208.1.1.1 spi 0x00001000 seq 4535 len 116
14:12:19.813519 esp 208.1.1.1 &gt; 208.2.2.2 spi 0x00001001 seq 49313 len 116
14:12:20.630277 esp 208.2.2.2 &gt; 208.1.1.1 spi 0x00001000 seq 4536 len 116
14:12:20.832458 esp 208.1.1.1 &gt; 208.2.2.2 spi 0x00001001 seq 49314 len 116
14:12:21.630273 esp 208.2.2.2 &gt; 208.1.1.1 spi 0x00001000 seq 4537 len 116
<b>^C</b>
1831 packets received by filter
0 packets dropped by kernel
</pre>

<p>
<li>ISAKMP va por el puerto UDP 500.  Si este puerto est&aacute;
bloqueado por un cortafuegos o filtro de paquetes, entonces debemos
cambiarlo.

<blockquote><pre>
# Passing in ISAKMP traffic from the security gateways
pass in on ne0 proto udp from gatewB/32 port = 500 to gatewA/32 port = 500
pass out on ne0 proto udp from gatewA/32 port = 500 to gatewB/32 port = 500

# Passing in encrypted traffic from security gateways
pass in proto esp from gatewB/32 to gatewA/32
pass out proto esp from gatewA/32 to gatewB/32
</pre></blockquote>

<p>
<li>Para activar todo el depurado de utilidad en isakmpd, lo iniciamos
como

<blockquote><tt>
# <b>/sbin/isakmpd -d -DA=90</b>
</tt></blockquote>

<p>
o (para saltar la informaci&oacute;n m&aacute;s detallada de depurado
del temporizador)

<blockquote><tt>
# <b>/sbin/isakmpd -d -DA=90 -D1=70</b>
</tt></blockquote>

<p>
<li>Debemos permitir el paso a nuestra net A con cortafuegos del
tr&aacute;fico que ha sido procesado por IPsec.

<blockquote><pre>
# Passing in traffic from the designated subnets.
pass in on enc0 from netB/netBmask to netA/netAmask
</pre></blockquote>

<p>
<li>Con tcpdump en OpenBSD podemos descodificar la mayor parte del texto
en claro de las sesiones IKE.  tcpdump tambi&eacute;n nos
mostrar&aacute; los datos de cargo de AH.

<p>
<li>Montaremos un sistema de archivo /kern (si no usamos uno por
definici&oacute;n)

<blockquote><tt>
# <b>mkdir /kern; mount -t kernfs /kern /kern</b>
</tt></blockquote>

<p>
En /kern hay una tabla de SA/SPIs actuales, incluidos los que tienen
flujos (SAs salientes) y los que no (SAs entrantes).  Tambi&eacute;n hay
contadores de tr&aacute;fico que podemos usar para ver qu&eacute;
tr&aacute;fico pasa y hacia d&oacute;de se dirige.

<p>
<li>Finalmente, podemos usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=netstat&amp;sektion=1">netstat(1)</a>
para ver nuestras SAs.

<blockquote><pre>
$ <b>netstat -rn -f encap</b>
Routing tables

Encap:
Source             Port  Destination        Port  Proto SA(Address/SPI/Proto) 
0.0.0.0/32         0     192.168.99/24      0     0     208.1.1.1/00001000/50
0.0.0.0/32         0     208.1.1.1/32       0     0     208.1.1.1/00001000/50
208.1.2.0/24       0     192.168.99/24      0     0     208.1.1.1/00001000/50
208.1.2.0/24       0     208.1.1.1/32       0     0     208.1.1.1/00001000/50
208.1.5.0/24       0     192.168.99/24      0     0     208.1.1.1/00001000/50
208.1.5.0/24       0     208.1.1.1/32       0     0     208.1.1.1/00001000/50
208.2.2.2/32       0     192.168.99/24      0     0     208.1.1.1/00001000/50
208.2.2.2/32       0     208.1.1.1/32       0     0     208.1.1.1/00001000/50
</pre></blockquote>

<p>
<li>Si todo lo dem&aacute;s fallara, recompilaremos el n&uacute;cleo del
sistema con <code>option ENCDEBUG</code>.  A continuaci&oacute;n
configuraremos <i>net.inet.ip.encdebug</i> con el valor 1 en sysctl.
Buscaremos avisos o errores en nuestro dmesg, e informaremos sobre ellos
a los desarrolladores de OpenBSD, usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a>.
De forma alternativa, si no se est&aacute; seguro de que que el problema
sea un error, se puede enviar un mensaje a una de las 
<a href="../../es/mail.html">listas de correo</a>.
</ul>


<p>
<a name="SeeAlso"></a>
<h2>13.11 - Documentaci&oacute;n relacionada</h2>

<p>
IPsec est&aacute; parcialmente documentado en la p&aacute;gina del
manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vpn&amp;sektion=8">vpn(8)</a>.
Hay varios modelos de configuraci&oacute;n en el directorio
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/share/ipsec/">/usr/share/ipsec/</a> 
que pueden ser de ayuda.  Las p&aacute;ginas del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=enc&amp;sektion=4">enc(4)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&amp;sektion=4">ipsec(4)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsecadm&amp;sektion=8">ipsecadm(8)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd&amp;sektion=8">isakmpd(8)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.conf&amp;sektion=5">isakmpd.conf(5)</a> y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd.policy&amp;sektion=5">isakmpd.policy(5)</a>
tienen informaci&oacute;n m&aacute;s detallada y pueden ayudarnos con la
configuraci&oacute;n y operaci&oacute;n de IPsec.

<p>
Otros enlaces:

<ul>
<li><a href="http://www.ietf.org/html.charters/ipsec-charter.html">Grupo
de Trabajo de IPsec del IETF</a>
<li><a href="http://isakmp-test.ssh.fi/">Nodo de Verificaci&oacute;n de
Interoperabilidad de SSH IPsec</a>
<li><a href="http://ipsec-wit.antd.nist.gov/">Verificador de
Interoperabilidad de NIST IPsec basado en web</a>
<li><a href="http://www.r4k.net/ipsec/">Porte de IPsec de OpenBSD para
FreeBSD</a>
<li><a href="http://www.xs4all.nl/~freeswan/">FreeS/WAN - IPsec para
Linux</a>
<li><a href="http://www.pintday.org/hack/docs/vpn-24-minifaq.shtml">
Mini-FAQ de Configuraci&oacute;n de una VPN con OpenBSD 2.4</a>
</ul>

<p> 
<a name="rfc">
Y en los RFC:
</a>

<ul>
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc1320.html">RFC
1320</a> - The MD4 Message-Digest Algorithm
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc1321.html">RFC
1321</a> - The MD5 Message-Digest Algorithm
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc1828.html">RFC
1828</a> - IP Authentication using Keyed MD5
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc1829.html">RFC
1829</a> - The ESP DES-CBC Transform
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2040.html">RFC
2040</a> - The RC5, RC5-CBC, RC5-CBC-Pad, and RC5-CTS Algorithms
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2085.html">RFC
2085</a> - HMAC-MD5 IP Authentication with Replay Prevention
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2104.html">RFC
2104</a> - HMAC: Keyed-Hashing for Message Authentication
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2144.html">RFC
2144</a> - The CAST-128 Encryption Algorithm 
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2202.html">RFC
2202</a> - Test Cases for HMAC-MD5 and HMAC-SHA-1 
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2207.html">RFC
2207</a> - RSVP Extensions for IPsec Data Flows
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2268.html">RFC
2268</a> - A Description of the RC2 Encryption Algorithm 
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2367.html">RFC
2367</a> - PF_KEY Key Management API, Version 2
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2401.html">RFC
2401</a> - Security Architecture for the Internet Protocol
(<b>IPsec</b>)
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2402.html">RFC
2402</a> - IP Authentication Header (<b>AH</b>)
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2403.html">RFC
2403</a> - The Use of HMAC-MD5-96 within ESP and AH
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2404.html">RFC
2404</a> - The Use of HMAC-SHA-1-96 within ESP and AH
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2405.html">RFC
2405</a> - The ESP DES-CBC Cipher Algorithm With Explicit IV
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2406.html">RFC
2406</a> - IP Encapsulating Security Payload (<b>ESP</b>)
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2407.html">RFC
2407</a> - The Internet IP Security Domain of Interpretation for ISAKMP
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2408.html">RFC
2408</a> - Internet Security Association and Key Management Protocol
(<b>ISAKMP</b>)
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2409.html">RFC
2409</a> - The Internet Key Exchange (<b>IKE</b>)
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2410.html">RFC
2410</a> - The NULL Encryption Algorithm and Its Use With IPsec (ha
ha...)
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2411.html">RFC
2411</a> - IP Security Document Roadmap
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2412.html">RFC
2412</a> - The OAKLEY Key Determination Protocol
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2451.html">RFC
2451</a> - The ESP CBC-Mode Cipher Algorithms
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2631.html">RFC
2631</a> - Diffie-Hellman Key Agreement Method
<li><a href="http://www.cis.ohio-state.edu/htbin/rfc/rfc2709.html">RFC
2709</a> - Security Model with Tunnel-mode IPsec for NAT Domains
</ul>

<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq12.html">[Secci&oacute;n 12 - Para usuarios avanzados]</a>
<a href="faq14.html">[Secci&oacute;n 14 - Uso de discos en OpenBSD]</a>
</font>
<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq13.html,v 1.78 2003/06/28 23:01:32 jolan Exp ]<br>
$Translation: faq13.html,v 1.41 2003/06/29 08:48:44 horacio Exp $<br>
$OpenBSD: faq13.html,v 1.39 2003/07/04 22:42:26 jufi Exp $
</small>
</body>
</html>
