<html>
<head>
<title>1.0 - Introducci&oacute;n a OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2000 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238E">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">1.0 - Introducci&oacute;n a OpenBSD</font><hr></h2>
</p>

<p>
<ul><h3>Tabla de Contenidos</h3>
<li><a href="#1.1">1.1 - &iquest;Qu&eacute; es OpenBSD?</a>
<li><a href="#1.2">1.2 - &iquest;En qu&eacute; sistemas funciona 
    OpenBSD?</a>
<li><a href="#1.3">1.3 - &iquest;Es OpenBSD libre?</a>
<li><a href="#1.4">1.4 - &iquest;Para qu&eacute; querr&iacute;a usar 
    OpenBSD?</a>
<li><a href="#1.5">1.5 - &iquest;C&oacute;mo puedo ayudar a
    OpenBSD?</a>
<li><a href="#1.6">1.6 - &iquest;Qui&eacute;n mantiene OpenBSD?</a>
</ul>
</p>

<hr>
<br>

<p>
<a name="1.1"></a>
<h2>1.1 - &iquest;Qu&eacute; es OpenBSD?</h2>
</p>

<p>
El Proyecto <a href="../../es/index.html">OpenBSD</a> produce un
sistema operativo tipo UNIX, basado en 4.4BSD, multiplataforma y de
libre disposici&oacute;n.  Nuestros
<a href="../../es/goals.html">objetivos</a> se centran en la correcta
aplicaci&oacute;n de la <a href="../../es/security.html">seguridad</a>,
las normas, y en la <a href="../../es/plat.html">portabilidad</a>.
<a href="../../es/index.html">OpenBSD</a> contiene soporte para la
emulaci&oacute;n de la mayor parte del c&oacute;digo binario de los
sistemas SVR4 (Solaris), FreeBSD, Linux, BSDI, SunOS, y HP-UX.<br>
</p>

<br>

<p>
<a name="1.2"></a>
<h2>1.2 - &iquest;En qu&eacute; sistemas funciona OpenBSD?</h2>
</p>

<p>
OpenBSD 2.8 funciona en las siguientes plataformas:
<ul>
   <li><a href="../../es/i386.html">i386</a> - CD de arranque
   <li><a href="../../es/sparc.html">sparc</a> - CD de arranque
   <li><a href="../../es/hp300.html">hp300</a> 
   <li><a href="../../es/amiga.html">amiga</a> 
   <li><a href="../../es/mac68k.html">mac68k</a> 
   <li><a href="../../es/powerpc.html">powerpc</a> 
   <li><a href="../../es/sun3.html">sun3</a> 
   <li><a href="../../es/mvme68k.html">mvme68k</a> 
   <li><a href="../../es/vax.html">vax</a>
</ul>

<p>
<em>CD de arranque</em> indica que la instalaci&oacute;n de OpenBSD se
iniciar&aacute; directamente desde el CDROM.  El CD arrancar&aacute; en
varias plataformas.  Puede obtener m&aacute;s detalles sobre
c&oacute;mo conseguir OpenBSD en CD en la
<a href="faq3.html">secci&oacute;n 3.0</a> de estas preguntas
frecuentes.
</p>

<p>
En versiones anteriores de OpenBSD tambi&eacute;n hab&iacute;a portes
para:
<ul>
    <li><a href="../../es/arc.html">arc</a> - Este porte se
	elimin&oacute; de la versi&oacute;n 2.4, pero se puede
	encontrar el c&oacute;digo en la versi&oacute;n 2.3.
    <li><a href= "../../es/mvme88k.html">mvme88k</a>
    <li><a href= "../../es/alpha.html">alpha</a> - Es muy probable que
	este porte reaparezca en un futuro no muy lejano.
    <li><a href= "../../es/pmax.html">pmax</a>
</ul>
</p>

<p>
&iquest;Soporte para multiprocesadores?  Lea la secci&oacute;n
<a href= "faq8.html#8.12">8.12</a> para m&aacute;s informaci&oacute;n.
<br>
Para conocer el estado de implementaci&oacute;n de este proyecto, lea
la p&aacute;gina 
<a href="../../es/smp.html">http://www.openbsd.org/es/smp.html</a>.
</p>

<p>
<a name="1.3"></a>
<h2>1.3 - &iquest;Es OpenBSD libre?</h2>
</p>

<p>
OpenBSD es totalmente libre.  El c&oacute;digo binario es de libre
distribuci&oacute;n.  El c&oacute;digo fuente es de libre
ditribuci&oacute;n.  Todas las partes componentes de OpenBSD tienen
unos derechos de autor con unos t&eacute;rminos razonables que permiten
su libre distribuci&oacute;n.  Esto incluye la posibilidad de
REUTILIZAR la mayor parte del &aacute;rbol de fuentes de OpenBSD, tanto
para el uso personal como para el comercial.  OpenBSD <strong>no
incluye ninguna restricci&oacute;n</strong> m&aacute;s all&aacute; de
las que vienen impuestas por la licencia original BSD.  En una
distribuci&oacute;n regular de OpenBSD no se puede incluir
ning&uacute;n tipo de <em>software</em> que se encuentre bajo licencias
m&aacute;s estrictas o restrictivas.  Esto lo mantenemos as&iacute;
para poder salvaguardar la libre redistribuci&oacute;n y uso de
OpenBSD.  Por ejemplo, se puede usar OpenBSD a nivel personal,
acad&eacute;mico, a nivel de instituciones gubernamentales, de
organizaciones no gubernamentales, y de empresas privadas o
p&uacute;blicas.
</p>

<p>
M&aacute;s informaci&oacute;n sobre otras licencias conocidas en 
<a href="../../es/policy.html">http://www.openbsd.org/es/policy.html</a>.
</p>

<p>
Los desarrolladores de OpenBSD mantienen el proyecto, en su mayor
parte, de sus propios recursos.  Estos recursos incluyen el tiempo
dedicado a programar para el proyecto, el equipamiento que usan para
desarrollar soporte para los distintos portes, los recursos de red que
se usan para que Vd.  pueda obtener OpenBSD a trav&eacute;s de
Internet, y el tiempo invertido en contestar preguntas e investigar
sobre los informes de errores que env&iacute;an los usuarios.  Los
desarrolladores de OpenBSD no son ricos, y hasta la m&aacute;s
peque&ntilde;a contribuci&oacute;n de tiempo, equipamiento y recursos
puede suponer una gran diferencia.
</p>

<br>

<p>
<a name="1.4"></a> 
<h2>1.4 - &iquest;Para qu&eacute; querr&iacute;a usar OpenBSD?</h2>
</p>

<p>
Con frecuencia, los nuevos usuarios quieren saber si OpenBSD es muy
superior a algunos otros sistemas operativos tipo UNIX.  No existe una
respuesta a esta pregunta, y generalmente da pie a innumerables (e
infructuosos) debates encendidos.  Bajo ninguna circunstancia debe
formular una pregunta de este tipo en una lista de correo de OpenBSD.
</p>

<p>
A continuaci&oacute;n exponemos algunas razones por las que creemos que
OpenBSD es un sistema operativo de gran utilidad.  Si OpenBDS es un
sistema que vaya a servir a sus prop&oacute;sitos o no, es una
cuesti&oacute;n que s&oacute;lo Vd. puede contestar.
</p>

<p>
<ul>
   <li>OpenBSD funciona en varios tipos diferentes de plataformas de
       <em>hardware</em>.</li>
   <li>OpenBSD est&aacute; reconocido por muchos profesionales de la
       seguridad inform&aacute;tica como el sistema operativo tipo
       UNIX m&aacute;s seguro;  esto es el resultado de una intensa
       auditor&iacute;a de seguridad sobre el c&oacute;digo fuente,
       llevada a cabo durante un a&ntilde;o y medio por un grupo de
       diez personas.</li>
   <li>OpenBSD es un sistema operativo con todas las funcionalidades de
       UNIX, que se puede adquirir de forma gratuita.</li>
   <li>OpenBSD integra la &uacute;ltima tecnolog&iacute;a en seguridad
       para la construcci&oacute;n de cortafuegos (filtros IP) y
       <a href="../../es/crypto.html#hardware">servicios de redes
       privados</a> dentro de un entorno distribuido.</li>
   <li>OpenBSD aprovecha el fuerte desarrollo actual en muchas
       &aacute;reas, y ofrece la oportunidad de trabajar con
       tecnolog&iacute;as emergentes dentro de una comunidad
       internacional de programadores y usuarios finales.</li>
   <li>OpenBSD ofrece al usuario normal la oportunidad de participar en
       el desarrollo y prueba del producto.</li>
</ul>
</p>

<br>

<p>
<a name="1.5"></a>
<h2>1.5 - &iquest;C&oacute;mo puedo ayudar a OpenBSD?</h2>
</p>

<p>
Agradecemos mucho a todas aquellas personas y organizaciones que hayan
aportado alg&uacute;n tipo de contribuci&oacute;n al Proyecto OpenBSD.
Vaya nuestro reconocimiento a las personas que aparecen en esta lista:
</p>

<p>
<a href="../../es/donations.html">http://www.openbsd.org/es/donations.html</a>
</p>

<p>
OpenBSD tiene una necesidad constante de apoyo en varios campos por
parte de la comunidad de usuarios.  Si piensa que OpenBSD es de
utilidad para sus prop&oacute;sitos, le animamos a que encuentre un
modo de contribuir al proyecto.  Si ninguna de las sugerencias que
hacemos a continuaci&oacute;n son de su conveniencia, le invitamos a
que proponga Vd. mismo una alternativa enviando un mensaje a 
<a href="mailto:donations@openbsd.org">donations@openbsd.org.</a>
</p>

<p>
<ul>
   <li>Compre un CD de OpenBSD.
       En &eacute;ste encontrar&aacute; una completa versi&oacute;n
       actual de OpenBSD, y el arranque del sistema desde el CDROM es
       posible para muchas plataformas.  Esta forma de
       adquisici&oacute;n del sistema genera fondos de ayuda para el
       proyecto, y al mismo tiempo reduce la carga sobre los recursos
       de red que se utilizan para la distribuci&oacute;n por medio de
       Internet.  La distribuci&oacute;n de la caja con 2 CD incluye el
       c&oacute;digo fuente completo, y su precio es muy bajo.
       &iexcl;Recuerde, sus amigos necesitar&aacute;n tener su propia
       copia!</li>
   <li>Haga donaciones de dinero.
       El proyecto necesita un flujo de fondos constante para sufragar
       los gastos de equipamiento, conexi&oacute;n de redes, y otros
       gastos relacionados con la publicaci&oacute;n de los CD.  La
       fabricaci&oacute;n de los CD requiere de un desembolso &laquo;in
       situ&raquo; por parte de los desarrolladores, y a cambio no
       obtienen ninguna garant&iacute;a de que pueda existir un
       reembolso &laquo;a posteriori&raquo;.  Env&iacute;e un mensaje a 
       <a href="mailto:donations@openbsd.org">donations@openbsd.org</a>
       para informarse sobre c&oacute;mo puede contribuir.  Incluso las
       donaciones m&aacute;s peque&ntilde;as pueden suponer una gran
       diferencia.</li>
   <li>Haga donaciones de equipamiento y componentes.
       El proyecto necesita constantemente <em>hardware</em>
       espec&iacute;fico y general.  Siempre hay necesidad de algunos
       productos como discos IDE y SCSI, y varios tipos de
       m&oacute;dulos de memoria RAM.  Para otros tipos de
       <em>hardware</em> como placas base y sistemas completos puede
       informarse sobre la necesidad existente en la actualidad.
       Escriba a 
       <a href="mailto:donations@openbsd.org">donations@openbsd.org</a>.</li>
   <li>Ayude con sus conocimientos y su tiempo.
       Aquellos programadores que disfrutan programando sistemas
       operativos son siempre bienvenidos, pero hay muchos otros modos
       en los que pueden ser &uacute;tiles.  Subscr&iacute;base en las
       listas de correo y participe ayudando a contestar las preguntas
       de los nuevos usuarios.</li>
   <li>Ayude a mantener la documentaci&oacute;n,
       enviando m&aacute;s informaci&oacute;n para las preguntas
       frecuentes a 
       <a href="mailto:faq@openbsd.org">faq@openbsd.org</a>.
       Organice un grupo de usuarios y atraiga a sus amigos y conocidos
       a OpenBSD.  Presente el caso en su lugar de trabajo.  Si eres
       estudiante, habla con tus profesores sobre la posibilidad de
       usar OpenBSD como una herramienta para cursos de
       Inform&aacute;tica o Ingenier&iacute;a.  Tambi&eacute;n vale la
       pena mencionar aqu&iacute; una de las maneras en que no se debe
       intentar &laquo;ayudar&raquo; al Proyecto OpenBSD:  perdiendo el
       tiempo en discusiones encendidas con usuarios de otros sistemas
       operativos en los grupos de noticias de Usenet.  Esto no ayuda
       al proyecto a atraer nuevos miembros y puede da&ntilde;ar las
       relaciones que los desarrolladores de OpenBSD tienen con otros
       desarrolladores.</li>
</ul>
</p>

<br>

<p>
<a name="1.6"></a>
<h2>1.6 - &iquest;Qui&eacute;n mantiene OpenBSD?</h2>
</p>

<p>
El mantenimiento de OpenBSD est&aacute; a cargo de un equipo de
desarrollo ubicado en varios 
<a href="../../images/map.jpg">pa&iacute;ses</a>.  La
coordinaci&oacute;n del proyecto est&aacute; cargo de Theo de Raadt
desde Canad&aacute;.
</p>

<hr>

<p>
<font color="#0000e0">
<a href="faq2.html">[Secci&oacute;n 2.0 - Otros Recursos de Informaci&oacute;n sobre OpenBSD]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&Iacute;ndice]"></a>
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq1.html,v 1.22 2001/03/17 22:45:18 austin Exp ]<br>
$Translation: faq1.html,v 1.14 2001/04/07 23:36:17 horacio Exp $<br>
$OpenBSD: faq1.html,v 1.10 2001/04/08 21:07:13 jufi Exp $
</small>
</p>
</body>
</html> 
