<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>11 - C&oacute;mo mejorar el rendimiento</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq10.html">[Secci&oacute;n 10 - Administraci&oacute;n del sistema]</a>
<a href="faq12.html">[Secci&oacute;n 12 - Para usuarios avanzados]</a>
</font>

<h1><font color="#e00000">11 - C&oacute;mo mejorar el
rendimiento</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#Network">11.1 - Redes</a>
<li><a href="#Disk">11.2 - E/S del disco</a>
<!-- li><a href="#kmem">11.3 - C&oacute;mo mejorar kmem</a -->
<li><a href="#HW">11.4 - Elecci&oacute;n del <em>hardware</em></a>
<li><a href="#Async">11.5 - &iquest;Por qu&eacute; no se usan montajes
asincr&oacute;nicos?</a>
<li><a href="#XF86">11.6 - Ajuste de la resoluci&oacute;n del monitor
para XFree86</a>
</ul>

<hr>

<p>
Es probable que quien tenga un servidor, una pasarela, o un cortafuegos
con mucha carga, prefiera o necesite realizar algunos ajustes en los
par&aacute;metros predeterminados con el fin de obtener un rendimiento
&oacute;ptimo.  En la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a> 
se encuentran las opciones de configuraci&oacute;n existentes para el
n&uacute;cleo del sistema.  Estas opciones se deben escribir en el
fichero de configuraci&oacute;n del n&uacute;cleo antes de compilar un
n&uacute;cleo personalizado, y algunas opciones se pueden configurar
mediante el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>.
V&eacute;ase el <a href="faq5.html">cap&iacute;tulo 5</a> de estas
preguntas frecuentes para obtener m&aacute;s detalles sobre la
configuraci&oacute;n e instalaci&oacute;n del n&uacute;cleo del sistema.


<p>
<a name="Network"></a>
<a name="11.1"></a>
<h2>11.1 - Redes</h2>
<!-- XXXchanges - changes with OpenBSD 3.3 -->
<p>
Un par&aacute;metro que puede ser necesario cambiar para un servidor,
pasarela, o cortafuegos con mucha carga, es <tt>NMBCLUSTERS</tt>.  Esta
opci&oacute;n controla el tama&ntilde;o del mapa de asignaci&oacute;n de
grupos (<em>clusters</em>) del n&uacute;cleo, <em>mbuf</em>.  Si se
reciben mensajes en la m&aacute;quina del tipo &quot;mb_map full&quot;,
entonces es necesario incrementar el valor de este par&aacute;metro.  Si
en una interfaz de red el tr&aacute;fico se parara sin un motivo
aparente, podr&iacute;a ser una indicaci&oacute;n de que es necesario
incrementar el valor de <tt>NMBCLUSTERS</tt>.  Un valor razonable en la
plataforma i386 con la mayor&iacute;a de interfaces de ethernet de
100Mbps (no importa cu&aacute;ntas tenga la m&aacute;quina), es 8192.

<blockquote><strong>
option NMBCLUSTERS=8192
</strong></blockquote>

<p>
El n&uacute;mero de NMBCLUSTERS predeterminado var&iacute;a seg&uacute;n
la plataforma, y va desde 256 hasta 2048.  El valor de este
n&uacute;mero se determina en un fichero de cabecera dependiente de la
plataforma, a menos que se anule mediante una opci&oacute;n en el
fichero de configuraci&oacute;n del n&uacute;cleo.

<p>
NMBCLUSTERS tambi&eacute;n se puede modificar usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>,
lo que elimina la necesidad de tener que compilar un nuevo n&uacute;cleo
y basta con reiniciar para cambiar esta opci&oacute;n.

<blockquote><pre>
# <b>config -e -o bsd.new /bsd</b>
OpenBSD 3.3 (GENERIC) #44: Sat Mar 29 13:22:05 MST 2003
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
Enter 'help' for information
ukc&gt; <b>nmbclust</b>
nmbclusters = 2048
ukc&gt; <b>nmbclust 8192</b>
nmbclusters = 8192
ukc&gt; <b>quit</b>
Saving modified kernel.
</pre></blockquote>

<p>
Con esto se crea un nuevo n&uacute;cleo, <tt>bsd.new</tt>, en el
directorio apropiado, <i>y</i> se modifican los par&aacute;metros de
NMBCLUSTERS del n&uacute;cleo actual.  Si todo se ha realizado
correctamente, no hay que olvidarse de copiar <tt>bsd.new</tt> a
<tt>/bsd</tt> antes de reiniciar el sistema.


<p>
<a name="Disk"></a>
<a name="11.2"></a>
<h2>11.2 - E/S del disco</h2>

<p>
La velocidad de E/S del disco es un hecho significativo en la velocidad
total de la m&aacute;quina.  Su importancia es a&uacute;n mayor cuando
la m&aacute;quina en cuesti&oacute;n es la anfitriona en un entorno
multiusuario (usuarios de todas clases, desde los que ingresan de modo
interactivo hasta los que la usan como un servidor de ficheros, o un
servidor de <em>web</em>... ).  El almacenamiento de datos requiere
antenci&oacute;n constante, y en especial cuando las particiones se
quedan sin espacio o cuando los discos fallan.  OpenBSD dispone de
varias opciones para incrementar la velocidad de las operaciones del
disco y para proveer tolerancia ante los fallos.

<p>
&Iacute;ndice de contenidos
<ul>
<li><a href="#ccd">CCD</a> - Controlador de Discos Concatenados
<li><a href="#raid">RAID</a>
<li><a href="#buf">Memoria intermedia del sistema de archivos
(<em>filesystem buffer</em>)</a>
<li><a href="#softu">Soft Updates</a>
<li><a href="#maxvnodes">Tama&ntilde;o de cach&eacute; de
<em>namei()</em></a>
</ul>

<p>
<a name="ccd"></a>
<h3>11.2.1 - CCD</h3>

<blockquote>
La primera opci&oacute;n es usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccd&amp;sektion=4">ccd(4)</a>,
el &laquo;Controlador de Discos Concatenados&raquo; (<em>Concatenated
Disk Driver</em>).  Este controlador permitir&aacute; unir varias
particiones en un s&oacute;lo disco virtual (y por tanto, la posibilidad
de hacer que varios discos parezcan uno s&oacute;lo).  Este concepto es
similar al de LVM (&laquo;gesti&oacute;n l&oacute;gica de
volumen&raquo;), que se encuentra en muchos Unix comerciales.

<p>
Si se est&aacute; usando el n&uacute;cleo GENERIC, ccd ya se encuentra
activado de forma predeterminada (en
<tt>/usr/src/sys/conf/GENERIC</tt>).  Si se ha personalizado el
n&uacute;cleo del sistema, es probable que haya que volver a incluirlo
en la configuraci&oacute;n del n&uacute;cleo.  De cualquier modo, tiene
que existir una l&iacute;nea como la siguiente en el fichero de
configuraci&oacute;n del n&uacute;cleo:

<pre>
<strong>pseudo-device   ccd     4       # concatenated disk devices</strong>
</pre>

<p>
El ejemplo anterior vale para un m&aacute;ximo de 4 dispositivos ccd
(discos virtuales).  Ahora es necesario saber qu&eacute; particiones de
los discos reales se quiere dedicar para ccd.  Para marcar estas
particiones como tipo 'ccd' se debe usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&amp;sektion=5">disklabel(5)</a>.
En algunas arquitecturas es probable que disklabel no permita hacerlo.
En este caso hay que marcarlas como 'ffs'.

<p>
Si se usa ccd para desmontarlo y ganar as&iacute; rendimiento,
n&oacute;tese que no se obtendr&aacute; un rendimiento &oacute;ptimo a
menos que se use el mismo modelo de discos con las mismas
configuraciones de disklabel(5).

<p>
Hay que editar <em>/etc/ccd.conf</em> y modificarlo para que quede
parecido a lo siguiente (para m&aacute;s informaci&oacute;n sobre la
configuraci&oacute;n de ccd, v&eacute;ase
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccdconfig&amp;sektion=8">ccdconfig(8)</a>):

<blockquote><pre>
# Fichero de configuraci&oacute;n para dispositivos de discos
# concatenados
#
# ccd   ileave  flags   component devices
ccd0   16      none    /dev/sd2e /dev/sd3e
</pre></blockquote>

<p>
Para que los cambios surtan efecto hay que ejecutar lo siguiente:

<blockquote><pre>
# ccdconfig -C
</pre></blockquote>

<p>
Mientras <em>/etc/ccd.conf</em> exista, ccd se configurar&aacute; a
s&iacute; mismo de forma autom&aacute;tica durante el arranque.  Ahora
ya tenemos un nuevo disco, <em>ccd0</em>, una combinaci&oacute;n de
<em>/dev/sd2e</em> y <em>/dev/sd3e</em>.  A continuaci&oacute;n se
usar&aacute; disklabel sobre el nuevo disco como se har&iacute;a
normalmente para crear la partici&oacute;n o particiones que se quieran
utilizar.  No se debe usar la partici&oacute;n 'c' como si fuera una
partici&oacute;n normal.  Es necesario asegurarse de que las particiones
utilizables est&aacute;n, como m&iacute;nimo, un cilindro m&aacute;s
all&aacute; del comienzo del disco.
</blockquote>

<p>
<a name="raid"></a>
<h3>11.2.2 - RAID</h3>

<blockquote>
Otra soluci&oacute;n es
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raid&amp;sektion=4">
raid(4)</a>, para lo que habr&aacute; que utilizar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raidctl&amp;sektion=8">raidctl(8)</a>
para controlar los dispositivos de <em>raid</em>.  En OpenBSD, RAID
est&aacute; basado en el
<a href="http://www.cs.usask.ca/staff/oster/raid.html">porte de
NetBSD</a> de Greg Oster del software CMU 
<a href="http://www.pdl.cmu.edu/RAIDframe/">RAIDframe</a>.  OpenBSD
tiene soporte para los niveles 0, 1, 4 y 5 de RAID.

<p>
Con raid, como con ccd, el soporte debe residir en el n&uacute;cleo del
sistema.  A diferencia de ccd, el soporte para RAID no est&aacute;
activado en el n&uacute;cleo GENERIC, y se debe compilar con el
n&uacute;cleo (el soporte para RAID a&ntilde;ade unos 500Kb al
tama&ntilde;o de un n&uacute;cleo para i386).

<blockquote><pre>
<strong>pseudo-device   raid   4       # RAIDframe disk device</strong>
</pre></blockquote>

<p>
La configuraci&oacute;n de RAID en algunos sistemas operativos es,
cuanto menos, confusa y complicada.  No es lo mismo con RAIDframe.  La
informaci&oacute;n completa sobre esto se encuentra en las
p&aacute;ginas del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raid&amp;sektion=4">
raid(4)</a> y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raidctl&amp;sektion=8">raidctl(8)</a>.
Existen muchas opciones y posibles configuraciones disponibles, y una
explicaci&oacute;n detallada ir&iacute;a m&aacute;s all&aacute; del
objetivo de este documento.
</blockquote>

<p>
<a name="buf"></a>
<h3>11.2.3 - Memoria intermedia del sistema de archivos
(<em>filesystem buffer)</em></h3>

<blockquote>
En servidores de archivos con memoria de sobra se puede incrementar
<tt>BUFCACHEPERCENT</tt>.  O sea, determinar qu&eacute; porcentaje de la
memoria de acceso aleatoria (RAM) deber&iacute;a usarse como sistema de
archivos de memoria intermedia.  Esta opci&oacute;n puede cambiar cuando
el &laquo;cach&eacute; de memoria intermedia unificado&raquo;
(<em>Unified Buffer Cache</em>) se haya completado y forme parte de
OpenBSD.  Mientras tanto, para incrementar <tt>BUFCACHEPERCENT</tt> es
necesario a&ntilde;adir una l&iacute;nea como la siguiente a la
configuraci&oacute;n del n&uacute;cleo:
</blockquote>

<blockquote>
<strong>option	BUFCACHEPERCENT=30</strong><br>
</blockquote>

<blockquote>
Se puede hacer que sea un porcentaje tan bajo como el 5%
(predeterminado), o tan alto como el 50% (o m&aacute;s si fuera
necesario).
</blockquote>

<blockquote>
BUFCACHEPERCENT tambi&eacute;n se puede modificar usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>,
tal y como se explica en la <a href="#Network">secci&oacute;n sobre
``Redes''</a>, lo que elimina la necesidad de tener compilar un
n&uacute;cleo s&oacute;lo para cambiar esta opci&oacute;n.
</blockquote>

<p>
<a name="softu"></a>
<h3>11.2.4 - Soft Updates</h3>

<blockquote>
Otra herramienta que se puede usar para aumentar la velocidad del
sistema es <em>softupdates</em>.  Una de las operaciones m&aacute;s
lentas en el sistema de archivos tradicional de BSD es la
actualizaci&oacute;n de la metainformaci&oacute;n (que ocurre, entre
otras, cuando se crean o generan ficheros y directorios).
<em>Softupdates</em> intenta actualizar la metainformaci&oacute;n en la
memoria de acceso, RAM, en lugar de escribir al disco duro cada vez que
se actualiza la metainformaci&oacute;n.  Otro efecto de esto es que la
metainformaci&oacute;n en el disco deber&iacute;a estar siempre
completa, aunque no siempre actualizada.  Por lo tanto, tras un
ca&iacute;da del sistema no deber&iacute;a ser necesaria la
comprobaci&oacute;n y reparaci&oacute;n de la consistencia de los
sistemas de archivos con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fsck&amp;sektion=8">
fsck(8)</a> durante el arranque, sino simplemente la ejecuci&oacute;n de
una versi&oacute;n de fondo de fsck(8) que realice cambios de la
metainformaci&oacute;n en la RAM (como <em>softupdates</em>).  Esto
implica que reiniciar un servidor ser&aacute; mucho m&aacute;s
r&aacute;pido, ya que no ser&aacute; necesario esperar a que termine
fsck(8) (OpenBSD todav&iacute;a no dispone de esta funcionalidad).  Hay
m&aacute;s informaci&oacute;n al respecto en la secci&oacute;n del
cap&iacute;tulo 14 que trata sobre
<a href="faq14.html#SoftUpdates">SoftUpdates</a>.
</blockquote>

<p>
<a name="maxvnodes"></a>
<h3>11.2.5 - Tama&ntilde;o del cach&eacute; de namei()</h3>

<dl>
<dd>
Nota: hace tiempo, la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a>
recomendaba que se activara la opci&oacute;n <code>NVNODE=integer</code>
del n&uacute;cleo.  Esto ya no es necesario y en su lugar se debe
utilizar la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8">sysctl(8)</a>.

<p>
El cach&eacute; de traducci&oacute;n de nombre a nodo-i (tambi&eacute;n
conocido como <em>namei(3)</em>) controla la velocidad de la
traducci&oacute;n del nombre de la ruta (<em>pathname</em>) a
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=inode&amp;sektion=5">inode(5)</a>.
Esta memoria de cach&eacute; tiene predeterminadas un n&uacute;mero de
entradas de <tt>NPROC * (80 + NPROC / 8)</tt>.  <tt>NPROC</tt>
est&aacute; configurado para <tt>20 + 16 * MAXUSERS</tt>; en la
p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>
puede verse una explicaci&oacute;n del par&aacute;metro de
configuraci&oacute;n del n&uacute;cleo <tt>maxusers</tt>.  Un modo
razonable para la obtenci&oacute;n de un valor derivado para el
cach&eacute;, en el caso en que un gran n&uacute;mero de fallos de
cach&eacute; <em>namei()</em> fueran detectados con una herramienta como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=systat&amp;sektion=1">systat(1)</a>,
ser&iacute;a examinar el valor actual computado por el sistema con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8">sysctl(8)</a>
(que llama a este par&aacute;metro <tt>kern.maxvnodes</tt>), e
incrementar este valor hasta que el n&uacute;mero de aciertos del
cach&eacute; <em>namei()</em> mejore;  o hasta que se determine que el
sistema no obtiene un beneficio substancial de un incremento en el
tama&ntilde;o del cach&eacute; <em>namei()</em>.  Despu&eacute;s de que
el valor haya sido determinado, se puede fijar como valor predeterminado
en el inicio del sistema con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl.conf&amp;sektion=5">sysctl.conf(5)</a>.
</dd>
</dl>


<!-- p>
<a name="kmem"></a>
<a name="11.3"></a>
<h2>11.3 - C&oacute;mo mejorar kmem</h2>

<p>
Esta secci&oacute;n se ha traspasado a la 
<a href="faq11-2.5.html#11.2">secci&oacute;n de
informaci&oacute;n de OpenBSD 2.5</a>
 -->

<p>
<a name="HW"></a>
<a name="11.4"></a>
<h2>11.4 - Elecci&oacute;n del <em>hardware</em></h2>
<!-- XXXchanges - check every OpenBSD release -->
<p>
<em>(Nota: esta secci&oacute;n se centra fuertemente en la arquitectura
de i386.  Esto quiere decir que... otras arquitecturas no ofrecen tantas
posibilidades de elecci&oacute;n)</em>

<p>
El rendimiento de las aplicaciones depende en gran medida del sistema
operativo y de las facilidades que &eacute;ste ofrezca.  &Eacute;sta
puede ser, en parte, la raz&oacute;n por la que alguien est&eacute;
usando OpenBSD.  El rendimiento de las aplicaciones también depende
mucho del equipo sobre el que se utilicen.  Para muchos usuarios, el
ratio precio/rendimiento de un PC nuevo con un procesador Intel Pentium
IV o AMD Athlon, es m&aacute;s importante que el ratio
precio/rendimiento de una estaci&oacute;n Sun UltraSparc 60.  Aunque
queda claro que el precio de OpenBSD no tiene competidor.

<p>
Si se est&aacute; pensando en comprar un nuevo PC, tanto si se va a
comprar por piezas o montado al completo, antes hay que asegurarse de
que las partes que se vayan a comprar sean fiables.  En el mundo del PC
esto no es f&aacute;cil.  <b>Componentes en mal estado o de escasa
fiabilidad pueden hacer que OpenBSD funcione mal o sufra frecuentes
ca&iacute;das</b>.  El mejor consejo que podemos ofrecer es que se tenga
cuidado, que se compren marcas y componentes que hayan sido revisados
por una autoridad que sea de confianza.  A veces, un ahorro en el precio
de un PC puede significar una p&eacute;rdida en calidad.

<p>
Hay algunas cosas que ayudar&aacute;n a obtener el rendimiento
m&aacute;ximo para un equipo:

<ul>
<li><b>Uso de discos m&uacute;ltiples.</b>
En lugar de comprar un disco de gran capacidad, es conveniente comprar
varios discos de menos capacidad.  Aunque sea m&aacute;s caro, la
distribuci&oacute;n de la carga sobre varios ejes disminuir&aacute; el
tiempo que se necesita para acceder a los datos en los discos.
Adem&aacute;s, con m&aacute;s ejes se obtendr&aacute; m&aacute;s
fiabilidad y un acceso m&aacute;s veloz a los datos con RAID.

<li><b>Uso preferible de SCSI para grandes velocidades de E/S en el
disco.</b>
Los discos IDE suelen funcionar entre 5400 RPM y 7200 RPM.  Si se usan
discos IDE de alto rendimiento, no es razonable esperar un caudal<!--
throughput --> de entre 15 y 20 megabytes por segundo desde un solo
disco.  Si se usan discos SCSI de alto rendimiento (discos de 10k RPM de
alto coste), se puede obtener rendimientos m&aacute;s altos.  Sin
embargo, si se va a usar discos SCSI de bajo o medio rendimiento, se
estar&aacute; malgastando el dinero ya que IDE puede servir igual o
incluso mejor.

<p>
Si se est&aacute; montando un servidor y se necesita m&aacute;s de un
disco, hay que tener en cuenta los discos SCSI.  IDE se limita a dos
discos por controladora, y el acceso concurrente a estos dos discos
puede tener un impacto negativo sobre los resultados de E/S de los
mismos.  El l&iacute;mite de Wide SCSI es de 15 por controladora, y
tiene mejor soporte que IDE para el acceso concurrente.  Aunque SCSI sea
m&aacute;s caro, la flexibilidad y el rendimiento justifican estos
costes en algunos entornos.

<li><b>Uso de SDRAM en lugar de DRAM.</b>
Esta opci&oacute;n es v&aacute;lida principalmente para PC.  La
mayor&iacute;a de las otras arquitecturas no ofrecen una elecci&oacute;n
en el tipo de RAM que pueden utilizarse.  Varios PC todav&iacute;a lo
hacen.  Se obtendr&aacute; un rendimiento mejor con SDRAM que con DRAM
(SIMMs).  Si el sistema tiene soporte para RDRAM o alg&uacute;n otro
tipo nuevo de RAM, entonces nos encontraremos un paso por delante...

<li><b>Uso de ECC o RAM de paridad.</b>
La paridad a&ntilde;ade algo de funcionalidad para ver si los datos en
RAM se han corrompido.  ECC extiende esta funcionalidad e intenta
corregir algunos errores de corrupci&oacute;n de bits al vuelo.  Esta
opci&oacute;n s&oacute;lo es aplicable a los PC.  Algunas
m&aacute;quinas no PC ni siquiera arrancar&aacute;n con RAM sin paridad.
Si no se usa RAM ECC/paridad, se puede provocar corrupci&oacute;n en los
datos y otras anomal&iacute;as.  Varios fabricantes de &laquo;RAM barata
para PC&raquo; ni siquiera producen la variedad ECC.  &iexcl;Esto
ayudar&aacute; a evitarlos!  Los fabricante de PC suelen vender otras
l&iacute;neas de productos, divididas entre &laquo;servidores&raquo; y
&laquo;estaciones de trabajo&raquo;.  Los servidores incorporan RAM ECC
en su arquitectura.  Los fabricantes de estaciones de trabajo Unix ha
usado paridad (y ahora ECC) durante varios a&ntilde;os en todas sus
l&iacute;neas de productos.

<li><b>Evitar los dispositivos ISA.</b>
Aunque la mayor&iacute;a suele evitarlos debido a que son
dif&iacute;ciles de configurar y obsoletos, todav&iacute;a existen
muchos.  Si se est&aacute; usando el bus ISA para los controladores del
disco o de la red (o peor a&uacute;n, para ambos), hay que tener
presente que el bus ISA puede ser un embudo para el rendimiento.  Si se
necesita velocidad se debe considerar el uso de PCI.  Todav&iacute;a
existen algunas tarjetas de bus ISA que funcionan bien, pero la
mayor&iacute;a son tarjetas de sonido y tarjetas de puerto serie.

<li><b>Evitar adaptadoras de red PCI baratas.</b>
OpenBSD tiene soporte para una gran cantidad de adaptadoras de red PCI
de bajo precio.  Estas adaptadoras funcionan muy bien en sistemas
caseros, y tambi&eacute;n en empresas y entornos de investigaci&oacute;n
medianos y peque&ntilde;os.  Pero si se necesita un alto rendimiento y
un bajo impacto en el servidor, es mejor comprar una adaptadora de red
PCI de calidad.  Por desgracia, algunas marcas caras de adaptadoras
(como las series XL de 3com) no son mucho mejor que las adaptadoras
baratas.  Una de las adaptadoras favoritas de 10/100Mbps es la Intel
EtherExpress PRO/100.
</ul>


<p>
<a name="Async"></a>
<a name="11.5"></a>
<h2>11.5 - &iquest;Por qu&eacute; no se usan montajes
asincr&oacute;nicos?</h2>

<p>
Pregunta: &laquo;Yo simplemente ejecuto 'mount -u -o async /', lo que me
permite utilizar cierto paquete.<br>
&iquest;Por qu&eacute; el montaje asincr&oacute;nico no se usa por
definici&oacute;n (como en otros Unix)?  &iquest;No es un modo mucho
m&aacute;s simple, y por lo tanto m&aacute;s seguro, que mejorar el
rendimiento de algunas aplicaciones?&raquo;

<p>
Respuesta: &laquo;Los montajes asincr&oacute;nicos son m&aacute;s
r&aacute;pidos que los montajes sincr&oacute;nicos, pero tambi&eacute;n
son menos seguros.  &iquest;Qu&eacute; suceder&iacute;a si hubiera un
fallo el&eacute;ctrico?  &iquest;O un problema de <em>hardware</em>?  La
consecuci&oacute;n de la velocidad no debe implicar el sacrificio de la
fiabilidad y estabilidad del sistema.  M&aacute;s informaci&oacute;n en
la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount&amp;sektion=8">mount(8)</a>.&raquo;

<pre>
	 async   Toda E/S al sistema de archivos deber&iacute;a llevarse
		 a cabo de forma asincr&oacute;nica.  &Eacute;ste es un
		 indicador peligroso de activar, ya que no garantiza que
		 mantendr&aacute; una estructura consistente en el disco
		 del sistema de archivos.  No se debe usar este
		 indicador a menos que se est&eacute; preparado para
		 recrear el sistema de archivos si hubiera una
		 ca&iacute;da del sistema.  El uso m&aacute;s
		 com&uacute;n de este indicador es el de acelerar
		 restore(8), en donde se puede dar un factor de
		 incremento de doble velocidad.
</pre>

<p>
Por otra parte, si se estuviera tratando con datos temporales que se
pudieran recrear desde cero despu&eacute;s de una ca&iacute;da del
sistema, se podr&iacute;a ganar en velocidad usando una partici&oacute;n
separada s&oacute;lo para esos datos, montada en modo
asincr&oacute;nico.  <em>Esto s&oacute;lo debe hacerse si no importa
perder todos los datos en la partici&oacute;n cuando algo vaya mal</em>.
Las particiones de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mfs&amp;sektion=8">
mfs(8)</a> se montan en modo asincr&oacute;nico, ya que se eliminan y se
vuelven a generear durante cada vez que se reinicia.


<p>
<a name="XF86"></a>
<a name="11.6"></a>
<h2>11.6 - Ajuste de la resoluci&oacute;n del monitor para XFree86</h2>

<p>
Con monitores multi-sync se puede conseguir que un servidor de X
funcione con una resoluci&oacute;n aceptable.  Si alguien ha intentado
ajustar la frecuencia con las utilidades xf86config o XF86Setup, es
probable que no habr&aacute; podido obtener resultados &oacute;ptimos.
Uno de los aspectos m&aacute;s dif&iacute;ciles es, precisamente, el de
lograr que el monitor funcione con la resoluci&oacute;n deseada y
conseguir que la frecuencia de barrido vertical se configure como
m&iacute;nimo a 72-75Hz;  una frecuencia en la que la pantalla parpadea
es mucho menos visible para los humanos.  Y al contrario,
&iquest;qu&eacute; ocurrir&iacute;a si se intentara ajustar con una
frecuencia de barrido vertical muy baja?  Se puede fijar a 50Hz para que
pueda ser capturada en el v&iacute;deo sin que parpadee, pero los
m&eacute;todos para conseguirlo no est&aacute;n muy claros con las
herramientas y la documentaci&oacute;n incluidas en XFree86.

<p>
Con las resoluciones que utilizan muchos usuarios con monitores VGA de
bajo precio (800x600, 1024x768, 1152x900, 1280x1024) es posible (por lo
menos en monitores m&aacute;s nuevos) usar frecuencias de barrido
vertical de 85Hz y superiores, y lograr as&iacute; una imagen
extremadamente pulida y clara.  El servidor de X de XFree86 dispone de
un mecanismo que permite describir en detalle el modo de v&iacute;deo
deseado, y &eacute;ste es el <em>ModeLine</em>.  Un ModeLine tiene
cuatro secciones:  un n&uacute;mero de una sola cifra para el reloj de
pixelaci&oacute;n (<em>pixel clock</em>), de cuatro cifras para los
tiempos de refresco horizontales (<em>horizontal timings</em>), de
cuatro cifras para los tiempos de refresco verticales (<em>vertical
timings</em>), y una secci&oacute;n opcional con una lista de
indicadores que especifican otras caracter&iacute;sticas del modo (como
<em>Interlace</em>, <em>DoubleScan</em>, y muchas otras que se pueden
ver en detalle en la p&aacute;gina del manual de XF86Config(5)).

<p>
Generar un <em>ModeLine</em> es cosa de magia negra... pero por suerte
existen unos guiones de ejecuci&oacute;n (<em>scripts</em>) que generan
este proceso.  Uno de ellos es
<a href="http://www-sop.inria.fr/cgi-bin/koala/nph-colas-modelines">
Colas XFree86 ModeLine Generator</a>.  El otro es
<a href="http://xtiming.sourceforge.net/">The XFree86 Modeline
Generator</a>, hospedado en SourceForge.  Hay otros disponibles en
<a href="http://freshmeat.net/search/?q=modeline">Freshmeat</a>.  Antes
de poder usar estos generadores de <em>ModeLine</em>, es preciso conocer
los l&iacute;mites de sincronizaci&oacute;n horizontal y vertical del
monitor.  Esta informaci&oacute;n suele aparecer en el manual del
monitor, o en su defecto en las p&aacute;ginas del fabricante en
Internet.  Si no se encuentra en ninguno de estos dos sitios, algunas
personas han recopilado listas con la informaci&oacute;n sobre varios
monitores que se pueden encontrar en Internet.

<p>
Pongamos como ejemplo un monitor Dell D1226H.  Despu&eacute;s de un
intensa b&uacute;squeda en las p&aacute;ginas de Dell, descubrimos que
la frecuencia de barrido horizontal est&aacute; entre 30-50KHz, y la
vertical entre 50-160Hz.  A continuaci&oacute;n ir&eacute;mos a la
<a href="http://www-sop.inria.fr/cgi-bin/koala/nph-colas-modelines">
p&aacute;gina del generador ModeLine</a> e introducir&eacute;mos esta
informaci&oacute;n.  Acto seguido tendremos que especificar la
frecuencia de barrido vertical m&iacute;nima que deseamos.  Cualquier
frecuencia por encima de 72Hz producir&aacute; un leve parpadeo.
Seg&uacute;n se vaya incrementando la frecuencia, la imagen en pantalla
ir&aacute; apareciendo m&aacute;s clara.

<p>
Con toda esta informaci&oacute;n, el gui&oacute;n de ejecuci&oacute;n
generar&aacute; un ModeLine para cada una de las resoluciones 4x3
factibles que pueda soportar el monitor, por encima de la frecuencia de
barrido vertical m&iacute;nima que hayamos introducido.  Si alguien
introdujera las especificaciones anteriores para Dell y una frecuencia
de barrido vertical m&iacute;nima de 75Hz, el gui&oacute;n le
mostrar&iacute;a algo como esto:

<pre>
ModeLine &quot;320x240&quot; 20.07 320 336 416 448 240 242 254 280 #160Hz
ModeLine &quot;328x246&quot; 20.86 328 344 424 456 246 248 260 286 #160Hz
...
ModeLine &quot;816x612&quot; 107.39 816 856 1056 1136 612 614 626 652 #145Hz
ModeLine &quot;824x618&quot; 108.39 824 864 1064 1144 618 620 632 658 #144Hz
ModeLine &quot;832x624&quot; 109.38 832 872 1072 1152 624 626 638 664 #143Hz
...
ModeLine &quot;840x630&quot; 109.58 840 880 1080 1160 630 632 644 670 #141Hz
ModeLine &quot;848x636&quot; 110.54 848 888 1088 1168 636 638 650 676 #140Hz
...
ModeLine &quot;1048x786&quot; 136.02 1048 1096 1336 1432 786 788 800 826 #115Hz
ModeLine &quot;1056x792&quot; 136.58 1056 1104 1344 1440 792 794 806 832 #114Hz
ModeLine &quot;1064x798&quot; 137.11 1064 1112 1352 1448 798 800 812 838 #113Hz
...
ModeLine &quot;1432x1074&quot; 184.07 1432 1496 1816 1944 1074 1076 1088 1114 #85Hz
ModeLine &quot;1576x1182&quot; 199.86 1576 1648 2008 2152 1182 1184 1196 1222 #76Hz
ModeLine &quot;1584x1188&quot; 198.93 1584 1656 2016 2160 1188 1190 1202 1228 #75Hz
</pre>

<p>
Ahora bien, las especificaciones de este monitor dicen que soporta
1600x1200 @ 75Hz, pero el gui&oacute;n de ejecuci&oacute;n no nos da esa
resoluci&oacute;n dentro de los 75Hz.  As&iacute; pues, si de verdad se
desea una resoluci&oacute;n exacta de 1600x1200, habr&aacute; que
disminuir un poco la frecuencia de barrido vertical m&iacute;nima... (en
el ejemplo la bajaremos a 70Hz):

<pre>
ModeLine &quot;1592x1194&quot; 197.97 1592 1664 2024 2168 1194 1196 1208 1234 #74Hz
ModeLine &quot;1600x1200&quot; 199.67 1600 1672 2032 2176 1200 1202 1214 1240 #74Hz
ModeLine &quot;1608x1206&quot; 198.65 1608 1680 2040 2184 1206 1208 1220 1246 #73Hz
ModeLine &quot;1616x1212&quot; 197.59 1616 1688 2048 2192 1212 1214 1226 1252 #72Hz
ModeLine &quot;1624x1218&quot; 199.26 1624 1696 2056 2200 1218 1220 1232 1258 #72Hz
ModeLine &quot;1632x1224&quot; 198.15 1632 1704 2064 2208 1224 1226 1238 1264 #71Hz
ModeLine &quot;1640x1230&quot; 199.81 1640 1712 2072 2216 1230 1232 1244 1270 #71Hz
ModeLine &quot;1648x1236&quot; 198.64 1648 1720 2080 2224 1236 1238 1250 1276 #70Hz
</pre>

<p>
Aqu&iacute; se puede ver que el monitor puede soportar 1600x1200 @ 74Hz
cuando el ancho de banda (<em>dot clock</em>) se limita a 200MHz.  El
ancho de banda lo configuraremos de acuerdo con los l&iacute;mites
definidos por el monitor.

<p>
Una vez que ya tengamos los ModeLines, los incluiremos en el fichero
<em>/etc/XF86Config</em>, comentando los viejos ModeLines para que
podamos usarlos de nuevo si los nuevos no llegaran a funcionar.  A
continuaci&oacute;n escogeremos la resoluci&oacute;n a la que queremos
que funcione.  Primero averiguaremos si X est&aacute; en modo acelerado
(suele estarlo con la mayor&iacute;a de tarjetas de v&iacute;deo), para
saber cu&aacute;l de las secciones <tt>&quot;Screen&quot;</tt> de
XF86Config debemos modificar.  O, simplemente, modificaremos todas las
secciones <tt>&quot;Screen&quot;</tt>.

<pre>
Section &quot;Screen&quot;
   Driver          &quot;Accel&quot;
   Device          &quot;Primary Card&quot;
   Monitor         &quot;Primary Monitor&quot;
   DefaultColorDepth 32
   SubSection &quot;Display&quot;
      Depth        32
      Modes        &quot;1280x1024&quot; &quot;1024x768&quot;
   EndSubSection
</pre>

<p>
La primera resoluci&oacute;n que se ver&aacute; a continuaci&oacute;n de
la l&iacute;nea &quot;Modes&quot; ser&aacute; la resoluci&oacute;n con
la que se iniciar&aacute; X.  Se puede pasar desde una hasta otra de las
resoluciones que est&eacute;n en esta lista desde X pulsando
CTRL-ALT-<strong>&lt;-&gt;</strong> o
CTRL-ALT-<strong>&lt;+&gt;</strong>.  De acuerdo con la secci&oacute;n
anterior, X intentar&aacute; iniciar en modo de color de 32 bits (a
trav&eacute;s de la directiva DefaultColorDepth, sin la cual
iniciar&iacute;a en modo de color de 8 bits).  La primera
resoluci&oacute;n que intentar&aacute; usar ser&aacute; 1280x1024
(siguiendo el orden de la l&iacute;nea &quot;Modes&quot;).
N&oacute;tese que &quot;1280x1024&quot; s&oacute;lo es una
clasificaci&oacute;n para los valores en ModeLine.

<p>
N&oacute;tese asimismo que el gui&oacute;n generador de ModeLine dispone
de opciones para relajar sus tiempos en los monitores m&aacute;s viejos
o m&aacute;s peque&ntilde;os, y que tambi&eacute;n tiene la capacidad de
proveer ModeLines para resoluciones espec&iactue;ficas.  Dependiendo del
tipo de <em>hardware</em> del que se disponga, es posible que no resulte
f&aacute;cil usarlo con las opciones predefinidas.  Si la imagen es
demasiado alta, demasiado ancha, o demasiado peque&ntilde;a, o si
est&aacute; corrida horizontal o verticalmente, y si los controles del
monitor no bastan para corregirlo, se puede usar xvidtune(1) para
ajustar el ModeLine y sincronizarlo mejor con los tiempos del monitor.

<p>
En la mayor&iacute;a de los monitores modernos no existe un
l&iacute;mite fijo para el ancho de banda, por lo que no aparecen en la
lista de especificaciones.  Lo que ocurre es que cuanto m&aacute;s se
incrementa el ancho de banda, m&aacute;s borrosa aparece la imagen en
pantalla.  En este caso se puede a&ntilde;adir el ancho de banda de la
tarjeta de v&iacute;deo (tambi&eacute;n llamado <em>dotclock</em>) para
hacer comprobaciones sin peligro de da&ntilde;ar el monitor, y disminuir
de forma progresiva el ancho de banda con el fin de obtener una imagen
n&iacute;tida.

<p>
Si todo esto parece complicado e innecesario, es porque en realidad lo
es.  XFree86 4.0 aborda este problema y hace que este proceso sea mucho
m&aacute;s f&aacute;cil, ya que tiene varios modos integrados y es capaz
de leer las capacidades de monitores <em>plug and play</em> a
trav&eacute;s DDC y DDC2.

<p>
El gui&oacute;n de ejecuci&oacute;n <em>Colas XFree86 ModeLine
Generator</em> se puede obtener desde
<a href="http://koala.ilog.fr/ftp/pub/Klone/">
http://koala.ilog.fr/ftp/pub/Klone/</a>.  Tambi&eacute;n es necesario
bajarse el int&eacute;rprete Klone y compilarlo.  Est&aacute; en el
directorio de portes como <em>lang/klone</em>.  Los guiones de
ejecuci&oacute;n se encuentran en el subdirectorio <em>scripts/</em> de
la distribuci&oacute;n de Klone (el porte los instala en
<em>/usr/local/lib/klone/scripts</em>).

<p>
Existen dos versiones, una de ellas en versi&oacute;n CGI
id&eacute;ntica a la p&aacute;gina <em>web</em> de arriba, y la segunda
en una versi&oacute;n no-CGI que usar&aacute; el fichero completo de
<em>XF86Config</em>, descodificar&aacute; las especificaciones que se
hayan introducido en xf86config o XF86Setup para el monitor
(pi&eacute;nselo antes, &iquest;introdujo las especificaciones del
monitor, o simplemente escogi&oacute; las gen&eacute;ricas?), y
configurar&aacute; los ModeLines existentes de acuerdo con &eacute;stas.

<p>
<font color="#0000e0">
<a href= "index.html">[&Iacute;ndice de documentos]</a>
<a href="faq10.html">[Secci&oacute;n 10 - Administraci&oacute;n del sistema]</a>
<a href="faq12.html">[Secci&oacute;n 12 - Para usuarios avanzados]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq11.html,v 1.40 2003/05/01 01:47:41 nick Exp ]<br>
$Translation: faq11.html,v 1.32 2003/05/01 18:42:42 horacio Exp $<br>
$OpenBSD: faq11.html,v 1.31 2003/05/01 20:47:29 jufi Exp $
</small>
</body>
</html>
