<html>
<head>
<title>11.0 - Afinar el Rendimiento</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2000 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">11.0 - Afinar el Rendimiento</font><hr></h2>
</p>

<p>
<ul><h3>Tabla de Contenidos</h3>
<li><a href="#11.1">11.1 - Redes</a></li>
<li><a href="#11.2">11.2 - E/S del disco</a></li>
<li><a href="#11.3">11.3 - Afinar kmem</a></li>
<li><a href="#11.4">11.4 - Elecci&oacute;n del <i>hardware</i></a></li>
<li><a href="#11.5">11.5 - &iquest;Por qu&eacute; no usamos montajes
    asincr&oacute;nicos?</a></li>
<li><a href="#11.6">11.6 - Ajustar la resoluci&oacute;n del monitor
    para XFree86</a></li>
</ul>
</p> 
<hr>

<p>
<a name="11.1"></a>
<h2>11.1 - Redes</h2>
</p>

<p>
Si tiene Vd. un servidor, una pasarela, o un cortafuegos muy ocupado,
deber&iacute;a asegurarse de prevenir la falta de memoria en varias
partes del n&uacute;cleo del sistema, descritas m&aacute;s abajo.
</p>

<p>
La p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&apropos=0&sektion=4&format=html">options(4)</a>
trata sobre las opciones que aqu&iacute; se comentan.
<p>

<p>
Una opci&oacute;n que puede necesitar cambiar para un servidor,
pasarela, o cortafuegos muy ocupado es NMBCLUSTERS.  Esta opci&oacute;n
controla el tama&ntilde;o del mapa de clusters mbuf del n&uacute;cleo.
Si recibe en su m&aacute;quina mensajes como &quot;mb_map full&quot;,
necesita incrementar este valor.  Si en una interfaz de red el
tr&aacute;fico se para sin un motivo aparente, puede ser tambi&eacute;n
un signo de que necesita incrementar este valor.  Un valor razonable en
el porte para i386 con la mayor&iacute;a de interfaces de ethernet de
100Mbps (no importa cu&aacute;ntas tenga la m&aacute;quina) es 8192.
</p>

<ul>
<strong>
option NMBCLUSTERS=8192
</strong>
</ul>

<p>
<a name="11.2"></a>
<h2>11.2 - E/S del disco</h2>
</p>

<p>
La velocidad de E/S del disco es un hecho significativo en la velocidad
total de su m&aacute;quina.  Se vuelve cada vez m&aacute;s importante
cuando su m&aacute;quina es la anfitriona en un entorno multiusuario
(usuarios de todas clases, desde los que ingresan de modo interactivo
hasta los que la usan como un servidor de ficheros, o un servidor de
web... ).  El almacenamiento de datos requiere antenci&oacute;n
constante, especialmente cuando sus particiones se quedan sin espacio y
cuando sus discos fallan.  OpenBSD tiene varias opciones para
incrementar la velocidad de las operaciones de su disco y para proveer
tolerancia a los fallos.
</p>

<ul>Tabla de contenidos
   <li><a href="#ccd">CCD</a> - Controlador de Disco Concatenado
   <li><a href="#raid">RAID</a>
   <li><a href="#buf">Filesystem Buffer</a>
   <li><a href="#softu">Soft Updates</a>
</ul>

<p>
<a name="ccd"></a>
<h3>11.2.1 - CCD</h3><ul>

<ul>
<p>
La primera opci&oacute;n es usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccd&apropos=0&sektion=4&format=html">ccd(4)</a>,
el &laquo;Controlador de Disco Concatenado&raquo;
(<i>&quot;Concatenated Disk Driver&quot;</i>).  &Eacute;ste le
permitir&aacute; unir varias particiones en un s&oacute;lo disco
virtual (y por tanto, podr&aacute; hacer que varios discos parezcan uno
s&oacute;lo).  Este concepto es similar al de LVM
(&laquo;gesti&oacute;n l&oacute;gica de volumen&raquo;), que se
encuentra en muchos Unix comerciales.

<p>
Si est&aacute; funcionando con el n&uacute;cleo GENERIC, ccd ya
est&aacute; activado.  De lo contrario, es posible que necesite
a&ntilde;adirlo a la configuraci&oacute;n de su n&uacute;cleo.  Para
iniciar la configuraci&oacute;n de ccd, necesita primero a&ntilde;adir
el soporte en su n&uacute;cleo, con una l&iacute;nea como la siguiente:
</p>

<p>
<ul>
<pre>
<strong>pseudo-device   ccd     4       # concatenated disk devices</strong>
</pre>
</ul>
</p>

<p>
El ejemplo anterior le da hasta 4 dispositivos ccd (discos virtuales).
Ahora necesita saber qu&eacute; particiones de sus discos reales quiere
dedicar a ccd.
Use <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&apropos=0&sektion=0&manpath=OpenBSD+Current&format=html">disklabel(5)</a>
para marcar estas particiones como tipo 'ccd'.  En algunas
arquitecturas, puede ser que disklabel no le permita hacerlo.  En este
caso m&aacute;rquelas como 'ffs'.

<p>
Si usa ccd para desmontarlo y ganar as&iacute; rendimiento, note que no
obtendr&aacute; un rendimiento &oacute;ptimo a menos que use el mismo
modelo de discos con las mismas configuraciones de disklabel.

<p>
Edite /etc/ccd.conf y modif&iacute;quelo para que quede parecido a esto
(para m&aacute;s informaci&oacute;n sobre la configuraci&oacute;n de
ccd, mirar en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccdconfig&apropos=0&sektion=8&format=html">ccdconfig(8)</a>):

<ul>
<pre>
# Configuration file for concatenated disk devices
#
# ccd   ileave  flags   component devices
ccd0   16      none    /dev/sd2e /dev/sd3e
</pre>
</ul>

Para que sus cambios hagan efecto, ejecute:

<ul>
<pre>
# ccdconfig -C
</pre>
</ul>

Mientras /etc/ccd.conf exista, ccd se configurar&aacute; a s&iacute;
mismo autom&aacute;ticamente durante el arranque.  Ahora ya tiene un
nuevo disco, ccd0, una combinaci&oacute;n de /dev/sd2e y /dev/sd3e.
Use disklabel sobre el nuevo disco como lo har&iacute;a normalmente
para crear la partici&oacute;n o particiones que quiera usar.  No use
la partici&oacute;n 'c' como si fuera una partici&oacute;n normal.
Aseg&uacute;rese de que sus particiones utilizables est&aacute;n, como
m&iacute;nimo, un cilindro m&aacute;s all&aacute; del comienzo del
disco.
</p>
</ul>
<br>

<a name="raid"></a>
<h3>11.2.2 - RAID</h3>

<ul>
<p>
Otra soluci&oacute;n es
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raid&apropos=0&sektion=4&format=html">raid(4)</a>,
que le har&aacute; usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raidctl&apropos=0&sektion=8&format=html">raidctl(8)</a>
para controlar sus dispositivos de raid.  En OpenBSD RAID est&aacute;
basado en el
<a href="http://www.cs.usask.ca/staff/oster/raid.html">porte de NetBSD</a>
de Greg Oster del software CMU 
<a href="http://www.pdl.cs.cmu.edu/RAIDframe/">RAIDframe</a>.
OpenBSD tiene soporte para los niveles 0, 1, 4 y 5 de RAID.

<p>
Con raid, como con ccd, el soporte debe residir en el n&uacute;cleo del
sistema.  A diferencia de ccd, el soporte para RAID no est&aacute;
activado en el n&uacute;cleo GENERIC, y debe ser compilado en el
n&uacute;cleo (&iexcl;el soporte para RAID a&ntilde;ade unos 500Kb al
tama&ntilde;o de un n&uacute;cleo para i386!).
</p>

<p>
<ul>
<pre>
<strong>pseudo-device   raid   4       # RAIDframe disk device</strong>
</pre>
</ul>

<p>
La configuraci&oacute;n de RAID en algunos sistemas operativos es,
cuanto menos, confusa y complicada.  No es lo mismo con RAIDframe.  Lea
las p&aacute;ginas de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raid&apropos=0&sektion=4&format=html">raid(4)</a> y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raidctl&apropos=0&sektion=8&format=html">raidctl(8)</a>
para conocer los detalles completos.  Existen muchas opciones y
posibles configuraciones, una explicaci&oacute;n en detalle ir&iacute;a
m&aacute;s all&aacute; del objetivo de este documento.
</ul>
<br>

<a name="buf"></a>
<h3>11.2.3 - Filesystem buffer</h3>

<ul>
Los servidores de archivos con memoria de sobra, puede incrementar
BUFCACHEPERCENT.  O sea, qu&eacute; porcentaje de su RAM deber&iacute;a
usar como fichero de memoria intermedia del sistema.  Esta
opci&oacute;n puede cambiar cuando el &laquo;Cach&eacute; de Memoria
Intermedia Unificado&raquo; (<i>&quot;Unified Buffer Cache&quot;</i>)
se haya completado y forme parte de OpenBSD.  Mientras tanto, para
incrementar BUFCACHEPERCENT debe a&ntilde;adir una l&iacute;nea como
&eacute;sta a la configuraci&oacute;n de su n&uacute;cleo:
</ul>

<p>
<ul>
<strong>option	BUFCACHEPERCENT=30</strong><br>
</ul>
</p>

<ul>
<p>
Puede hacer que sea tan bajo como el 5% (por definici&oacute;n), o tan
alto como el 50% (o m&aacute;s).
</p>
</ul>
<br>

<a name="softu"></a>
<h3>11.2.4 - Soft updates</h3>

<ul>
Otra herramienta que puede usar para aumentar la velocidad de su
sistema es &quot;softupdates&quot;.  Una de las operaciones m&aacute;s
lentas en el sistema de archivo tradicional de BSD es la
actualizaci&oacute;n de metainfo (que ocurre, entre otras, cuando crea
o genera ficheros y directorios).  &quot;Softupdates&quot; intenta
actualizar la metainfo en RAM, en lugar de escribir al disco duro cada
vez que se actualiza la metainfo.  Otro efecto de esto es que la
metainfo en el disco deber&iacute;a estar siempre completa, aunque no
siempre actualizada.  Por lo tanto, un ca&iacute;da del sistema no
deber&iacute;a necesitar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fsck&apropos=0&sektion=0&manpath=OpenBSD+Current&format=html">fsck(8)</a>
durante el reinicio, sino simplemente una versi&oacute;n de fondo de
fsck que lleve a cabo los cambios a la metainfo en RAM (como
&quot;softupdates&quot;).  Esto quiere decir que reiniciar un servidor
ser&aacute; mucho m&aacute;s r&aacute;pido, ya que no tendr&aacute; que
esperar a que termine fsck(8) (OpenBSD todav&iacute;a no dispone de
esta funcionalidad).  Puede leer m&aacute;s sobre esto en la entrada
sobre <a href="faq14.html#14.5">``softupdates''</a> de las Preguntas
Frecuentes.
</ul>
</p>
<br>

<p>
<a name="11.3"></a>
<h2>11.3 - Afinar kmem</h2>
</p>

Esta secci&oacute;n se ha movido a la 
<a href="faq11-2.5.html#11.2">secci&oacute;n de informaci&oacute;n
de OpenBSD 2.5</a>
<br>

<p>
<a name="11.4"></a>
<h2>11.4 - Elecci&oacute;n de <i>hardware</i></h2>
</p>

<i>(Nota: esta secci&oacute;n se centra fuertemente en la arquitectura
para i386.  Esto significa que... otras arquitecturas no ofrecen tantas
posibilidades de elecci&oacute;n)</i>

<p>
El rendimiento de sus aplicaciones depende fuertemente de su sistema
operativo y de las facilidades que &eacute;ste ofrezca.  &Eacute;sta
puede ser, en parte, la raz&oacute;n por la que est&eacute; usando
OpenBSD.  El rendimiento de sus aplicaciones también depende
fuertemente de su <i>hardware</i>.  Para muchos, el ratio
precio/rendimiento de un PC nuevo con un procesador Intel Pentium III o
AMD Athlon, es mucho mejor que el ratio precio/rendimiento de una Sun
UltraSparc 60.  Claro que el precio de OpenBSD no tiene competidor.

<p>
Si est&aacute; pensando en comprar un nuevo PC, tanto si lo va a
comprar por piezas o montado al completo, debe asegurarse antes de que
va a comprar partes fiables.  En el mundo del PC esto no es
f&aacute;cil.  <b>Componentes en mal estado, o de escasa fiabilidad
pueden hacer que OpenBSD funcione mal o caiga a menudo</b>.  El mejor
consejo que le podemos ofrecer es que tenga cuidado, que compre marcas
y componentes que hayan sido revisadas por una autoridad en la que Vd.
conf&iacute;e.  A veces, un ahorro en el precio de un PC puede
significar una p&eacute;rdida en calidad.

<p>
Hay algunas cosas que le ayudar&aacute;n a obtener el rendimiento
m&aacute;ximo para su <i>hardware</i>:

<ul>
   <li>Use discos m&uacute;ltiples.
   <p>En lugar de comprar un disco de 20GB, compre varios de 9GB.
      Aunque sea m&aacute;s caro, distribuir la carga sobre varios ejes
      disminuir&aacute; el tiempo necesario para acceder a los datos de
      los discos.  Adem&aacute;s, con m&aacute;s ejes, obtendr&aacute;
      m&aacute;s fiabilidad y una acceso m&aacute;s r&aacute;pido a los
      datos con RAID.

   <p>
   <li>Si necesita grandes velocidades de E/S en el disco, use SCSI.
   <p>Los discos IDE suelen funcionar a 5400 RPM, y los m&aacute;s
      nuevos hasta 7200 RPM.  Usando discos IDE de alto rendimiento,
      puede que no sea razonable esperar m&aacute;s de 15 a 20 Mb/s de
      rendimiento para un s&oacute;lo disco.  Usando discos SCSI de
      alto rendimiento (discos de 10000 RPM de alto coste), puede
      obtener rendimientos m&aacute;s altos.  Sin embargo, si va a usar
      discos SCSI de bajo o medio rendimiento, estar&aacute;
      malgastando su dinero ya que IDE puede servirle igual o incluso
      mejor.
   <p>Si est&aacute; montando un servidor y necesita m&aacute;s de 20GB
      de espacio en disco, tenga en cuenta los discos SCSI.  IDE le
      limita a dos discos por controladora, y el acceso concurrente a
      estos dos discos puede tener un impacto negativo sobre los
      resultados de E/S de estos discos.  El l&iacute;mite de Wide SCSI
      es de 15 por controladora.  Aunque SCSI sea m&aacute;s caro, la
      flexibilidad y el rendimiento justifican estos costes en algunos
      entornos.

   <p>
   <li>Use SDRAM en lugar de DRAM.
   <p>Esta opci&oacute;n es v&aacute;lida principalmente para PCs.
      La mayor&iacute;a de las otras arquitecturas no ofrecen una
      elecci&oacute;n en el tipo de RAM que puede usar.  Varios PCs
      todav&iacute;a lo hacen.  Obtendr&aacute; un rendimiento mejor
      con SDRAM que con DRAM (SIMMs).  Si su sistema tiene soporte para
      RDRAM o alg&uacute;n otro tipo nuevo de RAM, entonces ya se
      encuentra un paso por delante...

   <p>
   <li>Use ECC o RAM de paridad.
   <p>Paridad a&ntilde;ade algo de funcionalidad para ver si los datos
      en RAM se han corrompido.  ECC hace extiende esta funcionalidad e
      intenta corregir algunos errores de corrupci&oacute;n de bits al
      vuelo.  Esta opci&oacute;n s&oacute;lo es aplicable a PCs.
      Algunas m&aacute;quinas no PC ni siquiera arrancar&aacute;n con
      RAM de no paridad.  Si no est&aacute; usando RAM ECC/paridad,
      puede tener corrupci&oacute;n en sus datos y otras
      anomal&iacute;as.  Varios fabricantes de &laquo;RAM barata para
      PC&raquo; ni siquiera producen la variedad ECC.  &iexcl;Esto le
      ayudar&aacute; a evitarlos!  Los fabricante de PC suelen vender
      otras l&iacute;neas de productos, divididas entre
      &laquo;servidores&raquo; y &laquo;estaciones de trabajo&raquo;.
      Los servidores incorporan RAM ECC en su arquitectura.  Los
      fabricantes de estaciones de trabajo Unix ha usado paridad (y
      ahora ECC) durante varios a&ntilde;os en todas sus l&iacute;neas
      de productos.

   <p>
   <li>Evite los dispositivos ISA.
   <p>Aunque la mayor&iacute;a suele evitarlos debido a que son
      dif&iacute;ciles de configurar y obsoletos, todav&iacute;a
      existen muchos.  Si est&aacute; usando el bus ISA para los
      controladores de su disco o red (o peor a&uacute;n, para ambos),
      recuerde que el bus ISA puede ser un embudo para el rendimiento.
      Si necesita velocidad, busque PCI.  Todav&iacute;a existen
      algunas tarjetas de bus ISA que funcionan bien, pero la
      mayor&iacute;a son tarjetas de sonido y tarjetas de puerto serie.

   <p>
   <li>Evite adaptadoras de red PCI baratas.
   <p>OpenBSD tiene soporte para una gran cantidad de adaptadoras de
      red PCI de bajo precio.  Estas adaptadoras funcionan muy bien en
      sistemas caseros, y tambi&eacute;n en empresas y entornos de
      investigaci&oacute;n medios y peque&ntilde;os.  Pero si necesita
      un alto rendimiento y un bajo impacto en su servidor, es mejor
      que compre una adaptadora de red PCI de calidad.  Por desgracia,
      algunas marcas caras de adaptadoras (como las series XL de 3com)
      no son mucho mejor que las adaptadoras baratas.  Una de las
      adaptadoras favoritas de 10/100Mbps es la Intel EtherExpress
      PRO/100.
</ul>
<br>

<p>
<a name="11.5"></a>
<h2>11.5 - &iquest;Por qu&eacute; no usamos montajes
asincr&oacute;nicos?</h2>

<p>
Pregunta: &laquo;Yo simplemente ejecuto 'mount -u -o async /' lo que me
permite utilizar cierto paquete.<br> &iquest;Por qu&eacute; el montaje
asincr&oacute;nico no se usa por definici&oacute;n (como lo est&aacute;
en otros Unix)?  &iquest;No es un modo mucho m&aacute;s simple y por lo
tanto m&aacute;s seguro que de mejorar el rendimiento de algunas
aplicaciones?&raquo;
</p>

<p>
Respuesta: &laquo;Los montajes asincr&oacute;nicos son m&aacute;s
r&aacute;pidos que los montajes sincr&oacute;nicos, pero tambi&eacute;n
son menos seguros.  &iquest;Qu&eacute; suceder&iacute;a si hubiera un
fallo el&eacute;ctrico?  &iquest;O un problema de <i>hardware</i>?  La
b&uacute;squeda de la velocidad no debe sacrificar la fiabilidad y
estabilidad del sistema.  M&aacute;s Informaci&oacute;n en la
p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount&apropos=0&sektion=8&format=html">mount(8)</a>.&raquo;
</p>

<pre>
	     async   Toda E/S al sistema de archivo deber&iacute;a
		     llevarse a cabo de forma asincr&oacute;nica.
		     &Eacute;ste es un indicador peligroso de activar,
		     ya que no garantiza que mantendr&aacute; una
		     estructura del sistema de archivo consistente en
		     el disco.  No debe usar este indicador a menos que
		     est&eacute; preparado para recrear el sistema de
		     archivo si su sistema cae.  El uso m&aacute;s
		     com&uacute;n de este indicador es el de acelerar
		     restore(8), en donde puede dar un factor de
		     incremento de doble velocidad.
</pre>

<p>
Por otra parte, si est&aacute; tratando con datos temporales que pueda
recrear desde cero despu&eacute;s de una ca&iacute;da, puede ganar en
velocidad usando una partici&oacute;n separada, que se use s&oacute;lo
para esos datos, montada de forma asincr&oacute;nica.  Si no le importa
arriesgar la p&eacute;rdida de todos los datos en la partici&oacute;n
cuando algo vaya mal...
</p>

<br>
<p>
<a name= "11.6"></a>
<h2>11.6 - Ajustar la resoluci&oacute;n del monitor para XFree86</h2>

<p>
Con monitores multi-sync se puede conseguir que un servidor de X
funcione con una resoluci&oacute;n aceptable.  Si alguien ha intentado
ajustar la frecuencia con las utilidades xf86config o XF86Setup, es
probable que no haya podido obtener los mejores resultados.  Uno de los
aspectos m&aacute;s dif&iacute;ciles es precisamente el de lograr que
el monitor funcione con la resoluci&oacute;n deseada, y conseguir que
la frecuencia de barrido vertical se configure como m&iacute;nimo a
72-75Hz;  una frecuencia en la que la pantalla parpadea es mucho menos
visible para los humanos.  Y al contrario, &iquest;qu&eacute;
ocurrir&iacute;a si se intentara ajustar con una frecuencia de barrido
vertical muy baja?  Se puede fijar a 50Hz para que pueda ser capturada
en el v&iacute;deo sin que parpadee, pero los m&eacute;todos para
llevar esto a cabo no est&aacute;n muy claros con las herramientas y la
documentaci&oacute;n incluidas en XFree86.

<p>
Con las resoluciones que muchos usuarios utilizan con monitores VGA de
bajo precio (800x600, 1024x768, 1152x900, 1280x1024), es posible (por
lo menos en monitores m&aacute;s nuevos) usar frecuencias de barrido
vertical de 85MHz y superiores, y lograr as&iacute; una imagen
extremadamente pulida y clara.  El servidor de X de XFree86 dispone un
mecanismo que permite describir en detalle el modo de v&iacute;deo
deseado, y es el ModeLine.  Un ModeLine tiene cuatro secciones:  un
n&uacute;mero de una sola cifra para el reloj de pixelaci&oacute;n
(<i>pixel clock</i>), cuatro cifras para los tiempos de refresco
horizontales (<i>horizontal timings</i>), cuatro cifras para los
tiempos de refresco verticales (<i>vertical timings</i>), y una
secci&oacute;n opcional con una lista de indicadores que especifican
otras caracter&iacute;sticas del modo (como <i>Interlace</i>,
<i>DoubleScan</i>, y muchas otras... que puede ver en detalle en la
p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=XF86Config&sektion=5">XF86Config(5)</a>).

<p>
Generar un ModeLine es cosa de magia negra... pero por suerte existe un
gui&oacute;n (<i>script</i>) que lleva a cabo este proceso por usted.
Se trata del
<a href="http://www-sop.inria.fr/cgi-bin/koala/nph-colas-modelines">
<i>Colas XFree86 ModeLine Generator</i></a>.  Antes de usarlo necesita
conocer los l&iacute;mites de sincronizaci&oacute;n horizontal y
vertical de su monitor.  Esta informaci&oacute;n suele aparecer en el
manual de su monitor, o en su defecto en las p&aacute;ginas <i>web</i>
del fabricante.  Si no lo encontrara en ninguno de estos dos sitios,
algunas personas han recopilado listas con la informaci&oacute;n sobre
varios monitores que podr&aacute; buscar por Internet.

<p>
Pongamos como ejemplo un monitor Dell D1226H.  Despu&eacute;s de un
intensa b&uacute;squeda en las p&aacute;ginas de Dell, descubre que la
frecuencia de barrido horizontal est&aacute; entre 30-50KHz, y la
vertical entre 50-160Hz.  A continuaci&oacute;n ir&aacute; a la
<a href="http://www-sop.inria.fr/cgi-bin/koala/nph-colas-modelines">
p&aacute;gina del generador ModeLine</a> e introducir&aacute; esta
informaci&oacute;n.  Acto seguido deber&aacute; especificar la
frecuencia de barrido vertical m&iacute;nima que desea.  Cualquier
frecuencia por encima de 72Hz producir&aacute; un bajo parpadeo.
Seg&uacute;n vaya incrementando la frecuencia, la imagen en pantalla
ir&aacute; apareciendo m&aacute;s clara.

<p>
Con toda esta informaci&oacute;n, el gui&oacute;n generar&aacute; un
ModeLine para cada una de las resoluciones 4x3 factibles que pueda
soportar su monitor, por encima de la frecuencia de barrido vertical
m&iacute;nima que haya introducido.  Si alguien introdujera las
especificaciones anteriores para Dell y una frecuencia de barrido
vertical m&iacute;nima de 75Hz, el gui&oacute;n le mostrar&iacute;a
algo como esto:

<p>
<pre>
ModeLine &quot;320x240&quot; 20.07 320 336 416 448 240 242 254 280 #160Hz
ModeLine &quot;328x246&quot; 20.86 328 344 424 456 246 248 260 286 #160Hz
...
ModeLine &quot;816x612&quot; 107.39 816 856 1056 1136 612 614 626 652 #145Hz
ModeLine &quot;824x618&quot; 108.39 824 864 1064 1144 618 620 632 658 #144Hz
ModeLine &quot;832x624&quot; 109.38 832 872 1072 1152 624 626 638 664 #143Hz
...
ModeLine &quot;840x630&quot; 109.58 840 880 1080 1160 630 632 644 670 #141Hz
ModeLine &quot;848x636&quot; 110.54 848 888 1088 1168 636 638 650 676 #140Hz
...
ModeLine &quot;1048x786&quot; 136.02 1048 1096 1336 1432 786 788 800 826 #115Hz
ModeLine &quot;1056x792&quot; 136.58 1056 1104 1344 1440 792 794 806 832 #114Hz
ModeLine &quot;1064x798&quot; 137.11 1064 1112 1352 1448 798 800 812 838 #113Hz
...
ModeLine &quot;1432x1074&quot; 184.07 1432 1496 1816 1944 1074 1076 1088 1114 #85Hz
ModeLine &quot;1576x1182&quot; 199.86 1576 1648 2008 2152 1182 1184 1196 1222 #76Hz
ModeLine &quot;1584x1188&quot; 198.93 1584 1656 2016 2160 1188 1190 1202 1228 #75Hz
</pre>

<p>
Ahora bien, las especificaciones de este monitor dicen que soporta
1600x1200 @ 75Hz, pero el gui&oacute;n no nos da esa resoluci&oacute;n
dentro de los 75Hz.  As&iacute; pues, si de verdad quiere una
resoluci&oacute;n exacta de 1600x1200, disminuya un poco la frecuencia
de barrido vertical m&iacute;nima... (en el ejemplo la bajaremos a
70Hz):

<pre>
ModeLine &quot;1592x1194&quot; 197.97 1592 1664 2024 2168 1194 1196 1208 1234 #74Hz
ModeLine &quot;1600x1200&quot; 199.67 1600 1672 2032 2176 1200 1202 1214 1240 #74Hz
ModeLine &quot;1608x1206&quot; 198.65 1608 1680 2040 2184 1206 1208 1220 1246 #73Hz
ModeLine &quot;1616x1212&quot; 197.59 1616 1688 2048 2192 1212 1214 1226 1252 #72Hz
ModeLine &quot;1624x1218&quot; 199.26 1624 1696 2056 2200 1218 1220 1232 1258 #72Hz
ModeLine &quot;1632x1224&quot; 198.15 1632 1704 2064 2208 1224 1226 1238 1264 #71Hz
ModeLine &quot;1640x1230&quot; 199.81 1640 1712 2072 2216 1230 1232 1244 1270 #71Hz
ModeLine &quot;1648x1236&quot; 198.64 1648 1720 2080 2224 1236 1238 1250 1276 #70Hz
</pre>

<p>
Aqu&iacute; podemos ver que el monitor puede soportar 1600x1200 @ 74Hz
cuando el ancho de banda (<i>dot clock</i>) se limita a 200MHz.
Configure el ancho de banda de acuerdo con los l&iacute;mites definidos
por el monitor.

<p>
Una vez que ya tenga los ModeLines, p&oacute;ngalos en su fichero
<i>/etc/XF86Config</i>.  Comente los viejos ModeLines para que pueda
usarlos de nuevo si los nuevos no llegaran a funcionar.  A
continuaci&oacute;n escoja la resoluci&oacute;n a la que quiere que
funcione.  Primero averig&uuml;e si X est&aacute; en modo acelerado
(suele estarlo con la mayor&iacute;a de tarjetas de v&iacute;deo), para
saber cu&aacute;l de las secciones <tt>&quot;Screen&quot;</tt> de
XF86Config debe modificar.  O simplemente modifique todas las secciones
<tt>&quot;Screen&quot;</tt>.

<pre>
Section &quot;Screen&quot;
   Driver          &quot;Accel&quot;
   Device          &quot;Primary Card&quot;
   Monitor         &quot;Primary Monitor&quot;
   DefaultColorDepth 32
   SubSection &quot;Display&quot;
      Depth        32
      Modes        &quot;1280x1024&quot; &quot;1024x768&quot;
   EndSubSection
</pre>

La primera frecuencia que ver&aacute; a continuaci&oacute;n de la
l&iacute;nea &quot;Modes&quot; ser&aacute; la frecuencia con la que se
iniciar&aacute; X.  Se pueden pasar de una a otra de las frecuencias
que est&eacute;n en esta lista desde X, pulsando
CTRL-ALT-<b>&lt;-&gt;</b>, o CTRL-ALT-<b>&lt;+&gt;</b>.  De acuerdo con
la secci&oacute;n anterior, X intentar&aacute; iniciar en modo de color
de 32 bits (a trav&eacute;s de la directiva DefaultColorDepth, sin la
cual iniciar&iacute;a en modo de color de 8 bits).  La primera
resoluci&oacute;n que intentar&aacute; usar ser&aacute; 1280x1024
(siguiendo el orden de la l&iacute;nea &quot;Modes&quot;).
N&oacute;tese que &quot;1280x1024&quot; s&oacute;lo es una
clasificaci&oacute;n para los valores en ModeLine.

<p>
N&oacute;tese asimismo que el gui&oacute;n generador de ModeLine
dispone de opciones para relajar sus tiempos en monitores m&aacute;s
antiguos o m&aacute;s peque&ntilde;os, y que tambi&eacute;n tiene la
capacidad de proveer ModeLines para resoluciones espec&iactue;ficas.
Dependiendo del tipo de <i>hardware</i> que tenga, es posible que no le
resulte f&aacute;cil usarlo con las opciones predefinidas.  Si la
imagen es demasiado alta, demasiado ancha, o demasiado peque&ntilde;a,
o si est&aacute; corrida horizontal o verticalmente, y si los controles
del monitor no bastan para corregirlo, se puede usar xvidtune(1) para
ajustar el ModeLine y sincronizarlo mejor con los tiempos del monitor.

<p>
En la mayor&iacute;a de los monitores modernos no existe un
l&iacute;mite fijo para el ancho de banda, por lo que ya no aparecen en
las listas de especificaciones.  Lo que ocurre es que cuanto m&aacute;s
se incrementa el ByN, m&aacute;s borrosa aparece la imagen en pantalla.
En este caso puede a&ntilde;adir el ancho de banda de su tarjeta de
v&iacute;deo (tambi&eacute;n llamado <i>dotlock</i>) para hacer
comprobaciones sin peligro de da&ntilde;ar el monitor, y disminuirlo de
forma progresiva en ByN con el fin de obtener una imagen n&iacute;tida.

<p>
Si todo esto le parece complicado e innecesario, es porque en realidad
lo es.  XFree86 4.0 trata este asunto y hace este proceso mucho
m&aacute;s f&aacute;cil ya que tiene varios modos integrados y es capaz
de leer las capacidades de monitores <i>&quot;plug and play&quot;</i> a
trav&eacute;s DDC y DDC2.  Desafortunadamente, XFree86 4.0
todav&iacute;a no est&aacute; listo para su uso generalizado debido a
que no tiene soporte para muchas tarjetas de v&iacute;deo que tienen
soporte en XFree86
3.3.

<p>
Puede bajarse el gui&oacute;n (<em>&quot;script&quot;</em>)
<em>&quot;Colas XFree86 ModeLine Generator&quot;</em> desde
<a href="ftp://koala.inria.fr/pub/Klone/">ftp://koala.inria.fr/pub/Klone/</a>.
Tambi&eacute;n debe bajar el int&eacute;rprete Klone y compilarlo.
Est&aacute; en el directorio de portes como <em>lang/klone</em>.
Encontrar&aacute; los guiones en el subdirectorio <em>scripts/</em> de la
distribuci&oacute;n de Klone (el porte los instala en
<em>/usr/local/lib/klone/scripts</em>).

<p>
Existen dos versiones, una CGI id&eacute;ntica a la p&aacute;gina
<em>web</em> de arrriba.  La segunda en una versi&oacute;n
no-CGI que usar&aacute; el fichero completo de <em>XF86Config</em>,
descodificar&aacute; las especificaciones que haya introducido en
xf86config o XF86Setup para el monitor (pi&eacute;nselo antes,
&iquest;introdujo las especificaciones de su monitor, o simplemente
escogi&oacute; las gen&eacute;ricas?), y configurar&aacute; los
ModeLines existentes de acuerdo con &eacute;stas.

<p>
<font color="#0000e0">
<a href= "index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq10.html">[Secci&oacute;n 10.0 - Administraci&oacute;n del sistema]</a>
<a href="faq12.html">[Secci&oacute;n 12.0 - Para usuarios avanzados]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq11.html,v 1.15 2001/03/26 17:14:08 todd Exp ]<br>
$Translation: faq11.html,v 1.9 2001/04/06 16:41:15 horacio Exp $<br>
$OpenBSD: faq11.html,v 1.9 2001/04/07 07:58:54 jufi Exp $
</small>
</p>
</body>
</html>
