<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>1 - Introducci&oacute;n a OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq2.html">[Secci&oacute;n 2 - Otros recursos de informaci&oacute;n sobre OpenBSD]</a>
</font>

<h1><font color="#e00000">1 - Introducci&oacute;n a OpenBSD</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#WhatIs">1.1 - &iquest;Qu&eacute; es OpenBSD?</a>
<li><a href="#Platforms">1.2 - &iquest;En qu&eacute; sistemas funciona
OpenBSD?</a>
<li><a href="#ReallyFree">1.3 - &iquest;Es OpenBSD libre?</a>
<li><a href="#WhyUse">1.4 - &iquest;Qu&eacute; utilidad tiene
OpenBSD?</a>
<li><a href="#Support">1.5 - &iquest;C&oacute;mo puedo ayudar al
Proyecto OpenBSD?</a>
<li><a href="#WhoMaintains">1.6 - &iquest;Qui&eacute;n mantiene
OpenBSD?</a>
<li><a href="#Next">1.7 - &iquest;Cu&aacute;ndo estar&aacute; lista la
pr&oacute;xima versi&oacute;n de OpenBSD?</a>
<li><a href="#Included">1.8 - &iquest;Qu&eacute; incluye OpenBSD?</a>
<li><a href="#WhatsNew">1.9 - &iquest;Qu&eacute; novedades hay en
OpenBSD 3.4?</a>
</ul>

<hr>

<p>
<a name="WhatIs"></a>
<h2>1.1 - &iquest;Qu&eacute; es OpenBSD?</h2>

<p>
<a href="../../es/index.html">OpenBSD</a> es un proyecto que desarrolla
un sistema operativo tipo UNIX basado en 4.4BSD, multiplataforma y de
libre distribuci&oacute;n.  Nuestros
<a href="../../es/goals.html">objetivos</a> principales son la correcta
aplicaci&oacute;n de la <a href="../../es/security.html">seguridad</a>,
de las normas, y en la <a href="../../es/plat.html">portabilidad</a>.
OpenBSD contiene soporte para la emulaci&oacute;n de la mayor parte del
c&oacute;digo binario de los sistemas SVR4 (Solaris), FreeBSD, Linux,
BSDI, SunOS, y HP-UX.

<!-- XXXrelease -->
<p>
En este documento s&oacute;lo se tratan los aspectos relacionados con la
versi&oacute;n final m&aacute;s reciente de OpenBSD, que en este momento
es la versi&oacute;n 3.4.

<p>
<a name="Platforms"></a>
<h2>1.2 - &iquest;En qu&eacute; sistemas funciona OpenBSD?</h2>
<!-- XXXrelease -->
<p>
OpenBSD 3.4 funciona en las siguientes plataformas:
<ul>
   <li><a href="../../es/i386.html">i386</a> - CD de arranque
   <li><a href="../../es/sparc.html">sparc</a> - CD de arranque
   <li><a href="../../es/hp300.html">hp300</a> - S&oacute;lo FTP
   <li><a href="../../es/mac68k.html">mac68k</a> - S&oacute;lo FTP
   <li><a href="../../es/macppc.html">macppc</a> - CD de arranque
   <li><a href="../../es/mvme68k.html">mvme68k</a> S&oacute;lo FTP
   <li><a href="../mvme88k.html">mvme88k</a> - En fase experimental.
   S&oacute;lo FTP
   <li><a href="../../es/alpha.html">alpha</a> - S&oacute;lo FTP
   <li><a href="../../es/vax.html">vax</a>
   <li><a href="../hppa.html">hppa</a> - S&oacute;lo FTP
</ul>

<p>
Nota:  <em>&laquo;CD de arranque&raquo;</em> indica que la
instalaci&oacute;n de OpenBSD se iniciar&aacute; directamente desde el
CDROM.  El sistema de instalaci&oacute;n se puede iniciar desde el CD en
varias plataformas.  Pueden verse m&aacute;s detalles sobre c&oacute;mo
conseguir OpenBSD en CD en el <a href="faq3.html">cap&iacute;tulo 3</a>
de estos documentos.

<p>
En versiones anteriores de OpenBSD tambi&eacute;n hab&iacute;a portes
para las siguientes plataformas:
<ul>
   <li><a href="../../es/amiga.html">amiga</a> - eliminada
   despu&eacute;s de la versi&oacute;n 3.2
   <li><a href="../../es/sun3.html">sun3</a> - eliminada despu&eacute;s
   de la versi&oacute;n 2.9
   <li><a href="../../es/arc.html">arc</a> - eliminada despu&eacute;s de
   la versi&oacute;n 2.3
   <li><a href="../../es/pmax.html">pmax</a> - eliminada despu&eacute;s
   de la versi&oacute;n 2.7
</ul>

<p>
En la actualidad OpenBSD no dispone de soporte para m&aacute;s de un
procesador.  V&eacute;ase la secci&oacute;n sobre
<a href="faq8.html#SMP">SMP</a> para m&aacute;s informaci&oacute;n sobre
el desarrollo del soporte para multiprocesadores.

<p>
<a name="ReallyFree"></a>
<h2>1.3 - &iquest;Es OpenBSD libre?</h2>

<p>
OpenBSD es totalmente libre.  El c&oacute;digo binario es de libre
distribuci&oacute;n.  El c&oacute;digo fuente es de libre
ditribuci&oacute;n.  Todas las partes componentes de OpenBSD tienen unos
derechos de autor con unos t&eacute;rminos razonables que permiten su
libre distribuci&oacute;n.  Esto incluye la posibilidad de REUTILIZAR la
mayor parte del &aacute;rbol de fuentes de OpenBSD, tanto para el uso
personal como para el comercial.  OpenBSD <strong>no incluye ninguna
restricci&oacute;n</strong> m&aacute;s all&aacute; de las que vienen
impuestas por la licencia original de BSD.  En una distribuci&oacute;n
regular de OpenBSD no se puede incluir ning&uacute;n tipo de
c&oacute;digo que se encuentre bajo licencias m&aacute;s estrictas o
restrictivas.  El motivo por el que lo mantenemos de este modo es para
poder salvaguardar la libre redistribuci&oacute;n y uso de OpenBSD.
OpenBSD se puede utilizar, entre otros, con fines personales,
acad&eacute;micos, en instituciones gubernamentales y organizaciones no
gubernamentales, y en empresas privadas o p&uacute;blicas.

<p>
Hay m&aacute;s informaci&oacute;n sobre otras licencias en 
<a href="../../es/policy.html">http://www.openbsd.org/es/policy.html</a>.

<p>
Los desarrolladores de OpenBSD financian el proyecto, en su mayor parte,
con sus propios recursos.  Estos recursos incluyen el tiempo dedicado a
programar para el proyecto, el equipamiento que usan para desarrollar
soporte para los portes del sistema en las distintas plataformas, los
recursos de red que se usan para que los usuarios puedan obtener OpenBSD
a trav&eacute;s de Internet, y el tiempo invertido en contestar
preguntas e investigar los informes sobre errores enviados por los
usuarios.  Los desarrolladores de OpenBSD no son ricos, y hasta la
m&aacute;s peque&ntilde;a contribuci&oacute;n de tiempo, equipamiento y
recursos puede suponer una gran diferencia.


<p>
<a name="WhyUse"></a> 
<h2>1.4 - &iquest;Qu&eacute; utilidad tiene OpenBSD?</h2>

<p>
Con frecuencia, los nuevos usuarios quieren saber si OpenBSD es muy
superior a algunos otros sistemas operativos tipo UNIX.  No existe una
respuesta, y esta pregunta suele dar pie a innumerables (e infructuosos)
debates encendidos.  Bajo ninguna circunstancia se debe formular una
pregunta de este tipo en una lista de correo de OpenBSD.

<p>
A continuaci&oacute;n exponemos algunas razones por las que creemos que
OpenBSD es un sistema operativo de gran utilidad.  Si OpenBSD es un
sistema que vaya a servir a los prop&oacute;sitos de un usuario o no, es
una cuesti&oacute;n que s&oacute;lo el mismo usuario podr&aacute;
contestar.

<p>
<ul>
   <li>OpenBSD funciona en varios tipos
   <a href="../../es/plat.html">diferentes de plataformas de
   <em>hardware</em></a>.
   <li>OpenBSD est&aacute; reconocido por muchos profesionales de la
   seguridad inform&aacute;tica como el sistema operativo tipo UNIX
   m&aacute;s <a href="../../es/security.html">seguro</a>;  esto es el
   resultado de una intensa auditor&iacute;a de seguridad sobre el
   c&oacute;digo fuente, llevada a cabo durante un a&ntilde;o y medio
   por un grupo de diez personas.
   <li>OpenBSD es un sistema operativo con todas las funcionalidades de
   UNIX que se puede adquirir de forma gratuita.
   <li>OpenBSD integra las &uacute;ltimas tecnolog&iacute;as en
   seguridad para la implementaci&oacute;n de cortafuegos (filtros de
   IP) y <a href="../../es/crypto.html#hardware">redes privadas
   virtuales</a> (VPN) dentro de un entorno distribuido.
   <li>OpenBSD aprovecha el intenso desarrollo actual en muchas
   &aacute;reas, y ofrece la oportunidad de trabajar con
   tecnolog&iacute;as emergentes dentro de una comunidad internacional
   de programadores de sistemas y usuarios finales.
   <li>OpenBSD ofrece al usuario normal la oportunidad de participar en
   el desarrollo y prueba del producto.
</ul>


<p>
<a name="Support"></a>
<h2>1.5 - &iquest;C&oacute;mo se puede ayudar al Proyecto OpenBSD?</h2>

<p>
Estamos muy agradecidos hacia todas aquellas personas y organizaciones
que han aportado alg&uacute;n tipo de contribuci&oacute;n al Proyecto
OpenBSD.  Vaya nuestro reconocimiento a las personas que aparecen en la
lista de la <a href="../../es/donations.html">p&aacute;gina de
donaciones</a>.

<p>
OpenBSD tiene una necesidad constante de apoyo en varios campos por
parte de la comunidad de usuarios.  Animamos a cualquiera que crea que
OpenBSD es de utilidad para sus prop&oacute;sitos a que encuentre un
modo de contribuir al proyecto.  Si ninguna de las sugerencias que
hacemos a continuaci&oacute;n son convenientes, invitamos a los usuarios
a que propongan una alternativa enviando un mensaje a 
<a href="mailto:donations@openbsd.org">donations@openbsd.org</a>.

<p>
<ul>
   <li><a href="../../es/orders.html">Mediante la compra de los CD de
   OpenBSD</a>.  En los CD se encontrar&aacute; una versi&oacute;n
   completa y actual de OpenBSD, y el arranque del sistema desde el
   CDROM es funcional en muchas plataformas.  Esta forma de
   adquisici&oacute;n del sistema genera fondos de ayuda para el
   proyecto, y al mismo tiempo reduce la carga sobre los recursos de red
   que se utilizan para la distribuci&oacute;n a trav&eacute;s de
   Internet.  La distribuci&oacute;n de la caja con 3 CD incluye el
   c&oacute;digo fuente completo, y su precio es muy asequible.
   Recuerde, &iexcl;sus amigos necesitar&aacute;n tener su propia copia!
   <li><a href="../../es/donations.html">Mediante donaciones de
   dinero</a>.  El proyecto necesita un flujo de fondos constante para
   sufragar los gastos de equipamiento, conexi&oacute;n de redes, y
   otros gastos relacionados con la publicaci&oacute;n de los CD.  La
   fabricaci&oacute;n de los CD requiere de un desembolso <em>in
   situ</em> por parte de los desarrolladores, que a cambio no tienen
   ninguna garant&iacute;a de poder obtener un reembolso <em>a
   posteriori</em>.  Si alguien desea saber c&oacute;mo puede
   contribuir, puede enviar un mensaje a
   <a href="mailto:donations@openbsd.org">donations@openbsd.org</a>.
   Incluso las donaciones que puedan parecer insignificantes pueden
   suponer una gran diferencia.
   <li><a href="../../es/want.html">Mediante donaciones de equipos y
   componentes</a>.  El proyecto necesita constantemente equipos y
   componentes espec&iacute;ficos y generales.  Siempre hay necesidad de
   algunos productos como discos IDE y SCSI, y de varios tipos de
   m&oacute;dulos de memoria de RAM.  Tambi&eacute;n se puede solicitar
   informaci&oacute;n sobre la necesidad actual de otros tipos de
   equipamiento, como placas base y sistemas completos,  enviando un
   mensaje a
   <a href="mailto:donations@openbsd.org">donations@openbsd.org</a>.
   <li>Mediante la participaci&oacute;n con conocimientos y tiempo.  Los
   programadores que disfrutan programando sistemas operativos son
   siempre bienvenidos, pero hay muchos otros modos en los que se puede
   ayudar.  Uno de ellos es suscribi&eacute;ndose a las
   <a href="../../es/mail.html">listas de correo</a> y participando en
   &eacute;stas, contestando a las preguntas de los nuevos usuarios.
   <li>Mediante el mantenimiento de la documentaci&oacute;n, enviando
   m&aacute;s informaci&oacute;n para las preguntas frecuentes a
   <a href="mailto:faq@openbsd.org">faq@openbsd.org</a>.  Organizando un
   <a href="../../es/groups.html">grupo de usuarios</a> y atrayendo a
   amigos y conocidos a OpenBSD.  Presentando el sistema en el lugar de
   trabajo.  Los estudiantes pueden hablar con sus profesores sobre la
   posibilidad de usar OpenBSD como una herramienta para cursos de
   Inform&aacute;tica o Ingenier&iacute;a.  Tambi&eacute;n vale la pena
   mencionar aqu&iacute; una de las maneras en que no se debe intentar
   &laquo;ayudar&raquo; al Proyecto OpenBSD: perdiendo el tiempo en
   discusiones encendidas con usuarios de otros sistemas operativos.
   Esto no ayuda al proyecto a atraer nuevos miembros y puede
   da&ntilde;ar las relaciones que los desarrolladores de OpenBSD tienen
   con otros desarrolladores.
</ul>


<p>
<a name="WhoMaintains"></a>
<h2>1.6 - &iquest;Qui&eacute;n mantiene OpenBSD?</h2>

<p>
El mantenimiento de OpenBSD est&aacute; a cargo de un equipo de
desarrollo ubicado en varios 
<a href="../../images/map.jpg">pa&iacute;ses</a>.  La
coordinaci&oacute;n del proyecto est&aacute; a cargo de Theo de Raadt,
desde Canad&aacute;.

<p>
<a name="Next"></a>
<h2>1.7 - &iquest;Cu&aacute;ndo estar&aacute; lista la pr&oacute;xima
versi&oacute;n de OpenBSD?</h2>

<p>
El equipo de OpenBSD prepara una versi&oacute;n nueva cada seis meses, y
las fechas de salida previstas son el 1 de mayo y el 1 de noviembre.  La
informaci&oacute;n sobre el ciclo de desarrollo se encuentra
<a href="faq5.html#Flavors">aqu&iacute;</a>.

<a name="Included"></a>
<h2>1.8 - &iquest;Qu&eacute; incluye OpenBSD?</h2>

<p>
OpenBSD se distribuye con varios productos de <i>software</i> de
terceras partes, incluido:

<ul>
<li><a href="http://www.xfree.org">XFree86 4.3.0</a>, el entorno de X
Window.  Para la plataforma i386 tambi&eacute;n se incluyen los
servidores de la versi&oacute;n 3.3 de X a fin de ofrecer un soporte de
tarjetas gr&aacute;ficas adicional.  Se instala con los
<a href="faq4.html#FilesNeeded">archivos de instalaci&oacute;n</a>
<tt>x*.tgz</tt>.

<li><a href="http://gcc.gnu.org/">GCC 2.95.3</a>, el compilador de C de
GNU.  El equipo de OpenBSD ha a&ntilde;adido la tecnolog&iacute;a de
protecci&oacute;n de pila
<a href="http://www.trl.ibm.com/projects/security/ssp">Propolice</a>,
activada en la instalaci&oacute;n predeterminada, y que se usa en todo
el modo de usuario y en las aplicaciones compiladas en OpenBSD.  Se
instala como parte del <a href="faq4.html#FilesNeeded">archivo</a>
<tt>comp34.tgz</tt>.

<li><a href="http://www.perl.com/">Perl 5.8.0</a>, con parches y mejoras
del equipo de OpenBSD.

<li><a href="http://www.apache.org/">Apache 1.3.28</a>, el servidor de
<i>web</i>.  El equipo de OpenBSD ha a&ntilde;adido el
<a href="faq10.html#httpdchroot">entorno <i>chroot</i></a> como
predeterminado, la revocaci&oacute;n de privilegios, y otras mejoras
relacionadas con la seguridad.  Adem&aacute;s tambi&eacute;n incluye
soporte para mod_ssl 2.8 y DSO.

<li><a href="http://www.openssl.org">OpenSSL 0.9.7b</a>, con parches
y mejoras del equipo de OpenBSD.

<li><a href="http://www.gnu.org/software/groff/groff.html">Groff
1.15</a>, el procesador de texto.

<li><a href="http://www.sendmail.org/">Sendmail 8.12.9</a>, el servidor
de correo, con el parche de seguridad parse8.359.2.8.

<li><a href="http://www.isc.org/products/BIND/">BIND 9.2.2</a>, el
servidor de DNS.  OpenBSD ha implementado muchas mejoras en la
operaci&oacute;n de <i>chroot</i> y otros temas relacionados con la
seguridad.

<li><a href="http://lynx.isc.org/">Lynx 2.8.4rel.1</a>, el navegador de
texto de <i>web</i>.  Con soporte a&ntilde;adido para HTTPS, m&aacute;s
parches del equipo de OpenBSD.

<li><a href="http://www.courtesan.com/sudo/">Sudo v1.6.7p5</a>, que
permite a los usuarios ejecutar &oacute;rdenes individuales como si
fueran el usuario <i>root</i>.

<li><a href="http://www.gnu.org/software/ncurses/ncurses.html">Ncurses
5.2.</a>

<li><a href="http://www.kame.net/">KAME</a> IPv6.

<li>Heimdal 0.6rc1 con parches.

<li><a href="http://www.openssh.com">OpenSSH 3.7.1</a>.

</ul>

<p>
Como se puede ver, el equipo de OpenBSD produce con frecuencia parches
para productos de terceras partes con el fin de mejorar la seguridad o
la calidad del c&oacute;digo.  En algunos casos, el usuario no
percibir&aacute; la diferencia en la operaci&oacute;n, mientras que en
otros casos HAY diferencias operacionales que pueden significar un
impacto para algunos usuarios.  Antes de a&ntilde;adir versiones
diferentes de estos programas en el sistema, hay que tener en cuenta
todo esto.

<p>
Y, por supuesto, se pueden a&ntilde;adir aplicaciones adicionales a
trav&eacute;s de los sistemas de
<a href="faq8.html#Packages">paquetes</a> y
<a href="faq8.html#Ports">portes</a> de OpenBSD.


<a name="WhatsNew"></a>
<h2>1.9 - &iquest;Qu&eacute; novedades hay en OpenBSD 3.4?</h2>
<p>
La lista completa de cambios realizados en OpenBSD 3.3 para crear
OpenBSD 3.4 se puede ver <a href="../../plus34.html">aqu&iacute;</a>;  a
continuaci&oacute;n hay una lista de cambios para los que son necesarias
algunas notas a fin de poder actualizar o instalar OpenBSD 3.4 para
aquellas personas que est&aacute;n familiarizadas con versiones
anteriores:

<ul>
<li><b>La Plataforma i386 ha cambiado al formato ELF.</b>
El formato de archivo ejecutable
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=elf&amp;sektion=5">
ELF</a> ofrece una mayor flexibilidad en la composici&oacute;n de la
memoria que el antiguo formato
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=a.out&amp;sektion=5">a.out</a>,
y era necesario para nuestra implementaci&oacute;n de W^X en i386 (W^X
es una refinada composici&oacute;n de permisos de memoria que asegura
que la memoria a la que pueden acceder para la escritura los programas
de aplicaciones, no pueda ser ejecutable al mismo tiempo y vice versa.
Esto eleva la protecci&oacute;n contra desbordamientos de memoria
potenciales y otros ataques:  como resultado, un atacante no puede
escribir c&oacute;digo en ninguna parte de la memoria que se pueda
ejecutar).  NO existe la opci&oacute;n de actualizaci&oacute;n mediante
el c&oacute;digo fuente.  Las actualizaciones mediante binarios son
posibles, pero muy complicadas y requieren la desinstalaci&oacute;n de
todos los <a href="faq8.html#Packages">paquetes</a> existentes antes de
actualizar, y su posterior reinstalaci&oacute;n.  Adem&aacute;s existen
otros posibles problemas en la actualizaci&oacute;n.  El equipo de
OpenBSD recomienda encarecidamente reinstalar el sistema desde cero.
N&oacute;tese que existe una
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_aout&amp;sektion=8">emulaci&oacute;n binaria a.out</a> por sysctl
para aplicaciones binarias que la requieran.

<li><b>Las emulaciones binarias se encuentran desactivadas en la
instalaci&oacute;n predeterminada.</b>
Se ha tomado esta decisi&oacute;n para dificultar a&uacute;n m&aacute;s
la ejecuci&oacute;n de programas maliciosos codificados para otra
plataforma en OpenBSD.  Como consecuencia muchos
<a href="faq8.html#Ports">portes</a> no funcionar&aacute;n correctamente
hasta que se active la emulaci&oacute;n necesaria para el uso de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8">sysctl</a>s.
El n&uacute;cleo GENERIC tiene estas opciones incluidas, pero
desactivadas.  No es necesario recompilar el n&uacute;cleo.
V&eacute;ase <a href="faq9.html#Interact">este art&iacute;culo</a> para
m&aacute;s informaci&oacute;n.
</ul>

<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq2.html">[Secci&oacute;n 2 - Otros recursos de informaci&oacute;n sobre OpenBSD]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq1.html,v 1.52 ]<br>
$Translation: faq1.html,v 1.51 2003/11/02 19:29:50 horacio Exp $<br>
$OpenBSD: faq1.html,v 1.46 2003/11/03 14:45:36 horacio Exp $
</small>
</body>
</html> 
