<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>2 - Otros recursos de informaci&oacute;n sobre OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2004 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq1.html">[Secci&oacute;n 1 - Introducc&oacute;n a OpenBSD]</a>
<a href="faq3.html">[Secci&oacute;n 3 - C&oacute;mo obtener OpenBSD]</a>
</font>

<h1><font color="#e00000">2 - Otros recursos de informaci&oacute;n
sobre OpenBSD</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
   <li><a href="#WebSites">2.1 - P&aacute;ginas en Internet</a>
   <li><a href="#MailLists">2.2 - Listas de correo</a>
   <li><a href="#ManPages">2.3 - P&aacute;ginas del manual</a>
   <li><a href="#Bugs">2.4 - Sistema de informes de errores</a>
</ul>

<hr>

<p>
<a name="WebSites"></a>
<h2>2.1 - P&aacute;ginas de inter&eacute;s en Internet</h2>

<p>
El sitio oficial del Proyecto OpenBSD en Internet est&aacute; ubicado
en:<br> 
<a href="http://www.openbsd.org/es/">http://www.OpenBSD.org/es/</a>.

<p>
Aqu&iacute; se puede encontrar mucha informaci&oacute;n &uacute;til
relacionada con todos los aspectos del Proyecto OpenBSD.

<p>
<a href="http://undeadly.org">OpenBSD Journal</a> es un sitio de
noticias y opinión enfocado en OpenBSD.

<p>
Muchos usuarios han puesto sitios y páginas con información específica
sobre OpenBSD.
Como todo en Internet, un buen motor de búsqueda hará su vida más fácil,
así como una saludable dosis de escepticismo.
Como siempre, no introduzca a ciegas órdenes en su computadora que no
entiende.


<p>
<a name="MailLists"></a>
<h2>2.2 - Listas de correo</h2>

<p>
El Proyecto OpenBSD mantiene varias listas de correo a las que los
usuarios deber&iacute;an suscribirse.  Para darse de alta en una lista
de correo, hay que enviar un mensaje a
<a href="mailto:majordomo@openbsd.org">majordomo@openbsd.org</a>.  Esta
direcci&oacute;n es un servicio de suscripci&oacute;n autom&aacute;tica.
En el contenido del mensaje, en una sola l&iacute;nea, debe incluirse la
orden <kbd>subscribe</kbd> seguida del nombre de la lista a la que se
desee realizar la suscripci&oacute;n.  Por ejemplo:

<blockquote>
<pre>
<strong>subscribe announce</strong>
</pre>
</blockquote>

<p>
El procesador de listas enviar&aacute; una contestaci&oacute;n de vuelta
requiriendo que se confirme la petici&oacute;n de suscripci&oacute;n a
la lista, para que nadie pueda suscribirnos a una lista sin nuestra
aprobaci&oacute;n.  El mensaje incluye instrucciones sobre varios modos
diferentes de suscripci&oacute;n, incluido un en enlace a la
p&aacute;gina del <a href="http://lists.openbsd.org">servidor de
listas</a> como respuesta de confirmaci&oacute;n, o para una respuesta a
<tt>majordomo@openbsd.org</tt>.  Se puede usar cualquiera de los
m&eacute;todos.  Los tres m&eacute;todos incluyen un n&uacute;mero de
identificaci&oacute;n &uacute;nico y limitado, como
<tt>A56D-70D4-52C3</tt>, para asegurarse de que la persona que requiere
la suscripci&oacute;n es el due&ntilde;o de la direcci&oacute;n.

<p>
Una vez que se haya enviado la confirmaci&oacute;n de esta
autorizaci&oacute;n de vuelta al procesador y que &eacute;ste haya
confirmado el alta, la direcci&oacute;n ser&aacute; a&ntilde;adida a la
lista de inmediato, y el procesador enviar&aacute; una
notificaci&oacute;n confirmando el alta en la lista.

<p>
Para darse de baja de una lista hay que enviar un mensaje a 
<a href="mailto:majordomo@openbsd.org">majordomo@openbsd.org</a> con la
orden <kbd>unsubscribe</kbd> seguida del nombre de la lista.  Por
ejemplo:

<blockquote>
<pre>
<strong>unsubscribe announce</strong>
</pre>
</blockquote>

<p>
Si se encuentran dificultades con el sistema de suscripci&oacute;n a las
listas de correo, pueden verse las instrucciones de ayuda del gestor de
listas, majordomo, que se pueden obtener enviando un mensaje a
<a href="mailto:majordomo@openbsd.org">majordomo@openbsd.org</a> con la
orden <kbd>help</kbd> en el contexto del mensaje.

<p>
La suscripci&oacute;n a las listas de correo de OpenBSD tambi&eacute;n
se puede gestionar a trav&eacute;s de la interfaz de <i>web</i> en
<a href="http://lists.openbsd.org">http://lists.openbsd.org</a>.

<p>
Algunas de las listas de OpenBSD m&aacute;s frecuentadas son:

<ul>
   <li><b>announce</b> - Anuncios importantes.  Lista con poco
   tr&aacute;fico.
   <li><b>security-announce</b> - Anuncios sobre temas de seguridad.
   &Eacute;sta es una lista con poco tr&aacute;fico.
   <li><b>misc</b> - Preguntas y respuestas generales.  &Eacute;sta es
   la lista m&aacute;s activa, y la mayor&iacute;a de preguntas
   deber&iacute;an ser enviadas a esta lista.
   <li><b>bugs</b> - Informes sobre errores recibidos a trav&eacute;s de
   sendbug(1) y discusiones sobre estos errores.
   <li><b>source-changes</b> - Lista de distribuci&oacute;n de correo
   automatizada de los cambios en el &aacute;rbol de fuentes del CVS.
   Cada vez que un desarrollador efect&uacute;a un cambio en el
   &aacute;rbol de fuentes de OpenBSD, <a href="../why-cvs.html">CVS</a>
   env&iacute;a una copia del mensaje de entrega (generalmente breve) a
   trav&eacute;s de esta lista.
   <li><b>ports</b> - Discusi&oacute;n sobre el &aacute;rbol de portes
   de OpenBSD.
   <li><b>ports-changes</b> - Lista de distribuci&oacute;n de correo
   automatizada de los cambios espec&iacute;ficos en los portes, en el
   &aacute;rbol de fuentes del CVS.
   <li><b>advocacy</b> - Difusi&oacute;n de OpenBSD y otros temas que no
   corresponden a <b>misc</b>.
</ul> 

<p>
Antes de enviar una pregunta a <b>misc</b> o a cualquier otra lista es
conveniente buscar entre los archivos, ya que la mayor&iacute;a de
preguntas comunes pueden haber sido formuladas anteriormente y en
repetidas ocasiones.  Aunque para un usuario puede ser la primera vez
que se encuentre con un cierto problema o duda, es muy probable que
otros suscriptores de las listas de correo lo hayan tratado ya varias
veces en semanas anteriores, y pueden encontrar molesto volverlo a ver
repetido.
Si la pregunta tiene qué ver con hardware, <i>¡siempre incluya un
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">
dmesg(8)</a>!</i>


<p>
Se puede ver una lista con los archivos de los mensajes de correo de las
listas de OpenBSD y otra informaci&oacute;n en
<a href="../../es/mail.html">la p&aacute;gina de las listas de
correo</a>.

Una lista de correo no oficial que puede ser del interés de los usuarios
nuevos de OpenBSD y UNIX es la lista
<a href="http://mailman.theapt.org/listinfo/openbsd-newbies">OpenBSD
Newbies</a>. 


<p> 
<a name="ManPages"></a>
<h2>2.3 - P&aacute;ginas del manual</h2>

<p>
OpenBSD viene con una extensa documentaci&oacute;n en forma de
p&aacute;ginas del manual (<em>man pages</em>), as&iacute; como de
documentos m&aacute;s extensos sobre aplicaciones espec&iacute;ficas.
Se hace un esfuerzo considerable para asegurarse de que las páginas del
manual estén actualizadas y precisas.

<!-- XXXrelease -->
<p>
Para acceder a las p&aacute;ginas del manual y dem&aacute;s
documentaci&oacute;n, es necesario tener instalados los
<a href="faq4.html#FilesNeeded">paquetes</a> <tt>man35.tgz</tt> y
<tt>misc35.tgz</tt>.

<p>
He aqu&iacute; una lista de las p&aacute;ginas del manual m&aacute;s
&uacute;tiles para los usuarios noveles:

<p>
<b>Comenzando</b>

<ul>
   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8">afterboot(8)</a></b>
- primeras comprobaciones despu&eacute;s de iniciar el sistema por primera vez.

    <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=help&amp;sektion=1">help(1)</a></b>
- ayuda para usuarios y administradores nuevos.

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hier&amp;sektion=7">hier(7)</a></b>
- estructura del los sistemas de archivo.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=man&amp;sektion=1">man(1)</a></b>
- uso de las p&aacute;ginas del manual.

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=1">intro(1)</a></b>
- introducción a instrucciones generales, vea también los intros de las otras
secciones del manual:
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=2">intro(2)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=3">intro(3)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=4&amp;arch=i386">intro(4)</a>
(nota: intro(4) es dependiente de la
<a href="../../es/plat.html">plataforma</a>),
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=5">intro(5)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=6">intro(6)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=7">intro(7)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=8">intro(8)</a>
e
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=intro&amp;sektion=9">intro(9)</a>.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&amp;sektion=8">adduser(8)</a></b>
- orden para a&ntilde;adir nuevos usuarios.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw(8)</a></b>
- edici&oacute;n del fichero maestro de contrase&ntilde;as.

   <li> <b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&amp;sektion=8">disklabel(8)</a></b>
- leer y escribir las clasificaciones del disco.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=reboot&amp;sektion=8">reboot, halt(8)</a></b>
- parar y reiniciar el sistema.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=shutdown&amp;sektion=8">shutdown(8)</a></b>
- cerrar el sistema en un tiempo especificado.

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a></b>
- despliega de nuevo los mensajes de inicio del núcleo.
 
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sudo&amp;sektion=8">sudo(8)</a></b>
- no se registre como root, pero ejecute instrucciones como root.

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mg&amp;sektion=1">mg(1)</a></b>
- editor de texto semejante a emacs.
</ul>

<b>Para usuarios más avanzados</b>
<ul>
   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&amp;sektion=8&amp;arch=i386">boot(8)</a></b>
- procedimientos de arranque del sistema.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=login.conf&amp;sektion=5">login.conf(5)</a></b>
- formato del fichero de configuraci&oacute;n de la clase de ingreso.

   <li> <b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ifconfig&amp;sektion=8">ifconfig(8)</a></b>
- configurar los par&aacute;metros de la interfaz de red.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=netstat&amp;sektion1">netstat(1)</a></b>
- estado de la red.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&amp;sektion=8">boot_config(8)</a></b>
- cambiar la configuración del núcleo del sistema durante el arranque.

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=release&amp;sektion=8">release(8)</a></b> - construye una distribución de OpenBSD.

   <li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a></b>
- enviar un informe sobre un problema (PR) en OpenBSD al sitio central de asistencia.

<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8">sysctl(8)</a></b>
- consulta o establece el estado del núcleo.
 
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=style&amp;sektion=9">style(9)</a></b> - guía de estilo para el código fuente del núcleo de OpenBSD.
</ul>

<p>
<!-- XXXrelease -->
Se pueden ver todas las p&aacute;ginas del manual de OpenBSD en Internet
desde <a href="http://www.openbsd.org/cgi-bin/man.cgi">
http://www.openbsd.org/cgi-bin/man.cgi</a>, y tambi&eacute;n en la
pantalla si se ha instalado el archivo <tt>man35.tgz</tt>.

<p>
Por regla general, si se conoce el nombre de una orden o de una
p&aacute;gina del manual, se puede leer ejecutando <kbd>man
&lt;orden&gt;</kbd> (en donde <kbd>&lt;orden&gt;</kbd> es el nombre de
la orden o funci&oacute;n sobre la que se desea obtener
informaci&oacute;n).  Por ejemplo, <kbd>man vi</kbd> mostrar&iacute;a la
p&aacute;gina del manual del editor vi.  Si no se sabe el nombre de la
orden o funci&oacute;n, o si <kbd>man &lt;orden&gt;</kbd> no encuentra
la p&aacute;gina del manual que se est&eacute; buscando, se puede
realizar una b&uacute;squeda en la base de datos de las p&aacute;ginas
del manual mediante la orden "<kbd>apropos &lt;clave&gt;</kbd>" o "<kbd>man
-k &lt;clave&gt;</kbd>" (en donde <kbd>&lt;clave&gt;</kbd> es una palabra
que puede aparecer en el t&iacute;tulo de la p&aacute;gina del manual
que se desee consultar).  Por ejemplo:

<blockquote>
<pre>
# <strong>apropos &quot;time zone&quot;</strong>
tzfile (5) - time zone information
zdump (8) - time zone dumper
zic (8) - time zone compiler
</pre>
</blockquote>

<p>
Los n&uacute;meros entre par&eacute;ntesis indican la secci&oacute;n del
manual en la que se encuentra esa p&aacute;gina.  En algunos casos puede
ocurrir que para una misma orden o funci&oacute;n exista m&aacute;s de
una p&aacute;gina del manual con el mismo nombre y en secciones
separadas del manual.  Pongamos como ejemplo que necesit&aacute;ramos
conocer el formato de los ficheros de configuraci&oacute;n para el
d&aelig;mon <em>cron</em>.  Una vez que supi&eacute;ramos la
secci&oacute;n del manual para la p&aacute;gina que deseamos consultar,
ejecutar&iacute;amos <kbd>man &lt;n&gt; &lt;orden&gt;</kbd> (en donde
&lt;n&gt; ser&iacute;a el n&uacute;mero de la secci&oacute;n del
manual).

<blockquote>
<pre>
# <strong>man -k cron</strong>
cron (8) - clock daemon
crontab (1) - maintain crontab files for individual users
crontab (5) - tables for driving cron
# <strong>man 5 crontab</strong>
</pre>
</blockquote>

<p>
<!-- XXXrelease -->
Adem&aacute;s de las p&aacute;ginas del manual de UNIX, existe una
documentaci&oacute;n a la que se puede dar formato para la
impresi&oacute;n y que est&aacute; incluida en la distribuci&oacute;n
<tt>misc35.tgz</tt>.
Esta documentaci&oacute;n se encuentra en el
directorio <tt>/usr/share/doc</tt>.  Se puede dar formato a cada grupo
de documentos con la orden <kbd>make</kbd> desde dentro del
subdirectorio apropiado.  El subdirectorio <tt>psd</tt> es el de la
distribuci&oacute;n <em>Programmer's Supplementary Documents</em>
(Documentos Suplementarios para el Programador); el subdirectorio
<tt>smm</tt> es el del <em>System Manager's Manual</em> (Manual de
Gesti&oacute;n del Sistema);  y el subdirectorio <tt>usd</tt> es el del
<em>UNIX User's Supplementary Documents</em> (Documentos Suplementarios
del Usuario de UNIX).  Es posible ejecutar '<kbd>make</kbd>' sobre las
tres distribuciones, o puede hacerse sobre cada una de ellas por
separado desde el correspondiente subdirectorio.

<p>
Algunos de los subdirectorios están vacíos.  El formato predeterminado
del documento ser&aacute; Postscript, un formato ideal para la
impresi&oacute;n de los documentos.  El resultado de la salida en
Postscript suele ser bastante voluminoso;  el incremento en volumen
ser&aacute; de entre 250% y 300%.  Si no se dispone de acceso a una
impresora con capacidad para Postscript o a un programa de
visualizaci&oacute;n para este formato, tambi&eacute;n se puede dar
formato a los documentos en texto simple.
En el subdirectorio de cada documento existe un <i>target</i> para
construir copias en ASCII de estos documentos (llamado "paper.txt")
que puede ser generado con <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&amp;sektion=1">make(1)</a>.
Por ejemplo:

<blockquote>
<pre>
# <strong>cd /usr/share/doc/usd/04.csh</strong>
# <strong>make paper.txt</strong>
# <strong>more paper.txt</strong>
</pre>
</blockquote>

<p>
Tome en cuenta que para construir estos documentos podrían requerirse
prvilegios de superusuario en estos directorios y que la ejecución de
<strong>make clean</strong> borrará cualquier documento generado por un
make anterior. Para más información acerca de los documentos en /usr/share/doc/
vea /usr/share/doc/README.

<p>
Las p&aacute;ginas del manual de UNIX est&aacute;n, por lo general,
m&aacute;s actualizadas y son por tanto m&aacute;s fiables que los
documentos formateables.  Sin embargo, los documentos formateables
suelen ofrecer aclaraciones sobre las aplicaciones complicadas con
m&aacute;s detalle que las p&aacute;ginas del manual.

<p>
Para muchos usuarios puede ser de gran utilidad disponer de una copia
impresa de las p&aacute;ginas del manual.  A continuaci&oacute;n se
explica c&oacute;mo obtener un copia imprimible de una p&aacute;gina del
manual.

<h3>&iquest;C&oacute;mo se puede ver el fichero fuente de una
p&aacute;gina del manual  (o sea, aqu&eacute;l cuyo nombre acabe en
n&uacute;mero, como tcpdump.8)?</h3>

<p>
Éstos se encuentran por todo el árbol de fuentes.  Las p&aacute;ginas
del manual se encuentran dentro del &aacute;rbol en formato fuente, y
muchas veces se actualizan mediante el uso de
<a href="faq8.html#CVS">CVS</a>.  Para poder ver esas p&aacute;ginas:

<blockquote>
<pre>
# <b>nroff -Tascii -mandoc &lt;fichero&gt; | more</b>
</pre>
</blockquote>


<h3>&iquest;C&oacute;mo se puede obtener una p&aacute;gina del manual
sin caracteres de control o de formato?</h3>

<p>
Esto es &uacute;til para la obtenci&oacute;n de una salida directa, sin
caracteres no imprimibles.<br>
Por ejemplo:

<blockquote>
<pre>
# <b>man &lt;orden&gt; | col -b</b>
</pre>
</blockquote>

<h3>&iquest;C&oacute;mo se puede obtener una copia en Postscript de una
p&aacute;gina del manual lista para la impresi&oacute;n?</h3>

<p>
N&oacute;tese que <tt>&lt;fichero&gt;</tt> debe ser el fichero fuente de
la p&aacute;gina del manual (probablemente un fichero que termine con un
n&uacute;mero, como <tt>tcpdump.8</tt>).  Las versiones en formato
Postscript de las p&aacute;ginas del manual son muy vistosas.  Se pueden
imprimir o se pueden visualizar en pantalla con un programa como gv
(GhostView).  GhostView se puede obtener desde nuestro 
<a href="../../es/ports.html">&aacute;rbol de portes</a>.  A fin de
obtener una versi&oacute;n en formato PostScript de una p&aacute;gina
del manual de OpenBSD se usar&aacute; la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=nroff&amp;sektion=1">nroff(1)</a>
con las siguientes opciones:

<blockquote>
<pre>
# <b>nroff -Tps -mandoc &lt;archivo&gt; &gt; resultado.ps</b>
</pre>
</blockquote>

<h3>¿Cómo genero copias comprimidas de las páginas del manual?</h3>

<p>
Para quienes construyen sus sistemas desde el código fuente, hay varias
opciones a tomar en cuenta acerca de la construcción de las páginas del
manual. Estas opciones pueden colocarse en /etc/mk.conf (podría ser necesario
crear este archivo) y están incluidas durante la construcción del sistema.
Una opción especialmente útil es la que genera páginas del manual comprimidas
con el fin de ahorrar espacio en disco. Estas páginas del manual pueden
visualizarse normalmente con la instrucción man. Para conseguirlo añada
lo siguiente a <tt>/etc/mk.conf</tt>:

<blockquote>
<pre>
MANZ=yes
</pre>
</blockquote>
 
Otra opción útil es la que permite generar páginas del manual en formato
PostScript así como en texto ASCII. Esto se consigue colocando
<tt>MANPS=yes</tt> en /etc/mk.conf. Para más información vea
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mk.conf&amp;sektion=5">mk.conf(5)</a>.

<h3>¿Qué son los archivos info?</h3>

<p>
Parte de la documentación de OpenBSD viene en archivos info, ubicados
comúnmente en <tt>/usr/share/info</tt>. Éste es un formato alternativo de
documentación proporcionado por GNU. Muchos de estos archivos están más
actualizados que las páginas de los manuales proporcionados por GNU y pueden
ser accedidos con la instrucción
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=info&amp;sektion=1">info(1)</a>.
Por ejemplo, para ver información acerca del compilador de GNU
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gcc&amp;sektion=1">gcc(1)</a>,
escriba:

<blockquote>
<pre>
# <b>info gcc</b>
</pre>
</blockquote>

Después de usar info, ¡apreciará nuestras páginas del manual en serio!

<h3>¿Cómo veo las páginas del manual a color en XTerm?</h3>

<p>
El archivo de configuración por omisión para 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=xterm&amp;sektion=1">xterm(1)</a> no despliega las páginas del manual a color.
Para verlas a color copie el archivo
<tt>/etc/X11/app-defaults/XTerm-color</tt>
a su directorio personal y renómbrelo a "<tt>.Xdefaults</tt>".
Tenga cuidado de no sobreescribir cualquier configuración previa de
"<tt>.Xdefaults</tt>".
Este archivo contiene todas las opciones que necesita para habilitar el color
en XTerm. Sin embargo, es necesario quitar antes el comentario de de tres
líneas:

<blockquote>
<pre>
!*VT100*colorULMode: on
!*VT100*underLine: off
!*VT100*colorBDMode: on
</pre>
</blockquote>

El resto del archivo le permite seleccionar los colores para varias
configuraciones.
Las opciones pertinentes para las páginas del manual son:

<blockquote>
<pre>
*VT100*colorUL: yellow
*VT100*colorBD: white
</pre>
</blockquote>

Esto produce unas páginas del manual algo horribles, así que será necesario
hacer cambios:
¿podemos sugerirle rojo para "colorUL" y magenta para "colorBD"?

Existe también un visor de páginas de manual para X11 disponible,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=xman&amp;sektion=1">xman(1)</a>,
que proporciona una interfaz alternativa (gráfica) para las páginas del manual.
Para más información vea las páginas del manual de xterm y xman.

<h3>¿Cómo escribo mi propia página del manual?</h3>

<p>
Si desea escribir su propia página del manual para alguna aplicación que haya
escrito, se proporciona un tutorial en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mdoc.samples&amp;sektion=7">mdoc.samples(7)</a>.
También se proporciona una práctica guía de referencia en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mdoc&amp;sektion=7">mdoc(7)</a>.

<p>
<a name="Bugs"></a>
<h2>2.4 - &iquest;C&oacute;mo se env&iacute;a un informe sobre un
error?</h2>

<p>
Antes de enviar un informe sobre cualquier error es necesario leer
<a href="../../es/report.html">http://www.openbsd.org/es/report.html</a>.

<p>
Un informe sobre un error bien escrito es una de las responsabilidades
m&aacute;s importantes de los usuarios finales.  Para poder diagnosticar
los errores m&aacute;s serios se requiere una informaci&oacute;n muy
detallada.  Los desarrolladores suelen recibir informes por correo
electr&oacute;nico como el siguiente:

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
From: joeuser@example.com
To: bugs@openbsd.org
Subject: HELP!!!

&iexcl;&iexcl;&iexcl;Tengo un PC que no arranca!!!
&iexcl;&iexcl;&iexcl;&iexcl;Es un 486!!!!

</pre></td></tr></table>

<p>
Espero que resulte obvio el porqu&eacute; este tipo de
&laquo;informes&raquo; son eliminados sin mediar palabra.  Todos los
informes sobre errores deben contener informaci&oacute;n detallada.  Si
el usuario del mensaje anterior hubiera querido realmente que el error
sobre el que pretend&iacute;a informar hubiera sido investigado,
habr&iacute;a dado m&aacute;s informaci&oacute;n;  algo as&iacute;:

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
From: smartuser@example.com
To: bugs@openbsd.org
Subject: 3.3-beta panics on a SPARCStation2 

OpenBSD 3.2 installed from an official CD-ROM installed and ran fine
on this machine.

After doing a clean install of 3.3-beta from an FTP mirror, I find the
system randomly panics after a period of use, and predictably and
quickly when starting X.

This is the dmesg output:
  
OpenBSD 3.3-beta (GENERIC) #9: Mon Mar 17 12:37:18 MST 2003
    deraadt@sparc.openbsd.org:/usr/src/sys/arch/sparc/compile/GENERIC
real mem = 67002368
avail mem = 59125760
using 200 buffers containing 3346432 bytes of memory
bootpath: /sbus@1,f8000000/esp@0,800000/sd@1,0
mainbus0 (root): SUNW,Sun 4/75
cpu0 at mainbus0: CY7C601 @ 40 MHz, TMS390C602A FPU; cache chip bug
- trap page uncached
cpu0: 64K byte write-through, 32 bytes/line, hw flush cache enabled
memreg0 at mainbus0 ioaddr 0xf4000000
clock0 at mainbus0 ioaddr 0xf2000000: mk48t02 (eeprom)
timer0 at mainbus0 ioaddr 0xf3000000 delay constant 17
auxreg0 at mainbus0 ioaddr 0xf7400003
zs0 at mainbus0 ioaddr 0xf1000000 pri 12, softpri 6
zstty0 at zs0 channel 0 (console i/o)
zstty1 at zs0 channel 1
zs1 at mainbus0 ioaddr 0xf0000000 pri 12, softpri 6
zskbd0 at zs1 channel 0: reset timeout
zskbd0: no keyboard
zstty2 at zs1 channel 1: mouse
audioamd0 at mainbus0 ioaddr 0xf7201000 pri 13, softpri 4
audio0 at audioamd0
sbus0 at mainbus0 ioaddr 0xf8000000: clock = 20 MHz
dma0 at sbus0 slot 0 offset 0x400000: rev 1+
esp0 at sbus0 slot 0 offset 0x800000 pri 3: ESP100A, 25MHz, SCSI ID 7
scsibus0 at esp0: 8 targets
sd0 at scsibus0 targ 1 lun 0: &lt;SEAGATE, ST1480 SUN0424, 8628&gt; SCSI2 0/direct fixed
sd0: 411MB, 1476 cyl, 9 head, 63 sec, 512 bytes/sec, 843284 sec total
sd1 at scsibus0 targ 3 lun 0: &lt;COMPAQPC, DCAS-32160, S65A&gt; SCSI2 0/direct fixed
sd1: 2006MB, 8188 cyl, 3 head, 167 sec, 512 bytes/sec, 4110000 sec total
le0 at sbus0 slot 0 offset 0xc00000 pri 5: address 08:00:20:13:10:b9
le0: 16 receive buffers, 4 transmit buffers
cgsix0 at sbus0 slot 1 offset 0x0: SUNW,501-2325, 1152x900, rev 11
wsdisplay0 at cgsix0
wsdisplay0: screen 0 added (std, sun emulation)
fdc0 at mainbus0 ioaddr 0xf7200000 pri 11, softpri 4: chip 82072
fd0 at fdc0 drive 0: 1.44MB 80 cyl, 2 head, 18 sec
root on sd0a
rootdev=0x700 rrootdev=0x1100 rawdev=0x1102


This is the panic I got when attempting to start X:

panic: pool_get(mclpl): free list modified: magic=78746572; page 0xfaa93000;
 item addr 0xfaa93000
Stopped at      Debugger+0x4:   jmpl            [%o7 + 0x8], %g0
RUN AT LEAST 'trace' AND 'ps' AND INCLUDE OUTPUT WHEN REPORTING THIS PANIC!
DO NOT EVEN BOTHER REPORTING THIS WITHOUT INCLUDING THAT INFORMATION!
ddb&gt; trace
pool_get(0xfaa93000, 0x22, 0x0, 0x1000, 0x102, 0x0) at pool_get+0x2c0
sosend(0x16, 0xf828d800, 0x0, 0xf83b0900, 0x0, 0x0) at sosend+0x608
soo_write(0xfac0bf50, 0xfac0bf70, 0xfac9be28, 0xfab93190, 0xf8078f24, 0x0)
at soo_write+0x18
dofilewritev(0x0, 0xc, 0xfac0bf50, 0xf7fff198, 0x1, 0xfac0bf70) at
dofilewritev+0x12c
sys_writev(0xfac87508, 0xfac9bf28, 0xfac9bf20, 0xf80765c8, 0x1000, 0xfac0bf70)
at sys_writev+0x50
syscall(0x79, 0xfac9bfb0, 0x0, 0x154, 0xfcffffff, 0xf829dea0) at syscall+0x220
slowtrap(0xc, 0xf7fff198, 0x1, 0x154, 0x1, 0xfac87508) at slowtrap+0x1d8
ddb&gt; ps
   PID   PPID   PGRP    UID  S       FLAGS  WAIT       COMMAND
 27765   8819  29550      0  3        0x86  netio      xconsole
  1668  29550  29550      0  3      0x4086  poll       fvwm
 15447  29550  29550      0  3     0x44186  poll       xterm
  8819  29550  29550     35  3      0x4186  poll       xconsole
  1238  29550  29550      0  3      0x4086  poll       xclock
 29550  25616  29550      0  3      0x4086  pause      sh
  1024  25523  25523      0  3     0x40184  netio      XFree86
*25523  25616  25523     35  2     0x44104             XFree86
 25616  30876  30876      0  3      0x4086  wait       xinit
 30876  16977  30876      0  3      0x4086  pause      sh
 16977      1  16977      0  3      0x4086  ttyin      csh
  5360      1   5360      0  3        0x84  select     cron
 14701      1  14701      0  3     0x40184  select     sendmail
 12617      1  12617      0  3        0x84  select     sshd
 27515      1  27515      0  3       0x184  select     inetd
  1904      1   1904      0  2        0x84             syslogd
  9125      1   9125      0  3        0x84  poll       dhclient
     7      0      0      0  3    0x100204  crypto_wa  crypto
     6      0      0      0  3    0x100204  aiodoned   aiodoned
     5      0      0      0  3    0x100204  syncer     update
     4      0      0      0  3    0x100204  cleaner    cleaner
     3      0      0      0  3    0x100204  reaper     reaper
     2      0      0      0  3    0x100204  pgdaemon   pagedaemon
     1      0      1      0  3      0x4084  wait       init
     0     -1      0      0  3     0x80204  scheduler  swapper

Thank you!
</pre></td></tr></table>

<p>
V&eacute;ase <a href="../../es/report.html">report.html</a> para
m&aacute;s informaci&oacute;n sobre c&oacute;mo crear y enviar informes
sobre errores.  Si alguien cree que el error podr&iacute;a estar
relacionado <i>de alg&uacute;n modo</i> con su <i>hardware</i> o con la
configuraci&oacute;n de su <i>hardware</i>, ser&aacute; necesario que
tambi&eacute;n incluya informaci&oacute;n sobre su <i>hardware</i>.
Generalmente, la salida de la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>
ser&aacute; suficiente.  Tambi&eacute;n es necesaria una
descripci&oacute;n detallada del problema.  En el ejemplo se puede ver
que dmesg describ&iacute;a el <i>hardware</i>, la explicaci&oacute;n que
se inclu&iacute;a explicaba por qu&eacute; el usuario cre&iacute;a que
el sistema no estaba estropeado (anteriormente funcionaba con 3.2
correctamente), c&oacute;mo ocurri&oacute; el problema (iniciando X), y
la salida de la &oacute;rdenes <tt>ps</tt> y <tt>trace</tt> del
depurador, <tt>ddb</tt>.  En este caso, el usuario obtuvo esta salida
captur&aacute;ndola en una <a href="faq7.html#SerCon">consola serie</a>;
si no fuera posible usar una consola serie, ser&iacute;a necesario
escribir a mano el registro de la ca&iacute;da del sistema (el ejemplo
era el de un caso real en el que ese mismo informe ayud&oacute; a
solucionar el problema en los sistemas Sun4c).

<p>
Si se dispone de un sistema OpenBSD desde el que se pueda enviar el
informe sobre el error, es conveniente usar la utilidad 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a>
para enviar el informe a GNATS, el sistema de seguimiento de errores.
L&oacute;gicamente, no se puede usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a> 
si el sistema no arranca, pero en caso contrario hay que usarlo siempre
que sea posible.  Se debe incluir informaci&oacute;n detallada sobre el
problema que se ha tenido, la configuraci&oacute;n exacta del sistema, y
c&oacute;mo podemos reproducir el problema.  Para el uso de la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a> 
se requiere que el sistema pueda enviar correo electr&oacute;nico por
Internet.

<p>
Despu&eacute;s de enviar un informe de error a trav&eacute;s de
sendbug(1), se recibir&aacute; una notificaci&oacute;n por correo
electr&oacute;nico sobre el estado del informe.  Los desarrolladores
pueden contactar con la persona que haya enviado el informe para
requerirle m&aacute;s informaci&oacute;n o para que pruebe alg&uacute;n
parche.  Tambi&eacute;n se puede monitorizar los archivos de la lista de
correo <tt>bugs@openbsd.org</tt>.  V&eacute;ase la informaci&oacute;n en
la <a href="../../es/mail.html">p&aacute;gina sobre listas de correo</a>
para m&aacute;s detalles, o bien se puede realizar una b&uacute;squeda
en la base de datos de informes de error a trav&eacute;s del
<a href="../query-pr.html">Sistema de Seguimiento de Errores</a>.


<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq1.html">[Secci&oacute;n 1 - Introducc&oacute;n a OpenBSD]</a>
<a href="faq3.html">[Secci&oacute;n 3 - C&oacute;mo obtener OpenBSD]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq2.html,v 1.76 ]<br>
$Translation: faq2.html,v 1.48 2004/09/05 21:07:42 santana Exp $<br>
$OpenBSD: faq2.html,v 1.42 2004/09/06 16:51:03 saad Exp $
</small>
</body>
</html>
