<html>
<head>
<title>2.0 - Otros recursos de informaci&oacute;n sobre OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">2.0 - Otros recursos de informaci&oacute;n
sobre OpenBSD</font></h2>
<hr>
</p>

<p>
<ul><h3>Tabla de contenidos</h3>
   <li><a href="#WebSites">2.1 - P&aacute;ginas en
   Internet</a></li>
   <li><a href="#MailLists">2.2 - Listas de correo</a></li>
   <li><a href="#ManPages">2.3 - P&aacute;ginas del
   manual</a></li>
   <li><a href="#Bugs">2.4 - Env&iacute;o de informes sobre
   errores</a></li>
</ul>
</p>

<hr>

<p>
<a name= "WebSites"></a>
<a name="2.1"></a>
<h2>2.1 - P&aacute;ginas de inter&eacute;s en Internet</h2>
</p>

<p>
El sitio oficial en Internet del Proyecto OpenBSD est&aacute; ubicado
en:<br> 
<a href="http://www.openbsd.org/es/">http://www.OpenBSD.org/es/</a>
</p>

<p>
Aqu&iacute; puede encontrar mucha informaci&oacute;n &uacute;til
relacionada con todos los aspectos del Proyecto OpenBSD.
</p>

<p>
Tambi&eacute;n se puede encontrar informaci&oacute;n dirigida a los
usuarios de port&aacute;tiles en:<br>
<a href="http://www.monkey.org/openbsd-mobile/">http://www.monkey.org/openbsd-mobile/</a>
</p>

<br>

<p>
<a name= "MailLists"></a>
<a name="2.2"></a>
<h2>2.2 - Listas de correo</h2>
</p>

<p>
El Proyecto OpenBSD mantiene varias listas de correo a las que los
usuarios deber&iacute;an subscribirse.  Para darse de alta en una lista
de correo, env&iacute;e un mensaje a
<a href="mailto:majordomo@openbsd.org">majordomo@openbsd.org</a>.  Esta
direcci&oacute;n es un servicio de subscripci&oacute;n
autom&aacute;tica.  En el contenido del mensaje, en una sola
l&iacute;nea, debe incluir la orden <kbd>subscribe</kbd> seguida del
nombre de la lista a la que desea subscribirse.  Por ejemplo:
</p>

<ul>
<strong><pre>subscribe announce</pre></strong>
</ul>

<p>
El procesador de la lista le contestar&aacute;, pidi&eacute;ndole que
confirme su intento de darse de alta en la lista.  La
confirmaci&oacute;n que Vd. env&iacute;e de vuelta al procesador de la
lista se incluir&aacute; en la respuesta que &eacute;ste le
env&iacute;e.  Le enviar&aacute; una opci&oacute;n para usar
un enlace de hipertexto o para enviar una respuesta al mensaje
para confirmar el intento.  El mensaje de respuesta debe
contener algo parecido a lo siguiente:

<ul>
<strong><pre>auth 90855167 subscribe announce you@example.com</pre></strong>
</ul>

Una vez haya enviado la confirmaci&oacute;n de esta autorizaci&oacute;n
de vuelta y el procesador le haya confirmado su alta, su
direcci&oacute;n ser&aacute; inmediatamente a&ntilde;adida a la lista,
y el procesador le notificar&aacute; que ha sido a&ntilde;adido a la
lista con &eacute;xito.
</p>

<p>
Para darse de baja de una lista, vuelva a enviar un mensaje a 
<a href="mailto:majordomo@openbsd.org">majordomo@openbsd.org</a> con la
orden <kbd>unsubscribe</kbd> seguida del nombre de la lista.  Algo
as&iacute;:

<ul>
<strong><pre>unsubscribe announce</pre></strong>
</ul>
</p>

<p>
Si tiene dificultad con el sistema de las listas de correo, por favor
lea antes las instrucciones.  Puede obtenerlas enviando un mensaje a 
<a href="mailto:majordomo@openbsd.org">majordomo@openbsd.org</a> con la
orden <kbd>help</kbd> en el contexto.  Algunas de las listas
de distribuci&oacute;n de OpenBSD m&aacute;s conocidas son:
</p>

<ul>
   <li><strong>announce</strong> - Anuncios importantes.
   Lista con poco tr&aacute;fico.</li> 
   <li><strong>security-announce</strong> - Anuncios sobre
   temas de seguridad.</li>
   <li><strong>misc</strong> - Preguntas y respuestas
   generales.  &Eacute;sta es la lista m&aacute;s activa, y la
   mayor&iacute;a de preguntas deber&iacute;an ser enviadas a
   esta lista.</li>
   <li><strong>tech</strong> - Temas t&eacute;cnicos para los
   desarrolladores y usuarios avanzados de OpenBSD.  Por
   favor, env&iacute;e sus dudas de &laquo;nuevo
   usuario&raquo; y las relacionadas con la instalaci&oacute;n
   a <em>misc</em>, no a <em>tech</em>.  No env&iacute;e
   mensajes cruzados a <em>misc</em> y <em>tech</em>.</li>
   <li><strong>bugs</strong> - Errores recibidos por
   sendbug(1) y debates sobre estos errores.</li>
   <li><strong>source-changes</strong> - Lista de
   distribuci&oacute;n de correo automatizada de los cambios
   en el &aacute;rbol de fuentes del CVS.</li>
   <li><strong>ports</strong> - Discusi&oacute;n sobre el
   &aacute;rbol de portes de OpenBSD.</li>
   <li><strong>advocacy</strong> - Difusi&oacute;n de
   OpenBSD.</li>
   <li><strong>ports-changes</strong> - Lista de
   distribuci&oacute;n de correo automatizada de los cambios
   espec&iacute;ficos a los portes en el &aacute;rbol de
   fuentes del CVS.</li>
</ul> 
</p>

<p>
Antes de enviar una pregunta a <strong>misc</strong> o a
cualquier otra lista compruebe los archivos, ya que la
mayor&iacute;a de preguntas comunes han sido ya formuladas en
repetidas ocasiones.  A pesar de que sea la primera vez que se
encuentre con el problema o la duda, es posible que otros
subscriptores en las listas de correo lo hayan tratado ya
varias veces en semanas anteriores, y pueden encontrar molesto
volverlo a ver.  En la p&aacute;gina <em>web</em> sobre listas
de correo puede encontrar enlaces a varios archivos y otras
recomendaciones sobre el uso de las listas de correo:
Se pueden ver los archivos de los mensajes de correo de las listas de
OpenBSD visitando la p&aacute;gina que trata sobre listas de correo:
<a href="../../es/mail.html">http://www.openbsd.org/es/mail.html</a>.
</p>

<p>
Otra lista de correo que puede ser de inter&eacute;s es 
<a href="mailto:openbsd-mobile@monkey.org">openbsd-mobile@monkey.org</a>. 
Esta lista trata sobre el uso de OpenBSD en port&aacute;tiles.

<p>
Puede subscribirse a esta lista del siguiente modo:

<ul>
<kbd>'echo subscribe | mail &quot;openbsd-mobile-request@monkey.org&quot;'</kbd>
</ul>

<p>
Los archivos de esta lista se pueden encontrar en:
<a href="http://www.monkey.org/openbsd-mobile/archive/">http://www.monkey.org/openbsd-mobile/archive/</a>
</p>

<br>

<p> 
<a name= "ManPages"></a>
<a name="2.3"></a>
<h2>2.3 - P&aacute;ginas del manual</h2>
</p>

<p>
OpenBSD viene con una extensa documentaci&oacute;n en forma de
p&aacute;ginas del manual (<em>&quot;man pages&quot;</em>), as&iacute;
como de documentos m&aacute;s extensos sobre aplicaciones
espec&iacute;ficas.  Para acceder a las p&aacute;ginas del manual y
dem&aacute;s documentaci&oacute;n, aseg&uacute;rese de haber instalado
las distribuciones de <em>man</em> y <em>misc</em>.
</p>

<p>
He aqu&iacute; una lista de las p&aacute;ginas del manual m&aacute;s
&uacute;tiles para los usuarios noveles:

<ul>
    <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=help&apropos=0&sektion=1&format=html"> help(1)</a></strong> - ayuda para usuarios y administradores nuevos</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&apropos=0&sektion=8&format=html">afterboot(8)</a></strong> - primeras comprobaciones despu&eacute;s de iniciar el sistema por primera vez</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=boot&apropos=0&sektion=8&arch=i386">boot(8)</a></strong> - procedimientos de arranque del sistema.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=login.conf&apropos=0&sektion=5&format=html">login.conf(5)</a></strong> - formato del fichero de configuraci&oacute;n de la clase de ingreso</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&apropos=0&sektion=8&format=html">adduser(8)</a></strong> - orden para a&ntilde;adir nuevos usuarios.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&apropos=0&sektion=8&format=html">vipw(8)</a></strong> - edici&oacute;n del fichero <em>password</em>.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=man&apropos=0&sektion=1&format=html">man(1)</a></strong> - uso de las p&aacute;ginas del manual.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&apropos=0&sektion=1&format=html">sendbug(1)</a></strong> - enviar un informe sobre un problema (PR) en OpenBSD al sitio central de asistencia.</li>

   <li> <strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&apropos=0&sektion=8&format=html">disklabel(8)</a></strong> - leer y escribir las clasificaciones del disco.</li>

   <li> <strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=ifconfig&apropos=0&sektion=8&format=html">ifconfig(8)</a></strong> - configurar los par&aacute;metros de la interfaz de red.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=route&apropos=0&sektion=8&format=html">route(8)</a></strong> - manipulaci&oacute;n manual de las tablas de enrutamiento.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=netstat&apropos=0&sektion1&format=html">netstat(1)</a></strong> - estado de la red.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=reboot&apropos=0&sektion=8&format=html">reboot, halt(8)</a></strong> - parar y reiniciar el sistema.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=shutdown&apropos=0&sektion=8&format=html">shutdown(8)</a></strong> - cerrar el sistema en un tiempo especificado.</li>

   <li><strong><a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&apropos=0&sektion=8&format=html">boot_config(8)</a></strong> - cambiar la configuraci&oacute;n del n&uacute;cleo del sistema (<em>&quot;kernel&quot;</em>) durante el arranque.</li>
</ul>
</p>

<p>
Si no instal&oacute; el paquete <em>man31.tgz</em> durante la
instalaci&oacute;n del sistema, puede encontrar todas las
p&aacute;ginas del manual de OpenBSD en formato de hipertexto
en <a href="http://www.openbsd.org/cgi-bin/man.cgi">http://www.openbsd.org/cgi-bin/man.cgi</a>.
</p>

<p>
Por regla general, si conoce el nombre de una orden o de una
p&aacute;gina del manual la puede leer ejecutando <kbd>man
&lt;orden&gt;</kbd>, en donde <kbd>&lt;orden&gt;</kbd> es el nombre de
la orden o funci&oacute;n sobre la que desea informaci&oacute;n.  Por
ejemplo, <kbd>man vi</kbd> para leer sobre el editor vi.  Si no conoce
el nombre de la orden o funci&oacute;n, o si <kbd>man
&lt;orden&gt;</kbd> no encuentra la p&aacute;gina del manual que busca,
puede realizar una b&uacute;squeda entre la base de datos de las
p&aacute;ginas del manual ejecutando <kbd>apropos &lt;clave&gt;</kbd> o
<kbd>man -k &lt;clave&gt;</kbd>, en donde <kbd>&lt;clave&gt;</kbd> sea
una palabra que pueda aparecer en el t&iacute;tulo de la p&aacute;gina
del manual que desee consultar.  Por ejemplo:

<ul>
<pre>
bsd# <strong>apropos &quot;time zone&quot;</strong>
tzfile (5) - time zone information
zdump (8) - time zone dumper
zic (8) - time zone compiler
</pre>
</ul>
</p>

<p>
Los n&uacute;meros entre par&eacute;ntesis indican la secci&oacute;n
del manual en la que se puede encontrar esa p&aacute;gina.  En algunos
casos se puede dar que para una misma orden o funci&oacute;n exista
m&aacute;s de una p&aacute;gina del manual con el mismo nombre, en
secciones separadas del manual.  Pongamos como ejemplo que necesitara
saber el formato de los ficheros de configuraci&oacute;n para el
d&aelig;mon <em>cron</em>.  Una vez que supiera la secci&oacute;n del
manual para la p&aacute;gina que deseara consultar, ejecutar&iacute;a
<kbd>man &lt;n&gt; &lt;orden&gt;</kbd>, en donde <kbd>&lt;n&gt;</kbd>
ser&iacute;a el n&uacute;mero de la secci&oacute;n del manual.

<ul>
<pre>
bsd# <strong>man -k cron</strong>
cron (8) - daemon to execute scheduled commands (Vixie Cron)
crontab (1) - maintain crontab files for individual users (V3)
crontab (5) - tables for driving cron
bsd# <strong>man 5 crontab</strong>
</pre>
</ul>
</p>

<p>
Adem&aacute;s de las p&aacute;ginas del manual de UNIX, existe una
documentaci&oacute;n a la que se puede dar formato y que est&aacute;
incluida en la distribuci&oacute;n <em>misc</em>.  Se puede encontrar
en el directorio <em>/usr/share/doc</em>.  Si instal&oacute; la
distribuci&oacute;n <em>text</em>, puede dar formato a cada grupo de
documentos con la orden <kbd>make</kbd> desde el subdirectorio
apropiado.  El subdirectorio <em>psd</em> es el de la
distribuci&oacute;n <em>&quot;Programmer's Supplementary
Documents&quot;</em> (Documentos Suplementarios para el Programador);
el subdirectorio <em>smm</em> es el de <em>&quot;System Manager's
Manual&quot;</em> (Manual de Gesti&oacute;n del Sistema);  y el
subdirectorio <em>usd</em> es el de <em>&quot;UNIX User's Supplementary
Documents&quot;</em> (Documentos Suplementarios del Usuario de UNIX).
Puede llevar a cabo la ejecuci&oacute;n de '<kbd>make</kbd>' sobre las
tres distribuciones, o puede hacerlo sobre cada una de ellas por
separado desde el correspondiente subdirectorio.  Algunos de los
subdirectorios se encuentran vac&iacute;os.  El formato del documento
predeterminado ser&aacute; Postscript, un formato ideal para la
impresi&oacute;n de los documentos.  El resultado de la salida en
Postscript suele ser bastante voluminoso;  calcule un incremento en
volumen de entre 250% y 300%.  Si no tiene acceso a una impresora con
capacidad para Postscript o a un visualizador de este formato,
tambi&eacute;n puede dar formato a los documentos en texto simple.
Para ello deber&aacute; a&ntilde;adir en cada fichero <em>Makefile</em>
el indicador <kbd>-Tascii</kbd> para cada una de las &oacute;rdenes de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=groff&sektion=1&apropops=0&manpath=OpenBSD+Current">groff(1)</a>
(o ejecutarlo a mano).  Algunos documentos usan macros de formato ms, y
otros macros me.  El fichero <em>Makefile</em> existente en cada
subdirectorio de documentos (v.g.
<em>/usr/share/doc/usd/04.csh/Makefile</em>) le indicar&aacute;
cu&aacute;l puede usar.  Por ejemplo:

<ul>
<pre>
bsd# <strong>cd /usr/share/doc/usd/04.csh</strong>
bsd# <strong>groff -Tascii -ms tabs csh.1 csh.2 csh.3 csh.4 csh.a csh.g &gt; csh.txt</strong> 
bsd# <strong>more csh.txt</strong>
</pre>
</ul>
</p>

<p>
Las p&aacute;ginas del manual de UNIX est&aacute;n, por lo general,
m&aacute;s actualizadas y son por tanto m&aacute;s fiables que los
documentos formateables.  Los documentos formateables algunas veces
aclaran aplicaciones complicadas con m&aacute;s detalle que las
p&aacute;ginas del manual.
</p>

<p>
Para muchos usuarios puede ser de gran utilidad el tener una copia
impresa de las p&aacute;ginas del manual.  A continuaci&oacute;n se
explica c&oacute;mo obtener un copia imprimible de una p&aacute;gina
del manual.
</p>

<h3>&iquest;C&oacute;mo puedo ver el fichero fuente de una p&aacute;gina del manual?  (o sea, aqu&eacute;l cuyo nombre acabe en n&uacute;mero, como tcpdump.8).</h3>

<p>
Esto es lo que ocurre en el &aacute;rbol de fuentes.  Las
p&aacute;ginas del manual se encuentran dentro del
&aacute;rbol sin formatear, y muchas veces se actualizan
mediante el uso de <a href="faq8.html#CVS">CVS</a>.  Para
poder ver esas p&aacute;ginas:

<ul>
<pre>
<strong>
# nroff -mdoc &lt;fichero&gt; | more
</strong>
</pre>
</ul>
</p>


<h3>&iquest;C&oacute;mo puedo obtener una p&aacute;gina del manual sin caracteres de control o de formato?</h3>

<p>
Esto es &uacute;til para obtener una salida directa, sin caracteres no
imprimibles:

<ul>
<pre>
<strong>
# man &lt;orden&gt; | col -b
</strong>
</pre>
</ul>
</p>

<h3>&iquest;C&oacute;mo puedo obtener una copia en Postscript de una p&aacute;gina del manual lista para la impresi&oacute;n?</h3>

<p>
Note que [man_src_file] debe ser el fichero de fuentes de la
p&aacute;gina del manual (probablemente un fichero que termine en un
n&uacute;mero;  p. ej.  tcpdump.8).  Las versiones en formato Postscript
de las p&aacute;ginas del manual son muy vistosas.  Se pueden imprimir o
se pueden visualizar en pantalla con un programa como gv (GhostView).
Se puede obtener GhostView desde nuestro 
<a href="../../es/ports.html">&aacute;rbol de portes</a>.
Use las siguientes opciones para la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=groff&sektion=1&apropops=0&manpath=OpenBSD+Current">groff(1)</a>
a fin de obtener una versi&oacute;n en formato PostScript de un
p&aacute;gina del manual del sistema OpenBSD:
</p>

<ul>
<pre>
<strong>
# groff -mdoc -Tps [man_src_file] &gt; outfile.ps
</strong>
</pre>
</ul>

<p>
La l&iacute;nea de &oacute;rdenes anterior s&oacute;lo
funcionar&aacute; con p&aacute;ginas del manual cuyo formato sea el del
paquete de macros
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mdoc&sektion=7&apropos=0&manpath=OpenBSD+Current">mdoc(7)</a>,
utilizado por las p&aacute;ginas del manual de BSD.  Para obtener una
versi&oacute;n en formato PostScript de la p&aacute;gina del manual de
un programa de un tercero (ya sea compilado por uno mismo o instalado
desde los portes
[<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&sektion=7&apropos=0&manpath=OpenBSD+Current">ports(7)</a>]
o paquetes
[<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=packages&sektion=7&apropos=0&manpath=OpenBSD+Current">packages(7)</a>]), haga lo siguiente:
</p>

<ul>
<pre>
<strong>
# groff -Tps -mandoc [man_src_file] &gt; outfile.ps
</strong>
</pre>
</ul>
</p>

<br>

<p>
<a name= "Bugs"></a>
<a name= "2.4"></a>
<h2>2.4 - C&oacute;mo enviar informes sobre errores</h2>
</p>

<p>
Antes de enviar un informe sobre cualquier error, por favor lea 
<a href="../../es/report.html">http://www.openbsd.org/es/report.html</a>
</p>

<p>
Un informe sobre un error bien hecho es una de las responsabilidades
m&aacute;s importantes de los usuarios finales.  Se requiere una
informaci&oacute;n muy detallada para poder diagnosticar los errores
m&aacute;s serios.  Los desarrolladores suelen recibir informes por
correo electr&oacute;nico como el siguiente:

<ul>
<em>
<pre>
From: joeuser@example.com
To: bugs@openbsd.org
Subject: HELP!!!

&iexcl;&iexcl;&iexcl;Tengo un PC que no arranca!!!
&iexcl;&iexcl;&iexcl;&iexcl;Es un 486!!!!

</pre>
</em>
</ul>
</p>

<p>
Espero que puedan entender porqu&eacute; este tipo de
&laquo;informes&raquo; son eliminados sin m&aacute;s.  Todos los
informes sobre errores deben contener informaci&oacute;n detallada.  Si
el usuario del mensaje anterior hubiera querido realmente que el error
sobre el que informaba hubiera sido investigado, habr&iacute;a dado
m&aacute;s informaci&oacute;n;  algo as&iacute;:
</p>
<p>
(Nota:  v&eacute;ase <a href="../../es/report.html">report.html</a>
para m&aacute;s informaci&oacute;n sobre c&oacute;mo crear y
entregar informes de errores.  B&aacute;sicamente, la
informaci&oacute;n detallada sobre su <em>hardware</em> es
necesaria si cree que el error est&aacute; relacionado de
alguna manera con su <em>hardware</em> o con la
configuraci&oacute;n de su <em>hardware</em>.  Por lo general,
la salida de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&sektion=8&apropos=0&manpath=OpenBSD+Current">dmesg(8)</a>
es suficiente para esto.  Adem&aacute;s es necesaria una
descripci&oacute;n detallada de su problema)
</p>

<ul>
<pre>
From: smartuser@example.com
To: bugs@openbsd.org
Subject: 2.7 panics on an i386

After installing OpenBSD 2.7 from the CD which I purchased via your
outstanding on-line ordering system, I find that the system halts when
using any network utilities.  After booting with a bootdisk and
escaping to a shell. This is the dmesg output:
  
OpenBSD 2.7 (GENERIC) #690: Fri Oct 29 16:32:17 MDT 1999
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
cpu0: F00F bug workaround installed
cpu0: Intel Pentium (P54C) ("GenuineIntel" 586-class) 120 MHz
cpu0: FPU,V86,DE,PSE,TSC,MSR,MCE,CX8
BIOS mem  = 654336 conventional, 15728640 extended
real mem  = 16384000
avail mem = 11112448
using 225 buffers containing 921600 bytes of memory
mainbus0 (root)
bios0 at mainbus0: AT/286+(63) BIOS, date 08/20/96
bios0: diskinfo 0xe055800c cksumlen 1 memmap 0xe0558088 apminfo 0xe0558134
apm0 at bios0: Power Management spec V1.1
apm0: battery life expectancy 95%
apm0: AC on, battery charge high, charging, estimated 1:27 minutes
pci0 at mainbus0 bus 0: configuration mode 1 (no bios)
pchb0 at pci0 dev 0 function 0 "Toshiba (2nd ID) Host-PCI" rev 0x11
&quot;Chips and Technologies 65550&quot; rev 0x04 at pci0 dev 4 function 0 not configured
isa0 at mainbus0
isadma0 at isa0
wdc0 at isa0 port 0x1f0/8 irq 14
wd0 at wdc0 channel 0 drive 0: &lt;TOSHIBA MK2720FC&gt;
wd0: can use 16-bit, PIO mode 4
wd0: 16-sector PIO, LBA, 1296MB, 2633 cyl, 16 head, 63 sec, 2654280 sectors
sb0 at isa0 port 0x220/24 irq 5 drq 1: dsp v3.02
midi0 at sb0: &lt;SB MIDI UART&gt;
audio0 at sb0
opl0 at sb0: model OPL3
midi1 at opl0: &lt;SB Yamaha OPL3&gt;
wss0 at isa0 port 0x530/8 irq 10 drq 0: CS4232 (vers 63)
audio1 at wss0
pcppi0 at isa0 port 0x61
midi2 at pcppi0: &lt;PC speaker&gt;
sysbeep0 at pcppi0
npx0 at isa0 port 0xf0/16: using exception 16
pccom0 at isa0 port 0x3f8/8 irq 4: ns16550a, 16 byte fifo
pccom1 at isa0 port 0x2f8/8 irq 3: ns16550a, 16 byte fifo
pccom2: irq 5 already in use
vt0 at isa0 port 0x60/16 irq 1: generic VGA, 80 col, color, 8 scr, mf2-kbd
pms0 at vt0 irq 12
fdc0 at isa0 port 0x3f0/6 irq 6 drq 2
fd0 at fdc0 drive 0: 1.44MB 80 cyl, 2 head, 18 sec
pcic0 at isa0 port 0x3e0/2 iomem 0xd0000/16384
pcic0 controller 0: &lt;Intel 82365SL rev 1&gt; has sockets A and B
pcmcia0 at pcic0 controller 0 socket 0
pcmcia1 at pcic0 controller 0 socket 1
ne3 at pcmcia1 function 0 &quot;Linksys, EtherFast 10/100 PC Card (PCMPC100), &quot; port 0x340/16 irq 9
ne3: address 00:e0:98:04:95:ba
pcic0: irq 11
biomask 4040 netmask 4240 ttymask 5a42
pctr: 586-class performance counters and user-level cycle counter enabled
dkcsum: wd0 matched BIOS disk 80
root on wd0a
rootdev=0x0 rrootdev=0x300 rawdev=0x302

Thank you!
</pre>
</ul>
</p>

<p>
Si tiene un sistema OpenBSD en funcionamiento desde el que pueda enviar
el informe sobre el error, use la utilidad 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&sektion=1&format=html">sendbug(1)</a>
para enviar su informe al sistema de seguimiento de errores GNATS.
L&oacute;gicamente no podr&aacute; usar 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&sektion=1&format=html">sendbug(1)</a> 
si su sistema no arranca, pero en caso contrario debe usarlo siempre
que sea posible.  Debe incluir informaci&oacute;n detallada sobre el
problema que ha tenido, la configuraci&oacute;n exacta de su sistema, y
c&oacute;mo podemos reproducir el problema.  La orden 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&sektion=1&format=html">sendbug(1)</a> 
requiere que su sistema pueda enviar correo electr&oacute;nico por
Internet.
</p>

<p>
Para comprobar el estado de investigaci&oacute;n en el que se encuentra
el informe que Vd. haya enviado, las mejores maneras son:
</p>

<p>
<ul>
   <li>Visitar el sistema de seguimiento de GNATS:
       <a href="http://cvs.openbsd.org/cgi-bin/wwwgnats.pl">http://cvs.openbsd.org/cgi-bin/wwwgnats.pl</a>.</li>
    <li>Mirar en la lista:
        <a href="mailto:bugs@openbsd.org">bugs@openbsd.org</a>
        (archivos de las listas:
        <a href="../../es/mail.html">http://www.openbsd.org/es/mail.html</a>).</li>
</ul>
</p>

<p>
<font color="#0000e0">
<a href="index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq1.html">[Secci&oacute;n 1.0 - Introducc&oacute;n a OpenBSD]</a>
<a href="faq3.html">[Secci&oacute;n 3.0 - C&oacute;mo obtener OpenBSD]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq2.html,v 1.46 2002/05/29 17:54:35 nick Exp ]<br>
$Translation: faq2.html,v 1.27 2002/06/04 17:59:07 horacio Exp $<br>
$OpenBSD: faq2.html,v 1.21 2002/06/06 18:40:00 jufi Exp $
</small>
</p>
</body>
</html>
