<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>3 - C&oacute;mo obtener OpenBSD</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq2.html">[Secci&oacute;n 2 - Otros recursos para OpenBSD]</a>
<a href="faq4.html">[Secci&oacute;n 4 - Gu&iacute;a de instalaci&oacute;n]</a>
</font>
 
<h1><font color="#e00000">3 - C&oacute;mo obtener OpenBSD</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#BuyCD">3.1 - C&oacute;mo adquirir OpenBSD en CDROM</a>
<li><a href="#BuyTShirts">3.2 - C&oacute;mo comprar las camisetas de
OpenBSD</a>
<li><a href="#ISO">3.3 - &iquest;Existe alguna imagen ISO producida por
el proyecto OpenBSD?</a>
<li><a href="#FTP">3.4 - C&oacute;mo descargar OpenBSD por FTP o AFS</a>
<li><a href="#GetCurrent">3.5 - C&oacute;mo obtener el c&oacute;digo
fuente de la versi&oacute;n en desarrollo</a>
</ul>

<hr>

<p>
<a name="BuyCD"></a>
<h2>3.1 - C&oacute;mo adquirir OpenBSD en CDROM</h2>

<p>
La forma m&aacute;s f&aacute;cil para empezar a usar OpenBSD es
comprando los CD.  En la p&aacute;gina de pedidos,
<a href="../../es/orders.html">http://www.openbsd.org/es/orders.html</a>,
se encuentra la informaci&oacute;n relacionada con la adquisici&oacute;n
de los CD.

<p>
Existen muchas razones de peso para tener OpenBSD en CDROM:
<ul>
   <li>La venta de los CD ayuda a la continuidad de OpenBSD.
   <li>El desarrollo de un sistema operativo multiplatforma requiere de
   una inversi&oacute;n constante en equipos y componentes.
   <li>El apoyo que supone la compra de los CD tiene un impacto real en
   el desarrollo de futuras versiones.
   <li>Los CD contienen el c&oacute;digo binario (y el c&oacute;digo
   fuente) de todas las plataformas para las que existe soporte.
   <li>Se puede arrancar el sistema de instalaci&oacute;n directamente
   desde el CDROM en varias plataformas, y se puede usar como mecanismo
   de arranque de una m&aacute;quina que no tenga ning&uacute;n sistema
   operativo preinstalado.
   <li>Los CD son &uacute;tiles como mecanismo de arranque aun cuando se
   haya decidido instalar una versi&oacute;n preliminar
   (<em>snapshot</em>).
   <li>&iexcl;La instalaci&oacute;n desde el CDROM es mucho m&aacute;s
   r&aacute;pida!  Instalando el sistema desde los CD se ahorran
   recursos de conexi&oacute;n a la red.
   <li>Los CD de OpenBSD siempre traen adhesivos curiosos.  Un sistema
   no estar&aacute; completo sin &eacute;stos.  Estos adhesivos
   s&oacute;lo se pueden conseguir comprando los CD o donando
   equipamiento.
</ul>

<p>
Para instalar una versi&oacute;n final (<em>-release</em>) de OpenBSD se
debe utilizar un CD.

<p>
<a name="BuyTShirts"></a>
<h2>3.2 - Camisetas de OpenBSD</h2>

<p>
OpenBSD produce camisetas para el disfrute de sus usuarios.  Los modelos
existentes se pueden ver en <a href="../../es/tshirts.html">
http://www.OpenBSD.org/es/tshirts.html</a>.  &iexcl;A disfrutarlas! :)

<p>
<a name="ISO"></a>
<h2>3.3 - &iquest;Existe alguna imagen ISO compuesta por el proyecto
OpenBSD?</h2>

<p>
Otros sistemas operativos de c&oacute;digo abierto se suelen distribuir
como im&aacute;genes ISO en CD-ROM.  &Eacute;sta <i>no</i> es la forma
en la que se distribuyen OpenBSD.

<p>
El proyecto OpenBSD no hace p&uacute;blicas las im&aacute;genes ISO que
usa para producir los CD oficiales.  El motivo es que nos
gustar&iacute;a que los usuarios adquirieran los CD, ayudando de este
modo a recolectar fondos para el desarrollo de OpenBSD.  Los derechos
sobre la composici&oacute;n del CDROM oficial de OpenBSD pertenecen a
Theo de Raadt.  Theo no permite la redistribuci&oacute;n de los CD
oficiales de OpenBSD por parte del p&uacute;blico.  A modo de incentivo
para que los usuarios compren los CD, tambi&eacute;n se incluyen algunos
peque&ntilde;os extras en el paquete (logotipos e im&aacute;genes,
adhesivos, etc...).

<p>
Estos derechos s&oacute;lo son aplicables a la composici&oacute;n del
CD, mientras que el sistema OpenBSD en s&iacute; mismo es de libre
distribuci&oacute;n.  Nada impide que alguien se baje OpenBSD y componga
una imagen de CD.  Si por alg&uacute;n motivo alguien quiere bajarse la
imagen del CD, puede encontrar informaci&oacute;n a este respecto entre
los archivos de las listas de correo.  Cualquier imagen ISO de OpenBSD
que pueda existir en Internet es una imagen no oficial, o una
violaci&oacute;n de los derechos de Theo de Raadt.  La fuente de una
imagen no oficial puede o no ser de fiar, y por lo tanto corresponde al
usuario el determinar el grado de fiabilidad.

<p>
Aconsejamos que cualquiera que desee bajarse OpenBSD de forma gratuita,
lo haga mediante la opci&oacute;n de instalaci&oacute;n por FTP.  Para
quienes necesiten un CD de arranque para su sistema, hay disponibles
im&aacute;genes ISO con disco de arranque (llamada <tt>cd33.iso</tt>)
para varias plataformas que permiten que el resto del sistema se instale
a trav&eacute;s de FTP.  Estas im&aacute;genes ISO s&oacute;lo ocupan unos
pocos megabytes, y solamente contienen las herramientas de
instalaci&oacute;n, no los archivos de instalaci&oacute;n.

<p>
<a name="FTP"></a>
<h2>3.4 - Obtenci&oacute;n de OpenBSD mediante FTP o AFS</h2>

<p>
Existen muchas r&eacute;plicas internacionales que ofrecen acceso por
FTP a las versiones de OpenBSD.  Tambi&eacute;n existe acceso por AFS.
Es aconsejable usar siempre el servidor geogr&aacute;ficamente
m&aacute;s cercano.  Antes de empezar a bajarse cualquier
versi&oacute;n, es conveniente usar las utilidades
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ping&amp;sektion=8">ping(8)</a> y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=traceroute&amp;sektion=8">traceroute(8)</a>
para determinar en qu&eacute; servidor se encuentra la r&eacute;plica
m&aacute;s pr&oacute;xima, y si &eacute;sta funciona correctamente.  Por
supuesto que la r&eacute;plica m&aacute;s pr&oacute;xima siempre
ser&aacute; el CD de OpenBSD.  A continuaci&oacute;n puede verse la
informaci&oacute;n sobre c&oacute;mo acceder a OpenBSD:

<p>
<a href="../../es/ftp.html">http://www.openbsd.org/es/ftp.html</a>.

<p>
<a name= "GetCurrent"></a>
<h2>3.5 - Obtenci&oacute;n del c&oacute;digo fuente de la versi&oacute;n
en desarrollo</h2>

<p>
El c&oacute;digo fuente de OpenBSD es de libre redistribuci&oacute;n, y
de disponibilidad gratuita.  Por regla general, el mejor modo para
empezar con un &aacute;rbol de fuentes de la versi&oacute;n en
desarrollo (<em>-current</em>) es instalando el c&oacute;digo fuente
desde un CD reciente, y a partir de ah&iacute; configurar AnonCVS para
poder actualizar el c&oacute;digo con regularidad.  La
informaci&oacute;n sobre AnonCVS, incluida la configuraci&oacute;n,
puede verse en:

<p>
<a href="../../es/anoncvs.html">
http://www.openbsd.org/es/anoncvs.html</a>. 

<p>
o en la <a href="faq8.html#CVS">secci&oacute;n sobre <tt>CVS</tt></a>
del cap&iacute;tulo 8 de estos documentos.

<p>
Si el ancho de banda de red del que se dispone no es suficiente para el
soporte de AnonCVS, o si el acceso a Internet es por UUCP,
tambi&eacute;n es posible mantener el c&oacute;digo fuente actualizado
usando CTM en lugar de AnonCVS.  En tal caso es de suma importancia que
se empiece desde una versi&oacute;n del CD.  La informaci&oacute;n sobre
CTM, incluida la configuraci&oacute;n, puede verse en:

<p>
<a href="../../es/ctm.html">http://www.openbsd.org/es/ctm.html</a>.

<p>
Otra alternativa es la obtenci&oacute;n del c&oacute;digo fuente a
trav&eacute;s de la <em>web</em> (http).  Esto se puede hacer mediante
la interfaz de <em>cvsweb</em> en:
<a href="http://www.openbsd.org/cgi-bin/cvsweb/">
http://www.openbsd.org/cgi-bin/cvsweb/</a>.


<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq2.html">[Secci&oacute;n 2 - Otros recursos para OpenBSD]</a>
<a href="faq4.html">[Secci&oacute;n 4 - Gu&iacute;a de instalaci&oacute;n]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq3.html,v 1.40 2003/07/23 01:53:01 nick Exp ]<br>
$Translation: faq3.html,v 1.36 2003/07/26 16:34:03 horacio Exp $<br>
$OpenBSD: faq3.html,v 1.31 2003/07/27 15:30:08 jufi Exp $
</small>
</body>
</html>
