<html>
<head>
<title>3.0 - C&oacute;mo obtener OpenBSD</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">3.0 - C&oacute;mo obtener OpenBSD</font></h2>
<hr>

<p>
<ul><h3>&Iacute;ndice de contenidos</h3>
<li><a href="#BuyCD">3.1 - C&oacute;mo adquirir OpenBSD en
CDROM</a>
<li><a href="#BuyTShirts">3.1.1 - Camisetas de OpenBSD</a>
<li><a href="#ISO">3.1.2 - &iquest;D&oacute;nde se obtiene una
imagen ISO?</a>
<li><a href="#FTP">3.2 - C&oacute;mo obtener OpenBSD por FTP o
AFS</a>
<li><a href="#GetCurrent">3.3 - C&oacute;mo obtener el c&oacute;digo
fuente de la versi&oacute;n en desarrollo</a>
</ul>

<hr>

<br>

<p>
<a name= "BuyCD"></a>
<a name="3.1"></a>
<h2>3.1 - C&oacute;mo adquirir OpenBSD en CDROM</h2>

<p>
La forma m&aacute;s f&aacute;cil para empezar a usar OpenBSD es
adquiri&eacute;ndolo en CD.  En la p&aacute;gina de pedidos,
<a href="../../es/orders.html">http://www.openbsd.org/es/orders.html</a>,
se encuentra la informaci&oacute;n relacionada con la adquisici&oacute;n
de los CD.

<p>
Existen muchas razones de peso para tener OpenBSD en CDROM:
<ul>
   <li>La venta de los CD ayuda a la continuidad de OpenBSD.
   <li>El desarrollo de un sistema operativo multiplatforma requiere de
   una inversi&oacute;n constante en equipos y componentes.
   <li>El apoyo que supone la compra de los CD tiene un impacto real en
   el desarrollo de futuras versiones.
   <li>Los CD contienen el c&oacute;digo binario (y el c&oacute;digo
   fuente) de todas las plataformas para las que existe soporte.
   <li>Se puede arrancar el sistema de instalaci&oacute;n directamente
   desde el CDROM en varias plataformas, y se puede usar como mecanismo
   de arranque de una m&aacute;quina que no tenga ning&uacute;n sistema
   operativo preinstalado.
   <li>Los CD son &uacute;tiles como mecanismo de arranque aun cuando se
   haya decidido instalar una versi&oacute;n preliminar
   (<em>&quot;snapshot&quot;</em>).
   <li>&iexcl;La instalaci&oacute;n desde el CDROM es mucho m&aacute;s
   r&aacute;pida!  Instalando desde los CD se ahorran recursos de
   conexi&oacute;n de la red.
   <li>Los CD de OpenBSD siempre traen adhesivos curiosos.  Un sistema
   no est&aacute; completo sin &eacute;stos.  Estos adhesivos
   s&oacute;lo se pueden conseguir comprando los CD o donando
   equipamiento.
</ul>

<p>
Para instalar una versi&oacute;n final (<em>-release</em>) de OpenBSD
debe utilizarse un CD.  Las versiones preliminares s&oacute;lo se pueden
obtener a trav&eacute;s de Internet.

<p>
<a name= "BuyTShirts"></a>
<a name="3.1.1"></a>
<h2>3.1.1 - Camisetas de OpenBSD</h2>

<p>
OpenBSD produce camisetas para el disfrute de sus usuarios.  Se pueden
ver los modelos en
<a href="../../es/tshirts.html">http://www.OpenBSD.org/es/tshirts.html</a>.
&iexcl;A disfrutarlas! :)

<p>
<a name= "ISO"></a>
<a name="3.1.2"></a>
<h2>3.1.2 - &iquest;C&oacute;mo se obtiene una imagen ISO?</h2>

<p>
En pocas palabras, no se puede.  Las im&aacute;genes ISO que
usa el proyecto OpenBSD para componer los CD oficiales no
est&aacute;n a disposici&oacute;n p&uacute;blica.  El motivo
es que nos gustar&iacute;a que los usuarios adquirieran los
CD, ayudando de este modo a recoger fondos para el desarrollo
de OpenBSD.  Los derechos sobre la composici&oacute;n del
CDROM oficial de OpenBSD pertenecen a Theo de Raadt.  Theo no
permite la redistribuci&oacute;n de los CD oficiales de
OpenBSD por parte del p&uacute;blico.  A modo de incentivo
para que los usuarios compren los CD, tambi&eacute;n se
incluyen algunos peque&ntilde;os extras en el paquete
(logotipos e im&aacute;genes, adhesivos, etc...).

<p>
Estos derechos s&oacute;lo son aplicables a la composici&oacute;n del
CD, mientras que el sistema OpenBSD en s&iacute; mismo es de libre
distribuci&oacute;n.  Nada impide que alguien se baje OpenBSD y componga
una imagen de CD.  Si por alg&uacute;n motivo alguien quiere bajarse la
imagen del CD, puede encontrar informaci&oacute;n a este respecto entre
los archivos de las listas de correo.  Cualquier imagen ISO de OpenBSD
que pueda existir en Internet es una imagen no oficial, o una
violaci&oacute;n de los derechos de Theo de Raadt.  La fuente de una
imagen no oficial puede o no ser de fiar, y por lo tanto corresponde al
usuario el determinar el grado de fiabilidad.  Aconsejamos que
cualquiera que desee bajarse OpenBSD de forma gratuita, lo haga mediante
la opci&oacute;n de instalaci&oacute;n por FTP.

<p>
<a name= "FTP"></a>
<a name="3.2"></a>
<h2>3.2 - Obtenci&oacute;n de OpenBSD mediante FTP o AFS</h2>

<p>
Existen muchas r&eacute;plicas internacionales que ofrecen acceso por
FTP a las versiones de OpenBSD.  Tambi&eacute;n existe acceso por AFS.
Es aconsejable usar siempre el servidor geogr&aacute;ficamente
m&aacute;s cercano.  Antes de empezar a bajarse cualquier
versi&oacute;n, es conveniente usar las utilidades
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ping&sektion=8">ping(8)</a> y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=traceroute&sektion=8">traceroute(8)</a>
para poder determinar en qu&eacute; servidor se encuentra la
r&eacute;plica m&aacute;s pr&oacute;xima, y si &eacute;sta
funciona correctamente.  Por supuesto que la r&eacute;plica
m&aacute;s pr&oacute;xima siempre ser&aacute; el CD de
OpenBSD.  A continuaci&oacute;n puede verse la
informaci&oacute;n sobre c&oacute;mo acceder a OpenBSD:

<p>
<a href="../../es/ftp.html">http://www.openbsd.org/es/ftp.html</a>

<p>
<a name= "GetCurrent"></a>
<a name="3.3"></a>
<h2>3.3 - Obtenci&oacute;n del c&oacute;digo fuente de la versi&oacute;n
en desarrollo</h2>

<p>
El c&oacute;digo fuente de OpenBSD es de libre redistribuci&oacute;n, y
de disponibilidad gratuita.  Por regla general, el mejor modo para
empezar con un &aacute;rbol de fuentes de la versi&oacute;n en
desarrollo (<em>-current</em>) es instalando el c&oacute;digo fuente
desde un CD reciente y a partir de ah&iacute; configurar AnonCVS para
poder actualizar el c&oacute;digo con regularidad.  La
informaci&oacute;n sobre AnonCVS, incluida la configuraci&oacute;n,
puede verse en:

<p>
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a>. 

<p>
o en la secci&oacute;n <a href="faq8.html#CVS"><tt>CVS</tt></a> del
cap&iacute;tulo 8 de estos documentos.

<p>
Si el ancho de banda de red del que se dispone no es suficiente para el
soporte de AnonCVS, o si el acceso a internet es por UUCP,
tambi&eacute;n ser&aacute; posible mantener los fuentes actualizados
usando CTM en lugar de AnonCVS.  En tal caso es de suma importancia que
se empiece desde una versi&oacute;n del CD.  La informaci&oacute;n sobre
CTM, incluida la configuraci&oacute;n, puede verse en:

<p>
<a href="../../es/ctm.html">http://www.openbsd.org/es/ctm.html</a>.

<p>
Otra alternativa es la obtenci&oacute;n del c&oacute;digo fuente a
trav&eacute;s de la <em>web</em> (http).  Se puede hacer mediante
<em>cvsweb</em> en:

<a href="http://www.openbsd.org/cgi-bin/cvsweb/">http://www.openbsd.org/cgi-bin/cvsweb/</a>


<p>
<font color="#0000e0">
<a href="index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq2.html">[Secci&oacute;n 2.0 - Otros recursos para OpenBSD]</a>
<a href="faq4.html">[Secci&oacute;n 4.0 - Gu&iacute;a de instalaci&oacute;n]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq3.html,v 1.27 2002/07/12 02:51:35 nick Exp ]<br>
$Translation: faq3.html,v 1.23 2002/07/14 07:03:30 horacio Exp $<br>
$OpenBSD: faq3.html,v 1.18 2002/07/14 12:24:28 jufi Exp $
</small>
</body>
</html>
