<html>
<head>
<title>4.0 - Gu&iacute;a de instalaci&oacute;n</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">4.0 - Gu&iacute;a de
instalaci&oacute;n</font><hr></h2>
</p>

<p>
<ul><h3>Tabla de contenidos</h3>
<li><a href="#Overview">4.1 - Breve introducci&oacute;n al
procedimiento de instalaci&oacute;n de OpenBSD.</a></li>
<li><a href="#FilesNeeded">4.2 - &iquest;Qu&eacute; archivos
son necesarios para la instalaci&oacute;n?</a></li>
<li><a href="#SpaceNeeded">4.3 - &iquest;Cu&aacute;nto espacio
necesito para instalar OpenBSD?</a></li>
<li><a href="#Multibooting">4.4 - Multiarranque de
OpenBSD.</a></li>
<li><a href="#SendDmesg">4.5 - Env&iacute;o de la salida de
dmesg a dmesg@openbsd.org despu&eacute;s de la
instalaci&oacute;n.</a></li>
<li><a href="#AddFileSet">4.6 - C&oacute;mo a&ntilde;adir un
archivo de instalaci&oacute;n despu&eacute;s de haber
instalado el sistema.</a></li>
<li><a href="#bsd.rd">4.7 - &iquest;Qu&eacute; es
<em>bsd.rd</em>?</a></li>
</ul>
</p>

<hr>

<p>
<a name= "Overview"></a>
<a name="4.1"></a>
<h2>4.1 - Breve introducci&oacute;n a la instalaci&oacute;n de
OpenBSD</h2>
</p>

<p>
Esta secci&oacute;n de las preguntas frecuentes ahora contiene
instrucciones para la instalaci&oacute;n de OpenBSD 3.1.  Pueden
existir diferencias entre la instalaci&oacute;n de la versi&oacute;n
3.1 y la de versiones anteriores de OpenBSD.
</p>

<p>
OpenBSD dispone de un procedimiento de instalaci&oacute;n muy
robusto y de gran adaptabilidad, basado en texto.
Adem&aacute;s de su robustez, el procedimiento de
instalaci&oacute;n se puede llevar a cabo usando un solo
disquete.  El procedimiento de instalaci&oacute;n es parecido
en la mayor&iacute;a de arquitecturas, pero existen algunos
detalles diferentes.  En general, le recomendamos que lea el
documento <tt>INSTALL</tt> espec&iacute;fico de la plataforma
que utilice, y que encontrar&aacute; en el directorio
correspondiente a la plataforma en el CDROM o en los
servidores de FTP (por ejemplo, <tt>INSTALL.i386</tt>,
<tt>INSTALL.mac68k</tt> o <tt>INSTALL.sparc</tt>).
</p>

<p>
En la mayor&iacute;a de arquitecturas hay varias opciones de
instalaci&oacute;n, incluido FTP, CDROM y archivos de disco
local.  Una opci&oacute;n para la que <strong>no</strong> hay
soporte es la de <a href="faq3.html#ISO">descargar una imagen
ISO</a> para poder crear un CDROM propio.  Los CDROM
est&aacute;n disponibles <a href="../../es/orders.html">a la
venta</a>.
</p>

<h3>4.1.1 - Arquitecturas con soporte en OpenBSD</h3>

<p>
OpenBSD 3.0 dispone de soporte para una n&uacute;mero de
arquitecturas que se mencionan por orden alfab&eacute;tico a
continuaci&oacute;n.  Por favor, lea la p&aacute;gina
correspondiente a cada arquitectura para saber con detalle
para qu&eacute; componentes o modelos existe soporte en el
sistema.
</p>

<ul>
  <li><a href="../../es/alpha.html">alpha</a> -
  M&aacute;quinas basadas en la arquitectura Alpha de DEC.
  <li><a href="../../es/amiga.html">amiga</a> - Modelos
  basados en la arquitectura m68k de Amiga (requiere MMU).
  <li><a href="../../es/hp300.html">hp300</a> -
  M&aacute;quinas HP300/HP400 de Hewlett-Packard.
  <li><a href="../../es/i386.html">i386</a> - Ordenadores
  personales basados en la arquitectura 386 de Intel.
  <li><a href="../../es/mac68k.html">mac68k</a> - La
  mayor&iacute;a de modelos de Apple Macintosh basados en la
  arquitectura MC680x0.
  <li><a href="../../es/mvme68k.html">mvme68k</a> - Tarjetas
  MVME147/16x/17x 68K VME de Motorola.
  <li><a href="../../es/macppc.html">macppc</a> - Sistemas de
  Apple basados en la arquitectura PowerPC.
  <li><a href="../../es/sparc.html">sparc</a> - La plataforma
  SPARC DE Sun Microsystems.
  <li><a href="../../es/sparc64.html">sparc64</a> - Sistemas
  UltraSPARC de Sun Microsystems.
  <li><a href="../../es/vax.html">vax</a> - Computadoras VAX
  de DEC.
</ul>

<h3>4.1.2 - Medios de instalaci&oacute;n con soporte</h3>

<p>
Existe la posibilidad de instalar OpenBSD desde varios tipos
distintos de medios.  A continuaci&oacute;n se mencionan las
opciones que son m&aacute;s comunes y que son independientes
de la arquitectura.  Estas opciones se pueden utilizar
despu&eacute;s de arrancar desde un CD-ROM o desde un
disquete.
</p>

<table align="center" border="1" width="600">
	<tr>
		<td>
			<strong>CD-ROM</strong>
		</td>
		<td bgcolor="#eeeeee">
		Para instalar desde un CD-ROM es necesario haber
		adquirido un <a href="../../es/orders.html">CDROM
		oficial de OpenBSD</a>, o haber creado uno.  Sin lugar
		a dudas &eacute;sta es la forma m&aacute;s f&aacute;cil
		para instalar un sistema OpenBSD.<br>
		<strong>NOTA:</strong> Se puede arrancar desde los CD
		oficiales de OpenBSD siempre que su BIOS permita esta
		opci&oacute;n.

		</td>
	</tr><tr>
		<td>
			<strong>FTP</strong>
		</td>
		<td bgcolor="#eeeeee">
		Esta opci&oacute;n de instalaci&oacute;n le permite
		instalar OpenBSD baj&aacute;ndose antes los paquetes de
		instalaci&oacute;n en tiempo real a trav&eacute;s de la
		red.  Con esta opci&oacute;n puede escoger una
		direcci&oacute;n IP est&aacute;tica u obtener una
		direcci&oacute;n IP por medio de DHCP.
		</td>
	</tr><tr>
		<td>
			<strong>Local Filesystem</strong>
		</td>
		<td bgcolor="#eeeeee">
		Esta opci&oacute;n le permite instalar desde archivos
		disponibles previamente desde un sistema de archivos.
		En el disco de instalaci&oacute;n hay soporte para
		sistemas de archivos de DOS, EXT2FS y FFS.
		</td>
	</tr>
</table>

<a name="Overview.3"></a>
<h3>4.1.3 - C&oacute;mo crear disquetes de instalaci&oacute;n
con arranque de OpenBSD</h3>

<p>
Para crear un disquete con la imagen de instalaci&oacute;n,
primero debe obtener la imagen de arranque correcta desde uno
de los sitios de distribuci&oacute;n de OpenBSD.  Puede
encontrar una lista de servidores de FTP en la p&aacute;ginas
de <a href="../../es/ftp.html">distribuci&oacute;n por FTP de
OpenBSD</a>.  La mayor&iacute;a de arquitecturas disponen de
diferentes im&aacute;genes para elegir, dependiendo de las
variaciones del <em>hardware</em>.  Las diferencias entre
entre los disquetes de instalaci&oacute;n de la plataforma
i386 se se&ntilde;alan m&aacute;s abajo.  Para el resto de
arquitecturas con varios disquetes de arranque,
refi&eacute;rase al documento INSTALL del directorio de FTP
correspondiente.  Para las arquitecturas con un &uacute;nico
disquete, b&aacute;jese la imagen <em>floppy31.fs</em>.<br>
<strong>Nota:</strong>  La imagen <em>cdrom31.fs</em> se puede
usar para crear un CDROM de instalaci&oacute;n de OpenBSD.
</p>

<p>
La plataforma <a href="../../i386.html">i386</a> tiene cuatro
im&aacute;genes de disco distintas entre las que escoger.  Las
diferencias entra cada una de ellas se se&ntilde;alan a
continuaci&oacute;n.
</p>

<ul>
<li><strong>floppy31.fs</strong> contiene soporte para la
mayor&iacute;a de sistemas de escritorio, con soporte para NIC
PCI e ISA, IDE y adaptadoras SCSI simples.  Tambi&eacute;n
algo de soporte PCMCIA.
<li><strong>floppyB31.fs</strong> contiene soporte para muchas
controladoras de RAID, sin embargo se ha eliminado el soporte
para muchas adaptadoras SCSI y NIC EISA e ISA.  &Eacute;ste
ser&aacute; el disco de arranque a elegir para muchos
servidores grandes.  Tambi&eacute;n hay aqu&iacute; soporte
para algunas adaptadoras SCSI poco frecuentes.
<li><strong>floppyC31.fs</strong> contiene soporte para los
dispositivos Cardbus y PCMCIA que se encuentran en muchos
port&aacute;tiles.
<li><strong>cdrom31.fs</strong> contiene soporte para la
mayor&iacute;a de controladores del disco y de red del sistema
instalado;  en efecto, es una combinaci&oacute;n de los tres
discos de arranque.  Se puede utilizar para crear un disquete
de arranque de 2.88MB o, con m&aacute;s frecuencia, como una
imagen de arranque para un CD grabable.
</ul>

<p>
La mayor&iacute;a de usuarios de i386 usar&aacute;n el disquete de
instalaci&oacute;n <em>floppy31.fs</em>.
</p>

<p>
Y s&iacute;, pueden existir situaciones en las que un disco de
instalaci&oacute;n se requiera para el soporte de su
adaptadora de red.  Por fortuna, esto es muy extra&ntilde;o, y
generalmente se puede encontrar una soluci&oacute;n.
</p>

<p>
Una vez que ya disponga de la imagen de disquete correcta,
necesitar&aacute; un disquete en blanco.  Si hubiera
ALG&Uacute;N sector defectuoso en el disquete, la
instalaci&oacute;n fallar&iacute;a con casi total seguridad.
Para preparar un disquete desde otro sistema operativo tipo
UNIX (incluido OpenBSD), use la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdformat&sektion=1&arch=i386">fdformat(1)</a>
para dar formato y verificar los sectores defectuosos.
</p>

<ul>
<table border="0" width="800"> <tr> <td nowrap bgcolor="#eeeeee"><tt>
    # <b>fdformat /dev/fd0a</b><br>
    Format 1440K floppy `/dev/fd0a'? (y/n): y<br>
    processing VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV done.
</tt></td></tr> </table>
</ul>

<p>
Si en su pantalla ve algo como lo anterior, entonces su disquete
est&aacute; en buen estado.  Sin embargo, si no ve TODAS las
&laquo;V&raquo;, entonces es muy probable que su disco est&eacute; en
mal estado, y deber&iacute;a probar con uno virgen.
</p>

<p>
Si va a formatearlo desde MS-DOS, use la orden <tt>FORMAT</tt>
de DOS.
</p>

<p>
Una vez que tenga un disquete vac&iacute;o y con formato, puede empezar
a volcar la imagen de instalaci&oacute;n a &eacute;ste.  Si lo va a
hacer desde un sistema OpenBSD u otro sistema operativo tipo UNIX,
puede usar la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=0">dd(1)</a>.  A continuaci&oacute;n tiene un ejemplo de c&oacute;mo hacerlo:
</p>

<ul>
  <table border="0" width="800"> <tr> <td nowrap bgcolor="#eeeeee"><tt>
    # <b>dd if=floppy31.fs of=/dev/rfd0c bs=126b</b>
  </tt></td></tr></table>
</ul>

<p>
En cuanto haya volcado la imagen al disquete, aseg&uacute;rese que la
imagen volcada sea la misma que la original con la siguiente orden.
Si est&aacute; bien no ver&aacute; ninguna salida, s&oacute;lo otro
punto de pedido.
</p>

<ul>
  <table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
    # <b>cmp /dev/rfd0c floppy31.fs</b>
  </tt></td> </tr> </table>
</ul>

<p>
Si va a crear esta imagen desde una plataforma de DOS/Windows,
puede obtener las herramientas necesarias desde el directorio
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/tools/">tools</a>
en cualquiera de las r&eacute;plicas de ftp, o del directorio
<strong>3.1/tools</strong> en el CD1 de OpenBSD.  Los usuarios
de DOS/Windows 9x pueden usar el programa <em>rawrite</em>
para volcar la imagen a su disquete de arranque.
</p>

<ul>
Ejemplo de utilizaci&oacute;n de <em>rawrite</em>:
  <table border="0" width="800"> <tr> <td nowrap bgcolor="#eeeeee"><tt>
    C:\&gt; <b>rawrite</b><br>
    RaWrite 1.2 - Write disk file to raw floppy diskette<br><br>

    Enter source file name: <b>floppy31.fs</b><br>
    Enter destination drive: <b>a</b><br>
    Please insert a formatted diskette into drive A: and press -ENTER- : </tt><i><b>Enter</b></i><tt>
  </tt> </td> </tr> </table>
</ul>

<p>
Si usa NT, <em>rawrite</em> no le servir&aacute;.  Puede utilizar otros
programas como <em>fdimage</em> o <em>ntrw</em> para volcar la imagen
al disquete de arranque.  Estos dos programas est&aacute;n disponibles
en los sitios de ftp o en los CD de OpenBSD.  He aqu&iacute; un ejemplo
sobre c&oacute;mo usar cada uno de ellos:
</p>

<ul>
Ejemplo de utilizaci&oacute;n de <em>fdimage</em>:
  <table border="0" width="800"> <tr> <td nowrap bgcolor="#eeeeee"><tt>
    C:\&gt; <strong>fdimage -q floppy31.fs a:</strong>
  </tt></td></tr></table>

Ejemplo de utilizaci&oacute;n de <em>ntrw</em>:
  <table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
   C:\&gt; <strong>ntrw floppy31.fs a:</strong><br>
   3.5'', 1.44MB, 512 bytes/sector<br>
   bufsize is 9216<br>
   1474560 bytes written<br>
  </tt></td></tr></table>
</ul>

<p>
N&oacute;tese que <tt>FDIMAGE.EXE</tt> y <tt>RAWRITE.EXE</tt>
son aplicaciones de MS-DOS, y por lo tanto est&aacute;n
limitadas por la convenci&oacute;n 8.3 de nombres de archivos
de DOS.  Como <tt>floppy31B.fs</tt> y <tt>floppy31C.fs</tt>
tienen nombres de archivos m&aacute;s largos, antes de usar
<tt>FDIMAGE.EXE</tt> o <tt>RAWRITE.EXE</tt> para crear los
disquetes de arranque, tendr&aacute; que averiguar bajo
qu&eacute; nombre en formato 8.3 guarda el fichero su sistema.
</p>

<h3>4.1.4 - C&oacute;mo arrancar con las im&aacute;genes de
instalaci&oacute;n de OpenBSD</h3>

<p>
Esta secci&oacute;n est&aacute; dividida en subsecciones, de acuerdo
con las diferentes arquitecturas m&aacute;s usadas y para las que
existe soporte en OpenBSD.  La hemos subdividido de este modo para que
podamos dar a cada usuario las instrucciones correctas sobre lo que
deben hacer en sus respectivas plataformas.
</p>

<h4>Arranque de i386</h4>

<ul>
<p>
Para la mayor&iacute;a de personas, arrancar e instalar desde una
imagen en la arquitectura i386 no es nada nuevo.  Si va a usar el
disquete con la imagen, introd&uacute;zcalo en su disquetera y encienda
su m&aacute;quina.  Si va a usar el CD para el arranque, antes debe
entrar en la BIOS de su m&aacute;quina y configurar las opciones de
arranque para permitir el arranque desde el dispositivo de CD.  Algunas
BIOS ya viejas no presentan esta opci&oacute;n, y por tanto
tendr&aacute; que usar un disquete para el arranque.  Pero no se
preocupe, ya que aun arrancando desde un disquete podr&aacute; instalar
desde el CD.
</p>
</ul>

<h4>Arranque de sparc</h4>

<ul>
<p>
Para arrancar desde un disquete, introduzca su disquete con la imagen
de instalaci&oacute;n de OpenBSD en su disquetera.  A
continuaci&oacute;n use la siguiente orden para arrancar desde el
disquete:
</p>

<ul>
 <table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
  ok <b>boot floppy</b>
 </tt></td></tr></table>
</ul>

<p>
Para arrancar desde el CDROM, introduzca su CD de OpenBSD en el
dispositivo de CDROM.  Si su estaci&oacute;n Sun s&oacute;lo tiene un
dispositivo de CDROM, vaya al punto de arranque y desde &eacute;ste
ejecute '<tt>boot cdrom</tt>':
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
ok <b>boot cdrom</b>
</tt></td></tr></table>
</ul>

<p>
Esto s&oacute;lo funcionar&aacute; en el modo de &oacute;rdenes nuevo.
Si su punto de &oacute;rdenes es el antiguo (una flecha a la derecha),
escriba 'n' para entrar en el modo de &oacute;rdenes nuevo (si
est&aacute; usando una vieja sparc anterior al modelo sun4c, es
probable que no tenga un modo de &oacute;rdenes nuevo, en cuyo caso
tendr&aacute; que experimentar Vd mismo).  Si tiene varios dispositivos
de CDROM, tiene que arrancar desde el correcto.  Pruebe
<tt>probe-scsi</tt> desde el modo de &oacute;rdenes nuevo.
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
ok <strong>probe-scsi</strong><br>
Target 0<br>
  Unit 0   Disk     QUANTUM LIGHTNING 365S<br>
Target 1<br>
  Unit 0   Removable Disk     QUANTUM EMPIRE_1080S<br>
Target 3<br>
  Unit 0   Removable Disk     Joe's CD ROMs<br>
</tt></td></tr></table>
</ul>

<p>
Averig&uuml;e cu&aacute;l es el CDROM desde el que quiere arrancar.
Anote el n&uacute;mero que le corresponda.
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
ok <strong>boot /sbus/esp/sd@X,0</strong>
</tt></td></tr></table>
</ul>
</ul>

<h3>Inicio de la instalaci&oacute;n</h3>

<p>
Ahora que su disco de arranque ya ha sido creado, es el
momento de arrancar desde &eacute;l.  Cuando arranque con este
disquete, el n&uacute;cleo del sistema y todos los programas
que OpenBSD usa para instalarse se cargar&aacute;n en la
memoria.  Si surgiera alg&uacute;n problema y su disco de
arranque no funcionara, es probable que se deba a que el
disquete estaba en mal estado.  &iexcl;&Eacute;ste es un
problema muy com&uacute;n!  Si el disquete le falla durante el
arranque, int&eacute;ntelo de nuevo, y si le vuelve a fallar
t&iacute;relo y utilice un disquete virgen y nuevo.  Cuando un
disquete falla en el proceso de arranque, aun cuando ese mismo
disquete haya funcionado bien anteriormente, tenga en cuenta
que OpenBSD usa pr&aacute;cticamente todos y cada uno de los
bits disponibles en el disquete.  Cualquier error en el disco
impedir&aacute; que se cargue OpenBSD.
</p>

<p>
Cuando haya arrancado con &eacute;xito ver&aacute; una
cantidad de texto en blanco sobre fondo azul, el mensaje de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&sektion=8">dmesg</a> del n&uacute;cleo del sistema,
que le indica qu&eacute; dispositivos est&aacute; encontrando
y d&oacute;nde los encuentra.  A continuaci&oacute;n
ver&aacute; lo siguiente:
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
rootdev=0x1100 rrootdev=0x2f00 rawdev=0x2f02<br>
erase ^?, werase ^W, kill ^U, intr ^C, status ^T<br>
(I)nstall, (U)pgrade or (S)hell? <b>i</b><br>
Welcome to the OpenBSD/i386 3.1 installation program.<br>
 
This program is designed to help you put OpenBSD on your disk in a simple and<br>
rational way.<br>
<br>
As with anything which modifies your disk's contents, this program can cause<br>
SIGNIFICANT data loss, and you are advised to make sure your data is backed<br>
up before beginning the installation process.<br>
<br>
Default answers are displayed in brackets after the questions.  You can hit<br>
Control-C at any time to quit, but if you do so at a prompt, you may have<br>
to hit return.  Also, quitting in the middle of installation may leave your<br>
system in an inconsistent state.  If you hit Control-C and restart the<br>
install, the install program will remember many of your old answers.<br>
<br>
Proceed with install? [n] <b>y</b><br>
<br>
Cool!  Let's get to it...<br>
<br>
Specify terminal type [vt220]: </tt><i><b>Enter</b></i><tt><br>
Do you wish to select a keyboard encoding table? [n] </tt><i><b>Enter</b></i><tt><br>
</tt></td></tr></table>
</ul>

<p>
Despu&eacute;s le preguntar&aacute; por el tipo de terminal de
su equipo.  Dependiendo de la arquitectura que est&eacute;
usando, el tipo de terminal que necesita puede variar.  Por
ejemplo, OpenBSD/sparc usa el tipo de terminal
&laquo;sun&raquo;.  En OpenBSD/i386 puede escoger el
predeterminado, &laquo;pcvt25&raquo;, pulsando
<kbd>intro</kbd>.
</p>
</ul>

<h3>4.1.5 - C&oacute;mo configurar los discos durante la
instalaci&oacute;n</h3>

<p>
La configuraci&oacute;n de los discos en OpenBSD var&iacute;a
un poco dependiendo de la plataforma.  La configuraci&oacute;n
del disco para <a href="../../es/i386.html">i386</a> y
<a href="../../es/macppc.html">macppc</a> se hace en dos
fases.  Primero se define la partici&oacute;n del disco duro
de OpenBSD utilizando fdisk(8), y luego se subdivide esa
partici&oacute;n en varias particiones de OpenBSD utilizando
disklabel(8).
</p>

<p>
Esta terminolog&iacute;a puede resultar un poco confusa para
algunos usuarios.  Parece que estamos usando el t&eacute;rmino
&laquo;partici&oacute;n&raquo; con dos significados distintos.
As&iacute; es, en varias plataformas de OpenBSD existen dos
capas de particiones.  La primera, que se podr&iacute;a
considerar como la partici&oacute;n del sistema operativo, o
sea el modo en que varios sistemas operativos en una misma
m&aacute;quina marcan su propio espacio en el disco.  La
segunda es el modo en que la partici&oacute;n del sistema
operativo OpenBSD se subparticiona, dividi&eacute;ndose en
sistemas de archivos individuales.  La primera capa es visible
para DOS, Windows, y cualquier sistema operativo que pueda
coexistir con otros sistemas operativos en las m&aacute;quinas
descendientes de IBM AT.  La segunda capa de particiones
s&oacute;lo es visible para OpenBSD y para los sistemas
operativos que puedan leer directamente un sistema de archivos
de OpenBSD.
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
At any prompt except password prompts you can run a shell command by<br>
typing '!foo', or escape to a shell by typing '!'.<br>
<br>
The installation program needs to know which disk to consider the root disk.<br>
Note the unit number may be different than the unit number you used in the<br>
boot program (especially on a PC with multiple disk controllers).<br>
Available disks are:<br>
<br>
wd0<br>
<br>
Which disk is the root disk? [wd0] <i><b>&gt;Enter&lt;</b></i><br>
Do you want to use the *entire* disk for OpenBSD? [no] <b>yes</b><br>
<br>
[...]<br>
</tt></td></tr></table>
</ul>

<p>
&Eacute;sta es la parte de la instalaci&oacute;n en la que
escoger&aacute; qu&eacute; disco quiere que sea su
&laquo;disco ra&iacute;z&raquo; (<em>root</em>).  En este
disco ra&iacute;z ser&aacute; en donde se ubicar&aacute;n los
sistemas de archivos <em>root</em> ('/') y <em>swap</em>.
<strong>wd0</strong> indica un disco IDE, pero si sus discos
son SCSI ver&aacute; <strong>sd0</strong> en su lugar.
Habr&aacute; una entrada por cada disco que encuentre OpenBSD,
que suele ser todos los discos del sistema.  Si no muestra los
discos como esperaba, lo m&aacute;s probable es que se trate
de un <em>hardware</em> para el que no existe soporte o que
est&eacute; mal configurado.
</p>

<p> 
En este ejemplo hemos decidido asignar el disco completo a
OpenBSD.  De este modo obtenemos una tabla de particiones
simple del tama&ntilde;o de todo el disco duro, configurada
con el tipo de partici&oacute;n de OpenBSD, y marcada como
partici&oacute;n de arranque.  &Eacute;sta es una
opci&oacute;n bastante com&uacute;n para la mayor&iacute;a de
sistemas de producci&oacute;n de OpenBSD, aunque hay algunos
sistemas en los que no se debe hacer as&iacute;.  Muchos
sistemas de Compaq, algunos de Dell, y otros, usan una
&laquo;partici&oacute;n de mantenimiento&raquo; que se debe
mantener intacta.  Si su sistema tiene alguna otra
partici&oacute;n de alg&uacute;n tipo que no quiera o deba
borrar, no seleccione &quot;<strong>yes</strong>&quot; como
respuesta a la pregunta de arriba.
</p>

<p>
Si decidiera no asignar el disco completo a OpenBSD, el
programa de instalaci&oacute;n le pondr&iacute;a en el editor
de particiones del disco de OpenBSD,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&amp;sektion=8&amp;arch=i386">fdisk(8)</a>.
Puede ver m&aacute;s informaci&oacute;n sobre el uso de
fdisk(8) en la <a href="faq14.html#fdisk">secci&oacute;n
14.2</a> de las preguntas frecuentes.
</p>

<p>
<strong>Nota Importante:</strong>
los usuarios de plataformas i386 con un disco duro de gran
tama&ntilde;o (mayor de 8GB, aunque en m&aacute;quinas viejas
se podr&iacute;a aplicar a discos m&aacute;s peque&ntilde;os)
deber&iacute;an leer <a href="faq14.html#LargeDrive">esta
secci&oacute;n</a> antes de continuar.


<h3>C&oacute;mo crear una clasificaci&oacute;n del disco
(<em>disklabel</em>)</h3>

<p>
El siguiente paso consiste en usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&amp;sektion=8">disklabel(8)</a> 
para subdividir la partici&oacute;n de OpenBSD.  Puede ver
m&aacute;s detalles sobre el uso de disklabel(8) en la
<a href="faq14.html#disklabel">secci&oacute;n 14</a>.
</p>

<p>
NOTA: OpenBSD no dispone de soporte para ning&uacute;n sistema
de archivos tipo <em>journaling filesystems</em>, como
ReiserFS, JFS de IBM o XFS de SGI.  En lugar de &eacute;stos
usamos <a href="faq14.html#SoftUpdates">Soft Updates</a>.  El
sistema de archivos de OpenBSD es FFS (<em>Fast File
System</em>).
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><pre>
Inside the BIOS 'A6' ('OpenBSD') partition you just created, there resides an
OpenBSD partition table which defines how this BIOS partition is to be split
up. This table declares the offsets and sizes of your / partition, your swap
space, and any other partitions you might create.  (NOTE: The OpenBSD disk
label offsets are absolute, ie. relative to the start of the disk... NOT
relative to the start of the BIOS 'A6' partition).

If this disk is shared with other operating systems, those operating systems
should have a BIOS partition entry that spans the space they occupy completely.
For safety, also make sure all OpenBSD file systems are within the offset and
size specified in the 'A6' BIOS partition table.  (By default, the disklabel
editor will try to enforce this).  If you are unsure of how to use multiple
partitions properly (ie. separating /,  /usr, /tmp, /var, /usr/local, and other
things) just split the space into a root and swap partition for now.
 
# using MBR partition 3: type A6 off 63 (0x3f) size 12643092 (0xc0eb14)
 
Treating sectors 63-12658776 as the OpenBSD portion of the disk.
You can use the 'b' command to change this.

Initial label editor (enter '?' for help at any prompt)
&gt; <b>?</b>
Available commands:
        p [unit]  - print label.
        M         - show entire OpenBSD man page for disklabel.
        e         - edit drive parameters.
        a [part]  - add new partition.
        b         - set OpenBSD disk boundaries.
        c [part]  - change partition size.
        d [part]  - delete partition.
        D         - set label to default.
        g [d|b]   - Use [d]isk or [b]ios geometry.
        m [part]  - modify existing partition.
        n [part]  - set the mount point for a partition.
        r         - recalculate free space.
        u         - undo last change.
        s [path]  - save label to file.
        w         - write label to disk.
        q         - quit and save changes.
        x         - exit without saving changes.
        X         - toggle expert mode.
        z         - zero out partition table.
        ? [cmnd]  - this message or command specific help.
Numeric parameters may use suffixes to indicate units:
        'b' for bytes, 'c' for cylinders, 'k' for kilobytes, 'm' for megabytes,
        'g' for gigabytes or no suffix for sectors (usually 512 bytes).
        Non-sector units will be rounded to the nearest cylinder.
Entering '?' at most prompts will give you (simple) context sensitive help.
&gt; <b>p</b>
device: /dev/rwd0c
type: ESDI
disk: ESDI/IDE disk
label: Maxtor 86480D6
bytes/sector: 512
sectors/track: 63
tracks/cylinder: 15
sectors/cylinder: 945
cylinders: 13395
total sectors: 12658776
free sectors: 12658713
rpm: 3600

16 partitions:<br>
#        size   offset    fstype   [fsize bsize   cpg]<br>
  a: 12643092       63    unused        0     0
  c: 12658776        0    unused        0     0
&gt; <b>d a</b>
&gt; <b>a a</b>
offset: [63] <b><i>&gt;Enter&lt;</i></b>
size: [12658713] <b>80m</b>
Rounding to nearest cylinder: 163422
FS type: [4.2BSD] <b><i>&gt;Enter&lt;</i></b>
mount point: [none] <b>/</b>
&gt; <b>a b</b>
offset: [163485] <b><i>&gt;Enter&lt;</i></b>
size: [12495291] <b>300m</b>
Rounding to nearest cylinder: 614250
FS type: [swap] <b><i>&gt;Enter&lt;</i></b>
&gt; <b>a d</b>
offset: [777735] <b><i>&gt;Enter&lt;</i></b>
size: [11881041] <b>80m</b>
Rounding to nearest cylinder: 163485
FS type: [4.2BSD] <b><i>&gt;Enter&lt;</i></b>
mount point: [none] <b>/tmp</b>
&gt; <b>a e</b>
offset: [941220] <b><i>&gt;Enter&lt;</i></b>
size: [11717556] <b>80m</b>
Rounding to nearest cylinder: 163485
FS type: [4.2BSD] <b><i>&gt;Enter&lt;</i></b>
mount point: [none] <b>/var</b>
&gt; <b>a g</b>
offset: [1104705] <b><i>&gt;Enter&lt;</i></b>
size: [11554071] <b>2g</b>
Rounding to nearest cylinder: 4193910
FS type: [4.2BSD] <b><i>&gt;Enter&lt;</i></b>
mount point: [none] <b>/usr</b>
&gt; <b>a h</b>
offset: [5298615] <b><i>&gt;Enter&lt;</i></b>
size: [7360161] <b><i>&gt;Enter&lt;</i></b>
FS type: [4.2BSD] <b><i>&gt;Enter&lt;</i></b>
mount point: [none] <b>/home</b>
&gt; <b>p</b>
device: /dev/rwd0c
type: ESDI
disk: ESDI/IDE disk
label: Maxtor 86480D6
bytes/sector: 512
sectors/track: 63
tracks/cylinder: 15
sectors/cylinder: 945
cylinders: 13395
total sectors: 12658776
free sectors: 0
rpm: 3600

16 partitions:
#        size   offset    fstype   [fsize bsize   cpg]
  a:   163422       63    4.2BSD     1024  8192    16  # /
  b:   614250   163485      swap
  c: 12658776        0    unused        0     0
  d:   163485   777735    4.2BSD     1024  8192    16  # /tmp
  e:   163485   941220    4.2BSD     1024  8192    16  # /var
  g:  4193910  1104705    4.2BSD     1024  8192    16  # /usr
  h:  7360161  5298615    4.2BSD     1024  8192    16  # /home
&gt; <b>w</b>
&gt; <b>q</b>
No label changes.
</pre></td></tr></table>
</ul>

<p>
N&oacute;tese el modo en el que est&aacute; dividido dentro de
su propia partici&oacute;n cada punto de montaje.  Para muchas
aplicaciones es mejor crear un m&iacute;nimo de cinco sistemas
de archivos separados, uno para el sistema de archivos
ra&iacute;z (<strong>/</strong>), otro para el de la memoria
de intercambio (<em>swap</em>), otro para
<strong>/var</strong>, otro para <strong>/tmp</strong>, y otro
para <strong>/usr</strong>.  Si se va a permitir el ingreso de
usuarios en el sistema, tambi&eacute;n se deber&iacute;a crear
una clasificaci&oacute;n para el sistema de archivos
<strong>/home</strong>.
</p>

<h3>4.1.6 - C&oacute;mo configurar los puntos de montaje y dar
formato a los sistemas de archivos</h3>

<p>
Hay una respuesta l&oacute;gica a la pregunta sobre
&laquo;c&oacute;mo particiono mi*sistema&laquo;, y &eacute;sta
es &laquo;seg&uacute;n lo necesite&raquo;.  Cambiar&aacute;
seg&uacute;n el uso de una u otra aplicaci&oacute;n.  No hay
una respuesta universal.  Si no est&aacute; seguro de
c&oacute;mo quiere particionar su sistema, por favor lea
<a href="#SpaceNeeded">esta parte</a>.
</p>

<p>
La configuraci&oacute;n de los puntos de montaje es mucho m&aacute;s
simple de lo que parece.  Despu&eacute;s de que haya configurado sus
sistemas de archivos con disklabel(8), ver&aacute; unas l&iacute;neas
de texto como las que siguen a continuaci&oacute;n.  Si
configur&oacute; sus puntos de montaje con disklabel(8), esto se
har&aacute; de forma autom&aacute;tica, de lo contrario lo puede hacer
desde aqu&iacute;.
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><pre>
 You will now have the opportunity to enter filesystem information for wd0.
 You will be prompted for the mount point (full path, including the prepending
'/' character) for each BSD partition on wd0. Enter "none" to skip a
partition or "done" when you are finished.
 
 The following partitions will be used for the root filesystem and swap:<br>
         wd0a    /
         wd0b    swap
 
Mount point for wd0d (size=81742k) [/tmp, RET, none, or done]? <b><i>&gt;Enter&lt;</i></b>
Mount point for wd0e (size=81742k) [/var, RET, none, or done]? <b><i>&gt;Enter&lt;</i></b>
Mount point for wd0g (size=2096955k) [/usr, RET, none, or done]? <b><i>&gt;Enter&lt;</i></b>
Mount point for wd0h (size=3680080k) [/home, RET, none, or done]? <b><i>&gt;Enter&lt;</i></b>
Mount point for wd0d (size=81742k) [/tmp, RET, none, or done]? <b>done</b>

Now you can select another disk to initialize. (Do not re-select a disk
you have already entered information for). Available disks are:
 
 wd0
 
Which one? [done] <b><i>&gt;Enter&lt;</i></b>
 
 You have configured the following devices and mount points:
 
 wd0a /
 wd0h /home
 wd0d /tmp
 wd0g /usr
 wd0e /var
 
 ============================================================
 The next step will overwrite any existing data on:
        wd0a wd0h wd0d wd0g wd0e
 
 Are you really sure that you're ready to proceed? [n] <b>y</b>
 Creating filesystems...
 Warning: 63 sector(s) in last cylinder unallocated
 /dev/rwd0a:     163422 sectors in 173 cylinders of 15 tracks, 63 sectors
         79.8MB in 11 cyl groups (16 c/g, 7.38MB/g, 1792 i/g)
 Warning: 445 sector(s) in last cylinder unallocated
 /dev/rwd0h:     7360160 sectors in 7789 cylinders of 15 tracks, 63 sectors
         3593.8MB in 487 cyl groups (16 c/g, 7.38MB/g, 1792 i/g)
 Warning: 1 sector(s) in last cylinder unallocated
 /dev/rwd0d:     163484 sectors in 173 cylinders of 15 tracks, 63 sectors
         79.8MB in 11 cyl groups (16 c/g, 7.38MB/g, 1792 i/g)
 /dev/rwd0g:     4193910 sectors in 4438 cylinders of 15 tracks, 63 sectors
         2047.8MB in 278 cyl groups (16 c/g, 7.38MB/g, 1792 i/g)
 Warning: 1 sector(s) in last cylinder unallocated
 /dev/rwd0e:     163484 sectors in 173 cylinders of 15 tracks, 63 sectors
         79.8MB in 11 cyl groups (16 c/g, 7.38MB/g, 1792 i/g)
</pre></td></tr></table>
</ul>


<p>
El motivo por el que el instalador nos pregunta por los puntos
de montaje es que no es posible montar un sistema de archivos,
como por ejemplo <tt>/usr/src</tt> sin antes haber montado el
sistema de archivos inmediatamente anterior, que en el ejemplo
ser&iacute;a <tt>/usr</tt>.  La parte <tt>Mount Point</tt> nos
da la posibilidad de escoger el orden en el que est&aacute;n
montados los sistemas de archivos en <tt>/etc/fstab</tt>.
</p>

<p>
N&oacute;tese que la pregunta <tt>Are you really sure that you
are ready to proceed?</tt> (si est&acute; seguro de querer
continuar) est&aacute; predeterminada con <strong>no</strong>,
por lo que tendr&aacute; que explicitar que s&iacute; desea
continuar y formatear las particiones contestando
<strong>yes</strong>.  En caso contrario invocar&aacute; al
int&eacute;rprete, desde donde podr&aacute; reiniciar la
instalaci&oacute;n escribiendo <strong>install</strong>, o
reiniciando el sistema con el disco de arranque.  Si decide
continuar, el programa de instalaci&oacute;n dar&aacute;
formato a todos los sistemas de archivos.  Esto puede tardar
un tiempo que depender&aacute; del tama&ntilde;o del disco.
</p>

<h3>4.1.7 - Configuraci&oacute;n de la red</h3>

<p>
Ahora ya puede configurar su red.  Este paso es de una importancia
capital si va a llevar a cabo una instalaci&oacute;n por red,
considerando que para ello se basar&aacute; en la informaci&oacute;n
que introduzca en esta parte.  Aqu&iacute; puede ver una gu&iacute;a de
la secci&oacute;n de configuraci&oacute;n de la red durante el proceso
de instalaci&oacute;n.
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><pre>
 You will now be given the opportunity to configure the network. This will be
 useful if you need to transfer the installation sets via FTP, HTTP, or NFS.
 Even if you choose not to transfer installation sets that way, this information
 will be preserved and copied into the new root filesystem.
 
 Configure the network? [y] <b><i>&gt;Enter&lt;</i></b>
 Enter system hostname (short form, e.g. 'foo'): [] <b>puffy</b>

 If any interfaces will be configured using a DHCP server
 it is recommended that you do not enter a DNS domain name,
 a default route, or any name servers.
 
 Enter DNS domain name (e.g. 'bar.com'): [] <b>example.com</b>
 
 You may configure the following network interfaces (the interfaces
 marked with [X] have been successfully configured):
 
         [ ] fxp0
 
 Configure which interface? (or 'done') [fxp0] <b><i>&gt;Enter&lt;</i></b>
 IP address (or 'dhcp')? [] <b>199.185.137.55</b>
 Symbolic (host) name? [puffy] <b><i>&gt;Enter&lt;</i></b>
 Netmask? [255.255.255.0] <b><i>&gt;Enter&lt;</i></b>
 Your use of the network interface may require non-default
 media directives. The default media is:
         media: Ethernet autoselect (none)
 This is a list of supported media:
         media none
         media 10baseT
         media 10baseT mediaopt full-duplex
         media 100baseTX
         media 100baseTX mediaopt full-duplex
         media autoselect
         media none instance 1
         media 100baseTX instance 1
         media 100baseTX mediaopt full-duplex instance 1
         media 100baseT4 instance 1
 If the default is not satisfactory, and you wish to use another
 media, copy that line from above (e.g. "media 100baseTX")
 Media directives? [] <b><i>&gt;Enter&lt;</i></b>
 
 You may configure the following network interfaces (the interfaces
 marked with [X] have been successfully configured):
 
         [X] fxp0
 
 Configure which interface? (or 'done') [done] <b><i>&gt;Enter&lt;</i></b>
 Enter IP address of default route: [none] <b>199.185.137.128</b>
 Enter IP address of primary nameserver: [none] <b>199.185.137.1</b>
 Would you like to use the nameserver now? [y] <b><i>&gt;Enter&lt;</i></b>
</pre></td></tr></table></ul>
</ul>

<p>
En el ejemplo anterior usamos una direcci&oacute;n IP est&aacute;tica.
Tambi&eacute;n puede usar DHCP.  En el caso de DHCP la mayor parte de
esta informaci&oacute;n se obtendr&aacute; desde un servidor remoto de
dhcp.
</p>


<h3>4.1.8 - Elecci&oacute;n del medio de
instalaci&oacute;n</h3>

<p>
Despu&eacute;s de que su red haya sido configurada, el gui&oacute;n de
instalaci&oacute;n le dar&aacute; la oportunidad de realizar cambios a
su configuraci&oacute;n de red.  A continuaci&oacute;n se
montar&aacute;n los los sistemas de archivos que ha creado y
una contrase&ntilde;a para el superusuario <em>root</em>.
Despu&eacute;s de esto tendr&aacute; los discos preparados
para instalar en ellos los archivos de instalaci&oacute;n de
OpenBSD.  Cuando los discos est&eacute;n ya preparados, le
preguntar&aacute; si quiere instalar el entorno gr&aacute;fico
X en el sistema.  Si la respuesta es <strong>Y</strong>,
modificar&aacute; <tt>/etc/sysctl.conf</tt> para que incluya
la entrada <em>machdep.allowaperture=1</em>.

<p>
A continuaci&oacute;n le dar&aacute; la oportunidad de escoger
un medio de instalaci&oacute;n:
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><pre>
 You will now be given the opportunity to escape to the command shell to do
 any additional network configuration you may need. This may include adding
 additional routes, if needed. In addition, you might take this opportunity
 to redo the default route in the event that it failed above.
 Escape to shell? [n] <b><i>&gt;Enter&lt;</i></b>
 /dev/wd0a on /mnt type ffs (rw, asynchronous, local, ctime=Tue Apr 16 15:50:28 2
 002)
 /dev/wd0h on /mnt/home type ffs (rw, asynchronous, local, ctime=Tue Apr 16 15:50
 :28 2002)
 /dev/wd0d on /mnt/tmp type ffs (rw, asynchronous, local, ctime=Tue Apr 16 15:50:
 28 2002)
 /dev/wd0g on /mnt/usr type ffs (rw, asynchronous, local, ctime=Tue Apr 16 15:50:
 28 2002)
 /dev/wd0e on /mnt/var type ffs (rw, asynchronous, local, ctime=Tue Apr 16 15:50:
 28 2002)
 
 Please enter the initial password that the root account will have.
 Password (will not echo): <b><i>&gt;enter root PW&lt;</i></b>
 Password (again): <b><i>&gt;re-enter root PW&lt;</i></b>
 
 Do you expect to run the X Window System? [y] <b><i>&gt;Enter&lt;</i></b>
 
 
 You must now specify where the install sets you want to use are. They
 must either be on a local device (disk, tape, or CD-ROM), an
 accessible NFS filesystem or an accessible ftp or http network
 server. You will have the chance to repeat this step or to extract
 sets from several places, so you do not have to try to load all the
 sets in one try and can recover from some errors.

 Install from (f)tp, (h)ttp, (t)ape, (C)D-ROM or local (d)isk? <b>c</b>
</pre></td></tr></table>
</ul>

<p>
En este ejemplo, la instalaci&oacute;n la llevaremos a cabo mediante el
CDROM.  Le mostrar&aacute; una lista de los dispositivos que
identifique como CDROM en su m&aacute;quina.  La mayor&iacute;a de
usuarios s&oacute;lo tendr&aacute;n uno;  si tiene m&aacute;s de uno
deber&aacute; asegurarse de escoger el dispositivo desde el que va a
instalar OpenBSD.  Despu&eacute;s de escoger el dispositivo correcto le
preguntar&aacute; por el sistema de archivos en el que residir&aacute;n
los archivos de instalaci&oacute;n.  Si est&aacute; usando el CDROM de
OpenBSD, responda escogiendo 'c', ya que 'c' representa la totalidad
del disco.  He aqu&iacute; un ejemplo:
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><pre>
 The following CD-ROM devices are installed on your system.
 Please make sure the CD is in the CD-ROM drive and select
 the device containing the CD with the installation sets:
 
 cd0
 
 Which CD-ROM contains the installation media? [cd0] <b><i>&gt;Enter&lt;</i></b>

 Enter the directory relative to the mount point that contains
 the file: [3.1/i386] <b><i>&gt;Enter&lt;</i></b>
</pre></td></tr></table>
</ul>

<p>
Aqu&iacute; le pregunta por el directorio en el que se
encuentran los archivos de instalaci&oacute;n, que es
<tt>/3.1/i386/</tt> en el CDROM oficial.
</p>


<h3>4.1.9 - Elecci&oacute;n de archivos para instalar y finalizar la
instalaci&oacute;n del sistema.</h3>

<p>
Ahora puede escoger los archivos que va a instalar.  Puede ver
una descripci&oacute;n de estos archivos en la
<a href="#FilesNeeded">siguiente secci&oacute;n</a>.  El
instalador mostrar&aacute; en pantalla aquellos archivos que
encuentre.  Lo &uacute;nico que debe hacer Vd es especificar
cu&aacute;les desea instalar.  Todos los paquetes excepto los
del entorno gr&aacute;fico X est&aacute;n preseleccionados,
aunque algunos usuarios preferir&aacute;n dejarlo en el
m&iacute;nimo indispensable requerido para el funcionamiento
de OpenBSD, que ser&iacute;a <tt>base31.tar.gz</tt>,
<tt>etc31.tar.gz</tt> y <tt>bsd</tt>.   Otros
preferir&aacute;n instalar todos los archivos.  En el ejemplo
siguiente se escoger&aacute; una instalaci&oacute;n completa
menos el paquete de juegos.
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><pre>
 You will now be asked which sets to install. Some of these sets are required
 for your install and some are optional. You will want at least the
 base and bsd sets. Consult the installation notes if you are not sure
 which sets are required!
 
 The following sets are available. Enter a filename, 'all' to select
 all the sets, or 'done'. You may de-select a set by prepending a '-'
 to its name.
 
         [X] base31.tgz
         [X] etc31.tgz
         [X] misc31.tgz
         [X] comp31.tgz
         [X] man31.tgz
         [X] game31.tgz
         [ ] xbase31.tgz
         [ ] xshare31.tgz
         [ ] xfont31.tgz
         [ ] xserv31.tgz
         [X] bsd
 File name? [xbase31.tgz] <b>*</b>
 
 The following sets are available. Enter a filename, 'all' to select
 all the sets, or 'done'. You may de-select a set by prepending a '-'
 to its name.
 
         [X] base31.tgz
         [X] etc31.tgz
         [X] misc31.tgz
         [X] comp31.tgz
         [X] man31.tgz
         [X] game31.tgz
         [X] xbase31.tgz
         [X] xshare31.tgz
         [X] xfont31.tgz
         [X] xserv31.tgz
         [X] bsd
 File name? [done] <b>-game31.tgz</b>
 
 The following sets are available. Enter a filename, 'all' to select
 all the sets, or 'done'. You may de-select a set by prepending a '-'
 to its name.
 
         [X] base31.tgz
         [X] etc31.tgz
         [X] misc31.tgz
         [X] comp31.tgz
         [X] man31.tgz
         [ ] game31.tgz
         [X] xbase31.tgz
         [X] xshare31.tgz
         [X] xfont31.tgz
         [X] xserv31.tgz
         [X] bsd
 File name? [game31.tgz] <b>done</b>
 Ready to install sets? [y] <b><i>&gt;Enter&lt;</i></b>
</pre></td></tr></table>
</ul>

<p>
Una vez que ya haya escogido los archivos que desea instalar,
le preguntar&aacute; si est&aacute; seguro de querer extraer
estos archivos y pasar&aacute; a instalarlos.  Le
mostrar&aacute; una barra de progreso mediante la cual le
mantendr&aacute; informado del tiempo que tarde.  El tiempo
depender&aacute; en gran medida de la m&aacute;quina en la que
se encuentre instalando OpenBSD, los archivos que instale, y
la velocidad del medio de instalaci&oacute;n.  Esta parte
puede tardar desde unos pocos minutos hasta varias horas.
</p>

<ul>
<table border=0 width="800"><tr><td nowrap bgcolor="#EEEEEE"><pre>
 Ready to install sets? [y] <b><i>&gt;Enter&lt;</i></b>
 
 Getting base31.tgz ...
 100% |**************************************************| 23299 KB    00:25
 Getting etc31.tgz ...
 100% |**************************************************|  1164 KB    00:02
 Getting misc31.tgz ...
 100% |**************************************************|  1664 KB    00:01
 Getting comp31.tgz ...
 100% |**************************************************| 16061 KB    00:18
 Getting man31.tgz ...
 100% |**************************************************|  5412 KB    00:08
 Getting bsd ...
 100% |**************************************************|  4436 KB    00:02
 Getting xbase31.tgz ...
 100% |**************************************************|  8520 KB    00:06
 Getting xshare31.tgz ...
 100% |**************************************************|  1815 KB    00:05
 Getting xfont31.tgz ...
 100% |**************************************************| 30657 KB    00:31
 Getting xserv31.tgz ...
 100% |**************************************************| 19339 KB    00:11
 
 Extract more sets? [n] <b><i>&gt;don't answer yet!&lt;</i></b>
 </pre></td></tr></table>
 </ul>

<p>
Si su sistema tiene poca memoria de RAM, menos de 20M en i386,
no pulse <tt>intro</tt> todav&iacute;a.

<a name="SmallRAM"></a>
<h4>Pasos adicionales para m&aacute;quinas con poca RAM</h4>

<p>
Debido al constante crecimiento de OpenBSD, 
Seg&uacute;n va creciendo OpenBSD, tambi&eacute;n crecen los
requisitos de RAM, y esta tendencia continuar&aacute; en el
futuro.  El paso siguiente en el proceso de instalaci&oacute;n
requiere m&aacute;s de 16MB de RAM, y no funcionar&aacute; en
m&aacute;quinas que tengan menos de 20M de RAM.  Esto es para
m&aacute;quinas basadas en la plataforma i386, ya que otras
plataformas requieren mucha menos RAM;  pero este truco
tambi&eacute;n sirve para otras plataformas si se alcanzan los
l&iacute;mites en ellas.
</p>

<p>
Durante el proceso de instalaci&oacute;n no suele haber
memoria de intercambio (o <em>swap</em>), y &uacute;nico de lo
que podemos disponer es de la memoria de acceso aleatorio (o
<em>RAM</em>).  Para el paso que sigue con 'MAKEDEV' se
necesita m&aacute;s de lo requerido por el resto de la
instalaci&oacute;n.  Pero como un sistema con poca cantidad de
RAM todav&iacute;a puede ser de gran utilidad para muchas
aplicaciones, la evicci&oacute;n de de esta limitaci&oacute;n
nos resultar&aacute; muy &uacute;til.
</p>

<p>
La soluci&oacute;n est&aacute; en activar ahora la memoria de
intercambio.  La partici&oacute;n de <em>swap</em> ya
est&aacute; creada y los archivos se encuentran ya en el disco
duro, as&iacute; que el truco estar&aacute; en invocarla de
forma manual.  Para ello no pulse <tt>intro</tt> en el punto
anterior, escriba '!' para llamar a un int&eacute;rprete de
&oacute;rdenes y ejecute
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=swapon&amp;sektion=8">swapon(8)</a>
desde el disco duro montado:

<ul><table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee"><tt>
 Extract more sets? [n] <b>!</b><br>
 Type 'exit' to return to install.<br>
 # <b>/mnt/sbin/swapon /dev/wd0b</b><br>
 # <b>exit</b><br>
 <b>n</b><br>
</tt></td></tr></table>
</ul>

<p>
N&oacute;tese que 'n' es el &uacute;ltimo paso.  Recuerde que
llamamos al int&eacute;rprete desde la l&iacute;nea <tt>Extract
more sets?</tt> (&iquest;extraer m&aacute;s archivos?),
as&iacute; que esa &uacute;ltima 'n' es la respuesta a esa
pregunta.
</p>

<p>
Ahora ya puede continuar con la instalaci&oacute;n normal.


<h3>Pasos finales</h3>

<p>
Cuando haya acabado con esta parte ya s&oacute;lo le
faltar&aacute; configurar su franja horaria e instalar los
bloques de arranque.  La configuraci&oacute;n de la franja
horaria no tiene ning&uacute;n secreto.  Basta con escoger la
zona en la que vive e introducir el nombre de &eacute;sta.
&iexcl;Eso es todo!  S&oacute;lo queda una duda por resolver,
y es si va a tener X funcionando en este servidor.  Si cree
que en alg&uacute;n momento va a necesitar X debe responder
<em>yes</em>, o en caso contrario tendr&aacute; que editar su
fichero <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl.conf&amp;sektion=5">/etc/sysctl.conf(5)</a>
y cambiar <em>machdep.allowaperture=0</em> por
<em>machdep.allowaperture=1</em>.  Despu&eacute;s de esto
ejecute la orden 'reboot' para reiniciar el sistema desde el
punto del int&eacute;rprete (<em>shell prompt</em>) &iexcl;y
su m&aacute;quina iniciar&aacute; con OpenBSD!
</p>

<ul>
<table border=0 width="800"><tr><td nowrap bgcolor="#EEEEEE"><pre>
Extract more sets? [n]

Copying... fstab hostname.fxp0 hosts myname mygate resolv.conf ...done.

Select a time zone for your location. Timezones are represented on the system
by a directory structure rooted in &quot;/usr/share/timezone&quot;. Most timezones can
be selected by entering a token like &quot;CET&quot; or &quot;GMT-6&quot;. Other zones are
grouped by continent or country, with detailed zone information separated by
a slash (&quot;/&quot;), e.g. &quot;US/Pacific&quot; or &quot;Canada/Mountain&quot;.

What timezone are you in? ('?' for list) [US/Pacific] <b>Canada</b>
Select a sub-timezone of 'Canada' ('?' for list): <b>?</b>
Atlantic            Eastern             Pacific
Central             Mountain            Saskatchewan
East-Saskatchewan   Newfoundland        Yukon
Sele of 'Canada' ('?' for list): <b>Mountain</b>
You have selected timezone 'Canada/Mountain'.
Making all device nodes (by running /dev/MAKEDEV all) ...... done.
Installing boot block...
boot: /mnt/boot
proto: /usr/mdec/biosboot
device: /dev/rwd0c
/usr/mdec/biosboot: entry point 0
proto bootblock size 512
room for 12 filesystem blocks at 0x16f
Will load 7 blocks of size 8192 each.
Using disk geometry of 63 sectors and 255 heads.
 0: 56 @(0 152 8) (9583-9638)
 1: 40 @(0 153 1) (9639-9678)
 2: 16 @(0 9 27) (593-608)
/mnt/boot: 3 entries total
using MBR partition 3: type 166 (0xa6) offset 63 (0x3f)

Enabling machdep.allowaperture. Read xf86(4) for more information.


Cleaning up...
/dev/wd0e: unmount from /mnt/var
/dev/wd0g: unmount from /mnt/usr
/dev/wd0d: unmount from /mnt/tmp
/dev/wd0h: unmount from /mnt/home
/dev/wd0a: unmount from /mnt
Done.

CONGRATULATIONS!  You have successfully installed OpenBSD!  To boot the
installed system, enter halt at the command prompt. Once the system has
halted, reset the machine and boot from the disk.

# halt
syncing disks... done

The operating system has halted.
Please press any key to reboot.
</pre></td></tr></table>
</ul>

<h3>Despu&eacute;s de reiniciar...</h3>

<p>
En esta secci&oacute;n le ofrecemos algunas pistas sobre lo
que debe hacer una vez haya instalado OpenBSD.  Estas pistas
se basan en la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8&amp;format=html">afterboot(8)</a>,
que deber&iacute;a ser lo primero que leyera despu&eacute;s de
instalar OpenBSD.  Aqu&iacute; puede ver una tabla que
se&ntilde;ala las secciones relevantes del documento de
preguntas frecuentes:
</p>

<ul>
<li><a href="faq10.html#AddDelUser">Adici&oacute;n de nuevos
usuarios en OpenBSD</a>
<li><a href="faq6.html#Setup">Configuraci&oacute;n inicial de
la red</a>
<li><a href="faq2.html#ManPages">P&aacute;ginas del manual de
la &oacute;rdenes de uso m&aacute;s frecuente</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi">Interfaz
de <em>web</em> para las p&aacute;ginas del manual de
OpenBSD</a>
<li><a href="faq8.html#Packages">Paquetes para OpenBSD</a>
- paquetes de binarios precompilados.
</ul>

<h3>Una &uacute;ltima cosa...</h3>

<p>
Los desarrolladores de OpenBSD le piden que
<a href="#SendDmesg">env&iacute;e una copia de su dmesg</a>.
Esto es de gran utilidad para los desarrolladores, y en
consecuencia para todos los usuarios.
</p>


<a name="1.14"></a>
<h2>Otros recursos de informaci&oacute;n</h2>

<p>
Existen documentos adicionales para aquellos que puedan tener
alguna necesidad o inter&eacute;s especial.  Puede obtenerlos
desde cualquiera de las r&eacute;plicas del servidor de ftp.
</p>

<ul>
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.i386">INSTALL.i386</a> - Documento comprensivo de instalaci&oacute;n.  Existen documentos parecidos para cada una de las plataformas.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.linux">INSTALL.linux</a> - Instalaci&oacute;n compartida de OpenBSD y Linux.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.mbr">INSTALL.mbr</a> - Explicaci&oacute;n del &laquo;registro de arranque maestro&raquo; (<em>Master Boot Record</em>, MBR).
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.pt">INSTALL.pt</a> - Explicaci&oacute;n de las tablas de partici&oacute;n.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.dbr">INSTALL.dbr</a> - Sector de arranque del disquete de DOS.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.chs">INSTALL.chs</a> - Explicaci&oacute;n de la traducci&oacute;n CHS.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.ata">INSTALL.ata</a> - Preguntas frecuentes sobre ATA/ATA-1/ATA-2/IDE/EIDE/etc.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.os2br">INSTALL.os2br</a> - El sector de arranque de os2.
</ul>

<p>
<a name="FilesNeeded"></a>
<a name="4.2"></a>
<h2>4.2 - &iquest;Qu&eacute; archivos son necesarios para la
instalaci&oacute;n?</h2>
</p>

<p>
Existen muchos archivos que contienen ficheros binarios de OpenBSD
pero, &iquest;cu&aacute;les son los necesarios para que funcione el
sistema?  He aqu&iacute; una vista r&aacute;pida de cada paquete:
</p>

<p>
<ul>
<li><strong>base31.tgz</strong> - Contiene la base del sistema
de OpenBSD - <strong>Requerido</strong></li>
<li><strong>etc31.tgz</strong> - Contiene todos los ficheros
de <em>/etc</em> - <strong>Requerido</strong></li>
<li><strong>comp31.tgz</strong> - Contiene el compilador y sus
herramientas y bibliotecas - <strong>Recomendado</strong></li>
<li><strong>man31.tgz</strong> - Contiene las p&aacute;ginas
del manual - <strong>Recomendado</strong></li>
<li><strong>misc31.tgz</strong> - Contiene informaci&oacute;n
miscel&aacute;nea y la documentaci&oacute;n sobre la
configuraci&oacute;n.</li>
<li><strong>game31.tgz</strong> - Contiene juegos para
OpenBSD.</li>
<li><strong>xbase31.tgz</strong> - Contiene la base para la
instalaci&oacute;n de X11.</li>
<li><strong>xfont31.tgz</strong> - Contiene el servidor de
fuentes para X11 y fuentes.</li>
<li><strong>xserv31.tgz</strong> - Contiene los servidores de
X para X11.</li>
<li><strong>xshare31.tgz</strong> - Contiene p&aacute;ginas
del manual, configuraciones para la
internacionalizaci&oacute;n, ficheros de inclusi&oacute;n,
etc...  para X.</li>
<li><strong>bsd</strong> - Es el n&uacute;cleo del sistema.
<strong>Requerido</strong></li>
</ul>
</p>

<p>
<a name= "SpaceNeeded"></a>
<a name="4.3"></a>
<h2>4.3 - &iquest;Cu&aacute;nto espacio necesito para instalar
OpenBSD?</h2>
</p>

<p>
Se sugiere usar como m&iacute;nimo indispensable los
siguientes tama&ntilde;os de espacio para una
instalaci&oacute;n completa del sistema.  Las cifras incluyen
el suficiente espacio adicional como para una
instalaci&oacute;n t&iacute;pica de un sistema en su casa
conectado a Internet.

<ul>
<li>Estos valores son el m&iacute;nimo requerido.
<li>Si va a instalar una cantidad significativa de software de
terceras partes, haga una partici&oacute;n <em>/usr</em>
grande.  &iexcl;<strong>Como m&iacute;nimo</strong> triplique
estos valores!
<li>Para un sistema que vaya a gestionar mucho correo
electr&oacute;nico o p&aacute;ginas web (almacenados
respectivamente en <em>/var/mail</em> y <em>/var/www</em>), la
partici&oacute;n <em>/var</em> deber&aacute; ser bastante
m&aacute;s grande.
<li>Para un sistema multiusuario que genere muchos mensajes de
registro (<em>log</em>), la partici&oacute;n <em>/var</em>
a&uacute;n tendr&aacute; que ser mucho m&aacute;s grande
(<em>/var/log</em>).
<li>Si va a recompilar el n&uacute;cleo o el sistema desde el
c&oacute;digo fuente, le interesa crear una partici&oacute;n
<em>/usr</em> bastante m&aacute;s grande, <strong>como
m&iacute;nimo</strong> entre 800MB y 1GB m&aacute;s grande de
la que se indica abajo.
</ul>

Mientras lea esto recuerde que tanto <em>/usr</em> como
<em>/usr/X11R6</em> son, por regla general, parte del mismo sistema de
archivos;  o sea, parte de <em>/usr</em>, ya que no hay ninguna ventaja
importante en mantenerlos como sistemas de archivos separados.

<ul>
<strong>
<pre>
SYSTEM          /       /usr    /var    /usr/X11R6
alpha           50M     250M    25M     100M
amiga           40M     200M    25M     180M
hp300           40M     200M    25M      80M
i386            40M     200M    25M     140M
mac68k          40M     200M    25M      80M
macppc          50M     200M    25M     100M
mvme68k         40M     200M    25M      80M
sparc           40M     259M    25M      49M
sparc64         50M     200M    25M     100M
vax             75M     125M    25M     180M
</pre>
</strong>
</ul>

<p>
Cuando se encuentre en el editor del disco
(&quot;<em>disklabel</em>&quot;), puede escoger que su sistema tenga
s&oacute;lo 'a' (sistema de archivos principal) y 'b' (memoria de
intercambio, <em>swap</em>).  El sistema de archivos 'a' que configure
en <em>disklabel</em> ser&aacute; su partici&oacute;n ra&iacute;z
(<em>root</em>), que se debe componer de la suma de los tres valores
principales anteriores (<em>/</em>, <em>/usr</em>, y <em>/var</em>),
m&aacute;s algo de espacio para <em>/tmp</em>.  La partici&oacute;n 'b'
ser&aacute; la partici&oacute;n <em>swap</em> del sistema.  Para esta
partici&oacute;n recomendamos un m&iacute;nimo de 32MB, pero si dispone
de suficiente espacio en el disco use un m&iacute;nimo de 64MB.  Si
tiene mucho espacio de sobre en el disco, lo mejor es que la haga de
256MB, o incluso de 512MB.

<p>
Existen cuatro razones principales para usar sistemas de archivos
separados en lugar de meterlo todo en dos sistemas de archivos:

<ul>
<li><strong>Seguridad</strong>: puede marcar algunos sistemas de
archivos como 'nosuid', 'nodev', 'noexec', 'readonly', etc...
<li><strong>Estabilidad</strong>: un usuario, o un programa con un
comportamiento incorrecto, puede llenar un sistema de archivos de
basura si tiene permiso de escritura sobre &eacute;ste.  De este modo,
los programas m&aacute;s cr&iacute;ticos, que por supuesto
funcionar&aacute;n en un sistema de archivos diferente, no ser&aacute;n
interrumpidos.
<li><strong>Velocidad</strong>: un sistema de archivos sobre el que se
escriba con frecuencia puede acabar algo fragmentado.  Por suerte, el
sistema de archivos de tipo ffs, que es el que usa OpenBSD, no es
propenso a la fragmentaci&oacute;n.
<li><strong>Integridad</strong>: si un sistema de archivos se
corrompiera por cualquier motivo, el resto de sistemas quedar&iacute;an
intactos.
<li><strong>Tama&ntilde;o</strong>: muchas plataformas tienen
l&iacute;mites para el &acute;rea del disco desde la que la ROM
de arranque puede cargar el n&uacute;cleo del sistema.  En
algunos casos este l&iacute;mite puede ser muy peque&ntilde;o
(504M para un 486 antiguo), pero en otros casos puede ser
mucho m&aacute;s grande (8G en sistemas i386 nuevos).  Como el
n&uacute;cleo del sistema puede acabar en cualquier parte de
la partici&oacute;n ra&iacute;z, toda la partici&oacute;n
ra&iacute;z deber&iacute;a estar dentro de este &acute;rea.
Se pueden ver m&aacute;s detalles en
<a href="faq14.html#LargeDrive">esta secci&oacute;n</a>.  Una
pol&iacute;tica recomendable ser&iacute;a mantener la
partici&oacute;n ra&iacute;z totalmente por debajo de los 2G,
a menos que la plataforma (y la m&aacute;quina en particular)
sea capaz de manejar un tama&ntilde;o m&aacute;s grande
(&iexcl;o m&aacute;s peque&ntilde;o!).
</ul>

<p>
Algunas notas adicionales sobre las particiones:
</p>

<ul>
<li>Para un primer intento en un sistema experimental, una
partici&oacute;n <strong>/</strong> grande y otra de
<em>swap</em> puede ser lo m&aacute;s sencillo hasta que sepa
el espacio que va a necesitar.
<li>Un sistema expuesto en Internet u otra fuerza de
naturaleza hostil deber&iacute;a tener una partici&oacute;n
separada de /var (e incluso una de /var/log) para los
registros.
<li>Una partici&oacute;n /home es una buena idea.  Si quisiera
instalar una versi&oacute;n nueva del sistema operativo no
podr&iacute;a borrarlo todo y dejar su partici&oacute;n /home
intacta.
<li>Con una partici&oacute;n aparte para cualquier cosa que pueda
acumular grandes cantidades de archivos que tengan que ser
eliminados puede ser m&aacute;s r&aacute;pido reformatear y regenerar
que eliminar.  Puede ver un ejemplo en la
<a href="upgrade-minifaq.html#1.5">gu&iacute;a de
actualizaci&oacute;n</a> (<tt>/usr/obj</tt>).
<li>Si quiere recompilar el sistema desde el c&oacute;digo
fuente por cualquier motivo, los fuentes estar&aacute;n en
<tt>/usr/src</tt>.  Si no va a crear una partici&oacute;n
aparte para <tt>/usr/src</tt>, aseg&uacute;rese de que
<tt>/usr</tt> tenga espacio suficiente.
<li>Algo que se suele olvidar es que <strong>no</strong> es
necesario asignar todo el espacio de un disco cuando se
configura el sistema.  Como hoy en d&iacute;a es muy
dif&iacute;cil encontrar discos nuevos de menos de 20GB, puede
ser una buena idea dejar una parte del disco sin asignar;
as&iacute;, si una partici&oacute;n sobrepasara su
l&iacute;mite de capacidad, se podr&iacute;a asignar una nueva
partici&oacute;n del espacio libre,
<a href="faq10.html#DupFS">duplicando</a> la partici&oacute;n
existente en la nueva partici&oacute;n, cambiando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fstab&amp;sektion=5">/etc/fstab</a>
para que reflejara la nueva partici&oacute;n, y
volvi&eacute;ndola a montar.
<li>Si crea las particiones demasiado cerca del tama&ntilde;o
m&iacute;nimo requerido, probablemente se arrepienta
m&aacute;s adelante, cuando tenga que actualizar el sistema.
</ul>

<p>
<a name= "Multibooting"></a>
<a name="4.4"></a>
<h2>4.4 - Multiarranque de OpenBSD (i386, alpha)</h2>
</p>

<p>
<strong>OpenBSD y NT (o XP)</strong>
</p>

<p>
Para tener OpenBSD y NT (o XP) en una misma m&aacute;quina
puede usar el gestor de arranque del &uacute;ltimo, NTloader.
Para el multiarranque con NT necesita una copia de su
&laquo;registro de la partici&oacute;n de arranque&raquo;
(pbr, <em>partition boot record</em> de OpenBSD.
Despu&eacute;s de ejecutar installboot puede copiarlo del
siguiente modo:
</p>

<ul>
<pre>
	# <strong>dd if=/dev/rsd0a of=openbsd.pbr bs=512 count=1</strong>
</pre>
</ul>

<p>
A continuaci&oacute;n arranque NT y copie openbsd.pbr en C:.
A&ntilde;ada una l&iacute;nea como la siguiente al final de
<tt>C:\BOOT.INI</tt>:
</p>

<ul>
<pre>
	c:\openbsd.pbr=&quot;OpenBSD&quot;
</pre>
</ul>

<p>
Cuando reinicie podr&aacute; seleccionar OpenBSD desde el men&uacute;
del gestor de arranque de NT.  Puede encontrar m&aacute;s
informaci&oacute;n sobre NTloader en 
<a href="http://www.tburke.net/info/ntldr/ntldr_hacking_guide.htm">
NTLDR Hacking Guide.</a>
</p>

<p>
En Windows XP tambi&eacute;n puede editar la
informaci&oacute;n de arranque usando la interfaz
gr&aacute;fica de usuario;  puede ver m&aacute;s
informaci&oacute;n en
<a href="http://support.microsoft.com/default.aspx?scid=kb;EN-US;q289022">XP Boot.ini HOWTO</a>.
</p>

<p>
<strong>OpenBSD y Windows o DOS (i386)</strong>
</p>

<p>
Para arrancar OpenBSD junto con Windows 3.1, Windows95, o DOS,
debe usar un gestor de arranque en el sistema que pueda
manejar OpenBSD, Windows y DOS.  Algunos de estos gestores de
arranque son
<a href="http://www.freebird.org/sw-map/bootmanager.html">osbs20b8.zip</a>
o <a href="http://www.ranish.com/part/">The Ranish Partition
Manager</a>.  Estos dos pueden arrancar las particiones de
OpenBSD.
</p>

<p>
<strong>OpenBSD y Linux (i386)</strong>
</p>

<p>
Por favor, lea el documento
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/i386/INSTALL.linux">INSTALL.linux</a>,
que incluye instrucciones a fondo sobre el funcionamiento de OpenBSD
con Linux.
</p>

<p>
<a name= "SendDmesg"></a>
<a name="4.5"></a>
<h2>4.5 - Env&iacute;o de la salida de dmesg a
dmesg@openbsd.org despu&eacute;s de la instalaci&oacute;n</h2>
</p>

<p>
Recuerde que es importante para los desarrolladores de OpenBSD el poder
llevar un seguimiento del <em>hardware</em> que funciona, y del que no
funciona bien del todo...
</p>

<p>
De <em>/usr/src/etc/root/root.mail</em>:
</p>

<pre>
Si desean asegurarse de que OpenBSD funcione mejor en sus
m&aacute;quinas, h&aacute;ganos un favor (&iexcl;una vez que su sistema
de correo est&eacute; configurado!) ejecutando
	dmesg | mail dmesg@openbsd.org
para que podamos ver qu&eacute; tipo de configuraciones tienen los
usuarios.  Esta informaci&oacute;n ser&aacute; usada para mejorar el
soporte de dispositivos en versiones futuras.  Esta informaci&oacute;n
es mucho m&aacute;s &uacute;til con el n&uacute;cleo GENERIC que se
instala con el sistema, no por un n&uacute;cleo personalizado.  La
informaci&oacute;n sobre los dispositivos que obtengamos nos
ayudar&aacute; a corregir estos dispositivos.
</pre>

<p>
Aseg&uacute;rese de que env&iacute;a el mensaje por correo
electr&oacute;nico desde una cuenta en la que tambi&eacute;n pueda
recibir correo, de modo que los desarrolladores puedan contactar con Vd
en el caso que necesitaran que comprobara o cambiara algo para el
funcionamiento correcto.  No es estrictamente necesario que
env&iacute;e el mensaje desde la misma m&aacute;quina en la que haya
instalado OpenBSD;  si esa m&aacute;quina no puede recibir correo,
simplemente haga
</p>

<pre>
 $ dmesg | mail su-cuenta@sucorreo.dom
</pre>

<p>
y env&iacute;e ese mensaje a
</p>

<pre>
 dmesg@openbsd.org
</pre>

<p>
en donde <tt>su-cuenta@sucorreo.dom</tt> es su cuenta de correo normal
(o transfiera la salida de dmesg usando
ftp/scp/disquete/paloma-mensajera/...).
</p>

<p>
<strong>NOTA</strong>: Por favor, env&iacute;e s&oacute;lo el dmesg del
n&uacute;cleo GENERIC.  Los n&uacute;cleos personalizados en los que se
han eliminado dispositivos no son de ayuda.
</p>

<p>
<a name="AddFileSet"></a>
<h2>4.6 - C&oacute;mo a&ntilde;adir un archivo de
instalaci&oacute;n despu&eacute;s de haber instalado el
sistema</h2>
</p>

<p>
&laquo;&iexcl;NO!  Olvid&eacute; a&ntilde;adir uno de los
archivos durante la instalaci&oacute;n!&raquo;
</p>

<p>
A veces es realmente necesario un archivo de
instalaci&oacute;n como <tt>comp31.tgz</tt> (o cualquier otro
componente del sistema), pero nos damos cuenta demasiado tarde
de que no lo incluimos durante la instalaci&oacute;n del
sistema.  Las buenas noticias son que existen dos formas de
a&ntilde;adir estos archivos f&aacute;cilmente despu&eacute;s
de la instalaci&oacute;n inicial:
</p>

<h3>Usando el proceso de actualizaci&oacute;n</h3>

<p>
Arranque con su medio de instalaci&oacute;n (CD-ROM o
disquete) y elija la opci&oacute;n de actualizaci&oacute;n,
<tt>Upgrade</tt> (en lugar de <tt>Install</tt>, para
instalar).  Cuando vea la lista de archivos de
instalaci&oacute;n, escoja los archivos que olvid&oacute;
instalar la primera vez, seleccione su fuente de
instalaci&oacute;n, y deje que el programa de
instalaci&oacute;n lo instale.
</p>

<h3>Usando tar(1)</h3>

<p>
Los archivos de instalaci&oacute;n son simples paquetes
comprimidos, y se pueden extraer de forma manual desde el
sistema de archivos ra&iacute;z:
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee">
<pre>
# cd /
# tar xzvpf comp31.tgz
</pre>
</td></tr></table>
</ul>

<p>
NO se olvide de usar la opci&oacute;n <tt>p</tt> con la orden
anterior, para que restaure los permisos de los ficheros
correctamente.
</p>

<p>
Un concepto err&oacute;neo es el de pensar que puede usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&sektion=1">pkg_add(1)</a>
para a&ntilde;adir archivos de instalaci&oacute;n del sistema.
Esto no funciona.  pkg_add(1) es para archivos de programas,
no para archivos gen&eacute;ricos como los de
instalaci&oacute;n.
</p>

<p>
<a name="bsd.rd"></a>
<h2>4.7 - &iquest;Qu&eacute; es <em>bsd.rd</em>?</h2>
</p>

<p>
<strong><tt>bsd.rd</tt></strong> es un n&uacute;cleo del
sistema en un &laquo;disco RAM&raquo;.  Este archivo puede ser
de gran utilidad, y muchos de los desarrolladores se aseguran
de que se encuentra disponible en sus sistemas de archivos
ra&iacute;z en todo momento.

<p>
El t&eacute;rmino &laquo;n&uacute;cleo en un disco RAM&raquo;
describe el sistema de archivos del n&uacute;cleo (en lugar de
un controlador f&iacute;sico), y las utilidades disponibles
despu&eacute;s del arranque de <tt>bsd.rd</tt> que se
almacenan en el n&uacute;cleo y que se ejecutan desde un
sistema de archivos basado en RAM.  <tt>bsd.rd</tt>
tambi&eacute;n incluye algunas utilidades que permiten
mantener e instalar el sistema.
</p>

<p>
En algunas plataformas, <tt>bsd.rd</tt> es la t&eacute;cnica
de instalaci&oacute;n preferida (basta con copiarlo en un
sistema de archivos existente, iniciarlo, y ejecutar la
instalaci&oacute;n desde &eacute;l.  En la mayor&iacute;a de
plataformas, si tiene una versi&oacute;n m&aacute;s antigua de
OpenBSD, puede obtener una versi&oacute;n m&aacute;s reciente
de <tt>bsd.rd</tt>, iniciar con &eacute;sta, e instalar una
nueva versi&oacute;n de OpenBSD sin usar ning&uacute;n tipo de
medio de instalaci&oacute;n extra&iacute;ble.
</p>

<p>
He aqu&iacute; un ejemplo de arranque de <tt>bsd.rd</tt> en un
sistema i386:
</p>

<ul>
<table border="0" width="800"><tr><td nowrap bgcolor="#eeeeee">
<pre>
Using Drive: 0 Partition: 3
reading boot.....
probing pc0 com0 com1 apm mem[639k 255M a20=on]
disk fd0 hd0
&gt;&gt; OpenBSD/i386 BOOT 1.28
boot&gt; <strong>boot hd0a:/bsd.rd</strong>
<em>. . . arranque normal de instalaci&oacute;n . . .</em>
</pre>
</td></tr></table>
</ul>

<p>
Tal y como se indica, pasar&aacute; a la instalaci&oacute;n
del programa, pero tambi&eacute;n puede activar el
int&eacute;rprete de &oacute;rdenes para llevar a cabo tareas
de mantenimiento del sistema.
</p>

<p>
La regla general para arrancar con <tt>bsd.rd</tt> es cambiar
el n&uacute;cleo de arranque <tt>/bsd</tt> por el de
<tt>bsd.rd</tt> por cualquier medio que use su plataforma.
</p>

<p>
<font color="#0000e0">
<a href="index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq3.html">[Secci&oacute;n 3.0 - C&oacute;mo obtener OpenBSD]</a>
<a href="faq5.html">[Secci&oacute;n 5.0 - C&oacute;mo configurar OpenBSD]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq4.html,v 1.107 2002/07/12 02:51:35 nick Exp ]<br>
$Translation: faq4.html,v 1.40 2002/07/14 07:03:30 horacio Exp $<br>
$OpenBSD: faq4.html,v 1.34 2002/07/14 12:24:28 jufi Exp $
</small>
</p>
</body>
</html>
