<html>
<head>
<title>4.0 - Gu&iacute;a de instalaci&oacute;n</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2001 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238E">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">4.0 - Gu&iacute;a de
instalaci&oacute;n</font><hr></h2>
</p>

<p>
<ul><h3>Tabla de contenidos</h3>
<li><a href="faq4.html#4.1">4.1 - R&aacute;pida introducci&oacute;n al
    procedimiento de instalaci&oacute;n de OpenBSD.</a>
<li><a href="faq4.html#4.2">4.2 - &iquest;Qu&eacute; ficheros son
    necesarios para la instalaci&oacute;n?</a>
<li><a href="faq4.html#4.3">4.3 - &iquest;Cu&aacute;nto espacio necesito
    para instalar OpenBSD?</a>
<li><a href="faq4.html#4.4">4.4 - Multiarranque de OpenBSD.</a>
<li><a href="faq4.html#4.5">4.5 - Enviar el dmesg a dmesg@openbsd.org
    despu&eacute;s de la instalaci&oacute;n.</a>
<li><a href="#8meg">La instalaci&oacute;n se para en MAKEDEV en mi i386
    con 8MB de RAM.</a>
</ul>
</p>

<hr>

<p>
<a name="4.1"></a>
<h2>4.1 - Introducci&oacute;n r&aacute;pida a la instalaci&oacute;n de
OpenBSD</h2>
</p>

<p>
Esta secci&oacute;n de las preguntas frecuentes ahora contiene
instrucciones para la instalaci&oacute;n de OpenBSD 2.8.  Pueden
existir diferencias entre la instalaci&oacute;n de la versi&oacute;n
2.8 y la de versiones anteriores de OpenBSD.
</p>

<p>
OpenBSD dispone de un procedimiento de instalaci&oacute;n muy robusto,
basado en texto.  Este procedimiento de instalaci&oacute;n fue
dise&ntilde;ado para que se pudiera adaptar a casi todas las
situaciones posibles con las que se puede encontrar un usuario.
Adem&aacute;s de la robustez, el procedimiento de instalaci&oacute;n se
puede llevar a cabo usando el disquete n&uacute;mero 1.  El
procedimiento de instalaci&oacute;n es muy parecido para todas las
arquictecturas, aunque con frecuencia se requieren distintos grupos de
herramientas para cada una de las arquitecturas.  A continuaci&oacute;n
enumeraremos las diferentes opciones de las que dispondr&aacute;n los
usuarios de OpenBSD cuando instalen el sistema.
</p>

<p>
La informaci&oacute;n que sigue a continuaci&oacute;n se
ofrece independientemente de la arquitectura que se utilice.
Por favor, lea las instrucciones de instalaci&oacute;n
correspondientes a cada arquitectura, o busque
informaci&oacute;n concreta sobre las arquitecturas en la
cubierta del CD de OpenBSD.
</p>

<h3>4.1.1 - Arquitecturas con soporte en OpenBSD</h3>

<p>
Las arquitecturas para las que existe soporte en OpenBSD 2.9
se OpenBSD 2.9 dispone de soporte para una n&uacute;mero de
arquitecturas que se mencionan por orden alfab&eacute;tico a
continuaci&oacute;n.  Por favor, lea la p&aacute;gina
correspondiente a cada arquitectura para saber con detalle
para qu&eacute; componentes o modelos existe soporte en el
sistema.

<ul>
   <li><a href="../../es/alpha.html">alpha</a>
       - M&aacute;quinas DEC basadas en procesadores Alpha.
   <li><a href="../../es/amiga.html">amiga</a>
       - Modelos de Amiga basados en procesadores m68k (requieren MMU).
   <li><a href="../../es/hp300.html">hp300</a>
       - M&aacute;quinas HP300/HP400 de Hewlett-Packard.
   <li><a href="../../es/i386.html">i386</a>
       - Computadoras (ordenadores) personales basados en procesadores
	 Intel.
   <li><a href="../../es/mac68k.html">mac68k</a>
       - La mayor&iacute;a de modelos de Apple Macintosh basados en el
	 procesador MC680x0.
   <li><a href="../../es/mvme68k.html">mvme68k</a>
       - Tarjetas VME MVME147/16x/17x 68K de Motorola.
   <li><a href="../../es/macppc.html">macppc</a>
       - Modelos de Apple con procesadores PowerPC.
   <li><a href="../../es/sparc.html">sparc</a>
       - La plataforma SPARC de Sun Microsystems.
   <li><a href="../../es/sun3.html">sun3</a>
       - Modelos Sun3 basados en el procesador 68020 de Sun.
   <li><a href="../../es/vax.html">vax</a>
       - M&aacute;quinas VAX de DEC.
</ul>

<h3>4.1.2 - Medios de instalaci&oacute;n con soporte</h3>

<p>
Existe la posibilidad de instalar OpenBSD desde varios tipos distintos
de medios.  A continuaci&oacute;n se mencionan las opciones que son
m&aacute;s comunes y que son independientes de la arquitectura.  Estas
opciones se pueden utilizar despu&eacute;s de arrancar desde un CD-ROM
o desde un disquete.  Podr&aacute; encontrar m&aacute;s
informaci&oacute;n sobre <a href="#4.1.3">c&oacute;mo crear un disco de
instalaci&oacute;n de OpenBSD</a> m&aacute;s adelante.
</p>

<table align="center" border="1" width="800">
	<tr>
		<td>
			<strong>CD-ROM</strong>
		</td>
		<td bgcolor="#eeeeee">
		Para instalar desde un CD-ROM es necesario haber
		adquirido un <a href="../../es/orders.html">CDROM
		oficial de OpenBSD</a>, o haber creado uno.  Sin lugar
		a dudas &eacute;sta es la forma m&aacute;s f&aacute;cil
		para instalar un sistema OpenBSD.<br>
		<strong>NOTA:</strong> Se puede arrancar desde los CD
		oficiales de OpenBSD siempre que su BIOS permita esta
		opci&oacute;n.

		</td>
	</tr><tr>
		<td>
			<strong>FTP</strong>
		</td>
		<td bgcolor="#eeeeee">
		Esta opci&oacute;n de instalaci&oacute;n le permite
		instalar OpenBSD baj&aacute;ndose antes los paquetes de
		instalaci&oacute;n en tiempo real a trav&eacute;s de la
		red.  Con esta opci&oacute;n puede escoger una
		direcci&oacute;n IP est&aacute;tica u obtener una
		direcci&oacute;n IP por medio de DHCP.
		</td>
	</tr><tr>
		<td>
			<strong>Local Filesystem</strong>
		</td>
		<td bgcolor="#eeeeee">
		Esta opci&oacute;n le permite instalar desde archivos
		disponibles previamente desde un sistema de archivos.
		En el disco de instalaci&oacute;n hay soporte para
		sistemas de archivos de DOS, EXT2FS y FFS.
		</td>
	</tr>
</table>

<a name="4.1.3"></a>
<h3>4.1.3 - Crear disquetes de instalaci&oacute;n con arranque de
OpenBSD</h3>

<p>
Para crear un disquete con la imagen de instalaci&oacute;n, primero
debe obtener la imagen de arranque correcta desde uno de los sitios de
distribuci&oacute;n de OpenBSD.  Puede encontrar una lista de
servidores de FTP en la p&aacute;ginas de
<a href="../../es/ftp.html">distribuci&oacute;n por FTP de OpenBSD</a>.
Cada arquitectura dispone de una imagen que se puede bajar, excepto la
plataforma <a href="../../es/i386.html">i386</a>, para la que se puede
escoger entre 3 im&aacute;genes.  Las diferencias entre los diferentes
disquetes de instalaci&oacute;n para la plataforma i386 se detallan
m&aacute;s adelante.  Para el resto de las arquitecturas s&oacute;lo
tiene que bajarse la imagen <em>floppy28.fs</em> correspondiente.<br>
<strong>NOTA:</strong> La imagen <em>cdrom28.fs</em> se puede utilizar
para crear un CD-ROM de instalaci&oacute;n con arranque de OpenBSD.
</p>

<p>
La plataforma i386 tiene 3 discos de instalaci&oacute;n distintos entre
los que deber&aacute; escoger uno.  Las diferencias se muestran a
continuaci&oacute;n:

<ul>
   <li><strong>floppy28.fs</strong>
       con soporte para los siguientes dispositivos:
       <p>
       Ethernet:
       <ul>
          <li>NE2000 PCMCIA
          <li>3com 3c5xx PCMCIA
          <li>Xircom PCMCIA
       </ul>
       Disco:
       <ul>
          <li>ISAPNP/PCMCIA IDE
	      (<em>todas las im&aacute;genes de disquete tienen soporte
	      para IDE ISA y PCI</em>)
          <li>BusLogic [57]4X SCSI
          <li>Adaptec 154[02] SCSI
          <li>Adaptec 174[024] SCSI
          <li>Adaptec 274X/284X/2940 SCSI
          <li>NCR 538XX SCSI
          <li>AdvanSys 1200A/B/Ultra/Ultrawide SCSI
          <li>Seagate ST0[12] SCSI
       </ul>
<p>
   <li><strong>floppyB28.fs</strong>
       con soporte para los siguientes dispositivos (que no tienen
       soporte en floppy28.fs):
       <p>
       Disk:
       <ul>
          <li>Qlogic ISP [12]0x0 SCSI/FibreChannel
          <li>UltraStor [123]4f SCSI
          <li>WD7000/TMC-7000 SCSI
       </ul>
<p>
   <li><strong>floppyC28.fs</strong>
       con soporte para Cardbus y PCIBIOS:
       <p>
       Ethernet:
       <ul>
          <li>CardBus 3C575TX, 3C[CX]FE575BT, y 3C[CX3]FE575CT de 3Com 
	  <li>CardBus 3C[CX]FEM656, 3C[CX]FEM656B, y 3C[CX3]FEM656C de
	      3Com
          <li>CardBus AN985 Centaur-C de ADMtek
          <li>CardBus EtherJet 10/100 de IBM
          <li>CardBus II PRO/100 de Intel
       </ul>
<p>
</ul>

<p>
La mayor&iacute;a de usuarios de i386 usar&aacute;n el disquete de
instalaci&oacute;n <em>floppy28.fs</em>.
</p>

<p>
Una vez que ya disponga de la imagen de disquete correcta,
necesitar&aacute; un disquete en blanco.  Si hubiera ALG&Uacute;N
sector err&oacute;neo en el disquete, la instalaci&oacute;n
fallar&iacute;a con casi total seguridad.  Si no est&aacute; seguro,
use la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdformat&sektion=0">fdformat(1)</a>
para dar formato y verificar los sectores err&oacute;neos.
</p>

<ul>
<table border="0" width="800">
	<tr>
		<td nowrap bgcolor="#eeeeee">
# <strong>fdformat /dev/fd0a</strong><br>
Format 1440K floppy `/dev/fd0a'? (y/n): y<br>
Processing VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV done.
		</td>
	</tr>
</table>
</ul>

<p>
Si en su pantalla ve algo como lo anterior, entonces su disquete
est&aacute; en buen estado.  Sin embargo, si no ve TODAS las
&laquo;V&raquo;, entonces es muy probable que su disco est&eacute; en
mal estado, y deber&iacute;a probar con uno virgen.  Si va a
formatearlo desde MS-DOS, use la orden <em>format</em> de DOS.
</p>

<p>
Una vez que tenga un disquete vac&iacute;o y con formato, puede empezar
a volcar la imagen de instalaci&oacute;n a &eacute;ste.  Si lo va a
hacer desde un sistema OpenBSD u otro sistema operativo tipo UNIX,
puede usar la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=0">dd(1)</a>.  A continuaci&oacute;n tiene un ejemplo de c&oacute;mo hacerlo:
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
# <strong>dd if=floppy28.fs of=/dev/rfd0c bs=126b</strong>
                </td>
        </tr>
</table>
</ul>

<p>
En cuanto haya volcado la imagen al disquete, aseg&uacute;rese que la
imagen volcada sea la misma que la original con la siguiente orden.
Si est&aacute; bien no ver&aacute; ninguna salida, s&oacute;lo otro
punto de pedido.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
# <strong>cmp /dev/rfd0c floppy28.fs</strong>
                </td>
        </tr>
</table>
</ul>

<p>
Si va a crear esta imagen desde una plataforma de DOS/Windows, puede
obtener las herramientas necesarias desde el directorio
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/tools/">tools</a> en
cualquiera de las r&eacute;plicas de ftp, o del directorio
<strong>2.8/tools</strong> en el CD1 de OpenBSD.  Todo lo que
necesitar&aacute;n los usuarios de Windows ser&aacute; el programa
<em>rawrite</em> para volcar la imagen a su disquete de arranque.
</p>

<ul>
Ejemplo de utilizaci&oacute;n de <em>rawrite</em>:
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
C:\&gt; <strong>rawrite</strong><br>
RaWrite 1.2 - Write disk file to raw floppy diskette<br><br>

Enter source file name: <strong>floppy28.fs</strong><br>
Enter destination drive: <strong>a</strong><br>
Please insert a formatted diskette into drive A: and press -ENTER- : <strong>&lt;Intro&gt;</strong>
                </td>
        </tr>
</table>
</ul>

<p>
Si usa NT, <em>rawrite</em> no le servir&aacute;.  Puede utilizar otros
programas como <em>fdimage</em> o <em>ntrw</em> para volcar la imagen
al disquete de arranque.  Estos dos programas est&aacute;n disponibles
en los sitios de ftp o en los CD de OpenBSD.  He aqu&iacute; un ejemplo
sobre c&oacute;mo usar cada uno de ellos:
</p>

<ul>
Ejemplo de utilizaci&oacute;n de <em>fdimage</em>:
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
C:\&gt; <strong>fdimage -q floppy28.fs a:</strong>
                </td>
        </tr>
</table>

Ejemplo de utilizaci&oacute;n de <em>ntrw</em>:
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
C:\&gt; <strong>ntrw floppy28.fs a:</strong><br>
3.5&quot;, 1.44MB, 512 bytes/sector<br>
bufsize is 9216<br>
1474560 bytes written<br>
                </td>
        </tr>
</table>
</ul>

<h3>4.1.4 - Arrancar con las im&aacute;genes de instalaci&oacute;n de
OpenBSD</h3>

<p>
Esta secci&oacute;n est&aacute; dividida en subsecciones, de acuerdo
con las diferentes arquitecturas m&aacute;s usadas y para las que
existe soporte en OpenBSD.  La hemos subdividido de este modo para que
podamos dar a cada usuario las instrucciones correctas sobre lo que
deben hacer en sus respectivas plataformas.
</p>

<h4>Arranque de i386</h4>

<ul>
<p>
Para la mayor&iacute;a de personas, arrancar e instalar desde una
imagen en la arquitectura i386 no es nada nuevo.  Si va a usar el
disquete con la imagen, introd&uacute;zcalo en su disquetera y encienda
su m&aacute;quina.  Si va a usar el CD para el arranque, antes debe
entrar en la BIOS de su m&aacute;quina y configurar las opciones de
arranque para permitir el arranque desde el dispositivo de CD.  Algunas
BIOS ya viejas no presentan esta opci&oacute;n, y por tanto
tendr&aacute; que usar un disquete para el arranque.  Pero no se
preocupe, ya que aun arrancando desde un disquete podr&aacute; instalar
desde el CD.
</p>
</ul>

<h4>Arranque de sparc</h4>

<ul>
<p>
Para arrancar desde un disquete, introduzca su disquete con la imagen
de instalaci&oacute;n de OpenBSD en su disquetera.  A
continuaci&oacute;n use la siguiente orden para arrancar desde el
disquete:
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
ok <strong>boot floppy</strong>
                </td>
        </tr>
</table>
</ul>

<p>
Para arrancar desde el CDROM, introduzca su CD de OpenBSD en el
dispositivo de CDROM.  Si su estaci&oacute;n Sun s&oacute;lo tiene un
dispositivo de CDROM, vaya al punto de arranque y desde &eacute;ste
ejecute '<tt>boot cdrom</tt>':
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
ok <strong>boot cdrom</strong>
                </td>
        </tr>
</table>
</ul>

<p>
Esto s&oacute;lo funcionar&aacute; en el modo de &oacute;rdenes nuevo.
Si su punto de &oacute;rdenes es el antiguo (una flecha a la derecha),
escriba 'n' para entrar en el modo de &oacute;rdenes nuevo (si
est&aacute; usando una vieja sparc anterior al modelo sun4c, es
probable que no tenga un modo de &oacute;rdenes nuevo, en cuyo caso
tendr&aacute; que experimentar Vd mismo).  Si tiene varios dispositivos
de CDROM, tiene que arrancar desde el correcto.  Pruebe
<tt>probe-scsi</tt> desde el modo de &oacute;rdenes nuevo.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
ok <strong>probe-scsi</strong><br>
Target 0<br>
  Unit 0   Disk     QUANTUM LIGHTNING 365S<br>
Target 1<br>
  Unit 0   Removable Disk     QUANTUM EMPIRE_1080S<br>
Target 3<br>
  Unit 0   Removable Disk     Joe's CD ROMs<br>
                </td>
        </tr>
</table>
</ul>

<p>
Averig&uuml;e cu&aacute;l es el CDROM desde el que quiere arrancar.
Anote el n&uacute;mero que le corresponda.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
ok <strong>boot /sbus/esp/sd@X,0</strong>
                </td>
        </tr>
</table>
</ul>

<p>
Ahora que su disco de arranque ya ha sido creado, es el momento de
arrancar desde &eacute;l.  Cuando arranque con este disquete, el
n&uacute;cleo del sistema y todos los programas que OpenBSD usa para
instalarse se cargar&aacute;n en la memoria.  Si surgiera alg&uacute;n
problema y su disco de arranque no funcionara, es probable que se deba
a que el disquete estaba en mal estado.  &iexcl;&Eacute;ste es un
problema muy com&uacute;n!  Si el disquete le falla durante el
arranque, int&eacute;ntelo de nuevo, y si le vuelve a fallar
t&iacute;relo y utilice un disquete virgen y nuevo.  Cuando un disquete
falla en el proceso de arranque, aun cuando ese mismo disquete haya
funcionado bien anteriormente, tenga en cuenta que OpenBSD usa
pr&aacute;cticamente todos y cada uno de los bits disponibles en el
disquete.  Cualquier error en el disco impedir&aacute; que se cargue
OpenBSD.
</p>

<p>
Cuando haya arrancado con &eacute;xito ver&aacute; una cantidad de
texto en blanco sobre fondo azul;  este texto son mensajes del
n&uacute;cleo del sistema que le indica qu&eacute; dispositivos
est&aacute; encontrando y d&oacute;nde los encuentra.
</p>
<!-- begin added text -->
<p>
Ahora le pedir&aacute; que introduzca el camino hasta el
int&eacute;rprete (<em>shell</em>) que vaya a utilizar o que pulse
<kbd>intro</kbd> para seleccionar <em>sh</em> como int&eacute;rprete
predeterminado.  Acepte este &uacute;ltimo, y a continuaci&oacute;n le
preguntar&aacute; si desea instalar, actualizar o invocar al
int&eacute;rprete de &oacute;rdenes (<em>(I)nstall, (U)pgrade or
(S)hell?</em>).  Seleccione la opci&oacute;n <kbd>i</kbd> para
instalar, despu&eacute;s de lo cual le mostrar&aacute; un mensaje:
</p>
<!-- end added text -->
<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
rootdev=0x1100 rrootdev=0x2f00 rawdev=0x2f02<br>
Enter pathname of shell or RETURN for sh:<br>
erase ^?, werase ^W, kill ^U, intr ^C<br>
(I)nstall, (U)pgrade or (S)hell? <strong>i</strong><br>
==================================================<br>
Welcome to the OpenBSD/i386 2.8 installation program.<br><br>

This program is designed to help you put OpenBSD on your disk in a simple and<br>
rational way.<br><br>

As with anything which modifies your disk's contents, this program can cause<br>
SIGNIFICANT data loss, and you are advised to make sure your data is backed<br>
up before beginning the installation process.<br><br>

Default answers are displayed in brackets after the questions.  You can hit<br>
Control-C at any time to quit, but if you do so at a prompt, you may have<br>
to hit return.  Also, quitting in the middle of installation may leave your<br>
system in an inconsistent state.  If you hit Control-C and restart the<br>
install, the install program will remember many of your old answers.<br><br>

You can run a shell command at any prompt via '!foo'<br>
or escape to a shell by simply typing '!'.<br><br>

Specify terminal type [pcvt25]: <strong>&lt;Intro&gt;</strong>
                </td>
        </tr>
</table>
</ul>
<!-- begin added text -->
<p>
En este mensaje le advierte que el uso de el programa puede provocar
una p&eacute;rdida de datos en el disco, y le aconseja que haga antes
una copia de seguridad (respaldo) de sus datos.  Tambi&eacute;n le
indica que puede abandonar el programa de instalaci&oacute;n en
cualquier momento, presionando las teclas <kbd>Control-C</kbd> (si lo
hace desde un punto de pedido tendr&aacute; que pulsar <kbd>intro</kbd>
a continuaci&oacute;n), y que puede ejecutar &oacute;rdenes mediante el
int&eacute;rprete (<em>shell</em>), precedi&eacute;ndolas con un signo
de exclamaci&oacute;n final (<kbd>!orden</kbd>), o invocar al
int&eacute;rprete mediante la orden ´<kbd><strong>!</strong></kbd>´.
</p>

<p>
Despu&eacute;s le preguntar&aacute; por el tipo de terminal de su
equipo.  Dependiendo de la arquitectura que est&eacute; usando, el tipo
de terminal que necesita puede variar.  Por ejemplo, OpenBSD/sparc usa
el tipo de terminal &laquo;sun&raquo;.  En OpenBSD/i386 puede escoger
el predeterminado, &laquo;pcvt25&raquo;, pulsando <kbd>intro</kbd>.
</p>
<!-- end added text -->
</ul>

<h3>4.1.5 - Configurar los discos durante la instalaci&oacute;n</h3>

<p>
La configuraci&oacute;n de los discos duros (r&iacute;gidos) en OpenBSD
es muy parecida para todas las plataformas.  La configuraci&oacute;n
del disco duro para i386 se lleva a cabo en dos partes.  Una con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&sektion=8&arch=i386">fdisk(8)</a>, y la otra con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&sektion=8">disklabel(8)</a>.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
The installation program needs to know which disk to consider the root disk.<br>
Note the unit number may be different than the unit number you used in the<br>
boot program (especially on a PC with multiple disk controllers).<br>
Available disks are:<br><br>

wd0<br><br>

Which disk is the root disk? [wd0] <strong>&lt;Intro&gt;</strong><br>
Do you want to use the *entire* disk for OpenBSD? [no] <strong>yes</strong><br><br>

[...]
                </td>
        </tr>
</table>
</ul>

<p>
&Eacute;sta es la parte de la instalaci&oacute;n en la que
escoger&aacute; qu&eacute; disco quiere que sea su disco
&laquo;ra&iacute;z&raquo; (<em>root</em>).  En este disco ra&iacute;z
ser&aacute; en donde se ubicar&aacute;n los sistemas de archivos
<em>root</em> ('/') y <em>swap</em>.  <strong>wd0</strong> indica un
disco IDE, pero si sus discos son SCSI ver&aacute; <strong>sd0</strong>
en su lugar.  Deber&iacute;a existir una entrada para cada disco que
encuentre OpenBSD.  Si decide utilizar el disco completo para OpenBSD,
el programa de instalaci&oacute;n configurar&aacute; el espacio del
disco de forma autom&aacute;tica; si, por el contrario, decidiera
utilizar s&oacute;lo parte del disco, el programa de instalaci&oacute;n
abrir&iacute;a el editor de discos,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&sektion=8&arch=i386">fdisk(8)</a>.
Puede ver m&aacute;s informaci&oacute;n sobre el uso de fdisk(8) en la
<a href="faq14.html#14.2">secci&oacute;n 14.2</a> de las preguntas
frecuentes.
</p>

<p>
NOTA: OpenBSD no dispone de soporte para ning&uacute;n sistema
de archivos del tipo ReiserFS, JFS de IBM o XFS de SGI.
En lugar de &eacute;stos usamos <a href="faq14.html#14.5">Soft
Updates</a>.  El sistema de archivos de OpenBSD es FFS.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
Inside the BIOS 'A6' ('OpenBSD') partition you just created, there resides an<br>
OpenBSD partition table which defines how this BIOS partition is to be split<br>
up. This table declares the offsets and sizes of your / partition, your swap<br>
space, and any other partitions you might create.  (NOTE: The OpenBSD disk<br>
label offsets are absolute, ie. relative to the start of the disk... NOT<br>
relative to the start of the BIOS 'A6' partition).<br><br>

disklabel: no disk label<br>
WARNING: Disk wd0 has no label. You will be creating a new one.<br><br>

If this disk is shared with other operating systems, those operating systems<br>
should have a BIOS partition entry that spans the space they occupy completely.<br>
For safety, also make sure all OpenBSD file systems are within the offset and<br>
size specified in the 'A6' BIOS partition table.  (By default, the disklabel<br>
editor will try to enforce this).  If you are unsure of how to use multiple<br>
partitions properly (ie. separating /,  /usr, /tmp, /var, /usr/local, and other<br>
things) just split the space into a root and swap partition for now.<br><br>

# using MBR partition 3: type A6 off 63 (0x3f) size 16450497 (0xfb03c1)<br><br>

Treating sectors 63-80041248 as the OpenBSD portion of the disk.<br>
You can use the 'b' command to change this.<br>

Initial label editor (enter '?' for help at any prompt)<br>
&gt; <strong>?</strong><br>
<pre>
Available commands:
        p [unit]  - print label.
        M         - show entire OpenBSD man page for disklabel.
        e         - edit drive parameters.
        a [part]  - add new partition.
        b         - set OpenBSD disk boundaries.
        c [part]  - change partition size.
        d [part]  - delete partition.
        g [d|b]   - Use [d]isk or [b]ios geometry.
        m [part]  - modify existing partition.
        n [part]  - set the mount point for a partition.
        r         - recalculate free space.
        u         - undo last change.
        s [path]  - save label to file.
        w         - write label to disk.
        q         - quit and save changes.
        x         - exit without saving changes.
        X         - toggle expert mode.
        ? [cmnd]  - this message or command specific help.
Numeric parameters may use suffixes to indicate units:
        'b' for bytes, 'c' for cylinders, 'k' for kilobytes, 'm' for megabytes,
        'g' for gigabytes or no suffix for sectors (usually 512 bytes).
        Non-sector units will be rounded to the nearest cylinder.
</pre>
Entering '?' at most prompts will give you (simple) context sensitive help.<br>
                </td>
        </tr>
</table>
</ul>
<!-- begin added text -->
<p>
Desde el editor de clasificaciones del disco,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&sektion=8">disklabel(8)</a>,
puede obtener ayuda pulsando <kbd>?</kbd>.  Si desea obtener m&aacute;s
informaci&oacute;n sobre una de las &oacute;rdenes que aparecen en el
men&uacute; de ayuda, pulse <kbd>?</kbd> seguido de la letra
correspondiente a la orden deseada.  El men&uacute; de ayuda que se
muestra en la tabla anterior indica:
</p>

<pre>
&Oacute;rdenes disponibles:
        p [unit]  - mostrar la clasificaci&oacute;n.
        M         - mostrar la p&aacute;gina del manual de disklabel.
        e         - editar los par&aacute;metros del dispositivo.
        a [part]  - a&ntilde;adir una partici&oacute;n nueva.
        b         - fijar los l&iacute;mites del disco para OpenBSD.
        c [part]  - cambiar el tama&ntilde;o de la partici&oacute;n.
        d [part]  - borrar una partici&oacute;n existente.
        g [d|b]   - usar la geometr&iacute;a del [d]isco o de la [b]ios.
        m [part]  - modificar una partici&oacute;n existente.
        n [part]  - fijar el punto de montaje para una partici&oacute;n.
        r         - recalcular el espacio libre.
        u         - deshacer el &uacute;ltimo cambio.
        s [path]  - grabar la clasificaci&oacute;n en archivo.
        w         - grabar la clasificaci&oacute;n en el disco.
        q         - salir y grabar los cambios.
        x         - salir sin grabar los cambios.
        X         - pasar a modo de experto.
        ? [cmnd]  - mostrar este mensaje de ayuda o la ayuda
	            espec&iacute;fica para una orden.
Los par&aacute;metros num&eacute;ricos pueden usar sufijos para indicar el tipo de unidades:
        'b' para bytes, 'c' para cilindros, 'k' para kilobytes, 'm' para megabytes,
        'g' para gigabytes, o sin sufijo para sectores (generalmente 512 bytes).
	Las unidades sin sectores se redondear&aacute;n hacia el cilindro m&aacute;s pr&oacute;ximo.
</pre>

<p>
As&iacute; pues, puede obtener la informaci&oacute;n sobre su disco con
la orden <kbd>p</kbd>.
</p>
<!-- end added text -->
<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
&gt; <strong>p</strong><br>
device: /dev/rwd0c<br>
type: ESDI<br>
disk: ESDI/IDE disk<br>
label: Maxtor 54098U8<br>
bytes/sector: 512<br>
sectors/track: 63<br>
tracks/cylinder: 16<br>
sectors/cylinder: 1008<br>
cylinders: 16383<br>
total sectors: 80041248<br>
free sectors: 80041185<br>
rpm: 3600<br><br>

16 partitions:<br>
#        size   offset    fstype   [fsize bsize   cpg]<br>
  a: 16450497       63    unused        0     0<br>
  c: 80041248        0    unused        0     0<br>
&gt; <strong>d a</strong><br>
&gt; <strong>a a</strong><br>
offset: [63] <strong>&lt;Intro&gt;</strong><br>
size: [80041185] <strong>80m</strong><br>
Rounding to nearest cylinder: 164241<br>
FS type: [4.2BSD] <strong>&lt;Intro&gt;</strong><br>
mount point: [none] <strong>/</strong><br>
&gt; <strong>a b</strong>
offset: [164304] <strong>&lt;Intro&gt;</strong><br>
size: [79876944] <strong>300m</strong><br>
Rounding to nearest cylinder: 614880
FS type: [swap] <strong>&lt;Intro&gt;</strong><br>
&gt; <strong>a d</strong><br>
offset: [779184] <strong>&lt;Intro&gt;</strong><br>
size: [79262064] <strong>80m</strong><br>
Rounding to nearest cylinder: 164304
FS type: [4.2BSD] <strong>&lt;Intro&gt;</strong><br>
mount point: [none] <strong>/tmp</strong><br>
&gt; <strong>a e</strong><br>
offset: [943488] <strong>&lt;Intro&gt;</strong><br>
size: [79097760] <strong>80m</strong><br>
Rounding to nearest cylinder: 164304
FS type: [4.2BSD] <strong>&lt;Intro&gt;</strong><br>
mount point: [none] <strong>/var</strong><br>
&gt; <strong>a g</strong><br>
offset: [1107792] <strong>&lt;Intro&gt;</strong><br>
size: [78933456] <strong>350m</strong><br>
Rounding to nearest cylinder: 716688
FS type: [4.2BSD] <strong>&lt;Intro&gt;</strong><br>
mount point: [none] <strong>/usr</strong><br>
&gt; <strong>a h</strong><br>
offset: [1824480] <strong>&lt;Intro&gt;</strong><br>
size: [78216768] <strong>&lt;Intro&gt;</strong><br>
FS type: [4.2BSD] <strong>&lt;Intro&gt;</strong><br>
mount point: [none] <strong>/home</strong><br>
&gt; <strong>p</strong><br>
device: /dev/rwd0c<br>
type: ESDI<br>
disk: ESDI/IDE disk<br>
label: Maxtor 54098U8<br>
bytes/sector: 512<br>
sectors/track: 63<br>
tracks/cylinder: 16<br>
sectors/cylinder: 1008<br>
cylinders: 16383<br>
total sectors: 80041248<br>
free sectors: 0<br>
rpm: 3600<br><br>

<pre>
16 partitions:
#        size   offset    fstype   [fsize bsize   cpg]
  a:   164241       63    4.2BSD     1024  8192    16  # /
  b:   614880   164304      swap
  c: 80041248        0    unused        0     0
  d:   164304   779184    4.2BSD     1024  8192    16  # /tmp
  e:   164304   943488    4.2BSD     1024  8192    16  # /var
  g:   716688  1107792    4.2BSD     1024  8192    16  # /usr
  h: 78216768  1824480    4.2BSD     1024  8192    16  # /home
</pre>
&gt; <strong>w</strong><br>
&gt; <strong>q</strong><br>
No label changes.<br>
                </td>
        </tr>
</table>
</ul>

<!-- begin added text -->
<p>
En OpenBSD, la partici&oacute;n <strong>a</strong> corresponde al
sistema de archivos ra&iacute;z (<em>root</em>), y la partici&oacute;n
<strong>b</strong> al espacio de memoria de intercambio
(<em>swap</em>).  <strong>c</strong> representa siempre al disco
entero, y puede usar el resto de las letras para crear particiones para
sistemas de archivos adicionales hasta un n&uacute;mero total de 16 por
disco.  Antes de crear una nueva partici&oacute;n (v.g. <kbd>&gt;a
a</kbd>), debe comprobar que &eacute;sta no exista, y si existiera
deber&aacute; eliminarla antes de crearla (v.g. <kbd>&gt;d a</kbd>).
</p>
<!-- end added text -->

<p>
N&oacute;tese el modo en el que est&aacute; dividido dentro de su
propia partici&oacute;n cada punto de montaje.  Para una m&aacute;quina
multiusuario es mejor crear un m&iacute;nimo de cinco sistemas de
archivos diferentes, uno para '/' (<em>root</em>), otro para
<em>swap</em>, otro para <em>/var</em>, otro para <em>/tmp</em>, y otro
para <em>/usr</em>.  Si los usuarios del sistema van a guardar ficheros
de gran tama&ntilde;o, ser&aacute; conveniente tener tambi&eacute;n un
sistema de archivos <em>/home</em> separado.
</p>

<h3>4.1.6 - Configurar los puntos de montaje y dar formato a los
sistemas de archivos</h3>

<p>
Existen cuatro razones principales para la utilizaci&oacute;n de
sistemas de archivos separados, en lugar de meter todo junto en uno o
dos sistemas de archivos:
</p>

<ul>
<li><strong>Seguridad:</strong> Puede marcar algunos sistemas de
    archivos como 'nosuid', 'nodev', 'noexec', 'readonly', etc...
<li><strong>Estabilidad:</strong> Un usuario, o un programa que
    funcione mal, podr&iacute;a llenar un sistema de archivos con
    basura si tuviera permiso de escritura para &eacute;ste.  Con
    sistemas de archivos separados, sus programas cr&iacute;ticos, que
    por supuesto se ejecutar&iacute;an en ese sistema de archivos
    separado, no se interrumpir&iacute;an.
<li><strong>Velocidad:</strong> Un sistema de archivos sobre el que se
    escribe con frecuencia puede llegar a sufrir algo de
    fragmentaci&oacute;n (por suerte, los sistemas de archivos ffs que
    usa OpenBSD no sufren de fragmentaciones fuertes).
<li><strong>Integridad:</strong> Si un sistema de archivos se
    corrompiera por cualquier motivo, el resto estar&iacute;a a salvo.
</ul>

<p>
La configuraci&oacute;n de los puntos de montaje es mucho m&aacute;s
simple de lo que parece.  Despu&eacute;s de que haya configurado sus
sistemas de archivos con disklabel(8), ver&aacute; unas l&iacute;neas
de texto como las que siguen a continuaci&oacute;n.  Si
configur&oacute; sus puntos de montaje con disklabel(8), esto se
har&aacute; de forma autom&aacute;tica, de lo contrario lo puede hacer
desde aqu&iacute;.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
You will now have the opportunity to enter filesystem information for wd0.
You will be prompted for the mount point (full path, including the prepending
'/' character) for each BSD partition on wd0.  Enter "none" to skip a
partition or "done" when you are finished.

The following partitions will be used for the root filesystem and swap:
        wd0a    /
        wd0b    swap

Mount point for wd0d (size=82152k) [/tmp, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for wd0e (size=82152k) [/var, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for wd0g (size=358344k) [/usr, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for wd0h (size=39108384k) [/home, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for wd0d (size=82002k) [/tmp, RET, none, or done]? done <strong>&lt;Intro&gt;</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<!-- begin added text -->
<p>
A continuaci&oacute;n le dar&aacute; la oportunidad de editar otro
disco duro.  Si dispone de otros discos en su sistema, &eacute;stos
aparecer&aacute;n con la etiqueta correspondiente: <kbd>wd1, wd2</kbd>,
... si son discos IDE;  &oacute; <kbd>sd0, sd1</kbd>, ... si son discos
SCSI.  Introduzca la etiqueta correspondiente al disco que quiera
editar.  Si s&oacute;lo dispone de un disco duro, acepte la
opci&oacute;n predeterminada (<em>[done]</em>) para terminar este paso
y continuar con el proceso de instalaci&oacute;n:
</p>
<!-- end added text -->

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
Now you can select another disk to initialize.  (Do not re-select a disk
you have already entered information for).  Available disks are:

wd0

Which one? [done] <strong>&lt;Intro&gt;</strong>

You have configured the following devices and mount points:

wd0a /
wd0d /tmp
wd0e /var
wd0g /usr
wd0h /home
</pre>
                </td>
        </tr>
</table>
</ul>

<!-- begin added text -->
<p>
Finalmente, en el paso siguiente le preguntar&aacute; si desea grabar
los cambios en el disco, avis&aacute;ndole que sobreescribir&aacute;
cualquier dato existente en el disco.
</p>
<!-- end added text -->

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
============================================================
The next step will overwrite any existing data on:
        wd0a wd0d wd0e wd0g wd0h

Are you really sure that you're ready to proceed? [n] <strong>y</strong>
Creating filesystems...
Warning: 64 sector(s) in last cylinder unallocated
/dev/rwd0a:     164240 sectors in 163 cylinders of 16 tracks, 63 sectors
        80.2MB in 11 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
/dev/rwd0d:     164304 sectors in 163 cylinders of 16 tracks, 63 sectors
        80.2MB in 11 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
/dev/rwd0e:     164304 sectors in 163 cylinders of 16 tracks, 63 sectors
        80.2MB in 11 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
/dev/rwd0g:     716688 sectors in 711 cylinders of 16 tracks, 63 sectors
        349.9MB in 45 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
/dev/rwd0h:     78216768 sectors in 77596 cylinders of 16 tracks, 63 sectors
        38191.8MB in 4850 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
</pre>
                </td>
        </tr>
</table>
</ul>

<p>
N&oacute;tese que la respuesta predeterminada aqu&iacute; es no, por lo
que deber&aacute; indicarle expl&iacute;citamente que s&iacute; que
desea dar formato a sus clasificaciones del disco.  Si escogiera no,
entonces invocar&iacute;a al int&eacute;rprete (<em>shell</em>) y
podr&iacute;a empezar la instalaci&oacute;n de nuevo ejecutando
<em>install</em>, o simplemente reiniciando el sistema con su disco de
arranque.  Desde aqu&iacute; el programa dar&aacute; formato a todos
los sistemas de archivo, lo que podr&iacute;a tardar bastante tiempo
dependiendo del tama&ntilde;o de su disco.
</p>

<h3>4.1.7 - Configuraci&oacute;n de la red</h3>

<p>
Ahora ya puede configurar su red.  Este paso es de una importancia
capital si va a llevar a cabo una instalaci&oacute;n por red,
considerando que para ello se basar&aacute; en la informaci&oacute;n
que introduzca en esta parte.  Aqu&iacute; puede ver una gu&iacute;a de
la secci&oacute;n de configuraci&oacute;n de la red durante el proceso
de instalaci&oacute;n.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
You will now be given the opportunity to configure the network.  This will be
useful if you need to transfer the installation sets via FTP, HTTP, or NFS.
Even if you choose not to transfer installation sets that way, this information
will be preserved and copied into the new root filesystem.

Configure the network [y] <strong>&lt;Intro&gt;</strong>
Enter system hostname (short form): [] <strong>mybox</strong>
Enter DNS domain name: [] <strong>cualquierisp.com</strong>

If you have any devices being configured by a DHCP server
it is recommended that you do not enter a default route or
any name servers.

You may configure the following network interfaces (the interfaces
marked with [X] have been succesfully configured):

        [ ] fxp0

Configure which interface? (or, enter 'done') [fxp0] <strong>&lt;Intro&gt;</strong>
IP address (or 'dhcp') ? [] <strong>199.185.137.55</strong>
Symbolic (host) name? [test2] <strong>&lt;Intro&gt;</strong>
Netmask ? [255.255.255.0] <strong>&lt;Intro&gt;</strong>
Your use of the network interface may require non-default
media directives.  The default media is:
        media: Ethernet autoselect (100baseTX full-duplex)
This is a list of supported media:
        media autoselect
        media 100baseTX mediaopt full-duplex
        media 100baseTX
        media 10baseT mediaopt full-duplex
        media 10baseT
If the default is not satisfactory, and you wish to use another
media, copy that line from above (e.g. &quot;media 100baseTX&quot;)
Media directives? [] <strong>&lt;Intro&gt;</strong>

You may configure the following network interfaces (the interfaces
marked with [X] have been succesfully configured):

        [X] fxp0
Configure which interface? (or, enter 'done') [done] <strong>&lt;Intro&gt;</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<p>
En el ejemplo anterior usamos una direcci&oacute;n IP est&aacute;tica.
Tambi&eacute;n puede usar DHCP.  En el caso de DHCP la mayor parte de
esta informaci&oacute;n se obtendr&aacute; desde un servidor remoto de
dhcp.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#EEEEEE">
<pre>
Enter IP address of default route: [none] <strong>199.185.137.128</strong>
Enter IP address of primary nameserver: [none] <strong>199.185.137.1</strong>
Would you like to use the nameserver now? [y] <strong>&lt;Intro&gt;</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<h3>4.1.8 - Elegir el medio de instalaci&oacute;n</h3>

<p>
Despu&eacute;s de que su red haya sido configurada, el gui&oacute;n de
instalaci&oacute;n le dar&aacute; la oportunidad de realizar cambios a
su configuraci&oacute;n de red (sobre todo por si cometi&oacute;
alg&uacute;n error).  Entonces se crear&aacute;n los sistemas de
archivos y se montar&aacute;n, y se activar&aacute; una
contrase&ntilde;a para el usuario de administraci&oacute;n del sistema
(<em>root</em>, el omnipotente superusuario).  De esta forma sus discos
estar&aacute;n preparados para poder instalar en ellos los paquetes de
OpenBSD.  En cuanto sus discos est&eacute;n preparados le dar&aacute;
la oportunidad de escoger el medio de instalaci&oacute;n.  Las opciones
aparecen m&aacute;s adelante.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
You will now be given the opportunity to escape to the command shell to do
any additional network configuration you may need.  This may include adding
additional routes, if needed.  In addition, you might take this opportunity
to redo the default route in the event that it failed above.
Escape to shell? [n] <strong>&lt;Intro&gt;</strong>

/dev/wd0a on /mnt type ffs (rw, asynchronous, local)
/dev/wd0d on /mnt/tmp type ffs (rw, asynchronous, local)
/dev/wd0e on /mnt/var type ffs (rw, asynchronous, local)
/dev/wd0g on /mnt/usr type ffs (rw, asynchronous, local)
/dev/wd0h on /mnt/home type ffs (rw, asynchronous, local)

Please enter the initial password that the root account will have.
Password (will not echo): <strong>&lt;&iexcl;Escriba su nueva contrase&ntilde;a!&gt;</strong>
Password (again): <strong>&lt;&iexcl;Su contrase&ntilde;a otra vez!&gt;</strong>

Do you expect to run the X Window System? [y] <strong>&lt;Intro&gt;</strong>

It is now time to extract the installation sets onto the hard disk.  Make sure
the sets are either on a local device (i.e. tape, CD-ROM) or on a network
server.  You will have the chance to repeat this step or to extract sets from
several places, so you don't have to try to load all the sets in one try and
can recover from some errors.

Install from (f)tp, (h)ttp, (t)ape, (C)D-ROM, (N)FS or local (d)isk? <strong>c</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<p>
En este ejemplo, la instalaci&oacute;n la llevaremos a cabo mediante el
CDROM.  Le mostrar&aacute; una lista de los dispositivos que
identifique como CDROM en su m&aacute;quina.  La mayor&iacute;a de
usuarios s&oacute;lo tendr&aacute;n uno;  si tiene m&aacute;s de uno
deber&aacute; asegurarse de escoger el dispositivo desde el que va a
instalar OpenBSD.  Despu&eacute;s de escoger el dispositivo correcto le
preguntar&aacute; por el sistema de archivos en el que residir&aacute;n
los archivos de instalaci&oacute;n.  Si est&aacute; usando el CDROM de
OpenBSD, responda escogiendo 'c', ya que 'c' representa la totalidad
del disco.  He aqu&iacute; un ejemplo:
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
The following CD-ROM devices are installed on your system; please make
sure the CD is in the CD-ROM drive and select the device containing
the CD with the installation sets:

cd0

Which CD-ROM contains the installation media? [cd0] <strong>&lt;Intro&gt;</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<p>
Ahora le preguntar&aacute; por los sistemas de archivos que debe usar
cuando lea el CDROM, y por el directorio en el que se encuentran los
archivos de instalaci&oacute;n.  Si est&aacute; usando el CDROM oficial
de OpenBSD, responda 'cd9660' (&eacute;sta es la opci&oacute;n
predeterminada) para el sistema de archivos.  El directorio en el que
residen los archivos ser&aacute; entonces '/2.8/i386/' (&eacute;sta
tambi&eacute;n es la opci&oacute;n predeterminada).  Despu&eacute;s de
esto ver&aacute; una lista de paquetes para instalar.  Puede obtener
una descripci&oacute;n de estos ficheros en la
<a href="#4.2">secci&oacute;n 4.2</a> de estas preguntas frecuentes.
Esto es lo que ver&aacute;:

<h3>4.1.9 - Elecci&oacute;n de archivos para instalar y finalizar la
instalaci&oacute;n del sistema.</h3>

<p>
Ahora puede escoger los archivos que va a instalar.  Puede ver una
descripci&oacute;n de estos archivos en la
<a href="#4.2">secci&oacute;n 4.2</a>.  El instalador mostrar&aacute;
en pantalla aquellos archivos que encuentre.  Lo &uacute;nico que debe
hacer Vd es especificar cu&aacute;les desea instalar.  Hay cuatro
archivos preseleccionados, y que son: 'base28.tar.gz', 'etc28.tar.gz',
'man28.tar.gz' y 'bsd'.  Los tres primeros archivos DEBEN ser
instalados para que el sistema disponga de cierto grado de
funcionalidad, y el &uacute;ltimo, 'bsd', es el n&uacute;cleo del
sistema.  La instalaci&oacute;n del resto queda a su libre
elecci&oacute;n.  En el ejemplo siguiente puede ver una
instalaci&oacute;n completa, a excepci&oacute;n del archivo de juegos.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
Enter the directory relative to the mount point that
contains the file. [/2.8/i386] <strong>&lt;Intro&gt;</strong>

You will now be asked for files to extract.  In addition to the
files listed in the selector you may enter any file located in
/mnt2//2.8/i386.  You can also enter 'all' to install all the standard
sets, or 'list' to list the files avilable in /mnt2//2.8/i386.
When you are done selecting files, enter 'done'.
Some of these sets are required for your install and some are optional --
You will want at least the base and bsd sets.
Consult the installation notes if you are not sure which sets are required!

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base28.tgz
        [X] etc28.tgz
        [ ] misc28.tgz
        [ ] comp28.tgz
        [X] man28.tgz
        [ ] game28.tgz
        [ ] xbase28.tgz
        [ ] xshare28.tgz
        [ ] xfont28.tgz
        [ ] xserv28.tgz
        [X] bsd
File name? [] <strong>*</strong>

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base28.tgz
        [X] etc28.tgz
        [X] misc28.tgz
        [X] comp28.tgz
        [X] man28.tgz
        [X] game28.tgz
        [X] xbase28.tgz
        [X] xshare28.tgz
        [X] xfont28.tgz
        [X] xserv28.tgz
        [X] bsd
File name? [] <strong>-game*</strong>

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base28.tgz
        [X] etc28.tgz
        [X] misc28.tgz
        [X] comp28.tgz
        [X] man28.tgz
        [ ] game28.tgz
        [X] xbase28.tgz
        [X] xshare28.tgz
        [X] xfont28.tgz
        [X] xserv28.tgz
        [X] bsd
File name? [] <strong>done</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<p>
Una vez que ya haya escogido los archivos que desea instalar, le
preguntar&aacute; si est&aacute; seguro de querer extraer estos
archivos y pasar&aacute; a instalarlos.  Le mostrar&aacute; una barra
de progreso mediante la cual le mantendr&aacute; informado del tiempo
que tarde.  El tiempo depender&aacute; en gran medida de la
m&aacute;quina en la que se encuentre instalando OpenBSD.
Despu&eacute;s pasar&aacute; a copiar los ficheros de
configuraci&oacute;n (de la red y del sistema de archivos) desde el
disco de intalaci&oacute;n a su disco duro.
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
/mnt2//2.8/i386/base28.tgz:
100% |**************************************************| 21192 KB    00:00 ETA
/mnt2//2.8/i386/etc28.tgz:
100% |**************************************************|   987 KB    00:00 ETA
/mnt2//2.8/i386/man28.tgz:
100% |**************************************************|  4957 KB    00:00 ETA
/mnt2//2.8/i386/bsd:
100% |**************************************************|  3053 KB    00:00 ETA
/mnt2//2.8/i386/misc28.tgz:
100% |**************************************************|  1644 KB    00:00 ETA
/mnt2//2.8/i386/comp28.tgz:
100% |**************************************************| 14406 KB    00:00 ETA
/mnt2//2.8/i386/xbase28.tgz:
100% |**************************************************|  5504 KB    00:00 ETA
/mnt2//2.8/i386/xshare28.tgz:
100% |**************************************************|  1538 KB    00:00 ETA
/mnt2//2.8/i386/xfont28.tgz:
100% |**************************************************|  6019 KB    00:00 ETA
/mnt2//2.8/i386/xserv28.tgz:
100% |**************************************************| 15035 KB    00:00 ETA

Extract more sets? [n] <strong>&lt;Intro&gt;</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<p>
Cuando haya acabado con esta parte ya s&oacute;lo le
faltar&aacute; configurar su franja horaria e instalar los
bloques de arranque.  La configuraci&oacute;n de la franja
horaria no tiene ning&uacute;n secreto.  Basta con escoger la
zona en la que vive e introducir el nombre de &eacute;sta.
&iexcl;Eso es todo!  S&oacute;lo queda una duda por resolver,
y es si va a tener X funcionando en este servidor.  Si cree
que en alg&uacute;n momento va a necesitar X debe responder
<em>yes</em>, o en caso contrario tendr&aacute; que editar su
fichero <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl.conf&sektion=5">etc/sysctl.conf(5)</a>
y cambiar <em>machdep.allowaperture=0</em> por
<em>machdep.allowaperture=1</em>.  Despu&eacute;s de esto
ejecute la orden 'reboot' para reiniciar el sistema desde el
punto del int&eacute;rprete (<em>shell prompt</em>) &iexcl;y
su m&aacute;quina iniciar&aacute; con OpenBSD!
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
Copying fstab, hostname.fxp0, hosts, myname, mygate, resolv.conf,  ...done.

Select a time zone for your location. Timezones are represented on the system
by a directory structure rooted in &quot;/usr/share/timezone&quot;. Most timezones can
be selected by entering a token like &quot;MET&quot; or &quot;GMT-6&quot;.  Other zones are
grouped by continent or country, with detailed zone information separated by
a slash (&quot;/&quot;), e.g. &quot;US/Pacific&quot; or &quot;Canada/Mountain&quot;.

To get a listing of what's available in /usr/share/zoneinfo, enter &quot;?&quot;
at the prompts below.

What timezone are you in? [`?' for list] [GMT] <strong>?</strong>
Africa/      Chile/       GB-Eire      Israel       NZ-CHAT      Turkey
America/     Cuba         GMT          Jamaica      Navajo       UCT
Antarctica/  EET          GMT+0        Japan        PRC          US/
Arctic/      EST          GMT-0        Kwajalein    PST8PDT      UTC
Asia/        EST5EDT      GMT0         Libya        Pacific/     Universal
Atlantic/    Egypt        Greenwich    MET          Poland       W-SU
Australia/   Eire         HST          MST          Portugal     WET
Brazil/      Etc/         Hongkong     MST7MDT      ROC          Zulu
CET          Europe/      Iceland      Mexico/      ROK          posixrules
CST6CDT      Factory      Indian/      Mideast/     Singapore
Canada/      GB           Iran         NZ           SystemV/
What timezone are you in? [`?' for list] [GMT] <strong>Canada</strong>
There are several timezones available within zone 'Canada'
Select a sub-timezone [`?' for list]: ?
Atlantic            Eastern             Pacific
Central             Mountain            Saskatchewan
East-Saskatchewan   Newfoundland        Yukon
There are several timezones available within zone 'Canada'
Select a sub-timezone [`?' for list]: Mountain
You have selected timezone &quot;Canada/Mountain&quot;.
Installing timezone link.
Making all device nodes (by running /dev/MAKEDEV all) ...... done.
Installing boot block...
boot: /mnt/boot
proto: /usr/mdec/biosboot
device: /dev/rwd0c
/usr/mdec/biosboot: entry point 0
proto bootblock size 512
room for 12 filesystem blocks at 0x16f
Will load 7 blocks of size 8192 each.
Using disk geometry of 63 sectors and 255 heads.
 0: 20 @(0 108 44) (6847-6866)
 1: 63 @(0 109 1) (6867-6929)
 2: 13 @(0 110 1) (6930-6942)
 3:  5 @(0 9 59) (625-629)
 4: 11 @(0 10 1) (630-640)
/mnt/boot: 5 entries total
using MBR partition 3: type 166 (0xa6) offset 63 (0x3f)

Enabling machdep.allowaperture. Read xf86(4) for more information.

Unmounting filesystems... /mnt/home /mnt/usr /mnt/var /mnt/tmp /mnt ... Done.
Done.

CONGRATULATIONS!  You have successfully installed OpenBSD!  To boot the
installed system, enter halt at the command prompt. Once the system has
halted, reset the machine and boot from the disk.

# <strong>reboot</strong>
</pre>
                </td>
        </tr>
</table>
</ul>

<h3>Despu&eacute;s de reiniciar</h3>

<p>
En esta secci&oacute;n le ofrecemos algunas pistas sobre lo que debe
hacer una vez haya instalado OpenBSD.  Estas pistas se basan en la
p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&sektion=8&format=html">afterboot(8)</a>,
que deber&iacute;a ser lo primero que leyera despu&eacute;s de instalar
OpenBSD.  Aqu&iacute; puede ver una tabla que se&ntilde;ala las
secciones relevantes del documento de preguntas frecuentes:
</p>

<ul>
<li><a href="faq10.html#10.8">A&ntilde;adir nuevos usuarios en
    OpenBSD</a>
<li><a href="faq6.html#6.1">Configuraci&oacute;n inicial de la red</a>
<li><a href="faq2.html#2.3">P&aacute;ginas del manual de la
    &oacute;rdenes de uso m&aacute;s frecuente</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi">Interfaz de
    <em>web</em> para las p&aacute;ginas del manual de OpenBSD</a>
<li><a href="faq8.html#8.7">Paquetes para OpenBSD</a>
    - Paquetes de binarios precompilados.
</ul>

<p>
<p>
Le recordamos que es importante que los desarrolladores de OpenBSD
puedan llevar un seguimiento de los equipos y componentes que
funcionan, as&iacute; como de aqu&eacute;llos que no funcionan bien...
</p>

<p>
Tal y como indica el mensaje de /usr/src/etc/root/root.mail
<pre>
Si quiere asegurarse de que OpenBSD funcione mejor en sus m&aacute;quinas, por favor
ejecute (&iexcl;despu&eacute;s de que tenga su sistema de correo funcionando!)
        dmesg | mail dmesg@openbsd.org
para que podamos ver los diferentes tipos de configuraci&oacute;n que tienen los usuarios.
Usaremos esta informaci&oacute;n para mejorar el soporte para controladores de dispositivos
en versiones futuras (esta informaci&oacute;n nos es de utilidad con el n&uacute;cleo GENERIC,
(no con un n&uacute;cleo personalizado).  La informaci&oacute;n sobre los controladores
de dispositivos que obtengamos de esto nos ayudar&aacute; a mejorarlos.
</pre>
Repase tambi&eacute;n la <a href= "faq14.html#14.7">secci&oacute;n
14.7</a>.
</p>

<p>
Aseg&uacute;rese de enviarnos el mensaje desde una cuenta a la que
tambi&eacute;n pueda recibir correo, para que los desarrolladores
puedan contactar con Vd en caso de que haya algo que quieran que
verifique o que cambie para corregir su configuraci&oacute;n.  No es
necesario que env&iacute;e el mensaje desde la misma m&aacute;quina en
la que haya instalado OpenBSD;  si en &eacute;sta no puede recibir
correo:

<pre>
 dmesg | mail sucuenta@correo.dom
</pre>

y reenv&iacute;e el mensaje a

<pre>
 dmesg@openbsd.org
</pre>

en donde <tt>sucuenta@correo.dom</tt> es su cuenta de correo normal (o
transfiera la salida de dmesg usando
ftp/scp/disquete/paloma-mensajera/... ).
</p>

<p>
<strong>NOTA</strong> - Por favor, env&iacute;e s&oacute;lo el dmesg
del n&uacute;cleo GENERIC.  Los nucleos compilados personalizados que
incluyan o excluyan controladores de dispositivos no sirven.
</p>

<a name="1.14"></a>
<h2>Otros recursos de informaci&oacute;n y preguntas comunes</h2>

<ul>
Disponemos de documentos espec&iacute;ficos para aquellos usuarios que
usen plataformas diversas.  Puede obtenerlos desde cualquiera de las
r&eacute;plicas del servidor de ftp.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.i386">INSTALL.i386</a> - Documento de instalaci&oacute;n detallada.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.linux">INSTALL.linux</a> - Instalaci&oacute;n de OpenBSD junto con Linux.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.mbr">INSTALL.mbr</a> - Documento sobre el &laquo;registro de arranque maestro&raquo; (<em>MBR</em>).
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.pt">INSTALL.pt</a> - Documento sobre las tablas de particiones.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.dbr">INSTALL.dbr</a> - Sector de arranque del disquete en DOS.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.chs">INSTALL.chs</a> - Documento sobre la traducci&oacute;n <em>CHS</em> (cilindros - cabezales - sectores).
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.ata">INSTALL.ata</a> - Preguntas frecuentes sobre ATA/ATA-1/ATA-2/IDE/EIDE/etc...
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.9/i386/INSTALL.os2br">INSTALL.os2br</a> - El sector de arranque de os2.
</ul>

<p>
<strong>Pregunta:</strong>
- &iquest;Puedo obtener una imagen ISO de OpenBSD?
</p>

<p>
<strong>Respuesta:</strong>
- No.  Los derechos de autor de la composici&oacute;n oficial del CDROM
pertenecen a Theo de Raadt.  Esto se hace para motivar a los usuarios a
que adquieran los CD.  Pero estos derechos s&oacute;lo son aplicables a
la composici&oacute;n, y no al sistema OpenBSD que es de libre
distribuci&oacute;n.  Nada ni nadie puede impedir que una persona se
baje OpenBSD y componga su propio CD.
</p>

<a name="8meg"></a>
<p>
<strong>Pregunta:</strong>
- Tengo problemas de instalaci&oacute;n con 8MB de RAM.
&iquest;Qu&eacute; puedo hacer?
</p>

<p>
<strong>Respuesta:</strong>
- Es un problema muy frecuente que un sistema con poca memoria de RAM,
al final de la instalaci&oacute;n se cuelgue en <em>MAKEDEV</em>.  Hay
una soluci&oacute;n para esto.  Debe activar la memoria de intercambio
(<em>swap</em>) durante la instalaci&oacute;n.  H&aacute;galo tal y
como se describe a continuaci&oacute;n:
</p>

<ul>
<li>Inicie el proceso de instalaci&oacute;n normalmente
<li>Configure sus discos con
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&sektion=8">fdisk(8)</a> y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&sektion=8">disklabel(8)</a>
    como ya se ha descrito anteriormente.
<li>Despu&eacute;s de configurar los discos, y DESPU&Eacute;S de
    haberlos formateado, pulse <em>&lt;CNTRL&gt;-C</em> para pasar al
    int&eacute;rprete de &oacute;rdenes (<em>shell</em>).
<li>Ejecute la orden <em>reboot</em> para reiniciar la m&aacute;quina.
<li>En esta ocasi&oacute;n deber&aacute; saltarse las partes
    correspondientes a
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&sektion=8">fdisk(8)</a> y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&sektion=8">disklabel(8)</a>.
    Para ello ejecute la orden <em>exit</em> desde fdisk(8), y luego la
    orden <em>q</em> desde disklabel(8).
<li>Contin&uacute;e con el proceso de instalaci&oacute;n hasta haber
    completado la <strong>configuraci&oacute;n de la red</strong>.
    <strong>NOTA:</strong> Esta parte tiene lugar despu&eacute;s de la
    instalaci&oacute;n de los archivos.  Cuando llegue a ella pulse
    <em>&lt;CNTRL&gt;-z</em>, que le devolver&aacute; al punto del
    int&eacute;rprete.
<li>Es desde este punto desde donde debe activar <em>swap</em>.  Para
    ello ejecute <em>/mnt/sbin/swapctl -a /dev/wd0b</em>, o
    <em>/dev/sd0b</em>, o cualquiera que sea su dispositivo de
    <em>swap</em>.
<ul>
<li>Si no lo encontrara, monte su partici&oacute;n <em>root</em> en
    <em>/mnt</em> para buscarla.
</ul>
<li>Ahora ya puede ejecutar <em>fg</em> para continuar con el resto de
    la instalaci&oacute;n.
</ul>

<p>
Si ha seguido estas instrucciones y aun as&iacute; tiene problemas,
env&iacute;e un mensaje a
<a href="mailto:ericj@openbsd.org">Eric Jackson &lt;ericj@openbsd.org&gt;</a>.
</p>

<p>
<a name="4.2"></a>
<h2>4.2 - &iquest;Qu&eacute; archivos son necesarios para la
instalaci&oacute;n?</h2>
</p>

<p>
Existen muchos archivos que contienen ficheros binarios de OpenBSD
pero, &iquest;cu&aacute;les son los necesarios para que funcione el
sistema?  He aqu&iacute; una vista r&aacute;pida de cada paquete:
</p>

<p>
<ul>
   <li><strong>base26.tar.gz</strong> - Contiene la base del sistema de
       OpenBSD - <strong>Requerido</strong></li>
   <li><strong>etc26.tar.gz</strong> - Contiene todos los ficheros de
       <em>/etc</em> - <strong>Requerido</strong></li>
   <li><strong>comp26.tar.gz</strong> - Contiene el compilador y sus
       herramientas y bibliotecas - <strong>Recomendado</strong></li>
   <li><strong>man26.tar.gz</strong> - Contiene las p&aacute;ginas del
       manual - <strong>Recomendado</strong></li>
   <li><strong>misc26.tar.gz</strong> - Contiene informaci&oacute;n
       miscel&aacute;nea y documentos sobre la configuraci&oacute;n.</li>
   <li><strong>game26.tar.gz</strong> - Contiene juegos para OpenBSD.</li>
   <li><strong>xbase26.tar.gz</strong> - Contiene la base para la
       instalaci&oacute;n de X11.</li>
   <li><strong>xfont26.tar.gz</strong> - Contiene el servidor de fuentes
       para X11 y fuentes.</li>
   <li><strong>xlink26.tar.gz</strong> - Contiene el enlace al grupo de 
       servidores de X.</li>
   <li><strong>xserv26.tar.gz</strong> - Contiene los servidores de X
       para X11.</li>
   <li><strong>xshare26.tar.gz</strong> - Contiene p&aacute;ginas del
       manual, configuraciones para la internacionalizaci&oacute;n,
       ficheros include, etc...  para X.</li>
   <li><strong>bsd</strong> - N&uacute;cleo del sistema.
       <strong>Requerido</strong></li>
</ul>
</p>

<p>
<a name="4.3"></a>
<h2> 4.3 - &iquest;Cu&aacute;nto espacio necesito para instalar
OpenBSD?</h2>
</p>

<p>
Se sugiere usar los siguientes tama&ntilde;os de espacios para una
instalaci&oacute;n completa del sistema.  Las cifras incluyen el
suficiente espacio adicional como para una instalaci&oacute;n
t&iacute;pica de un sistema en su casa conectado a internet.

<ul>
<li>Para un sistema multiusuario es recomendable triplicar estos
valores.
<li>Si va a instalar una cantidad significativa de software de terceras
partes, haga una partici&oacute;n <em>/usr</em> grande.
&iexcl;<strong>Como m&iacute;nimo</strong> triplique estos valores!
<li>Para un sistema que vaya a gestionar mucho correo
electr&oacute;nico o p&aacute;ginas web (almacenados respectivamente en
<em>/var/mail</em> y <em>/var/www</em>), la partici&oacute;n
<em>/var</em> deber&aacute; ser bastante m&aacute;s grande.
<li>Para un sistema multiusuario que genere muchos mensajes de registro
(<em>log</em>), la partici&oacute;n <em>/var</em> a&uacute;n
tendr&aacute; que ser mucho m&aacute;s grande (<em>/var/log</em>).
</ul>

Mientras lea esto recuerde que tanto <em>/usr</em> como
<em>/usr/X11R6</em> son, por regla general, parte del mismo sistema de
archivos;  o sea, parte de <em>/usr</em>, ya que no hay ninguna ventaja
importante en mantenerlos como sistemas de archivos separados.

<ul>
<strong>
<pre>
SYSTEM          /       /usr    /var    /usr/X11R6
alpha           56M     540M    27M     161M
amiga           45M     399M    24M      36M
hp300           31M     234M    24M      47M
i386            35M     229M    24M      72M
mac68k          29M     232M    24M      36M
mvme68k         29M     232M    24M       -  (no Xserver)
pmax            50M     355M    24M      60M
sparc           40M     259M    24M      49M
</pre>
</strong>
</ul>

<p>
Cuando se encuentre en el editor del disco
(&quot;<em>disklabel</em>&quot;), puede escoger que su sistema tenga
s&oacute;lo 'a' (sistema de archivos principal) y 'b' (memoria de
intercambio, <em>swap</em>).  El sistema de archivos 'a' que configure
en <em>disklabel</em> ser&aacute; su partici&oacute;n ra&iacute;z
(<em>root</em>), que se debe componer de la suma de los tres valores
principales anteriores (<em>/</em>, <em>/usr</em>, y <em>/var</em>),
m&aacute;s algo de espacio para <em>/tmp</em>.  La partici&oacute;n 'b'
ser&aacute; la partici&oacute;n <em>swap</em> del sistema.  Para esta
partici&oacute;n recomendamos un m&iacute;nimo de 32MB, pero si dispone
de suficiente espacio en el disco use un m&iacute;nimo de 64MB.  Si
tiene mucho espacio de sobre en el disco, lo mejor es que la haga de
256MB, o incluso de 512MB.

<p>
Existen cuatro razones principales para usar sistemas de archivos
separados en lugar de meterlo todo en dos sistemas de archivos:

<ul>
<li><strong>Seguridad</strong>: puede marcar algunos sistemas de
archivos como 'nosuid', 'nodev', 'noexec', 'readonly', etc...
<li><strong>Estabilidad</strong>: un usuario, o un programa con un
comportamiento incorrecto, puede llenar un sistema de archivos de
basura si tiene permiso de escritura sobre &eacute;ste.  De este modo,
los programas m&aacute;s cr&iacute;ticos, que por supuesto
funcionar&aacute;n en un sistema de archivos diferente, no ser&aacute;n
interrumpidos.
<li><strong>Velocidad</strong>: un sistema de archivos sobre el que se
escriba con frecuencia puede acabar algo fragmentado.  Por suerte, el
sistema de archivos de tipo ffs, que es el que usa OpenBSD, no es
propenso a la fragmentaci&oacute;n.
<li><strong>Integridad</strong>: si un sistema de archivos se
corrompiera por cualquier motivo, el resto de sistemas quedar&iacute;an
intactos.
</ul>

<p>
<a name="4.4"></a>
<h2>4.4 - Multiarranque de OpenBSD (i386, alpha)</h2>
</p>

<p>
<strong>OpenBSD y NT</strong>
</p>

<p>
Para tener OpenBSD y NT en una misma m&aacute;quina puede usar el
gestor de arranque del &uacute;ltimo, NTloader.  Para el multiarranque
con NT necesita una copia de su &laquo;registro de la partici&oacute;n
de arranque&raquo; (pbr, <em>partition boot record</em> de OpenBSD.
Despu&eacute;s de ejecutar installboot puede copiarlo del siguiente
modo:
</p>

<ul>
<pre>
	# <strong>dd if=/dev/rsd0c of=openbsd.pbr bs=512 count=1</strong>
</pre>
</ul>

<p>
A continuaci&oacute;n arranque NT y copie openbsd.pbr en c:.
A&ntilde;ada una l&iacute;nea como la siguiente al final de
c:\boot.ini:
</p>

<ul>
<pre>
	c:\openbsd.pbr=&quot;OpenBSD&quot;
</pre>
</ul>

<p>
Cuando reinicie podr&aacute; seleccionar OpenBSD desde el men&uacute;
del gestor de arranque de NT.  Puede encontrar m&aacute;s
informaci&oacute;n sobre NTloader en 
<a href="http://www.tburke.net/info/ntldr/ntldr_hacking_guide.htm">
NTLDR Hacking Guide.</a>
</p>

<p>
<strong>OpenBSD y Windows o DOS (i386)</strong>
</p>

<p>
Para arrancar OpenBSD junto con Windows 3.1, Windows95, o DOS, debe
usar un gestor de arranque en el sistema que pueda manejar OpenBSD,
Windows y DOS.  Algunos de estos gestores de arranque son
<a href="http://www.freebird.org/sw-map/bootmanager.html">osbs20b8.zip</a> o
<a href="http://www.users.intercom.com/~ranish/part/">The Ranish
Partition Manager</a>.
Estos dos pueden arrancar las particiones de OpenBSD.
</p>

<p>
<strong>OpenBSD y Linux (i386)</strong>
</p>

<p>
Por favor, lea el documento
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.8/i386/INSTALL.linux">INSTALL.linux</a>,
que incluye instrucciones a fondo sobre el funcionamiento de OpenBSD
con Linux.
</p>

<p>
<a name="4.5"></a>
<h2>4.5 - Enviar el dmesg a dmesg@openbsd.org despu&eacute;s de la
Instalaci&oacute;n</h2>
</p>

<p>
Recuerde que es importante para los desarrolladores de OpenBSD el poder
llevar un seguimiento del <em>hardware</em> que funciona, y del que no
funciona bien del todo...
</p>

<p>
De <em>/usr/src/etc/root/root.mail</em>:

<pre>
Si desean asegurarse de que OpenBSD funcione mejor en sus
m&aacute;quinas, h&aacute;ganos un favor (&iexcl;una vez que su sistema
de correo est&eacute; configurado!) ejecutando
	dmesg | mail dmesg@openbsd.org
para que podamos ver qu&eacute; tipo de configuraciones tienen los
usuarios.  Esta informaci&oacute;n ser&aacute; usada para mejorar el
soporte de dispositivos en versiones futuras.  Esta informaci&oacute;n
es mucho m&aacute;s &uacute;til con el n&uacute;cleo GENERIC que se
instala con el sistema, no por un n&uacute;cleo personalizado.  La
informaci&oacute;n sobre los dispositivos que obtengamos nos
ayudar&aacute; a corregir estos dispositivos.
</pre>

Vea tambi&eacute;n la <a href="faq14.html#14.7">secci&oacute;n 14.7</a>
</p>

<p>
Aseg&uacute;rese de que env&iacute;a el mensaje por correo
electr&oacute;nico desde una cuenta en la que tambi&eacute;n pueda
recibir correo, de modo que los desarrolladores puedan contactar con Vd
en el caso que necesitaran que comprobara o cambiara algo para el
funcionamiento correcto.  No es estrictamente necesario que
env&iacute;e el mensaje desde la misma m&aacute;quina en la que haya
instalado OpenBSD;  si esa m&aacute;quina no puede recibir correo,
simplemente haga

<pre>
 dmesg | mail su-cuenta@sucorreo.dom
</pre>

y env&iacute;e ese mensaje a

<pre>
 dmesg@openbsd.org
</pre>

en donde <tt>su-cuenta@sucorreo.dom</tt> es su cuenta de correo normal
(o transfiera la salida de dmesg usando
ftp/scp/disquete/paloma-mensajera/...).
</p>

<p>
<strong>NOTA</strong>: Por favor, env&iacute;e s&oacute;lo el dmesg del
n&uacute;cleo GENERIC.  Los n&uacute;cleos personalizados en los que se
han eliminado dispositivos no son de ayuda.
</p>

<p>
<font color="#0000e0">
<a href="index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq3.html">[Secci&oacute;n 3.0 - Obtener OpenBSD]</a>
<a href="faq5.html">[Secci&oacute;n 5.0 - Configuraci&oacute;n de OpenBSD]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq4.html,v 1.90 2001/12/07 17:08:39 millert Exp ]<br>
$Translation: faq4.html,v 1.27 2001/12/08 13:19:19 horacio Exp $<br>
$OpenBSD: faq4.html,v 1.22 2001/12/30 11:48:26 jufi Exp $
</small>
</p>
</body>
</html>
