<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>4 - Gu&iacute;a de instalaci&oacute;n de OpenBSD 3.3</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq3.html">[Secci&oacute;n 3 - C&oacute;mo obtener OpenBSD]</a>
<a href="faq5.html">[Secci&oacute;n 5 - C&oacute;mo compilar OpenBSD]</a>
</font>

<h1><font color="#e00000">4 - Gu&iacute;a de instalaci&oacute;n de
OpenBSD 3.3</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#Overview">4.1 - Breve introducci&oacute;n al procedimiento
de instalaci&oacute;n de OpenBSD</a>
<li><a href="#Checklist">4.2 - Lista de comprobaciones antes de la
instalaci&oacute;n</a>
<li><a href="#MkInsMedia">4.3 - C&oacute;mo crear un medio de
instalaci&oacute;n con arranque de OpenBSD</a>
    <ul>
	<li><a href="#UnixFlop">4.3.1 - C&oacute;mo crear un disquete en
	Unix</a>
	<li><a href="#DosFlop">4.3.2 - C&oacute;mo crear un disquete en
	Windows o DOS</a>
	<li><a href="#MkCD-ROM">4.3.3 - C&oacute;mo crear un CD de
	arranque</a>
    </ul>
<li><a href="#Boot">4.4 - C&oacute;mo arrancar con el medio de
instalaci&oacute;n de OpenBSD</a>
<li><a href="#Install">4.5 - C&oacute;mo llevar a cabo una
instalaci&oacute;n</a>
  <ul>
  <li><a href="#Start">4.5.1 - Inicio de la instalaci&oacute;n</a>
  <li><a href="#Disks">4.5.2 - Configuraci&oacute;n de los discos</a>
  <li><a href="#Hostname">4.5.3 - Configuraci&oacute;n del nombre del
  sistema</a>
  <li><a href="#Network">4.5.4 - Configuraci&oacute;n de la red</a>
  <li><a href="#InstMedia">4.5.5 - Elecci&oacute;n de un medio de
  instalaci&oacute;n</a>
  <li><a href="#Filesets">4.5.6 - Elecci&oacute;n de los archivos de
  instalaci&oacute;n</a>
  <li><a href="#SmallRAM">4.5.7 - Procedimiento para m&aacute;quinas con
  poca memoria de RAM</a>
  <li><a href="#Finish">4.5.8 - Notas finales de la
  instalaci&oacute;n</a>
  <li><a href="#OtherInf">4.5.9 - Otros recursos de
  informaci&oacute;n</a>
  </ul>
<li><a href="#FilesNeeded">4.6 - &iquest;Qu&eacute; archivos son
necesarios para la instalaci&oacute;n?</a>
<li><a href="#SpaceNeeded">4.7 - &iquest;Cu&aacute;nto espacio necesito
para instalar OpenBSD?</a>
<li><a href="#Multibooting">4.8 - Multiarranque de OpenBSD/i386</a>
<li><a href="#SendDmesg">4.9 - Env&iacute;o de la salida de dmesg a
dmesg@openbsd.org despu&eacute;s de la instalaci&oacute;n</a>
<li><a href="#AddFileSet">4.10 - C&oacute;mo a&ntilde;adir un archivo de
instalaci&oacute;n despu&eacute;s de haber instalado el sistema</a>
<li><a href="#bsd.rd">4.11 - &iquest;Qu&eacute; es <i>bsd.rd</i>?</a>
<li><a href="#InstProb">4.12 - Problemas comunes durante la
instalaci&oacute;n</a>
  <ul>
  <li><a href="#mkdevhang">4.12.1 - La instalaci&oacute;n se bloquea
  durante MAKEDEV</a>
  <li><a href="#cpq16m">4.12.2 - Mi Compaq s&oacute;lo reconoce 16M de
  RAM</a>
  <li><a href="#noboot">4.12.3 - Mi i386 no arranca despu&eacute;s de la
  instalaci&oacute;n</a>
  <li><a href="#sshhang">4.12.4 - La m&aacute;quina arranca, pero se
  bloquea durante el proceso de ssh-keygen</a>
  <li><a href="#noftplist">4.12.5 - Durante la instalaci&oacute;n, veo
  el mensaje &quot;Failed to change directory&quot;</a>
  </ul>
<li><a href="#site">4.13 - Personalizaci&oacute;n del proceso de
instalaci&oacute;n</a>
<li><a href="#Multiple">4.14 - &iquest;C&oacute;mo se pueden instalar
varios sistemas parecidos?</a>
<li><a href="#getdmesg">4.15 - &iquest;C&oacute;mo se puede obtener una
salida de dmesg(8) para informar sobre un problema de
instalaci&oacute;n?</a>
</ul>

<hr>

<p>
<a name="Overview"></a>
<h2>4.1 - Breve introducci&oacute;n a la instalaci&oacute;n de
OpenBSD</h2>

<p>
OpenBSD dispone de un robusto procedimiento de instalaci&oacute;n
de gran adaptabilidad, basado en texto, y se puede instalar desde un
simple disquete.  El procedimiento de instalaci&oacute;n es muy parecido
en la mayor&iacute;a de las plataformas;  sin embargo existen algunos
detalles en los que se diferencian.  En cualquier caso es altamente
recomendable leer el documento INSTALL espec&iacute;fico para cada
plataforma, que se encuentra en el directorio correspondiente a la
plataforma del CD-ROM de los servidores de FTP (por ejemplo,
<tt>i386/INSTALL.i386</tt>, <tt>mac68k/INSTALL.mac68k</tt>, o
<tt>sparc/INSTALL.sparc</tt>).

<p>
OpenBSD usa un n&uacute;cleo del sistema (<i>kernel</i>) especial junto
con un n&uacute;mero de utilidades y guiones de instalaci&oacute;n
dentro de un mismo disco de RAM precargado, distinto para cada una de la
mayor&iacute;a de las plataformas.  Despu&eacute;s de haber arrancado
con este n&uacute;cleo, el sistema operativo se extrae desde varios
archivos de instalaci&oacute;n comprimidos con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=tar&amp;sektion=1">
tar(1)</a> (<tt>.tgz</tt>).  Existen varios m&eacute;todos para arrancar
el n&uacute;cleo de instalaci&oacute;n:

<ul>
<li><b>Disquete:</b>
Las im&aacute;genes de disquete se pueden usar para crear un disquete de
instalaci&oacute;n desde otro sistema tipo <a href="#UnixFlop">Unix</a>,
o desde un sistema <a href="#DosFlop">DOS/Windows</a>.  Los nombres
comunes para estas im&aacute;genes son <tt>floppy33.fs</tt>, aunque hay
algunas plataformas que disponen de m&uacute;ltiples im&aacute;genes de
instalaci&oacute;n.

<li><b>CD-ROM:</b>
Para algunas plataformas hay disponible una imagen de CD-ROM
(<tt>cd33.iso</tt>) que permite la creaci&oacute;n de un CD-ROM de
arranque.  Estas im&aacute;genes s&oacute;lo contienen el n&uacute;cleo
de instalaci&oacute;n;  los archivos de instalaci&oacute;n hay que
obtenerlos a trav&eacute;s de FTP u otra fuente.  Adem&aacute;s,
cualquier usuario puede crear su propio CD-ROM con cualquier grupo de
archivos y herramientas que desee.

<li><b><a href="#bsd.rd">bsd.rd</a>:</b>
El n&uacute;cleo en disco de RAM, para poder arrancar desde una
partici&oacute;n de OpenBSD ya existente o a trav&eacute;s de una red.

<li><b>Red:</b>
Algunas plataformas tienen soporte para el arranque a trav&eacute;s de
una red.

<li><b>Volcado de una imagen del sistema de archivos a un disco:</b>
Se puede volcar una imagen de un sistema de archivos a una
partici&oacute;n ya existente, y arrancar desde &eacute;sta.

<li><b>Cinta de arranque:</b>
En algunas plataformas existe soporte para el arranque desde una cinta
de almacenamiento.  Estas cintas se pueden crear siguiendo las
instrucciones del documento INSTALL espec&iacute;fico para cada
plataforma.

</ul>

No todas las <a href="../../es/plat.html">platformas</a> disponen de
soporte para todas las opciones de arranque:

<ul>
<li><a href="../../es/alpha.html"><b>alpha:</b></a>  Disquete, CD-ROM y
volcado de imagen a disco duro.

<li><a href="../../es/hp300.html"><b>hp300:</b></a> CD-ROM y red.

<li><a href="../../es/hppa.html"><b>hppa:</b></a> Red.

<li><a href="../../es/i386.html"><b>i386:</b></a> Disquete y CD.

<li><a href="../../es/mac68k.html"><b>mac68k:</b></a> Instalaci&oacute;n
(y arranque) mediante el uso de las utilidades de MacOS.  V&eacute;ase
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/mac68k/INSTALL.mac68k">
INSTALL.mac68k</a> para los detalles.

<li><a href="../../es/macppc.html"><b>macppc:</b></a> CD-ROM y red.

<li><a href="../../es/mvme68k.html"><b>mvme68:</b></a> Red y cinta de
arranque.

<li><a href="../../es/sparc.html"><b>sparc:</b></a> Disquete, CD-ROM,
red, volcado de imagen a una partici&oacute;n de <i>swap</i>, y cinta de
arranque.

<li><a href="../../es/sparc64.html"><b>sparc64:</b></a> Disquete
(s&oacute;lo U1/U2), CD-ROM, red, volcado de imagen a una
partici&oacute;n.

<li><a href="../../es/vax.html"><b>vax:</b></a> Disquete y red.

</ul>

La imagen <a href="#bsd.rd">bsd.rd</a> se puede usar para reinstalar o
actualizar todas las plataformas excepto la mac68k.

<p>
Una vez que se haya creado el n&uacute;cleo de instalaci&oacute;n,
existen varias opciones para obtener los <a href="#FilesNeeded">archivos
de instalaci&oacute;n</a>.  En este caso tampoco todas las plataformas
disponen de soporte para todas las opciones.

<ul>
<li><b>CD-ROM:</b>
Sin duda, la opci&oacute;n que preferimos es la del uso del
<a href="../../es/order.html">CD-ROM oficial</a>, aunque para casos
especiales tambi&eacute;n se puede crear uno propio.

<li><b>FTP:</b>
Cualquiera de las
<a href="../../es/ftp.html">r&eacute;plicas del servidor de FTP</a>, o
un servidor de FTP local que contenga los archivos.

<li><b>HTTP:</b>
Cualquiera de las
<a href="../../es/ftp.html#http">r&eacute;plicas del servidor de
HTML</a>, o un servidor de <i>web</i> local que contenga los archivos.

<li><b>Partici&oacute;n del disco local:</b>
En muchos casos se puede instalar los archivos desde otra
partici&oacute;n del disco duro.  Por ejemplo, en la plataforma
<a href="../../es/i386.html">i386</a>, se puede instalar desde una
partici&oacute;n FAT o desde un CD-ROM formateado en formato ISO9660
&oacute; Joliet.  En algunos casos ser&aacute; necesario montar el
sistema de archivos antes de usarlo.

<li><b>NFS:</b>
Algunas plataformas tienen soporte para montajes de NFS  para los
archivos de instalaci&oacute;n.

<li><b>Cinta:</b>
Los archivos de instalaci&oacute;n tambi&eacute;n se pueden usar desde
una cinta de almacenamiento para la que exista soporte en OpenBSD.
</ul>

<a name="Checklist"></a>
<h2>4.2 - Pre-installation checklist</h2>

<p>
Antes de comenzar la instalaci&oacute;n hay que tener una idea clara de
lo que se desea hacer.  Como m&iacute;nimo hay que conocer la
informaci&oacute;n siguiente:
<ul>
<li>Nombre de la m&aacute;quina
<li>Componentes instalados y disponibles
  <ul>
  <li>Haber verificado que el <i>hardware</i> de la plataforma se
  encuentre en la p&aacute;gina de compatibilidad correspondiente
  <li>Si hay componentes ISA, hay que saber la configuraci&oacute;n de
  <i>hardware</i> de esos componentes y asegurarse de que cumplen con
  las que requiere OpenBSD.
  </ul>
<li>M&eacute;todo de instalaci&oacute;n a utilizar (CD-ROM, FTP, etc.)
<li>Composici&oacute;n deseada del disco
  <ul>
  <li>&iquest;Hay que guardar los datos existentes en alg&uacute;n otro
  sitio?
  <li>&iquest;Va a coexistir OpenBSD con otro sistema operativo en la
  misma m&aacute;quina?  Si es as&iacute;, &iquest;qu&eacute; sistema se
  va a utilizar para arrancar los dos?  &iquest;Hay que instalar un
  &laquo;gestor de arranque&raquo;?
  <li>&iquest;Se va a usar todo el disco para OpenBSD o se desea
  conservar una partici&oacute;n o un sistema operativo ya existente (o
  espacio sin utilizar para un futuro)?
  <li>&iquest;C&oacute;mo queremos subdividir la parte de OpenBSD de
  nuestro disco?
  </ul>
<li>Configuraciones de la red (si no se usa DHCP):
  <ul>
  <li>Nombre de dominio
  <li>Direcci&oacute;n del Servidor de Nombres de Dominio (DNS)
  <li>Direcciones IP y m&aacute;scaras de subrred para cada NIC
  (interfaz de red)
  <li>Direcci&oacute;n de la pasarela (<i>gateway</i>)
  </ul>
<li>&iquest;Se va a usar el sistema gr&aacute;fico X Window System?
</ul>


<a name="MkInsMedia"></a>
<h2>4.3 - C&oacute;mo crear un medio de instalaci&oacute;n de arranque
de OpenBSD</h2>

<p>
Para los ejemplos tomaremos las im&aacute;genes de instalaci&oacute;n
que hay disponibles para las plataformas
<a href="../../es/i386.html">i386</a>
y <a href="../../es/sparc.html">sparc</a>.

<p>
La plataforma <a href="../../es/i386.html">i386</a> tiene cinco
im&aacute;genes de disco distintas entre las que escoger:

<ul>
<li><b><tt>floppy33.fs</tt></b> (para ordenadores personales de
sobremesa) contiene soporte para muchas tarjetas de interfaz de red PCI
e ISA, adaptadoras IDE y SCSI simples, y algunas PCMCIA.  La
<i>mayor&iacute;a</i> de usuarios utilizar&aacute;n esta imagen.
<li><b><tt>floppyB33.fs</tt></b> (para servidores) contiene soporte para
muchas controladoras de RAID, y algunas adaptadoras SCSI menos comunes
que las anteriores.  Sin embargo se ha eliminado el soporte para muchas
adaptadoras SCSI y tarjetas de interfaz de red EISA e ISA.
<li><b><tt>floppyC33.fs</tt></b> (para port&aacute;tiles) contiene
soporte para los dispositivos CardBus y PCMCIA que se encuentran en
muchos ordenadores port&aacute;tiles.
<li><b><tt>cdrom33.fs</tt></b> es una combinaci&oacute;n de los tres
discos de arranque anteriores.  Se puede utilizar para componer un
disquete de 2.88MB de arranque o, con m&aacute;s frecuencia, usar como
imagen de arranque para un CD grabable personalizado.
<li><b><tt>cd33.iso</tt></b> es una imagen ISO9660 que se puede usar
para crear un CD de arranque con la mayor&iacute;a de programas de
creaci&oacute;n de CD-ROM en la mayor&iacute;a de plataformas.  Es en
realidad <tt>cdrom33.fs</tt> en un formato &laquo;listo para
grabar&raquo;.
</ul>

<p>
Y s&iacute;, pueden existir situaciones en las que se requiera un disco
de instalaci&oacute;n para el soporte de la adaptadora de red.  Por
suerte esto es muy extra&ntilde;o, y generalmente se puede encontrar una
soluci&oacute;n alternativa.

<p>
Para la plataforma <a href="../../es/sparc.html">sparc</a> existen tres
im&aacute;genes de disco de instalaci&oacute;n diferentes a elegir:

<p>
<a name="UnixFlop"></a>
<h3>4.3.1 - C&oacute;mo dar formato a un disquete en Unix.</h3>

<p>
Para preparar un disquete desde otro sistema operativo tipo UNIX
(incluido OpenBSD), hay que usar la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdformat&amp;sektion=1&amp;arch=i386">fdformat(1)</a>,
que dar&aacute; formato al disquete y verificar&aacute; los sectores
defectuosos.

<p>
<table border="0" width="650"> <tr> <td nowrap bgcolor="#eeeeee"><pre>
  # <b>fdformat /dev/rfd0c</b>
  Format 1440K floppy `/dev/rfd0c'? (y/n): y
  Processing VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV done.
</pre></td></tr> </table>

<p>
Si en la pantalla se ve algo como lo anterior, entonces el disquete
est&aacute; en buen estado.  Sin embargo, si no se ven TODAS las
&laquo;Vr&raquo;, entonces es muy probable que el disco est&eacute; en
mal estado, y habr&aacute; que probar con uno virgen.

<p>
N&oacute;tese que algunos sistemas tipo Unix tienen &oacute;rdenes
diferentes para formatear disquetes.  V&eacute;ase la
documentaci&oacute;n del sistema para conocer el procedimiento adecuado.

<p>
Si se va a formatear desde MS-DOS, hay que usar la orden <tt>FORMAT</tt>
de DOS.

<p>
Una vez que se tenga un disquete vac&iacute;o y con formato, ya se puede
empezar a volcar la imagen de instalaci&oacute;n al disquete.  Para ello
se usar&aacute; la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&amp;sektion=0">
dd(1)</a>.  A continuaci&oacute;n puede verse un ejemplo del uso de
<tt>dd(1)</tt>:

<p>
<table border="0" width="650"> <tr> <td nowrap bgcolor="#eeeeee"><pre>
  # <b>dd if=floppy33.fs of=/dev/rfd0c bs=32k</b>
</pre></td></tr></table>

<p>
En cuanto se haya volcado la imagen al disquete, hay que asegurarse de
que la imagen volcada sea la misma que la original con la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cmp&amp;sektion=1">
cmp(1)</a>.  Si el disquete es id&eacute;ntico a la imagen s&oacute;lo
se ver&aacute; otro punto de inserci&oacute;n.

<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  # <b>cmp /dev/rfd0c floppy33.fs</b>
</pre></td> </tr> </table>

<p>
<a name="DosFlop"></a>
<h3>4.3.2 - C&oacute;mo dar formato a un disquete en DOS/Windows.</h3>

<p>
En esta secci&oacute;n se describe c&oacute;mo volcar las
im&aacute;genes de instalaci&oacute;n a un disquete desde Windows o DOS.
Las herramientas necesarias se pueden obtener en el directorio
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/tools/">tools</a> de
cualquiera de las r&eacute;plicas del servidor de ftp, o en el
directorio <tt>3.3/tools</tt> del CD1 de OpenBSD.

<p>
Para preparar un disquete desde MS-DOS o Windows, primero hay que usar
las herramientas de formateo nativas de esas plataformas para dar
formato al disco.

<p>
Para volcar la imagen de instalaci&oacute;n en el disquete preparado, se
puede usar <i>rawrite</i>, <i>fdimage</i>, o <i>ntrw</i>.
<i>rawrite</i> no funciona en Windows NT, 2000 &oacute; XP.

<p>
N&oacute;tese que <tt>FDIMAGE.EXE</tt> y <tt>RAWRITE.EXE</tt> son
aplicaciones de MS-DOS, y por lo tanto est&aacute;n limitadas por la
convenci&oacute;n 8.3 de nombres de archivos de DOS.  Como
<tt>floppy33B.fs</tt> y <tt>floppy33C.fs</tt> tienen nombres de archivo
m&aacute;s largos, antes de usar <tt>FDIMAGE.EXE</tt> o
<tt>RAWRITE.EXE</tt> para crear los disquetes de arranque, habr&acute;a
que averiguar bajo qu&eacute; nombre en formato 8.3 guarda el fichero el
sistema.

<p>
Ejemplo del uso de <i>rawrite</i>:
<table border="0" width="650"> <tr> <td nowrap bgcolor="#eeeeee"><pre>
  C:\&gt; <b>rawrite</b>
  RaWrite 1.2 - Write disk file to raw floppy diskette

  Enter source file name: <b>floppy33.fs</b>
  Enter destination drive: <b>a</b>
  Please insert a formatted diskette into drive A: and press -ENTER- : <i><b>Intro</b></i>
</pre></td></tr></table> 

<p>
Ejemplo del uso de <i>fdimage</i>:
<table border="0" width="650"> <tr> <td nowrap bgcolor="#eeeeee"><pre>
  C:\&gt; <strong>fdimage -q floppy33.fs a:</strong>
</pre></td></tr></table>

<p>
Ejemplo del uso de <i>ntrw</i>:
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  C:\&gt; <strong>ntrw floppy33.fs a:</strong>
  3.5", 1.44MB, 512 bytes/sector
  bufsize is 9216
  1474560 bytes written
</pre></td></tr></table>


<a name="MkCD-ROM"></a>
<h3>4.3.3 - C&oacute;mo crear un CD-ROM de arranque</h3>

<p>
Para crear un CD-ROM se puede usar el archivo <tt>cd33.iso</tt> o, en el
caso de la plataforma i386, se puede tambi&eacute;n usar
<tt>cdrom33.fs</tt> como imagen de disquete de arranque para arrancar
i386 desde un CD-ROM.  Los detalles exactos sobre el uso de las
herramientas los obviaremos aqu&iacute; para que los determine el
usuario.

<p>
Algunas de las herramientas en OpenBSD son:
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mkhybrid&amp;sektion=8">mkhybrid(8)</a>
<li><a href="http://www.fokus.gmd.de/research/cc/glone/employees/joerg.schilling/private/cdrecord.html">cdrecord</a>,
parte de la colecci&oacute;n <i>cdrtools</i> del
<a href="faq8.html#Ports">Sistema de Portes de OpenBSD</a>.
</ul>

<p>
<a name="Boot"></a>
<h2>4.4 - C&oacute;mo arrancar con las im&aacute;genes de
instalaci&oacute;n de OpenBSD</h2>

<p>
Esta secci&oacute;n est&aacute; dividida en subsecciones, de acuerdo con
las diferentes plataformas m&aacute;s usadas y para las que existe
soporte en OpenBSD.  La hemos subdividido de este modo para poder
ofrecer a cada usuario las instrucciones correctas sobre lo que deben
hacer en sus respectivas plataformas.

<p>
<h4>Arranque de i386</h4>

<p>
Para la mayor&iacute;a de personas, arrancar e instalar desde una imagen
en la arquitectura i386 PC no es nada nuevo.  Si se va a usar el
disquete con la imagen, hay que introducirlo en la disquetera y arrancar
el sistema.  Entonces se cargar&aacute; la imagen de instalaci&oacute;n,
suponiendo que la opci&oacute;n de arranque desde la disquetera
est&eacute; activada en la BIOS.  Si se va a usar el CD para el
arranque, antes hay que entrar en la BIOS de la m&aacute;quina y
configurar las opciones de arranque para permitir el arranque desde el
dispositivo de CD.  Algunas BIOS ya viejas no presentan esta
opci&oacute;n, y por tanto ser&aacute; necesario usar un disquete para
el arranque.  Pero no hay que preocuparse, ya que aun arrancando desde
un disquete se podr&aacute; instalar desde el CD.

<p>
<h4>Arranque de sparc</h4>

<p>
<b>NOTA:</b>  En la plataforma sparc64 s&oacute;lo se puede arrancar con
disquete en las m&aacute;quinas con SBus (Ultra 1 y Ultra 2).

<p>
Para arrancar desde un disquete, hay que introducir el disquete con la
imagen de instalaci&oacute;n de OpenBSD en la disquetera.  A
continuaci&oacute;n se usar&aacute; la siguiente orden para arrancar
desde el disquete:

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  ok <b>boot floppy</b>
</pre></td></tr></table>

<p>
Para arrancar desde el CDROM, hay que introducir el CD de OpenBSD en el
dispositivo de CDROM.  Si la estaci&oacute;n de Sun s&oacute;lo tiene un
dispositivo de CDROM, hay que ir al punto de arranque y desde
&eacute;ste ejecutar '<tt>boot cdrom</tt>':

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  ok <b>boot cdrom</b>
</pre></td></tr></table>

<p>
Esto s&oacute;lo funcionar&aacute; en el modo de &oacute;rdenes nuevo
(<i>new command mode</i>).  Si el punto de inserci&oacute;n de
&oacute;rdenes es el antiguo (una flecha a la derecha), hay que escribir
'n' para entrar en el modo de &oacute;rdenes nuevo (si se est&aacute;
usando una vieja sparc anterior al modelo sun4c, es probable que no
tenga un modo de &oacute;rdenes nuevo, en cuyo caso habr&aacute; que
experimentar un poco).  Si hay varios dispositivos de CDROM, hay que
arrancar desde el correcto.  Se puede probar <tt>probe-scsi</tt> desde
el modo de &oacute;rdenes nuevo.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  ok <b>probe-scsi</b>

  Target 0
    Unit 0   Disk     QUANTUM LIGHTNING 365S
  Target 1
    Unit 0   Removable Disk     QUANTUM EMPIRE_1080S
  Target 3
    Unit 0   Removable Disk     Joe's CD ROM
</pre></td></tr></table>

<p>
Hay que averig&uuml;ar cu&aacute;l es el CDROM desde el que se quiere
arrancar y anotar el n&uacute;mero que le corresponda.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  ok <b>boot /sbus/esp/sd@X,0</b>
</pre></td></tr></table>

<p>
<a name="Install"></a>
<h2>4.5 - El proceso de instalaci&oacute;n</h2>
<a name="Start"></a>
<h3>4.5.1 - Inicio de la instalaci&oacute;n</h3>
<!-- XXXrelease -->
<p>
Cualquiera que sea el medio de instalaci&oacute;n, ahora es el momento
de usarlo.  Durante el proceso de arranque, el n&uacute;cleo del sistema
y todos los programas que se hayan usado para instalar OpenBSD se
cargar&aacute;n en la memoria.  El problema m&aacute;s t&iacute;pico
durante el arranque es el de un disquete err&oacute;neo o un problema de
alineamiento de una controladora.  El espacio en un disquete de arranque
est&aacute; bastante constre&ntilde;ido, y cualquier error m&iacute;nimo
es causa de problemas.

<p>
Es posible terminar el intento de instalaci&oacute;n desde casi
cualquier punto del proceso de instalaci&oacute;n de OpenBSD, pulsando
CTRL-C, y volver a empezar sin tener que reiniciar, ejecutando
<tt>install</tt> desde el punto de inserci&oacute;n del
int&eacute;rprete.

<p>
Despu&eacute;s de haber realizado un arranque con &eacute;xito, se
ver&aacute; muchas l&iacute;neas de texto de un mensaje pasando por la
pantalla.  Este texto, que en muchas arquitecturas es en blanco sobre
fondo azul, es la salida de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg</a>,
el n&uacute;cleo del sistema informando sobre qu&eacute; dispositivos
que se han encontrado y d&oacute;nde han sido encontrados.  No hay que
preocuparse por recordar estas l&iacute;neas, ya que una copia del texto
se guarda en el fichero <tt>/var/run/dmesg.boot</tt>.  En la
mayor&iacute;a de las arquitecturas, las teclas SHIFT+ReP&aacute;g
permite examinar el texto que ya ha pasado por la pantalla.

<p>
A continuaci&oacute;n se ver&aacute; lo siguiente:
 
<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  rootdev=0x1100 rrootdev=0x2f00 rawdev=0x2f02
  erase ^?, werase ^W, kill ^U, intr ^C, status ^T
  (I)nstall, (U)pgrade or (S)hell? <b>i</b>
</pre></td></tr></table>

<p>
Y aqu&iacute; llega nuestra primera pregunta, para la que veremos las
tres opciones de respuesta:

<ul>
<li><b>Install:</b>  <b>instalar</b>, cargar OpenBSD en el sistema,
sobreescribiendo cualquier otra cosa que pueda existir en &eacute;l.
N&oacute;tese que se puede dejar algunas particiones sin tocar durante
este proceso, como <tt>/home</tt>, pero en cualquier otro caso hay que
asumir que se sobreescribir&aacute; cualquier otra.

<li><b>Upgrade:</b>  <b>actualizar</b>, instalar un nuevo grupo de
<a href="#FilesNeeded">archivos de instalaci&oacute;n</a> en la
m&aacute;quina, pero sin sobreescribir ninguna informaci&oacute;n de
configuraci&oacute;n, datos de usuario o programas adicionales.  En esta
opci&oacute;n no se lleva a cabo ning&uacute;n formateo del disco, ni se
sobreescriben los directorios /etc o /var.  No se ofrece la
opci&oacute;n de instalar el archivo <i>etc33.tgz</i>.  Despu&eacute;s
de la instalaci&oacute;n ser&aacute; necesario fusionar a mano los
cambios de <i>etc33.tgz</i> con los ya existentes, antes de que el
sistema sea completamente funcional.  Este paso es muy importante y se
debe hacer, ya que de otro modo ciertos servicios claves (como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&amp;sektion=4">
pf(4)</a>) pueden no iniciarse.<br>
<b>NOTA:</b>  El proceso de actualizaci&oacute;n no est&aacute;
dise&ntilde;ado para saltarse versiones, y aunque esto puede funcionar,
no se dar&aacute; soporte en tales casos.  S&oacute;lo se dar&aacute;
soporte en los casos en que se haya actualizado desde una versi&oacute;n
anterior hasta la versi&oacute;n inmediata (v.g. 3.2 a 3.3).  Si alguien
tiene que actualizar desde una versi&oacute;n m&aacute;s antigua se
recomienda reinstalar el sistema completo.

<li><b>Shell:</b>  (el <i>int&eacute;rprete de &oacute;rdenes</i>) a
veces puede ser necesario llevar a cabo reparaciones o mantenimiento en
un sistema que no arranca, o que no deber&iacute;a arrancar, con un
n&uacute;cleo normal.  Esta opci&oacute;n permite invocar al
int&eacute;rprete para realizar estas operaciones al sistema.
</ul>

<p>
Hay ocasiones en las que puede no aparecer la opci&oacute;n.
Despu&eacute;s de un cambio en el c&oacute;digo que no es compatible con
el c&oacute;digo anterior
(<a href="http://www.catb.org/~esr/jargon/html/entry/flag-day.html">flag
day</a>), no es posible actualizar un sistema de forma directa, y se
hace necesario recomponer el sistema desde el principio.  Un ejemplo de
esto es el de openbsd/sparc, que pas&oacute; de los fomatos ejecutables
a.out a ELF entre las versiones 3.1 y 3.2, por lo que los usuarios que
actualicen a la versi&oacute;n 3.2 o 3.3 en m&aacute;quinas SPARC, deben
reinstalar completamente sus sistemas.

<p>
En el ejemplo se realizar&aacute; una instalaci&oacute;n, pero el
proceso de actualizaci&oacute;n es muy parecido.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Welcome to the OpenBSD/i386 3.3 install program.

  This program will help you install OpenBSD in a simple and rational way. At
  any prompt except password prompts you can run a shell command by typing
  '!foo', or escape to a shell by typing '!'. Default answers are shown in []'s
  and are selected by pressing RETURN. At any time you can exit this program by
  pressing Control-C and then RETURN, but quitting during an install can leave
  your system in an inconsistent state.

  Specify terminal type: [vt220]
  Do you wish to select a keyboard encoding table? [n] <b>y</b>
</pre></td></tr></table>

<p>
En la mayor&iacute;a de los casos, el terminal predeterminado es el
apropiado;  sin embargo, si se est&aacute; usando una
<a href="faq7.html#SerCon">consola serie</a> para la instalaci&oacute;n,
no se debe escoger el predeterminado sino responder con el terminal que
corresponda.

<p>
Si no se selecciona una tabla de codificaci&oacute;n de caracteres el
programa asumir&aacute; que se va a usar un teclado estadounidense.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  IS YOUR DATA BACKED UP? As with anything that modifies disk contents, this
  program can cause SIGNIFICANT data loss.

  It is often helpful to have the installation notes handy. For complex disk
  configurations, relevant disk hardware manuals and a calculator are useful.

  Proceed with install? [n] <b>y</b>
</pre></td></tr></table>

<p>
Si se aceptara la respuesta predeterminada a esta pregunta, el proceso
de instalaci&oacute;n terminar&iacute;a y pasar&iacute;a al
int&eacute;rprete de &oacute;rdenes.


<p>
<a name="Disks"></a>
<h3>4.5.2 - Configuraci&oacute;n de los discos</h3>

<p>
La configuraci&oacute;n de los discos en OpenBSD var&iacute;a un poco
dependiendo de la plataforma.  La configuraci&oacute;n del disco para
<a href="../../es/i386.html">i386</a> y
<a href="../../es/macppc.html">macppc</a> se hace en dos fases.  Primero
se define la partici&oacute;n del disco duro de OpenBSD utilizando
fdisk(8), y luego se subdivide esa divisi&oacute;n en varias particiones
de OpenBSD utilizando disklabel(8).

<p>
Esta terminolog&iacute;a puede resultar un poco confusa para algunos
usuarios.  Parece que estamos usando el t&eacute;rmino
&laquo;partici&oacute;n&raquo; con dos significados distintos.
As&iacute; es, en varias plataformas de OpenBSD existen dos capas de
particiones.  La primera, que se podr&iacute;a considerar como la
partici&oacute;n del sistema operativo, o sea el modo en que varios
sistemas operativos en una misma m&aacute;quina marcan su propio espacio
en el disco.  La segunda es el modo en que la partici&oacute;n del
sistema operativo OpenBSD se subparticiona, dividi&eacute;ndose en
sistemas de archivos individuales.  La primera capa es visible para DOS,
Windows, y cualquier sistema operativo que pueda coexistir con otros
sistemas operativos en las m&aacute;quinas descendientes de IBM AT.  La
segunda capa de particiones s&oacute;lo es visible para OpenBSD y para
los sistemas operativos que puedan leer directamente un sistema de
archivos de OpenBSD.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Cool!  Let's get to it...

  You will now initialize the disk(s) that OpenBSD will use. To enable all
  available security features you should configure the disk(s) to allow the
  creation of separate filesystems for /, /tmp, /var, /usr, and /home.

  Available disks are: wd0.
  Which one is the root disk? (or done) [wd0] <b><i>Intro</i></b>
</pre></td></tr></table>

<p>
El disco ra&iacute;z es el disco desde el que se arrancar&aacute; el
sistema, y suele ser en el que reside el espacio de la memoria de
intercambio (<i>swap</i>).  Generalmente &eacute;ste coincidir&aacute;
con la respuesta predeterminada, pero si no coincidiera ser&aacute;
necesario que el usuario sepa como forzar a la m&aacute;quina a arrancar
desde un disco no est&aacute;ndar.  Los discos IDE se muestran como
<tt>wd0</tt>, <tt>wd1</tt>, etc... y los discos SCSI y dispositivos de
RAID como <tt>sd0</tt>, <tt>sd1</tt>, etc.  El programa mostrar&aacute;
una lista con todos los discos que encuentre en el sistema.  Si se tiene
alg&uacute;n disco que no aparezca en la lista ser&aacute; bien porque
no existe soporte para ese disco o bien porque la configuraci&oacute;n
del <i>hardware</i> es incorrecta.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Do you want to use *all* of wd0 for OpenBSD? [no] <b><i>Intro</i></b>
</pre></td></tr></table>

<p>
Si se responde afirmativamente (<i>yes</i>) a esta pregunta, se
usar&aacute; todo el disco para OpenBSD.  De este modo se
grabar&aacute;n en el disco un &laquo;Registro de Arranque
Maestro&raquo; (MBR, <i>Master Boot Record</i>) y una tabla de
particiones m&aacute;s simples:  una partici&oacute;n del tama&ntilde;o
de todo el disco duro configurada con el tipo de partici&oacute;n de
OpenBSD, y marcada como partici&oacute;n de arranque.  Esto ser&aacute;
una opci&oacute;n com&uacute;n para la mayor&iacute;a de sistemas para
uso de producci&oacute;n de OpenBSD;  sin embargo, hay algunos sistemas
en los que esto no se debe hacer as&iacute;.  Muchos sistemas Compaq,
algunos Dell, y otros, usan una partici&oacute;n de
&laquo;mantenimiento&raquo;, que se debe dejar intacta.  Si el sistema
tiene alguna otra partici&oacute;n de cualquier tipo que se quiera
conservar, no se debe responder &quot;<i>yes</i>&quot; a la pregunta de
arriba.

<p>
Para este ejemplo asumiremos que el disco se va a dividir entre OpenBSD
y una partici&oacute;n de Windows 2000 ya instalada, para lo que
aceptaremos la respuesta predeterminada, &quot;<i>no</i>&quot;, con lo
que se invocar&aacute; al programa
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&amp;sektion=8&amp;arch=i386">fdisk(8)</a>.
Tambi&eacute;n se puede obtener m&aacute;s informaci&oacute;n sobre
fdisk(8) <a href="faq14.html#fdisk">aqu&iacute;</a>.

<p>
<strong>Nota Importante:</strong>
los usuarios que tengan un disco duro de gran tama&ntilde;o (de
m&aacute;s de 8GB, aunque en m&aacute;quinas viejas y en plataformas
diferentes se podr&iacute;a aplicar a discos m&aacute;s peque&ntilde;os)
deber&iacute;an leer <a href="faq14.html#LargeDrive">esta
secci&oacute;n</a> antes de continuar.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  You will now create a single MBR partition to contain your OpenBSD data. This
  partition must have an id of 'A6'; must *NOT* overlap other partitions; and
  must be marked as the only active partition.

  The 'manual' command describes all the fdisk commands in detail.

  Disk: wd0       geometry: 2586/240/63 [39100320 Sectors]
  Offset: 0       Signature: 0xAA55
           Starting       Ending       LBA Info:
   #: id    C   H  S -    C   H  S [       start:      size   ]
  ------------------------------------------------------------------------
  *0: 06    0   1  1 -  202 239 63 [          63:     3069297 ] DOS &gt; 32MB
   1: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
   2: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
   3: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
  Enter 'help' for information
  fdisk: 1&gt; <b>help</b>
          help            Command help list
          manual          Show entire OpenBSD man page for fdisk
          reinit          Re-initialize loaded MBR (to defaults)
          setpid          Set the identifier of a given table entry
          disk            Edit current drive stats
          edit            Edit given table entry
          flag            Flag given table entry as bootable
          update          Update machine code in loaded MBR
          select          Select extended partition table entry MBR
          print           Print loaded MBR partition table
          write           Write loaded MBR to disk
          exit            Exit edit of current MBR, without saving changes
          quit            Quit edit of current MBR, saving current changes
          abort           Abort program without saving current changes
  fdisk: 1&gt; 
</pre></td></tr></table>

<p>
Algunas &oacute;rdenes que vale la pena explicar:

<ul>
<li><b><tt>r</tt></b> o <b><tt>reinit</tt>:</b>  Elimina la tabla de
particiones existente, crea una partici&oacute;n grande de OpenBSD, y la
marca como activa.  Equivale a responder &quot;yes&quot; a la pregunta
&quot;<tt>use *all of ...</tt>&quot;
<li><b><tt>p</tt></b> o <b><tt>print:</tt></b>  Muestra la tabla de
particiones actual en sectores.  &quot;<tt>p m</tt>&quot; muestra la
tabla de particiones en <i>megabytes</i>, y &quot;<tt>p g</tt>&quot; la
muestra en <i>gigabytes</i>.
<li><b><tt>e</tt></b> o <b><tt>edit:</tt></b>  Editar o alterar una
entrada de la tabla.
<li><b><tt>f</tt></b> o <b><tt>flag:</tt></b>  Marca una
partici&oacute;n como activa, o sea como la partici&oacute;n desde donde
se arrancar&aacute; el sistema.
<li><b><tt>exit</tt></b> y <b><tt>quit:</tt></b>  Hay que tener cuidado
con estas dos, ya que algunos usuarios est&aacute;n acostumbrados a que
&quot;exit&quot; y &quot;quit&quot; tengan significados opuestos.
</ul>

<p>
Es preciso que insistamos en que si se hace mal algo en este punto el
resultado ser&aacute; de una p&eacute;rdida significativa de datos.  Si
se va a realizar sobre un dispositivo con datos importantes, puede ser
conveniente practicar antes con un dispositivo de &laquo;usar y
tirar&raquo;, adem&aacute;s de hacer una buena copia de seguridad.

<p>
En el ejemplo, nuestro dispositivo tiene una partici&oacute;n de 1.5GB
para Windows 2000 (que usa el sistema de archivos FAT).  Mirando a la
informaci&oacute;n de la pantalla anterior, podemos ver que la
partici&oacute;n de Windows ocupa hasta el cilindro 202 del dispositivo,
por lo que asignaremos el resto del disco a OpenBSD, empezando por el
cilindro 203.  Tambi&eacute;n podr&iacute;amos calcular el sector
inicial 3069360 de OpenBSD sumando el sector inicial de la
partici&oacute;n existente (63) y su tam&ntilde;o (3069297).

<p>
Podemos editar la composici&oacute;n del dispositivo en
Cilindros/Cabezales/Sectores o simplemente en sectores puros.
Cu&aacute;l de las dos formas resultar&aacute; m&aacute;s f&aacute;cil
depender&aacute; de lo que estemos haciendo, y como en este caso estamos
evitando una partici&oacute;n ya existente, lo m&aacute;s probable es
que el uso de la forma CHS (<i>Cylinder/Heads/Sectors</i>) sea lo
m&aacute;s f&aacute;cil.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  fdisk: 1&gt; <b>e 1</b>
           Starting       Ending       LBA Info:
   #: id    C   H  S -    C   H  S [       start:      size   ]
  ------------------------------------------------------------------------
   1: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
  Partition id ('0' to disable)  [0 - FF]: [0] (? for help) <b>a6</b>
  Do you wish to edit in CHS mode? [n] <b>y</b>
  BIOS Starting cylinder [0 - 2585]: [0] <b>203</b>
  BIOS Starting head [0 - 239]: [0] <b><i>Intro</i></b>
  BIOS Starting sector [1 - 63]: [0] <b>1</b>
  BIOS Ending cylinder [0 - 2585]: [0] <b>2585</b>
  BIOS Ending head [0 - 239]: [0] <b>239</b>
  BIOS Ending sector [1 - 63]: [0] <b>63</b>
  fdisk:*1&gt; <b>p</b>
  Disk: wd0       geometry: 2586/240/63 [39100320 Sectors]
  Offset: 0       Signature: 0xAA55
           Starting       Ending       LBA Info:
   #: id    C   H  S -    C   H  S [       start:      size   ]
  ------------------------------------------------------------------------
  *0: 06    0   1  1 -  202 239 63 [          63:     3069297 ] DOS &gt; 32MB
   1: A6  203   0  1 - 2585 239 63 [     3069360:    36030960 ] OpenBSD
   2: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
   3: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
  fdisk:*1&gt; <b>p m</b>
  Disk: wd0       geometry: 2586/240/63 [19092 Megabytes]
  Offset: 0       Signature: 0xAA55
           Starting       Ending       LBA Info:
   #: id    C   H  S -    C   H  S [       start:      size   ]
  ------------------------------------------------------------------------
  *0: 06    0   1  1 -  202 239 63 [          63:        1499M] DOS &gt; 32MB
   1: A6  203   0  1 - 2585 239 63 [     3069360:       17593M] OpenBSD
   2: 00    0   0  0 -    0   0  0 [           0:           0M] unused
   3: 00    0   0  0 -    0   0  0 [           0:           0M] unused
  fdisk:*1&gt; 
</pre></td></tr></table>

<p>
N&oacute;tese que el punto de inserci&oacute;n cambia para incluir un
asterisco ('<tt>*</tt>') donde anteriormente hab&iacute;a un espacio en
blanco, para indicar que hay cambios que todav&iacute;a no han sido
guardados y que por lo tanto a&uacute;n no son definitivos.  Como
podemos observar en la salida de <tt>p&nbsp;m</tt>, no hemos alterado
nuestra partici&oacute;n de Windows, sino que hemos asignado con
&eacute;xito el resto del dispositivo para OpenBSD y las particiones no
se solapan.  Ya casi estamos en ello.

<p>
A&uacute;n nos falta por marcar la partici&oacute;n como activa para que
la m&aacute;quina arranque con OpenBSD la pr&oacute;xima vez que se
reinicie.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  fdisk:*1&gt; <b>f 1</b>
  Partition 1 marked active.
  fdisk:*1&gt; <b>p</b>
  Disk: wd0       geometry: 2586/240/63 [39100320 Sectors]
  Offset: 0       Signature: 0xAA55
           Starting       Ending       LBA Info:
   #: id    C   H  S -    C   H  S [       start:      size   ]
  ------------------------------------------------------------------------
   0: 06    0   1  1 -  202 239 63 [          63:     3069297 ] DOS &gt; 32MB
  *1: A6  203   0  1 - 2585 239 63 [     3069360:    36030960 ] OpenBSD
   2: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
   3: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
  fdisk:*1&gt;
</pre></td></tr></table>
 
<p>
Ahora ya podemos guardar los cambios:
 
<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  fdisk:*1&gt; <b>w</b>
  Writing MBR at offset 0.
  wd0: no disk label
  fdisk: 1&gt; <b>q</b>
</pre></td></tr></table> 

<p>
<a name="disklabel"></a>
<h3>C&oacute;mo crear una clasificaci&oacute;n del disco
(<i>disklabel</i>)</h3>

<p>
El siguiente paso consiste en usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&amp;sektion=8">disklabel(8)</a> 
para subdividir la partici&oacute;n de OpenBSD.  Puede ver m&aacute;s
detalles sobre el uso de disklabel(8) en la
<a href="faq14.html#disklabel">secci&oacute;n 14</a>.


<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Here is the partition information you chose:
  
  Disk: wd0       geometry: 2586/240/63 [39100320 Sectors]
  Offset: 0       Signature: 0xAA55
           Starting       Ending       LBA Info:
   #: id    C   H  S -    C   H  S [       start:      size   ]
  ------------------------------------------------------------------------
  *0: 06    0   1  1 -  202 239 63 [          63:     3069297 ] DOS &gt; 32MB
   1: A6  203   0  1 - 2585 239 63 [     3069360:    36030960 ] OpenBSD
   2: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
   3: 00    0   0  0 -    0   0  0 [           0:           0 ] unused

  You will now create an OpenBSD disklabel inside the OpenBSD MBR
  partition. The disklabel defines how OpenBSD splits up the MBR partition
  into OpenBSD partitions in which filesystems and swap space are created.

  The offsets used in the disklabel are ABSOLUTE, i.e. relative to the
  start of the disk, NOT the start of the OpenBSD MBR partition.

  disklabel: no disk label
  WARNING: Disk wd0 has no label. You will be creating a new one.
  
  # using MBR partition 1: type A6 off 3069360 (0x2ed5b0) size 36030960 (0x225c9f0)

  Treating sectors 3069360-39100320 as the OpenBSD portion of the disk.
  You can use the 'b' command to change this.

  Initial label editor (enter '?' for help at any prompt)
  &gt; <b>?</b>
  Available commands:
          p [unit]  - print label.
          M         - show entire OpenBSD man page for disklabel.
          e         - edit drive parameters.
          a [part]  - add new partition.
          b         - set OpenBSD disk boundaries.
          c [part]  - change partition size.
          d [part]  - delete partition.
          D         - set label to default.
          g [d|b]   - Use [d]isk or [b]ios geometry.
          m [part]  - modify existing partition.
          n [part]  - set the mount point for a partition.
          r         - recalculate free space.
          u         - undo last change.
          s [path]  - save label to file.
          w         - write label to disk.
          q         - quit and save changes.
          x         - exit without saving changes.
          X         - toggle expert mode.
          z         - zero out partition table.
          ? [cmnd]  - this message or command specific help.
  Numeric parameters may use suffixes to indicate units:
          'b' for bytes, 'c' for cylinders, 'k' for kilobytes, 'm' for megabytes,
          'g' for gigabytes or no suffix for sectors (usually 512 bytes).
          Non-sector units will be rounded to the nearest cylinder.
  Entering '?' at most prompts will give you (simple) context sensitive help.
  &gt; 
</pre></td></tr></table>
 
<p>
Aqu&iacute; tambi&eacute;n explicaremos un poco estas &oacute;rdenes:

<ul>
<li><b><tt>p</tt></b> - muestra la composici&oacute;n actual del disco
(<i>disklabel</i>) en la pantalla, y se pueden usar los modificadores
<tt>k, m</tt> o <tt>g</tt> para obtenerla en kilobytes, megabytes, o
gigabytes.

<li><b><tt>D</tt></b> - Borra cualquier composici&oacute;n del disco
existente y crea una nueva predeterminada que s&oacute;lo cubra la
partici&oacute;n actual de OpenBSD.  Esto puede sernos &uacute;til si el
disco ya ten&iacute;a una composici&oacute;n previa, y si la
partici&oacute;n de OpenBSD fue vuelta a crear con un tama&ntilde;o
diferente;  la etiqueta del disco antigua puede no eliminarse, y esto
puede causar confusi&oacute;n.

<li><b><tt>m</tt></b> - Modifica una entrada existente en una
composici&oacute;n.  No debemos sobreestimar lo que esto puede hacer.
Aunque pueda alterar el tama&ntilde;o de una partici&oacute;n de
composici&oacute;n del disco, NO alterar&aacute; el sistema de archivos
en el dispositivo.  Usar esta opci&oacute;n para cambiar el
tama&ntilde;o de particiones ya existentes puede hacer que perdamos
grandes cantidades de datos.
</ul>

<p>
Hacer una divisi&oacute;n correcta del disco es importante.  La
respuesta a la pregunta &laquo;C&oacute;mo se debe particionar un
sistema&raquo; es &laquo;Exactamente como se necesite&raquo;.  Esto
variar&aacute; seg&uacute;n la aplicaci&oacute;n.  No existe una
respuesta global.  Si no se est&aacute; seguro de c&oacute;mo se quiere
particionar un sistema, v&eacute;se <a href="#SpaceNeeded">esta
discusi&oacute;n</a>.

<p>
En este sistema tenemos m&aacute;s de 17GB disponibles para OpenBSD.
Eso es mucho espacio, y lo m&aacute;s seguro es que no vayamos a
necesitar la mayor parte.  Por este motivo no utilizaremos ning&uacute;n
tama&ntilde;o m&iacute;nimo para el ejemplo.  Preferimos tener unos
cientos de megabytes de espacio sin usar a quedarnos cortos por un
kilobyte.

<p>
En el disco ra&iacute;z,  se <b>deben</b> crear las dos particiones 'a'
y 'b'.  El proceso de instalaci&oacute;n no seguir&aacute; adelante
hasta que est&eacute;n disponibles estas dos particiones.  'a' se
usar&aacute; para el sistema de archivos ra&iacute;z (<i>root</i>, '/'),
y 'b' como espacio de la memoria de intercambio (<i>swap</i>).

<p>
Despu&eacute;s de pensarlo un rato hemos decidido crear las suficientes
particiones para permitir la creaci&oacute;n de los sistemas de archivos
que se recomiendan separados (<tt>/, /tmp, /var, /usr, /home</tt>)
adem&aacute;s de una partici&oacute;n <i>swap</i>:

<ul>
<li><i><b>wd0a: /</b></i> (root) -150MB.  Deber&iacute;a ser suficiente.
<li><i><b>wd0b: </b></i>(swap) - 300MB.
<li><i><b>wd0d: /tmp</b></i> - 120MB.  <tt>/tmp</tt> se usa para
compilar algo de <i>software</i>, y probablemente 120MB sean suficiente
para la mayor&iacute;a de cosas.
<li><i><b>wd0e: /var</b></i> - 80MB.  Si se tratara de un servidor de
<i>web</i> o de correo habr&iacute;amos creado esta partici&oacute;n
mucho m&aacute;s grande, pero no es el caso.
<li><i><b>wd0g: /usr</b></i> - 2GB.  Queremos que esta partici&oacute;n
sea lo suficientemente grande como para cargar unas cuantas aplicaciones
de usuario, y adem&aacute;s para que podamos actualizar y recomponer el
sistema si lo deseamos o lo necesitamos.  El
<a href="../../es/ports.html">&aacute;rbol de portes</a> tambi&eacute;n
estar&aacute; en esta partici&oacute;n, y ocupar&aacute; casi 100MB del
espacio antes de compilar e instalar los portes.
<li><i><b>wd0h: /home</b></i> - 4GB.  Esto nos permitir&aacute; mucho
espacio para ficheros de usuarios.
</ul>

<p>
Si sumamos estas cantidades, veremos que quedan m&aacute;s de 10GB de
espacio sin usar.  Este espacio sin utilizar no da&ntilde;a nada, y nos
da flexibilidad para ampliar particiones en el futuro si lo
necesit&aacute;ramos.  Por ejemplo, si necesit&aacute;ramos m&aacute;s
espacio de <i>/tmp</i> s&oacute;lo tendr&iacute;amos que crear uno nuevo
en este espacio y cambiar <i>/etc/fstab</i> para reflejarlo.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  &gt; <b>p m</b>
  device: /dev/rwd0c
  type: ESDI
  disk: ESDI/IDE disk
  label: ST320011A
  bytes/sector: 512
  sectors/track: 63
  tracks/cylinder: 16
  sectors/cylinder: 1008
  cylinders: 16383
  total sectors: 39102336
  free sectors: 36030960
  rpm: 3600
  
  16 partitions:
  #        size   offset    fstype   [fsize bsize   cpg]
    a: 17593.2M  1498.7M    unused        0     0
    c: 19092.9M     0.0M    unused        0     0
    i:  1498.7M     0.0M     MSDOS
  &gt; <b>d a</b>
  &gt; <b>a a</b>
  offset: [3069360] <b><i>Intro</i></b>
  size: [36030960] <b>150M</b>
  Rounding to nearest cylinder: 307440
  FS type: [4.2BSD] <b><i>Intro</i></b>
  mount point: [none] <b>/</b>
  &gt; <b>a b</b>
  offset: [3376800] <b><i>Intro</i></b>
  size: [35723520] <b>300M</b>
  Rounding to nearest cylinder: 614880
  FS type: [swap] <b><i>Intro</i></b>
  &gt; <b>a d</b>
  offset: [3991680] <b><i>Intro</i></b>
  size: [35108640] <b>120m</b>
  Rounding to nearest cylinder: 245952
  FS type: [4.2BSD] <b><i>Intro</i></b>
  mount point: [none] <b>/tmp</b>
  &gt; <b>a e</b>
  offset: [4237632] <b><i>Intro</i></b>
  size: [34862688] <b>80m</b>
  Rounding to nearest cylinder: 164304
  FS type: [4.2BSD] <b><i>Intro</i></b>
  mount point: [none] <b>/var</b>
  &gt; <b>a g</b>
  offset: [4401936] <b><i>Intro</i></b>
  size: [34698384] <b>2g</b>
  Rounding to nearest cylinder: 4194288
  FS type: [4.2BSD] <b><i>Intro</i></b>
  mount point: [none] <b>/usr</b>
  &gt; <b>a h</b>
  offset: [8596224] <b><i>Intro</i></b>
  size: [30504096] <b>4g</b>
  Rounding to nearest cylinder: 8388576
  FS type: [4.2BSD] <b><i>Intro</i></b>
  mount point: [none] <b>/home</b>
  &gt; <b>p m</b>
  device: /dev/rwd0c
  type: ESDI
  disk: ESDI/IDE disk
  label: ST320011A
  bytes/sector: 512
  sectors/track: 63
  tracks/cylinder: 16
  sectors/cylinder: 1008
  cylinders: 16383
  total sectors: 39102336
  free sectors: 22115520
  rpm: 3600
  
  16 partitions:
  #        size   offset    fstype   [fsize bsize   cpg]
    a:   150.1M  1498.7M    4.2BSD     1024  8192    16  # /
    b:   300.2M  1648.8M      swap
    c: 19092.9M     0.0M    unused        0     0
    d:   120.1M  1949.1M    4.2BSD     1024  8192    16  # /tmp
    e:    80.2M  2069.2M    4.2BSD     1024  8192    16  # /var
    g:  2048.0M  2149.4M    4.2BSD     1024  8192    16  # /usr
    h:  4096.0M  4197.4M    4.2BSD     1024  8192    16  # /home
    i:  1498.7M     0.0M     MSDOS
  &gt; <b>q</b>
  Write new label?: [y] <b><i>Intro</i></b>
</pre></td></tr></table>

<p>
Como se puede ver, hay una partici&oacute;n <i>c</i> que parece haber
sido ignorada.  Esta partici&oacute;n representa al disco duro completo,
y no se debe intentar modificarla.  Tambi&eacute;n puede verse que no
hemos definido la partici&oacute;n <i>i</i>, ya que &eacute;sta es la
partici&oacute;n de Windows 2000 que ya exist&iacute;a anteriormente.
En general, a las particiones no se les asigna ninguna letra en
concreto, a excepci&oacute;n de <i>a</i>, que es la partici&oacute;n
ra&iacute;z, <i>b</i>, la partici&oacute;n para la memoria de
intercambio, y <i>c</i>, que es una representaci&oacute;n de todo el
disco duro;  el resto de las letras, hasta la <i>p</i>, pueden ser
asignadas a cualquier partici&oacute;n seg&uacute;n se desee.

<p>
Si observamos la salida de la orden <tt>disklabel</tt>, podremos notar
que el <i>rating</i> RPM del dispositivo es incorrecto.  El sistema no
usa para nada la velocidad del dispositivo, por lo que no hay que
preocuparse por ello.

<p>
<h3>Configuraci&oacute;n de los puntos de montaje y formateado de los
sistemas de archivos</h3>

<p>
Ahora llega el &uacute;ltimo paso de la configuraci&oacute;n de los
puntos de montaje.  Si hemos configurado los puntos de montaje con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&amp;sektion=8">disklabel(8)</a>, 
este paso s&oacute;lo consiste en verificar las selecciones que hemos
realizado o, si queremos cambiar alguna selecci&oacute;n, hacerlo ahora.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  The root filesystem will be mounted on wd0a.
  wd0b will be used for swap space.
  Mount point for wd0d (size=122976k), none or done? [/tmp] <b><i>Intro</i></b>
  Mount point for wd0e (size=82152k), none or done? [/var] <b><i>Intro</i></b>
  Mount point for wd0g (size=2097144k), none or done? [/usr] <b><i>Intro</i></b>
  Mount point for wd0h (size=4194288k), none or done? [/home] <b><i>Intro</i></b>
  Mount point for wd0d (size=122976k), none or done? [/tmp] <b>done</b>
  Done - no available disks found.
 
  You have configured the following partitions and mount points:

  wd0a /
  wd0d /tmp
  wd0e /var
  wd0g /usr
  wd0h /home

  The next step creates a filesystem on each partition, ERASING existing data.
  Are you really sure that you're ready to proceed? [n] y
  /dev/rwd0a:     307440 sectors in 305 cylinders of 16 tracks, 63 sectors
          150.1MB in 20 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
  /dev/rwd0d:     245952 sectors in 244 cylinders of 16 tracks, 63 sectors
          120.1MB in 16 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
  /dev/rwd0e:     164304 sectors in 163 cylinders of 16 tracks, 63 sectors
          80.2MB in 11 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
  /dev/rwd0g:     4194288 sectors in 4161 cylinders of 16 tracks, 63 sectors
          2048.0MB in 261 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
  /dev/rwd0h:     8388576 sectors in 8322 cylinders of 16 tracks, 63 sectors
          4096.0MB in 521 cyl groups (16 c/g, 7.88MB/g, 1920 i/g)
  /dev/wd0a on /mnt type ffs (rw, asynchronous, local, ctime=Thu Oct 10 21:
  50:36 2 002)
  /dev/wd0h on /mnt/home type ffs (rw, asynchronous, local, nodev, nosuid,
   ctime=Thu Oct 10 21:50:36 2002)
  /dev/wd0d on /mnt/tmp type ffs (rw, asynchronous, local, nodev, nosuid, 
  ctime=Thu Oct 10 21:50:36 2002)
  /dev/wd0g on /mnt/usr type ffs (rw, asynchronous, local, nodev, ctime=Th
  u Oct 10 21:50:36 2002)
  /dev/wd0e on /mnt/var type ffs (rw, asynchronous, local, nodev, nosuid, 
  ctime=Th u Oct 10 21:50:36 2002)
</pre></td></tr></table>

<p>
El motivo por el que el instalador nos pregunta por los puntos de
montaje es que as&iacute; nos da la oportunidad de corregir cualquier
error u omisi&oacute;n en los puntos de montaje que hayamos especificado
durante la creaci&oacute;n de la composici&oacute;n del disco.  Por
ejemplo, durante el proceso de instalaci&oacute;n se elimina de forma
autom&aacute;tica cualquier punto de montaje duplicado que hayamos
introducido durante la configuraci&oacute;n de la composici&oacute;n del
disco.  El programa <tt>disklabel</tt> nos permite crear estos
duplicados, y por lo tanto deben ser comprobados despu&eacute;s de
acabar el programa <tt>disklabel</tt>.  Los puntos de montaje duplicados
dan como resultado particiones sin un punto de montaje, y es necesario
asignarles nuevos puntos de montaje si queremos usar este espacio.

<p>
N&oacute;tese que la pregunta <tt>Are you really sure that you are ready
to proceed?</tt> (si est&aacute; seguro de querer continuar) est&aacute;
predeterminada con <strong>no</strong>, por lo que tendr&aacute; que
explicitar que s&iacute; desea continuar y formatear las particiones
contestando <strong>yes</strong>.  En caso contrario invocar&aacute; al
int&eacute;rprete, desde donde podr&aacute; reiniciar la
instalaci&oacute;n escribiendo <strong>install</strong>, o reiniciando
el sistema de nuevo con el disco de arranque.

<p>
A partir de este punto el programa dar&aacute; formato a todos los
sistemas de archivo.  Esto podr&iacute;a tardar un tiempo dependiendo
del tama&ntilde;o de las particiones y de la velocidad del disco.

<p>
<a name="Hostname"></a>
<h3>4.5.3 - Configuraci&oacute;n del nombre de anfitri&oacute;n del
sistema (<i>system hostname</i>)</h3>

<p>
Ahora debemos configurar el nombre de anfitri&oacute;n que
utilizar&aacute; el sistema.  Este valor se guardar&aacute; en el
fichero <tt>/etc/myname</tt>, y se usar&aacute; durante el arranque
normal del sistema para asignar el nombre de anfitri&oacute;n del
sistema.  A partir de la versi&oacute;n 3.2 de OpenBSD, el nombre que se
guarda en <tt>/etc/myname</tt> incluye el &laquo;nombre de dominio del
sistema de totalmente calificado&raquo; (FQDN, <i>fully qualified domain
name system</i>).  Si no asignamos el FQDN al sistema, se usar&aacute;
el valor predeterminado 'my.domain'.

<p>
Es importante que configuremos ahora este nombre, ya que ser&aacute; el
que se utilice cuando se generen las claves criptogr&aacute;ficas
durante el primer arranque del sistema despu&eacute;s de la
instalaci&oacute;n.  La generaci&oacute;n de esta claves se
realizar&aacute; tanto si la red est&aacute; configurada como si no.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Enter system hostname (short form, e.g. 'foo'): <b>puffy</b>
</pre></td></tr></table>

<p>
<a name="Network"></a>
<h3>4.5.4 - Configuraci&oacute;n de la red</h3>

<p>
Ahora es el momento de configurar la red.  La red debe estar configurada
si se va a realizar una instalaci&oacute;n por ftp o nfs, ya que estas
instalaciones se basar&aacute;n en la informaci&oacute;n que
introduzcamos aqu&iacute;.  He aqu&iacute; un ejemplo de la
secci&oacute;n de configuraci&oacute;n de la red en el proceso de
instalaci&oacute;n:

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Configure the network? [y] <b><i>Intro</i></b>

  Which one do you wish to initialize? (or 'done') [fxp0] <b><i>Intro</i></b>
  Symbolic (host) name for fxp0? [puffy] <b><i>Intro</i></b>
  The default media for fxp0 is
          media: Ethernet autoselect (100baseTX full-duplex)
  Do you want to change the default media? [n] <b><i>Intro</i></b>
  IP address for fxp0? (or 'dhcp') <b>199.185.137.55</b>
  Netmask? [255.255.255.0] <b><i>Intro</i></b>
  Done - no available interfaces found.
  DNS domain name? (e.g. 'bar.com') [my.domain] <b>example.com</b>
  DNS nameserver? (IP address or 'none') [none] <b>199.185.137.1</b>
  Use the nameserver now? [y] <b><i>Intro</i></b>
  Default route? (IP address, 'dhcp' or 'none') <b>199.185.137.128</b>
  add net default: gateway 199.185.137.128
  Edit hosts with ed? [n] <b><i>Intro</i></b> 
  Do you want to do any manual network configuration? [n] <b><i>Intro</i></b>
</pre></td></tr></table>

<p>

<p>
En el ejemplo anterior usamos una direcci&oacute;n IP est&aacute;tica.
Como se indica, se puede usar &quot;<tt>dhcp</tt>&quot; para IPs
din&aacute;micas en lugar de est&aacute;ticas en la mayor&iacute;a de
platformas (no en <a href="../../es/alpha.html">Alpha</a>).  En el caso
de DHCP, la mayor parte de la informaci&oacute;n se obtiene del servidor
de DHCP remoto;  el proceso de instalaci&oacute;n nos dar&aacute; la
oportunidad de confirmarla.  He aqu&iacute; un ejemplo de la parte
correspondiente a la configuraci&oacute;n de red en el proceso de
instalaci&oacute;n, en este caso con DHCP:

<p>
<table border=0 width="650"><tr><td nowrap bgcolor="#EEEEEE"><pre>
  Configure the network? [y] <b><i>Intro</i></b>
  Available interfaces are: fxp0.
  Which one do you wish to initialize? (or 'done') [fxp0] <b><i>Intro</i></b>
  Symbolic (host) name for fxp0? [puffy] <b><i>Intro</i></b>
  The default media for fxp0 is
          media: Ethernet autoselect (100baseTX full-duplex)
  Do you want to change the default media? [n] <b><i>Intro</i></b>
  IP address for fxp0? (or 'dhcp') <b>dhcp</b>
  Issuing hostname-associated DHCP request for fxp0.
  Internet Software Consortium DHCP Client 2.0pl5-OpenBSD
  Listening on BPF/fxp0/00:08:c7:77:b4:6b
  Sending on   BPF/fxp0/00:08:c7:77:b4:6b
  Sending on   Socket/fallback/fallback-net
  DHCPDISCOVER on fxp0 to 255.255.255.255 port 67 interval 1
  DHCPOFFER from 199.185.137.128
  DHCPREQUEST on fxp0 to 255.255.255.255 port 67
  DHCPACK from 199.185.137.128 
  New Network Number: 199.185.137.0
  New Broadcast Address: 199.185.137.255
  bound to 199.185.137.55 -- renewal in 43200 seconds.
  Done - no available interfaces found.
  DNS domain name? (e.g. 'bar.com') [example.org] <b><i>Intro</i></b>
  DNS nameserver? (IP address or 'none') [199.185.137.1] <b><i>Intro</i></b>
  Use the nameserver now? [y] <b><i>Intro</i></b>
  Default route? (IP address, 'dhcp' or 'none') [199.185.137.128] <b><i>Intro</i></b>
  add net default: gateway 199.185.137.128
  Edit hosts with ed? [n] <b><i>Intro</i></b>
  Do you want to do any manual network configuration? [n] <b><i>Intro</i></b>
</pre></td></tr></table>

<p>
<b>NOTA:</b>  Durante la instalaci&oacute;n, s&oacute;lo se puede
configurar de modo f&aacute;cil <b>una</b> interfaz usando DHCP.  Si
intent&aacute;ramos configurar m&aacute;s de una interfaz usando DHCP,
encontrar&iacute;amos una serie de errores.  Cualquier interfaz
adicional tendr&aacute; que ser configurada manualmente despu&eacute;s
de la instalaci&oacute;n.

<p>
Ahora configuraremos la contrase&ntilde;a para la cuenta del
superusuario <i>root</i>:

<p>
<table border=0 width="650"><tr><td nowrap bgcolor="#EEEEEE"><pre>
Password for root account? (will not echo) <b><i>cOnTRase&Ntilde;a</i></b>
Password for root account? (again) <b><i>cOnTRase&Ntilde;a</i></b>
</pre></td></tr></table>

<p>
Para el usuario <i>root</i> hay que escoger una contrase&ntilde;a muy
segura.  Despu&eacute;s de arrancar el sistema podremos crear otras
cuentas para usuarios normales.  De acuerdo con la p&aacute;gina del
manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&amp;sektion=1">passwd(1)</a>:

<pre>
    La nueva contrase&ntilde;a debe tener un m&iacute;nimo de seis
    caracteres y no deben ser s&oacute;lo caracteres alfab&eacute;ticos.
    Su tama&ntilde;o total debe ser menor que el valor de _PASSWORD_LEN
    (que en la actualidad es 128 caracteres).  Se aconseja utilizar un
    combinado de letras may&uacute;sculas y min&uacute;sculas,
    n&uacute;meros, signos de puntuaci&oacute;n y otros.
</pre>

<p>
<a name="InstMedia"></a>
<h3>4.5.5 - Elecci&oacute;n del medio de instalaci&oacute;n</h3>

<p>
Despu&eacute;s de configurar la red, el gui&oacute;n de
instalaci&oacute;n nos dar&aacute; la oportunidad de realizar cambios
manuales a la configuraci&oacute;n.  A continuaci&oacute;n se
montar&aacute;n los los sistemas de archivos que hayamos creado y una
contrase&ntilde;a para el superusuario <i>root</i>.  Despu&eacute;s de
esto los discos ya estar&aacute;n preparados para instalar en ellos los
archivos de instalaci&oacute;n de OpenBSD.

<p>
A continuaci&oacute;n nos dar&aacute; la oportunidad de escoger un medio
de instalaci&oacute;n:

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  You will now specify the location and names of the install sets you want to
  load. You will be able to repeat this step until all of your sets have been
  successfully loaded. If you are not sure what sets to install, refer to the
  installation notes for details on the contents of each.
 
  Sets can be located on a (m)ounted filesystem; a (c)drom, (d)isk or (t)ape
  device; or a (f)tp, (n)fs or (h)ttp server.
  Where are the install sets? <b>c</b>
  Available CD-ROMs are: cd0.
</pre></td></tr></table>

<p>
En este ejemplo, la instalaci&oacute;n la llevaremos a cabo desde el
CDROM.  Nos mostrar&aacute; una lista de los dispositivos que identifique
como CDROM en nuestra m&aacute;quina.  La mayor&iacute;a de usuarios
s&oacute;lo tendr&aacute;n uno.  Si se tiene m&aacute;s de uno, es
necesario asegurarse de escoger correctamente cu&aacute;l es el que
estamos utilizando para instalar OpenBSD.

<p>
<b>NOTA:</b>  Nos mostrar&aacute; una lista de todas las posibles
fuentes de instalaci&oacute;n, pero es posible que no todas est&eacute;n
disponibles en el sistema.  Por ejemplo, (n)fs aparecer&aacute; en la
lista, pero no todas las arquitecturas permiten la instalaci&oacute;n
por NFS.  Si escogemos una fuente de instalaci&oacute;n que no
est&eacute; disponible, el programa nos mostrar&aacute; un mensaje de
error y nos permitir&aacute; escoger otra fuente distinta.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Available CD-ROMs are: cd0.
  Which one contains the install media? (or 'done') [cd0] <b><i>Intro</i></b>

  Pathname to the sets?  (or 'done') [3.3/i386] <b><i>Intro</i></b>
</pre></td></tr></table>

<p>
Aqu&iacute; le pregunta por el directorio en el que se encuentran los
archivos de instalaci&oacute;n, que es <i>/3.3/i386/</i> en el CD-ROM
oficial.

<p>
<a name="Filesets"></a>
<h3>4.5.6 - Elecci&oacute;n de los archivos de instalaci&oacute;n</h3>

<p>
Ahora puede escoger los archivos que va a instalar.  Puede ver una
descripci&oacute;n de estos archivos en la
<a href="#FilesNeeded">siguiente secci&oacute;n</a>.  El instalador
mostrar&aacute; en pantalla aquellos archivos que encuentre.  Lo
&uacute;nico que debe hacer Vd es especificar cu&aacute;les desea
instalar.  Todos los paquetes excepto los del entorno gr&aacute;fico X
est&aacute;n preseleccionados, aunque algunos usuarios preferir&aacute;n
dejarlo en el m&iacute;nimo indispensable requerido para el
funcionamiento de OpenBSD, que ser&iacute;a <tt>base32.tar.gz</tt>,
<tt>etc32.tar.gz</tt> y <tt>bsd</tt>.   Otros preferir&aacute;n instalar
todos los archivos.  En el ejemplo siguiente se escoger&aacute; una
instalaci&oacute;n completa.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  The following sets are available. Enter a filename, 'all' to select
  all the sets, or 'done'. You may de-select a set by prepending a '-'
  to its name.

          [X] bsd
          [ ] bsd.rd
          [X] base33.tgz
          [X] etc33.tgz
          [X] misc33.tgz
          [X] comp33.tgz
          [X] man33.tgz
          [X] game33.tgz
          [ ] xbase33.tgz
          [ ] xshare33.tgz
          [ ] xfont33.tgz
          [ ] xserv33.tgz

  File Name? (or 'done') [bsd.rd] <b>all</b>

  The following sets are available. Enter a filename, 'all' to select
  all the sets, or 'done'. You may de-select a set by prepending a '-'
  to its name.

          [X] bsd
          [X] bsd.rd
          [X] base33.tgz
          [X] etc33.tgz
          [X] misc33.tgz
          [X] comp33.tgz
          [X] man33.tgz
          [X] game33.tgz
          [X] xbase33.tgz
          [X] xshare33.tgz
          [X] xfont33.tgz
          [X] xserv33.tgz
</pre></td></tr></table>

<p>
Aqu&iacute; podemos hacer todo tipo de cosas:  <tt>-x*</tt>
eliminar&iacute;a todos los componentes de X.  Pero en este caso vamos a
cargar todos los archivos de instalaci&oacute;n.  Aunque el sistema
funcionar&aacute; con menos archivos instalados, se recomienda instalar
las un comienzo predeterminado.  Se pueden ver m&aacute;s detalles sobre
la selecci&oacute;n de archivos en <a href="#FilesNeeded">esta
secci&oacute;n</a>.

<p>
Una vez que ya hayamos escogido los archivos que deseamos instalar, nos
preguntar&aacute; si estamos seguros de querer extraer estos archivos y
pasar&aacute; a instalarlos.  Nos mostrar&aacute; una barra de progreso
mediante la cual nos mantendr&aacute; informado del tiempo que tarde.
El tiempo depender&aacute; en gran medida de la m&aacute;quina en la que
estemos instalando OpenBSD, de los archivos que instale, y de la
velocidad del medio de instalaci&oacute;n.  Esta parte puede tardar
desde unos pocos minutos hasta varias horas.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#EEEEEE"><pre>
  File Name? (or 'done') [done] <b><i>Intro</i></b>
  Ready to install sets? [y] <b><i>Intro</i></b>
 
  100% |**************************************************|  4472 KB    00:03
  Getting bsd.rd ...
  100% |**************************************************|  4190 KB    00:02
  Getting base33.tgz ...
  100% |**************************************************| 30255 KB    00:21
  Getting etc33.tgz ...
  100% |**************************************************|  1469 KB    00:01
  Getting misc33.tgz ...
  100% |**************************************************|  1828 KB    00:01
  Getting comp33.tgz ...
  100% |**************************************************| 16207 KB    00:13
  Getting man33.tgz ...
  100% |**************************************************|  5921 KB    00:04
  Getting game33.tgz ...
  100% |**************************************************|  2545 KB    00:01
  Getting xbase33.tgz ...
  100% |**************************************************|  9073 KB    00:06
  Getting xshare33.tgz ...
  100% |**************************************************|  1574 KB    00:02
  Getting xfont33.tgz ...
  100% |**************************************************| 30666 KB    00:21
  Getting xserv33.tgz ...
  100% |**************************************************| 14948 KB    00:11

  Sets can be located on a (m)ounted filesystem; a (c)drom, (d)isk or (t)ape
  device; or a (f)tp, (n)fs or (h)ttp server.
  Where are the install sets? (or 'done')
</pre></td></tr></table>

<p>
Desde este punto podr&iacute;amos incluir archivos adicionales desde
otras fuentes si quisi&eacute;ramos hacerlo, o introducir
'<tt>done</tt>' para dar la orden de acabar si ya hemos instalado todos
los archivos que necesitamos.

<p>
Si su sistema tiene poca memoria de RAM, menos de 20M en i386, &iexcl;no
conteste a esa pregunta todav&iacute;a!

<p>
<a name="SmallRAM"></a>
<h3>4.5.7 - Pasos adicionales para m&aacute;quinas con poca RAM</h3>

<p>
Debido al constante crecimiento de OpenBSD, Seg&uacute;n va creciendo
OpenBSD, tambi&eacute;n crecen los requisitos de RAM, y esta tendencia
continuar&aacute; en el futuro.  El paso siguiente en el proceso de
instalaci&oacute;n requiere m&aacute;s de 16MB de RAM, y no
funcionar&aacute; en m&aacute;quinas que tengan menos de 20M de RAM.
Esto es para m&aacute;quinas basadas en la plataforma i386, ya que otras
plataformas requieren mucha menos RAM;  pero este truco tambi&eacute;n
sirve para otras plataformas si se alcanzan los l&iacute;mites en ellas.

<p>
Durante el proceso de instalaci&oacute;n no suele haber memoria de
intercambio (o <i>swap</i>), y &uacute;nico de lo que podemos disponer
es de la memoria de acceso aleatorio (o <i>RAM</i>).  Para el paso que
sigue con 'MAKEDEV' se necesita m&aacute;s de lo requerido por el resto
de la instalaci&oacute;n.  Pero como un sistema con poca cantidad de RAM
todav&iacute;a puede ser de gran utilidad para muchas aplicaciones, la
evicci&oacute;n de de esta limitaci&oacute;n nos resultar&aacute; muy
&uacute;til.

<p>
La soluci&oacute;n est&aacute; en activar ahora la memoria de
intercambio.  La partici&oacute;n de <i>swap</i> ya est&aacute; creada y
los archivos se encuentran ya en el disco duro, as&iacute; que el truco
estar&aacute; en invocarla de forma manual.  Para ello no introduzca
'<tt>done</tt>' en el punto anterior;  escriba '!' para llamar a un
int&eacute;rprete de &oacute;rdenes y ejecute
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=swapon&amp;sektion=8">swapon(8)</a>
desde el disco duro montado:

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Where are the install sets? (or 'done') <b>!</b>
  Type 'exit' to return to install.
  # <b>/mnt/sbin/swapon /dev/wd0b</b>
  # <b>exit</b>
  Where are the install sets? (or 'done') <b>done</b>
</pre></td></tr></table>

<p>
Ahora ya puede continuar con la instalaci&oacute;n normal.


<p>
<a name="Finish"></a>
<h3>4.5.8 - &Uacute;ltimos pasos</h3>

<p>
Ahora nos preguntar&aacute; si vamos a instalar X en este sistema.  Si
contestamos afirmativamente, modificar&aacute; <tt>/etc/sysctl.conf</tt>
para que incluya la l&iacute;nea <tt>machdep.allowaperture=1</tt> o
<tt>machdep.allowaperture=2</tt>, dependiendo de nuestra plataforma.

<p>
Ya s&oacute;lo faltar&aacute; introducir la franja horaria.  Dependiendo
de la regi&oacute;n en la que vivamos, existen varias respuestas que
pueden ser igualmente v&aacute;lidas.  En el ejemplo hemos usado
<tt>US/Eastern</tt>, pero tambi&eacute;n podr&iacute;amos haber usado
<tt>EST5EDT</tt> o <tt>US/Michigan</tt> para obtener el mismo resultado.
Si pulsamos la tecla <tt>?</tt> nos mostrar&aacute; una lista de
posibles candidatos.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Extract more sets? [n] <b><i>Intro</i></b>
  Do you expect to run the X Window System? [y] <b>y</b>
  Saving configuration files......done.
  Generating initial host.random file ......done.
  What timezone are you in? ('?' for list) [US/Pacific] <b>?</b>
  Africa/      Chile/       GB-Eire      Israel       NZ-CHAT      Turkey
  America/     Cuba         GMT          Jamaica      Navajo       UCT
  Antarctica/  EET          GMT+0        Japan        PRC          US/
  Arctic/      EST          GMT-0        Kwajalein    PST8PDT      UTC
  Asia/        EST5EDT      GMT0         Libya        Pacific/     Universal
  Atlantic/    Egypt        Greenwich    MET          Poland       W-SU
  Australia/   Eire         HST          MST          Portugal     WET
  Brazil/      Etc/         Hongkong     MST7MDT      ROC          Zulu
  CET          Europe/      Iceland      Mexico/      ROK          posix/
  CST6CDT      Factory      Indian/      Mideast/     Singapore    posixrules
  Canada/      GB           Iran         NZ           SystemV/     right/
  What timezone are you in? ('?' for list) [US/Pacific] <b>US</b>
  What sub-timezone of 'US' are you in? ('?' for list) <b>?</b>
  Alaska          Central         Hawaii          Mountain        Samoa
  Aleutian        East-Indiana    Indiana-Starke  Pacific
  Arizona         Eastern         Michigan        Pacific-New
  Select a sub-timezone of 'US' ('?' for list): <b>Eastern</b>
  Setting local timezone to 'US/Eastern'...done.
</pre></td></tr></table>

<p>
Alguien que desee tener una medici&oacute;n horaria muy precisa,
deber&iacute;a <a href="faq8.html#NTPerror">la secci&oacute;n sobre
NTP</a>.

<p>
Los &uacute;ltimos pasos del programa ser&aacute;n los de crear el
directorio <tt>/dev</tt> (que puede tardar un rato en algunos sistemas, en
especial si hemos tenido que usar el truco para <a href="SmallRAM">poca
RAM</a> anterior), e instalar los bloques de arranque.

<p>
<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Making all device nodes...done.
  Installing boot block...
  boot: /mnt/boot
  proto: /usr/mdec/biosboot
  device: /dev/rwd0c
  /usr/mdec/biosboot: entry point 0
  proto bootblock size 512
  room for 12 filesystem blocks at 0x16f
  Will load 7 blocks of size 8192 each.
  Using disk geometry of 63 sectors and 240 heads.
   0:  9 @(203 150 55) (3078864-3078872)
   1: 63 @(203 151 1) (3078873-3078935)
   2: 24 @(203 152 1) (3078936-3078959)
   3: 16 @(203 8 47) (3069910-3069925)
  /mnt/boot: 4 entries total
  using MBR partition 1: type 166 (0xa6) offset 3069360 (0x2ed5b0)
  ...done.

  CONGRATULATIONS! Your OpenBSD install has been successfully completed!
  To boot the new system, enter halt at the command prompt. Once the
  system has halted, reset the machine and boot from the disk.
  # <b>halt</b>
  syncing disks... done

  The operating system has halted.
  Please press any key to reboot.
</pre></td></tr></table>

<p>
Ahora OpenBSD ya est&aacute; instalado en el sistema y listo para su
primer arranque, pero antes...

<p>
<h4>Antes de reiniciar</h4>

<p>
En este momento el sistema ya est&aacute; instalado y preparado para ser
reiniciado y configurado para entrar en servicio.  Pero antes de
hacerlo, ser&iacute;a conveniente repasar la
<a href="../../es/errata.html">p&aacute;gina de erratas</a> para ver si
existiera alg&uacute;n error que deba tenerse en cuenta.

<p>
<h4>Despu&eacute;s de reiniciar</h4>

<p>
Uno de los primeros documentos que hay que leer despu&eacute;s de
instalar el sistema es
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8">afterboot(8)</a>.
 
<p>
Y los siguientes enlaces tambi&eacute;n ser&aacute;n de utilidad:

<ul>
<li><a href="faq10.html#AddDelUser">Adici&oacute;n de nuevos usuarios en
OpenBSD</a>
<li><a href="faq6.html#Setup">Configuraci&oacute;n inicial de la red</a>
<li><a href="faq2.html#ManPages">P&aacute;ginas del manual de la
&oacute;rdenes de uso m&aacute;s frecuente</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi">Interfaz de
<i>web</i> para las p&aacute;ginas del manual de OpenBSD</a>
<li><a href="../../es/ports.html">El subsistema de Portes y Paquetes de
OpenBSD para la instalaci&oacute;n de programas</a>;  y tambi&eacute;n
<a href="faq8.html#Ports">&eacute;ste</a> y
<a href="faq8.html#Packages">&eacute;ste</a>
</ul>

<p>
<h4>Una &uacute;ltima cosa...</h4>

<p>
Los desarrolladores de OpenBSD agradecen el
<a href="#SendDmesg">env&iacute;o de una copia de la salida de
dmesg</a>.  Esto es de gran utilidad para los desarrolladores, y en
consecuencia para todos los usuarios.


<p>
<a name="OtherInf"></a>
<h3>4.5.9 - Otros recursos de informaci&oacute;n</h3>

<p>
Existen documentos adicionales para aquellos que puedan tener alguna
necesidad o inter&eacute;s especial.  Puede obtenerlos desde cualquiera
de las <a href="../../es/ftp.html">r&eacute;plicas del servidor de
ftp</a>.

<ul>
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.i386">INSTALL.i386</a> - Documento comprensivo de instalaci&oacute;n.  Existen documentos parecidos para cada una de las plataformas.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.linux">INSTALL.linux</a> - Instalaci&oacute;n compartida de OpenBSD y Linux.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.mbr">INSTALL.mbr</a> - Explicaci&oacute;n del &laquo;registro de arranque maestro&raquo; (<i>Master Boot Record</i>, MBR).
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.pt">INSTALL.pt</a> - Explicaci&oacute;n de las tablas de partici&oacute;n.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.dbr">INSTALL.dbr</a> - Sector de arranque del disquete de DOS.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.chs">INSTALL.chs</a> - Explicaci&oacute;n de la traducci&oacute;n CHS.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.ata">INSTALL.ata</a> - Preguntas frecuentes sobre ATA/ATA-1/ATA-2/IDE/EIDE/etc.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.os2br">INSTALL.os2br</a> - El sector de arranque de os2.
</ul>

<p>
<a name="FilesNeeded"></a>
<h2>4.6 - &iquest;Qu&eacute; archivos son necesarios para la
instalaci&oacute;n?</h2>
<!-- XXXrelease -->
<p>
La instalaci&oacute;n completa de OpenBSD se encuentra dividida en
varios <i>archivos de instalaci&oacute;n</i> separados, y no todas las
aplicaciones necesitan cada uno de estos archivos.  He aqu&iacute; una
breve explicaci&oacute;n de lo que contiene cada uno de ellos:

<p>
<ul>
<li><b><i>bsd</i></b> - El n&uacute;cleo del sistema <b>Requerido</b>
<li><b><i>bsd.rd</i></b> - Un <a href="#bsd.rd">n&uacute;cleo en disco
RAM</a>
<li><b><i>base33.tgz</i></b> - Contiene la base del sistema OpenBSD
<b>Requerido</b>
<li><b><i>etc33.tgz</i></b> - Contiene todos los ficheros de /etc -
<b>Requerido</b>
<li><b><i>comp33.tgz</i></b> - Contiene el compilador y sus herramientas
y bibliotecas - <b>Recomendado</b>
<li><b><i>man33.tgz</i></b> - Contiene las p&aacute;ginas del manual
<b>Recomendado</b>
<li><b><i>misc33.tgz</i></b> - Contiene informaci&oacute;n
miscel&aacute;nea, documentaci&oacute;n de configuraci&oacute;n,
<li><b><i>game33.tgz</i></b> - Contiene los juegos para OpenBSD
<li><b><i>xbase33.tgz</i></b> - Contiene la instalaci&oacute;n base de
X11
<li><b><i>xfont33.tgz</i></b> - Contiene los servidores de fuentes de
X11 y las fuentes
<li><b><i>xserv33.tgz</i></b> - Contiene servidores de X para X11
<li><b><i>xshare33.tgz</i></b> - Contiene p&aacute;ginas del manual,
configuraciones para la internacionalizaci&oacute;n, ficheros de
inclusi&oacute;n, etc...  para X
</ul>


<p>
<a name="SpaceNeeded"></a>
<h2>4.7 - &iquest;Cu&aacute;nto espacio necesito para instalar
OpenBSD?</h2>
<!-- XXXrelease -->
<p>
Se sugiere usar, como m&iacute;nimo indispensable, los siguientes
tama&ntilde;os para los sistemas de archivos para realizar una
instalaci&oacute;n completa del sistema.  Los tama&ntilde;os sugeridos
incluyen el suficiente espacio adicional para una instalaci&oacute;n
t&iacute;pica de un sistema en casa conectado a Internet.

<ul>
<li>Estos valores son el m&iacute;nimo requerido.
<li>Si se va a instalar una cantidad significativa de <i>software</i> de
terceras partes, hay que crear una partici&oacute;n <tt>/usr</tt>
grande.  &iexcl;<strong>Como m&iacute;nimo</strong> hay que triplicar
estos valores!
<li>Para un sistema que vaya a gestionar mucho correo electr&oacute;nico
o p&aacute;ginas web (almacenados respectivamente en <tt>/var/mail</tt>
y <tt>/var/www</tt>), la partici&oacute;n <tt>/var</tt> deber&aacute;
ser bastante m&aacute;s grande, o ponerlos en particiones separadas.
<li>Para un sistema multiusuario que genere muchos mensajes de registro
(<i>logs</i>), la partici&oacute;n <tt>/var</tt> a&uacute;n
tendr&aacute; que ser mucho m&aacute;s grande (<tt>/var/log</tt>).
<li>Si se va a recompilar el n&uacute;cleo o el sistema desde el
c&oacute;digo fuente, interesa crear una partici&oacute;n <tt>/usr</tt>
bastante m&aacute;s grande, <strong>como m&iacute;nimo</strong> entre
800MB y 1GB m&aacute;s grande de la que se indica abajo.
</ul>

<p>
Es necesario recordar que tanto <tt>/usr</tt> como <tt>/usr/X11R6</tt>
son, por regla general, parte del mismo sistema de archivos;  o sea
parte de <tt>/usr</tt>, ya que no hay ninguna ventaja importante en
mantenerlos como sistemas de archivos separados.

<blockquote>
<pre>
<b>
SYSTEM          /       /usr    /var    /usr/X11R6
alpha           80M     250M    25M     140M
hp300           80M     250M    25M     140M
hppa           100M     200M    25M     120M
i386            60M     250M    25M     140M
mac68k          80M     250M    25M     100M
macppc          80M     250M    25M     140M
mvme68k         80M     250M    25M     100M
sparc           80M     250M    25M     120M
sparc64         80M     250M    25M     100M
vax            100M     200M    25M     120M
</b>
</pre>
</blockquote>

<p>
Adem&aacute;s, se recomienda usar una partici&oacute;n separada para el
sistema de archivos <tt>/tmp</tt>.  La partici&oacute;n de <tt>/tmp</tt>
se usa en la compilaci&oacute;n de los portes entre otras cosas, y su
tama&ntilde;o depender&aacute; de las necesidades de cada usuario.  50MB
puede ser suficiente para la mayor&iacute;a de usuarios, pero algunas
aplicaciones m&aacute;s grandes pueden requerir un espacio en
<tt>/tmp</tt> de 100MB o m&aacute;s.

<p>
Cuando nos encontremos en el editor del disco (<i>disklabel</i>),
podemos escoger que el sistema tenga s&oacute;lo dos particiones, 'a'
(sistema de archivos principal) y 'b' (memoria de intercambio,
<i>swap</i>).  El sistema de archivos 'a' que configuremos en
<i>disklabel</i> ser&aacute; la partici&oacute;n ra&iacute;z
(<i>root</i>), que se debe componer de la suma de los tres valores
principales anteriores (<tt>/</tt>, <tt>/usr</tt>, y <tt>/var</tt>),
m&aacute;s algo de espacio para <tt>/tmp</tt>.  La partici&oacute;n 'b'
ser&aacute; la partici&oacute;n <tt>swap</tt> del sistema.  Para esta
partici&oacute;n recomendamos un m&iacute;nimo de 32MB, pero si se
dispone de suficiente espacio en el disco es mejor usar un m&iacute;nimo
de 64MB.  Si se dispone de mucho espacio de sobra en el disco, lo mejor
es hacerla de 256MB, o incluso de 512MB.

<p>
El espacio de la memoria de intercambio se usa para almacenar volcados
del sistema en el caso de que sufriera una ca&iacute;da
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crash&amp;sektion=8">crash(8)</a>).
Por ello, el espacio de la partici&oacute;n <tt>swap</tt> deber&iacute;a
ser ligeramente mayor que el de la memoria principal del sistema.
Hay que tener en cuenta que cuando se reinicia el sistema,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=savecore&amp;sektion=8">savecore(8)</a>
intenta guardar el contenido de la partici&oacute;n <tt>swap</tt> en un
fichero en <tt>/var/crash</tt>, por lo que si deseamos conservar el
volcado de una ca&iacute;da del sistema, debemos disponer de <i>espacio
disponible</i> para estos ficheros de volcado.

<p>
Existen cinco razones principales para usar sistemas de archivos
separados en lugar de meterlo todo en s&oacute;lo dos sistemas de
archivos:

<ul>
<li><strong>Seguridad</strong>: se puede marcar algunos sistemas de
archivos como 'nosuid', 'nodev', 'noexec', 'readonly', etc...  Si se
utilizan las particiones que se han descrito anteriormente esto lo
har&aacute; autom&aacute;ticamente el proceso de instalaci&oacute;n.
<li><strong>Estabilidad</strong>: un usuario, o un programa con un
comportamiento incorrecto, puede llenar un sistema de archivos de basura
si tiene permiso de escritura sobre &eacute;ste.  De este modo, los
programas m&aacute;s cr&iacute;ticos, que por supuesto
funcionar&aacute;n en un sistema de archivos diferente, no ser&aacute;n
interrumpidos.
<li><strong>Velocidad</strong>: un sistema de archivos sobre el que se
escriba con frecuencia puede acabar algo fragmentado.  Por suerte, el
sistema de archivos de tipo ffs, que es el que usa OpenBSD, no es
propenso a la fragmentaci&oacute;n.
<li><strong>Integridad</strong>: si un sistema de archivos se
corrompiera por cualquier motivo, el resto de sistemas quedar&iacute;an
intactos.
<li><strong>Tama&ntilde;o</strong>: muchas plataformas tienen
l&iacute;mites para el &aacute;rea del disco desde la que la ROM de
arranque puede cargar el n&uacute;cleo del sistema.  En algunos casos
este l&iacute;mite puede ser muy peque&ntilde;o (504M para un 486
antiguo), pero en otros casos puede ser mucho m&aacute;s grande (8G en
sistemas i386 nuevos).  Como el n&uacute;cleo del sistema puede acabar
en cualquier parte de la partici&oacute;n ra&iacute;z, toda la
partici&oacute;n ra&iacute;z deber&iacute;a estar dentro de este
&aacute;rea.  Se pueden ver m&aacute;s detalles en
<a href="faq14.html#LargeDrive">esta secci&oacute;n</a>.  Una
pol&iacute;tica recomendable ser&iacute;a mantener toda la
partici&oacute;n ra&iacute;z por debajo de los 2G, a menos que la
plataforma (y la m&aacute;quina en particular) sea capaz de manejar un
tama&ntilde;o m&aacute;s grande (&iexcl;o m&aacute;s peque&ntilde;o!).
</ul>

<p>
Algunas notas adicionales sobre las particiones:


<ul>
<li>Para un primer intento en un sistema experimental, una
partici&oacute;n <i>root</i> (<strong>/</strong>) grande y otra de
<i>swap</i> puede ser lo m&aacute;s sencillo hasta que se sepa el
espacio que se va a necesitar.  De este modo se sacrificar&aacute;n
algunas de las funcionalidades de seguridad predeterminadas de OpenBSD,
que requiere del uso de sistemas de archivos separados para <tt>/, /tmp,
/var, /usr</tt> y <tt>/home</tt>.
<li>Un sistema expuesto en Internet u otra fuerza de naturaleza hostil
deber&iacute;a tener una partici&oacute;n separada de <tt>/var</tt> (e
incluso una de <tt>/var/log</tt>) para los registros.
<li>Una partici&oacute;n <tt>/home</tt> es una buena idea.  Si
quisi&eacute;ramos instalar una versi&oacute;n nueva del sistema
operativo m&aacute;s tarde, no podr&iacute;amos borrarlo todo y dejar
nuestra partici&oacute;n <tt>/home</tt> intacta.  &iexcl;Hay que
acordarse de guardar una copia de los ficheros de configuraci&oacute;n!
<li>Con una partici&oacute;n aparte para cualquier cosa que pueda
acumular grandes cantidades de archivos que tengan que ser eliminados
puede ser m&aacute;s r&aacute;pido reformatear y regenerar que eliminar.
Se puede ver un ejemplo en la
<a href="upgrade-minifaq.html#1.5">gu&iacute;a de
actualizaci&oacute;n</a> (<tt>/usr/obj</tt>).
<li>Si se quiere recompilar el sistema desde el c&oacute;digo fuente por
cualquier motivo, los fuentes estar&aacute;n en <tt>/usr/src</tt>.  Si
no se va a crear una partici&oacute;n aparte para <tt>/usr/src</tt>, hay
que asegurarse de que <tt>/usr</tt> tenga espacio suficiente.
<li>Algo que se suele olvidar es que <strong>no</strong> es necesario
asignar todo el espacio de un disco cuando se configura el sistema.
Como hoy en d&iacute;a es muy dif&iacute;cil encontrar discos nuevos de
menos de 20GB, puede ser una buena idea dejar una parte del disco sin
asignar; as&iacute;, si una partici&oacute;n sobrepasara su
l&iacute;mite de capacidad, se podr&iacute;a asignar una nueva
partici&oacute;n del espacio libre,
<a href="faq10.html#DupFS">duplicando</a> la partici&oacute;n existente
en la nueva partici&oacute;n, cambiando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fstab&amp;sektion=5">/etc/fstab</a>
para que reflejara la nueva partici&oacute;n, y volvi&eacute;ndola a
montar.
<li>Si creamos las particiones demasiado cerca del tama&ntilde;o
m&iacute;nimo requerido, probablemente nos arrepentiremos m&aacute;s
adelante, cuando tengamos que actualizar el sistema.
<li>Si permitimos que nuestros usuarios tengan acceso de escritura en
<tt>/var/www</tt> (o sea, p&aacute;ginas personales), podemos ponerlo en
una partici&oacute;n separada para poder usar
<a href="faq10.html#Quotas">cuotas</a> a fin de restringir el espacio
que utilicen y, si llegaran a llenar la partici&oacute;n, no
tendr&iacute;a ning&uacute;n impacto sobre otras partes del sistema.
</ul>


<p>
<a name="Multibooting"></a>
<h2>4.8 - Arranque m&uacute;ltiple de OpenBSD/i386</h2>

<p>
El arranque m&uacute;ltiple consiste en tener varios sistemas operativos
en una sola m&aacute;quina, y alguna forma para poder seleccionar el
sistema operativo que queramos arrancar.  &iexcl;<i>No</i> es una tarea
f&aacute;cil!  Si no se sabe bien lo que se est&aacute; haciendo, se
puede llegar a borrar grandes cantidades de datos.  Se recomienda a los
nuevos usuarios de OpenBSD que usen un disco duro en blanco sobre una
m&aacute;quina dedicada s&oacute;lo a este fin, y que practiquen la
configuraci&oacute;n que deseen obtener antes de intentar configurar un
sistema de arranque m&uacute;ltiple sobre una m&aacute;quina productiva.
Se puede encontrar informaci&oacute;n sobre el proceso de arranque de
OpenBSD en el <a href="faq14.html">cap&iacute;tulo 14</a>.

<p>
Cuando se usa un arranque m&uacute;ltiple, la configuraci&oacute;n debe
cumplir con los requerimientos de todos los sistemas operativos.  Una
pregunta frecuente es c&oacute;mo solucionar el
<a href="faq14.html#LargeDrive">l&iacute;mite de arranque de 8G</a> de
OpenBSD.  Aunque existen algunos programas que aseguran que solucionan
los l&iacute;mites de varios sistemas operativos, ninguno de ellos lo
hace con las versiones modernas de OpenBSD.

<p>
He aqu&iacute; varias opciones de arranque m&uacute;ltiple:

<h3>Configurar las particiones activas</h3>
&Eacute;sta es, probablemente, la menos usada y, sin embargo, la mejor
soluci&oacute;n en algunos casos para un arranque m&uacute;ltiple.  Hay
que marcar la partici&oacute;n activa de cualquier sistema operativo que
se est&eacute; usando para que sea la que arranque por
definici&oacute;n.  Casi todos los sistemas operativos tienen un
programa para esto, y el de OpenBSD es
<a href="faq14.html#fdisk">fdisk(8)</a>;  en Windows 9x y DOS, y en
otros sistemas operativos, existen otros programas con este mismo nombre
o parecido.  Esta opci&oacute;n es la deseable para los sistemas que
tarden mucho en apagarse y reiniciarse, ya que podemos irnos mientras
reinicia el sistema que queramos arrancar y encontrarlo ya iniciado
cuando volvamos, sin tener que esperar hasta el momento de seleccionar
el siguiente sistema operativo.

<h3>Arrancar desde un disquete</h3>
En una m&aacute;quina en la que no solemos arrancar OpenBSD con
frecuencia (o en la que no queremos que otros usuarios de la misma
m&aacute;quina se den cuenta de que algo ha cambiado), podemos usar un
disquete de arranque.  Basta con usar uno de los
<a href="#MkFlop">disquetes de instalaci&oacute;n de OpenBSD</a> y crear
un fichero <tt>/etc/boot.conf</tt> (tambi&eacute;n ser&aacute; necesario
crear antes un directorio <tt>/etc</tt> en el disquete) con el siguiente
contenido:

<pre>
     boot hd0a:/bsd
</pre>

<p>
para que el sistema arranque desde el disco duro 0, la partici&oacute;n
'a', y el archivo del n&uacute;cleo <tt>/bsd</tt>.  N&oacute;tese que
tambi&eacute;n es posible arrancar desde otros discos distintos, como
por ejemplo usando la l&iacute;nea &quot;<tt>boot hd2a:/bsd</tt>&quot;
para arrancar desde el tercer disco duro de una m&aacute;quina.  Para
arrancar OpenBSD hay que introducir el disquete y reiniciar;  para
arrancar desde otro sistema, sacar el disquete y reiniciar.

<p>
En este caso, el programa
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&amp;sektion=8&amp;arch=i386">boot(8)</a>
se carga desde el disquete, y busca y lee el fichero
<tt>/etc/boot.conf</tt>.  La l&iacute;nea
&quot;<tt>boot hd0a:/bsd</tt>&quot; da instrucciones as boot(8) sobre
desde d&oacute;nde debe cargar el n&uacute;cleo;  en este caso desde el
primer disco duro que ve la BIOS.  T&eacute;ngase en cuenta que desde el
disquete s&oacute;lo se carga un peque&ntilde;o fichero (<tt>/boot</tt>)
y que el sistema carga el n&uacute;cleo desde el disco duro, por lo que
s&oacute;lo se a&ntilde;aden cinco segundos adicionales al proceso de
arranque.

<h3>Windows NT/2000/XP NTLDR</h3>
Para obtener un arranque m&uacute;ltiple con OpenBSD y Windows
NT/2000/XP, se puede usar NTLDR, el cargador de arranque de NT.  Para un
arranque m&uacute;ltiple con NT, es necesaria una copia del
&laquo;Registro de Arranque de la Partici&oacute;n&raquo; (PBR) de
OpenBSD.  Despu&eacute;s de invocar installboot, se puede copiar a un
fichero usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&amp;sektion=1">dd(1)</a>:

<pre>
	# <strong>dd if=/dev/rsd0a of=openbsd.pbr bs=512 count=1</strong>
</pre>

<p>
A continuaci&oacute;n hay que arrancar NT y copiar <tt>openbsd.pbr</tt>
en C:, y despu&eacute;s  a&ntilde;adir una l&iacute;nea como la
siguiente al final de <tt>C:\BOOT.INI</tt>:

<pre>
	c:\openbsd.pbr=&quot;OpenBSD&quot;
</pre>

<p>
Cuando reiniciemos podremos seleccionar OpenBSD desde el men&uacute; del
gestor de arranque de NT.  Puede verse m&aacute;s informaci&oacute;n
sobre NTLDR en la
<a href="http://www.tburke.net/info/ntldr/ntldr_hacking_guide.htm">
NTLDR Hacking Guide.</a>

<p>
En Windows XP tambi&eacute;n se puede editar la informaci&oacute;n de
arranque usando la interfaz gr&aacute;fica de usuario;  puede verse
m&aacute;s informaci&oacute;n en
<a href="http://support.microsoft.com/default.aspx?scid=kb;EN-US;q289022">
XP Boot.ini HOWTO</a>.

<p>
Nota:  El cargador de arranque de Windows NT s&oacute;lo puede arrancar
sistemas operativos desde el disco duro primario.  No se puede usar para
cargar OpenBSD desde un disco secundario.

<p>
<h3>Otros cargadores de arranque</h3>

<p>
Otros cargadores de arranque que se han utilizado con &eacute;xito en
OpenBSD son:
<a href="http://gag.sourceforge.net/">GAG</a>,
<a href="http://www.prz.tu-berlin.de/~wolf/os-bs.html">OSBS</a>,
<a href="http://www.ranish.com/part/">The Ranish Partition Manager</a>
y <a href="http://www.gnu.org/software/grub/">GRUB</a>. 

<p>
<h3>OpenBSD y Linux (i386)</h3>
<!-- XXXversion -->
<p>
Por favor, lea el documento
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.linux">INSTALL.linux</a>,
que incluye instrucciones a fondo sobre el funcionamiento de OpenBSD con
Linux.


<a name="SendDmesg"></a>
<h2>4.9 - Env&iacute;o de la salida de dmesg a dmesg@openbsd.org
despu&eacute;s de la instalaci&oacute;n</h2>

<p>
Recu&eacute;rdese que es importante que los desarrolladores de OpenBSD
puedan llevar un seguimiento del <i>hardware</i> que funciona, y del que
no funciona bien del todo...

<p>
De <i>/usr/src/etc/root/root.mail</i>:

<pre>
Si desea asegurarse de que OpenBSD funcione mejor en sus
m&aacute;quinas, h&aacute;ganos un favor (&iexcl;una vez que su sistema
de correo est&eacute; configurado!) ejecutando
	dmesg | mail dmesg@openbsd.org
para que podamos ver qu&eacute; tipo de configuraciones tienen los
usuarios.  Esta informaci&oacute;n ser&aacute; usada para mejorar el
soporte de dispositivos en versiones futuras.  Esta informaci&oacute;n
es mucho m&aacute;s &uacute;til con el n&uacute;cleo GENERIC que se
instala con el sistema, no por un n&uacute;cleo personalizado.  La
informaci&oacute;n sobre los dispositivos que obtengamos nos
ayudar&aacute; a corregir estos dispositivos.
</pre>

<p>
Hay que asegurarse de que se env&iacute;a el mensaje por correo
electr&oacute;nico desde una cuenta en la que tambi&eacute;n se pueda
recibir correo, de modo que los desarrolladores puedan contactar con el
remitente en el caso en el que necesitaran que &eacute;ste comprobara o
cambiara algo para el correcto funcionamiento.  No es estrictamente
necesario que se env&iacute;e el mensaje desde la misma m&aacute;quina
en la que se haya instalado OpenBSD;  si esa m&aacute;quina no puede
recibir correo, basta con ejecutar

<pre>
 $ dmesg | mail cuenta_usuario@correo.dom
</pre>

<p>
y enviar ese mensaje a

<pre>
 dmesg@openbsd.org
</pre>

<p>
en donde <tt>cuenta_usuario@correo.dom</tt> es una cuenta normal de
correo electr&oacute;nico (o transferir la salida de dmesg usando
ftp/scp/disquete/paloma-mensajera/...).

<p>
<strong>NOTA</strong>: Por favor, s&oacute;lo debe enviarse el producto
de la orden dmesg del n&uacute;cleo GENERIC.  Los n&uacute;cleos
personalizados en los que se han eliminado dispositivos no son de ayuda.


<p>
<a name="AddFileSet"></a>
<h2>4.10 - C&oacute;mo a&ntilde;adir un archivo de instalaci&oacute;n
despu&eacute;s de haber instalado el sistema</h2>
<!-- XXXversion -->
<p>
&laquo;&iexcl;NO!  Olvid&eacute; a&ntilde;adir uno de los archivos
durante la instalaci&oacute;n!&raquo;

<p>
A veces es realmente necesario un archivo de instalaci&oacute;n como
<tt>comp33.tgz</tt> (o cualquier otro componente del sistema), pero nos
damos cuenta demasiado tarde de que no lo incluimos durante la
instalaci&oacute;n del sistema.  Las buenas noticias son que existen dos
formas de a&ntilde;adir estos archivos f&aacute;cilmente despu&eacute;s
de la instalaci&oacute;n inicial:

<p>
<h3>Usando el proceso de actualizaci&oacute;n</h3>

<p>
Para ello hay que arrancar desde el medio de instalaci&oacute;n
disponible (CD-ROM o disquete) y eligir la opci&oacute;n de
actualizaci&oacute;n, <tt>Upgrade</tt> (en lugar de <tt>Install</tt>,
para instalar).  Cuando aparezca la lista de archivos de
instalaci&oacute;n, hay que marcar los archivos que se olvid&oacute;
instalar la primera vez, seleccionar la fuente de instalaci&oacute;n, y
dejar que el programa de instalaci&oacute;n lo instale.


<p>
<h3>Usando tar(1)</h3>

<p>
Los archivos de instalaci&oacute;n son simples paquetes comprimidos, y
se pueden extraer de forma manual desde el sistema de archivos
ra&iacute;z:

<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  # cd /
  # tar xzvpf comp33.tgz
</pre></td></tr></table>

<p>
NO hay que olvidar usar la opci&oacute;n <tt>p</tt> con la orden
anterior, para que restaure los permisos de los ficheros correctamente.

<p>
Un concepto err&oacute;neo es el de pensar que se puede usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1">pkg_add(1)</a>
para a&ntilde;adir archivos de instalaci&oacute;n del sistema.  Esto no
funciona.  pkg_add(1) es para archivos de programas, no para archivos
gen&eacute;ricos como los de instalaci&oacute;n.


<p>
<a name="bsd.rd"></a>
<h2>4.11 - &iquest;Qu&eacute; es <i>bsd.rd</i>?</h2>

<p>
<b><tt>bsd.rd</tt></b> es un <i>kernel ramdisk</i>, un n&uacute;cleo del
sistema en &laquo;disco de memoria RAM&raquo;.  Este archivo puede ser
de gran utilidad, y muchos de los desarrolladores se aseguran de tenerlo
disponible en sus sistemas de archivos ra&iacute;z en todo momento.

<p>
El t&eacute;rmino &laquo;n&uacute;cleo en disco de memoria&raquo;
describe el sistema de archivos del n&uacute;cleo (en lugar de un
controlador f&iacute;sico), y las utilidades disponibles despu&eacute;s
del arranque de <tt>bsd.rd</tt> que se almacenan en el n&uacute;cleo y
que se ejecutan desde un sistema de archivos basado en RAM.
<tt>bsd.rd</tt> tambi&eacute;n incluye algunas utilidades que permiten
mantener e instalar el sistema.

<p>
En algunas plataformas, <tt>bsd.rd</tt> es la t&eacute;cnica de
instalaci&oacute;n preferida (basta con copiarlo en un sistema de
archivos existente, iniciarlo, y ejecutar la instalaci&oacute;n desde
&eacute;l.  En la mayor&iacute;a de plataformas, si tiene una
versi&oacute;n m&aacute;s antigua de OpenBSD, puede obtener una
versi&oacute;n m&aacute;s reciente de <tt>bsd.rd</tt>, iniciar con
&eacute;sta, e instalar una nueva versi&oacute;n de OpenBSD sin usar
ning&uacute;n tipo de medio de instalaci&oacute;n extra&iacute;ble.

<p>
He aqu&iacute; un ejemplo de arranque de <tt>bsd.rd</tt> en un sistema
i386:

<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>
  Using Drive: 0 Partition: 3
  reading boot.....
  probing pc0 com0 com1 apm mem[639k 255M a20=on]
  disk fd0 hd0
  &gt;&gt; OpenBSD/i386 BOOT 1.29
  boot&gt; <b>boot hd0a:/bsd.rd</b>
<i>. . . arranque normal de instalaci&oacute;n . . .</i>
</pre></td></tr></table>

<p>
Tal y como se indica, pasar&aacute; a la instalaci&oacute;n del
programa, pero tambi&eacute;n puede activar el int&eacute;rprete de
&oacute;rdenes para llevar a cabo tareas de mantenimiento del sistema.

<p>
La regla general para arrancar con <tt>bsd.rd</tt> es cambiar el
n&uacute;cleo de arranque <tt>/bsd</tt> por el de <tt>bsd.rd</tt> por
cualquier medio que use su plataforma.

<a name="InstProb"></a>
<h2>4.12 - Problemas comunes durante la instalaci&oacute;n</h2>

<a name="mkdevhang"></a>
<h3>4.12.1 - La instalaci&oacute;n se bloquea durante MAKEDEV</h3>

<p>
La causa de este problema suele ser una falta de memoria f&iacute;sica
de RAM en el sistema.  V&eacute;ase <a href="#SmallRAM">esta
secci&oacute;n</a>.

<a name="cpq16m"></a>
<h3>4.12.2 - Mi Compaq s&oacute;lo reconoce 16M de RAM</h3>

<p>
<i>Algunos</i> sistemas Compaq tienen un problema a causa del cual el
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&amp;sektion=8&amp;arch=i386">cargador de arranque de segunda fase de OpenBSD</a>
no detecta todo el sistema de memoria de RAM correctamente, y tan
s&oacute;lo detecta y utiliza 16MB.  Esto se puede corregir
creando/modificando el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot.conf&amp;sektion=8&amp;arch=i386"><tt>/etc/boot.conf</tt></a>,
o ejecutando cierta instrucci&oacute;n desde el punto de
inserci&oacute;n <tt>boot&gt;</tt> antes de que se cargue OpenBSD.  Si
la m&aacute;quina tiene 64MB de RAM pero OpenBSD s&oacute;lo detecta los
primeros 16MB, la orden a usar ser&iacute;a:

<pre>
     machine mem +0x3000000@0x1000000
</pre>

<p>
para a&ntilde;adir 48MB (<tt>0x3000000</tt>) a continuaci&oacute;n de
los primeros 16MB (<tt>0x1000000</tt>).  Lo normal en este caso
ser&aacute; ejecutar esta instrucci&oacute;n en el punto de
inserci&oacute;n <tt>boot&gt;</tt> durante la instalaci&oacute;n desde
el disquete o CD-ROM, cargar el sistema, reiniciar, y crear un fichero
<tt>/etc/boot.conf</tt> que contenga dicha instrucci&oacute;n para que
siempre que arranque reconozca toda la memoria de RAM disponible.

<p>
En algunos informes nos han indicado que una actualizaci&oacute;n de la
ROM soluciona este problema en <i>algunos</i> sistemas.

<a name="noboot"></a>
<h3>4.12.3 - Mi i386 no arranca despu&eacute;s de la
instalaci&oacute;n</h3>

<p>
La instalaci&oacute;n parece haber ido bien pero, en el primer arranque,
no se ve ninguna se&ntilde;al que indique que est&eacute; intentando
arrancar.  Existen algunas probables razones comunes para este problema:

<ul>
<li><b>Durante fdisk(8) no se marc&oacute; como activa ninguna
partici&oacute;n.</b>  La soluci&oacute;n para esto es reiniciar la
m&aacute;quina con el disquete o medio de arranque utilizado, y marcar
(<i>&quot;flag&quot;</i>) una partici&oacute;n como &laquo;activa&raquo;
(de arranque).  V&eacute;ase m&aacute;s informaci&oacute;n en la
<a href="faq14.html#fdisk">secci&oacute;n sobre fdisk</a> y en la
p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&amp;sektion=8&amp;arch=i386">fdisk(8)</a>.

<li><b>No se ha incluido ning&uacute;n cargador de arranque
v&aacute;lido en el disco.</b> Si durante la instalaci&oacute;n se ha
contestado &quot;Y&quot; a la pregunta <i>&quot;Use entire disk for
OpenBSD?&quot;</i>, o si se hab&iacute;a usado la opci&oacute;n
<tt>reinit</tt> de fdisk(8), el registro de arranque de OpenBSD se
habr&aacute; instalado en el registro maestro de arranque (MBR) del
disco;  de otra forma, el c&oacute;digo maestro de arranque habr&aacute;
quedado intacto.  Esto supone un problema si no exist&iacute;a
ning&uacute;n otro registro de arranque anterior.  La soluci&oacute;n
est&aacute; en arrancar con el medio de instalaci&oacute;n utilizado,
salir al int&eacute;rprete (<i>shell</i>), e invocar la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&amp;sektion=8&amp;arch=i386">fdisk(8)</a>
y usar la opci&oacute;n <tt>update</tt>.

<li><b>En algunas raras ocasiones, puede haber alg&uacute;n fallo en la
instalaci&oacute;n del cargador de arranque de segunda fase.</b>  La
reinstalaci&oacute;n del cargador de arranque de segunda fase se trata
en <a href="faq14.html">esta secci&oacute;n</a>.

<li><b>Se han mezclado los ficheros <i>a.out</i> y <i>ELF</i> de
arranque del disco y de instalaci&oacute;n.</b>  Despu&eacute;s de la
versi&oacute;n final 3.3, OpenBSD/i386 ha cambiado del viejo formato
binario <i>a.out</i> al nuevo <i>ELF</i>.  El
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&amp;sektion=8&amp;arch=i386">cargador de arranque</a> de las
<a href="faq5.html#Flavors">versiones de prueba de (<i>snapshots</i>) de
3.3-<i>current</i></a> no pueden arrancar un n&uacute;cleo de la
versi&oacute;n final 3.3 (<i>3.3-release</i>).  Hay que usar un disco de
arranque de la misma versi&oacute;n que se quiera instalar.  Si no se
hace como se recomienda, se mostrar&aacute; un mensaje de error como
&quot;<tt>failure(79)</tt> y/o &quot;<tt>Inappropriate file type or
format</tt>&quot;.

<li><b>Se han ignorado todos los <a href="#Disks">avisos</a> y
<a href="#SpaceNeeded">explicaciones</a> sobre el
<a href="faq14.html#LargeDrive">l&iacute;mite de arranque de 8G</a>.</b>
Como resultado de esto, el sistema se colgar&aacute; nada m&aacute;s
empezar el proceso de arranque, en ocasiones mostrando el mensaje
&quot;<tt>Bad magic</tt>&quot;.
</ul>

<a name="sshhang"></a>
<h3>4.12.4 - La m&aacute;quina arranca, pero se bloquea durante el
proceso de ssh-keygen</h3>

<p>
En m&aacute;quinas viejas o lentas es muy posible que el funcionamiento
de la m&aacute;quina sea normal, simplemente que tarde mucho en realizar
el proceso inicial de generaci&oacute;n de claves de ssh.  Una
SparcStation2 &oacute; una Macintosh Quadra pueden tardar 45 minutos o
m&aacute;s en completar los tres pasos de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh-keygen&amp;sektion=1">ssh-keygen(1)</a>,
y algunas m&aacute;quinas pueden llegar a tardar mucho m&aacute;s.  Hay
que dejar que acaben el proceso, ya que &eacute;ste s&oacute;lo ocurre
una vez por instalaci&oacute;n.


<a name="noftplist"></a>
<h3>4.12.5 - Durante la instalaci&oacute;n, veo el mensaje
&quot;Failed to change directory&quot;</h3>

<p>
Al realizar una instalaci&oacute;n por FTP de una
<a href="upgrade-minifaq.html#1.1">versi&oacute;n preliminar</a>
(<i>snapshot</i>) durante la fase <i>-beta</i> del
<a href="faq5.html#Flavors">ciclo de desarrollo de OpenBSD</a>,  es
posible ver lo siguiente:

<table border="0" width="650"><tr><td nowrap bgcolor="#eeeeee"><pre>

  Do you want to see a list of potential FTP servers?  [y] <i>INTRO</i>
  Getting the list from 192.128.5.191 (ftp.openbsd.org)... FAILED
  Failed to change directory.
  Server IP address or hostname? 
</pre></td></tr></table>

<p>
No se trata de ning&uacute;n error, es normal durante la fase anterior
al lanzamiento de la versi&oacute;n final.  El programa de
instalaci&oacute;n busca la lista de las r&eacute;plicas del servidor
primario de FTP en un directorio que no estar&aacute; disponible hasta
la <a href="faq1.html#Next">fecha de lanzamiento</a>.

<p>
Hay que usar la <a href="../../es/ftp.html">lista de r&eacute;plicas de
FTP</a> para averiguar la r&eacute;plica de FTP que m&aacute;s convenga,
e introducir su nombre a mano cuando lo pida.

<p>
<b>Nota:  Si se est&aacute; instalando una versi&oacute;n final,
<i>-release</i>, o desde el CD-ROM, no debe verse este mensaje.</b>


<a name="site"></a>
<h2>4.13 - Personalizaci&oacute;n del proceso de instalaci&oacute;n</h2>
<!-- XXXversion -->
<h3>El fichero <tt>siteXX.tgz</tt></h3>

<p>
Los guiones (<i>scripts</i>) de instalaci&oacute;n y
actualizaci&oacute;n de OpenBSD permiten seleccionar un archivo creado
por el usuario llamado <tt>siteXX.tgz</tt>, en donde <tt>XX</tt> debe
sustituirse por el n&uacute;mero de versi&oacute;n del sistema (v.g.
33).  El archivo <tt>siteXX.tgz</tt> es, como los otros
<a href="#FilesNeeded">archivos</a>, un archivo comprimido con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gzip&amp;sektion=1">
gzip(1)</a> y empaquetado con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=tar&amp;sektion=1">
tar(1)</a> en el directorio '/', y se desempaqueta como cualquier otro
archivo mediante las opciones <tt>xzpf</tt>.  Este archivo se
instalar&aacute; el &uacute;ltimo, despu&eacute;s de haber instalado el
resto de archivos.

<p>
Este archivo permite al usuario a&ntilde;adir y/o anular ficheros que
hayan sido instalados con los archivos &laquo;normales&raquo;, y
personalizar de este modo la instalaci&oacute;n o la
actualizaci&oacute;n.

<p>
Algunos ejemplos de la utilizaci&oacute;n de un archivo
<tt>siteXX.tgz</tt>:

<ul>
<li>Crear un archivo siteXX.tgz que contenga todos los cambios que
hayamos realizado a los ficheros del sistema desde que instalamos por
primera vez OpenBSD.  A continuaci&oacute;n, si tenemos que volver a
crear el sistema, seleccionaremos <tt>siteXX.tgz</tt> durante la
reinstalaci&oacute;n y todos nuestros cambios ser&aacute;n replicados en
el nuevo sistema.

<li>Crear una serie de directorios espec&iacute;ficos de varias
m&aacute;quinas que contengan cada uno un archivo <tt>siteXX.tgz</tt>
que, a su vez, debe contener los ficheros espec&iacute;ficos de esas
m&aacute;quinas.  La instalaci&oacute;n de m&aacute;quinas de una
categor&iacute;a particular (por ejemplo m&aacute;quinas con tarjetas de
gr&aacute;ficos diferentes) se puede completar seleccionando el archivo
<tt>siteXX.tgz</tt> correspondiente.

<li>Poner los ficheros que se suelan personalizar de forma rutinaria en
un mismo archivo <tt>siteXX.tgz</tt>.  Por ejemplo, los ficheros de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&amp;sektion=8"><tt>/etc/skel</tt></a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf.conf&amp;sektion=5"><tt>/etc/pf.conf</tt></a>, 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=httpd&amp;sektion=8"
><tt>/var/www/conf/httpd.conf</tt></a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.conf&amp;sektion=5"><tt>/etc/rc.conf</tt></a>,
etc&eacute;tera.
</ul>

<h3>Los guiones de ejecuci&oacute;n
<tt>install.site</tt>/<tt>upgrade.site</tt></h3>

<p>
Como &uacute;ltimo paso del proceso de instalaci&oacute;n o de
actualizaci&oacute;n, los guiones de
instalaci&oacute;n/actualizaci&oacute;n buscar&aacute;n
<tt>install.site</tt> o <tt>upgrade.site</tt>, seg&uacute;n sea
apropiado para el proceso que estemos llevando a cabo, en el directorio
ra&iacute;z del nuevo sistema que hayamos instalado o actualizado, y
luego ejecutar&aacute;n el gui&oacute;n correspondiente en un entorno
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=chroot&amp;sektion=8">chroot</a>.
Recu&eacute;rdese que la actualizaci&oacute;n se realiza desde un
sistema de archivos que ya ha sido iniciado previamente, por lo que el
sistema de archivos en cuesti&oacute;n se encontrar&aacute; montado en
<tt>/mnt</tt>.  Sin embargo podemos escribir el gui&oacute;n como si se
estuviera ejecutando en el sistema de archivos de <i>root</i> de nuestro
sistema.  Como este gui&oacute;n se ejecuta despu&eacute;s de haber
instalado todos los ficheros, el sistema ser&aacute; casi totalmente
funcional (aunque en modo mono-usuario) cuando se ejecute nuestro
gui&oacute;n.

<p>
N&oacute;tese que el gui&oacute;n <tt>install.site</tt> debe estar en un
archivo <tt>siteXX.tgz</tt>, mientras que el gui&oacute;n
<tt>upgrade.site</tt> puede estar en el directorio <i>root</i> antes de
la actualizaci&oacute;n, o puede estar en un archivo
<tt>siteXX.tgz</tt>.

<p>
Estos guiones de instalaci&oacute;n y actualizaci&oacute;n se pueden
usar para llevar a cabo cualquier cosa que sea posible en un
gui&oacute;n de ejecuci&oacute;n:

<ul>
<li>Eliminar ficheros que se hayan instalado o actualizado y que no
queramos que est&eacute;n presentes en el sistema.
<li>Eliminar, actualizar o instalar los
<a href="faq8.html#Packages">paquetes</a> que queramos tener instalados
en el sistema.
<li>Realizar un <a href="faq14.html#Backup">archivo de
respaldo/seguridad inmediato</a> del nuevo sistema antes de exponerlo
ante el resto del mundo.
</ul>

<p>
La combinaci&oacute;n del archivo <tt>siteXX.tgz</tt> y de los ficheros
<tt>install.site</tt> y/o <tt>upgrade.site</tt> tiene como fin el
ofrecer a los usuarios una capacidad de personalizaci&oacute;n amplia
sin que tengan que componer sus propios archivos de instalaci&oacute;n
personalizados.

<a name="Multiple"></a>
<h2>4.14 - &iquest;C&oacute;mo se pueden instalar varios sistemas
parecidos?</h2>

<p>
He aqu&iacute; algunas herramientas para poder instalar varios sistemas
OpenBSD parecidos.

<h3>Los archivos <tt>siteXX.tgz</tt> e
<tt>install/upgrade.site</tt></h3>
<p>
V&eacute;ase la <a href="#site">secci&oacute;n anterior</a>.

<h3>Restaurar con dump(8)</h3>

<p>
En muchas plataformas, el medio de arranque incluye el programa
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=restore&amp;sektion=8">restore(8)</a>,
que se puede usar para restaurar una copia de seguridad mediante
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dump&amp;sektion=8">
dump(8)</a>.  De forma parecida, se puede arrancar desde un
<a href="#MkFlop">disquete</a>, <a href="../../es/orders.html">CD</a>, o
desde un fichero <a href="#bsd.rd">bsd.rd</a>, y a continuaci&oacute;n
usar <a href="faq14.html#fdisk">fdisk</a>,
<a href="faq14.html#disklabel">disklabel</a>, y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=restore&amp;sektion=8">restore</a>
para obtener la configuraci&oacute;n deseada desde una cinta u otro
medio de instalaci&oacute;n, e instalar los
<a href="faq14.html#InstBoot">bloques de arranque</a>.  V&eacute;anse
m&aacute;s detalles 
<a href="faq14.html#Backup">aqu&iacute;</a>.

<h3>Imagen de disco</h3>

<p>
Desgraciadamente no existen programas de creaci&oacute;n de
im&aacute;genes de disco que tengan soporte para el sistema de archivos
FFS y que puedan crear una imagen que contenga solamente el espacio del
fichero activo.  La mayor&iacute;a de las soluciones para crear
im&aacute;genes de disco tratan las particiones de OpenBSD como
particiones gen&eacute;ricas, y pueden crear una imagen del disco
completo.  Esto suele ser suficiente para conseguir nuestro objetivo,
pero se suelen perder cantidades enormes de espacio (una
partici&oacute;n <tt>/home</tt> de 10GB requiere 10GB de espacio en la
imagen, aunque no haya ning&uacute;n fichero en la partici&oacute;n).
Aunque podemos instalar una imagen del disco en un disco m&aacute;s
grande, no podremos usar el espacio adicional directamente, y no
podremos instalar una imagen en un disco m&aacute;s peque&ntilde;o.

<p>
Si alguien encuentra esta situaci&oacute;n aceptable, la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&amp;sektion=1">
dd</a> servir&aacute; para sus prop&oacute;sitos, permiti&eacute;ndole
copiar un disco en otro, sector por sector.  De esta forma se
obtendr&aacute; la misma funcionalidad que si se usara un programa
comercial, aunque sin el coste a&ntilde;adido.


<a name="getdmesg"></a>
<h2>4.15 - &iquest;C&oacute;mo se puede obtener una salida de dmesg(8)
para informar sobre un problema de instalaci&oacute;n?</h2>

<p>
Cuando se env&iacute;a un <a href="../../es/report.html">informe sobre
un problema</a>, es importante incluir la salida completa de la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>.
Pero en muchas ocasiones, cuando necesitamos hacer esto, el problema
est&aacute; en que el sistema no funciona correctamente o simplemente no
se instala correctamente, por lo que no disponemos de un disco, red u
otro recurso necesario para obtener el mensaje de dmesg(8) y enviarlo a
la <a href="../../es/mail.html">lista de correo</a> apropiada.  Pero
existen otras formas de hacerlo:

<ul>
<li><b>Disquete:</b>  Los discos de arranque y el CD-ROM tienen
herramientas suficientes para permitirnos grabar una salida de dmesg(8)
a un disquete de MSDOS, para luego leerlo en otra m&aacute;quina.  Para
esto hay que introducir un disquete formateado para MSDOS en la
disquetera y ejecutar las siguientes &oacute;rdenes:

<pre>
     mount -t msdos /dev/fd0a /mnt
     dmesg &gt;/mnt/dmesg.txt
     umount /mnt
</pre>

<p>
Si disponemos de otro sistema OpenBSD, tambi&eacute;n podemos usar un
disquete formateado para OpenBSD.  Con frecuencia, el disquete de
arranque tiene suficiente espacio libre para copiar en &eacute;l el
mensaje de dmesg(8).  Si &eacute;ste es el caso, se pueden usar las
mismas &oacute;rdenes anteriores excluyendo la parte de &quot;<tt>-t
msdos</tt>&quot;.

<p>
<li><b>Consola serie:</b>  V&eacute;ase la
secci&oacute;n sobre la <a href="faq7.html#SerCon">configuraci&oacute;n
de una consola serie</a> y luego capturaremos la salida de la orden en
un fichero.

<p>
<li><b>FTP:</b>  En algunos casos es posible usar el cliente de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp&amp;sektion=1">
ftp(1)</a> incluido en el disco de arranque o CD-ROM para enviar la
salida de dmesg(8) a un servidor local de FTP, desde donde se
podr&aacute; sacar m&aacute;s tarde para enviarla.
</ul>

<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq3.html">[Secci&oacute;n 3 - C&oacute;mo obtener OpenBSD]</a>
<a href="faq5.html">[Secci&oacute;n 5 - C&oacute;mo compilar OpenBSD]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq4.html,v 1.145 ]<br>
$Translation: faq4.html,v 1.75 2003/10/07 19:41:19 horacio Exp $<br>
$OpenBSD: faq4.html,v 1.64 2003/10/07 20:06:45 horacio Exp $
</small>
</body>
</html>
