<html>
<head>
<title>4.0 - Gu&iacute;a de instalaci&oacute;n</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2000 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238E">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">4.0 - Gu&iacute;a de
instalaci&oacute;n</font><hr></h2>
</p>

<p>
<ul><h3>Tabla de contenidos</h3>
<li><a href="faq4.html#4.1">4.1 - R&aacute;pida introducci&oacute;n al
    procedimiento de instalaci&oacute;n de OpenBSD.</a>
<li><a href="faq4.html#4.2">4.2 - &iquest;Qu&eacute; ficheros son
    necesarios para la instalaci&oacute;n?</a>
<li><a href="faq4.html#4.3">4.3 - &iquest;Cu&aacute;nto espacio necesito
    para instalar OpenBSD?</a>
<li><a href="faq4.html#4.4">4.4 - Multiarranque de OpenBSD.</a>
<li><a href="faq4.html#4.5">4.5 - Enviar el dmesg a dmesg@openbsd.org
    despu&eacute;s de la instalaci&oacute;n.</a>
<li><a href="install-i386.html#8meg">La instalaci&oacute;n se para en
    MAKEDEV en mi i386 con 8MB de RAM.</a>
</ul>
</p>

<hr>

<p>
<a name="4.1"></a>
<h2>4.1 - Introducción r&aacute;pida a la instalaci&oacute;n de
OpenBSD</h2>
</p>

<p>
OpenBSD ofrece m&uacute;ltiples m&eacute;todos de instalar un sistema
nuevo de OpenBSD en m&uacute;ltiples arquitecturas, lo que facilita que
casi todos los usuarios puedan instalar un sistema OpenBSD en cualquier
situaci&oacute;n.  Los diferentes m&eacute;todos de instalar un sistema
OpenBSD son los siguientes:
</p>

<ul>
<li><strong>CD-ROM</strong> - Este m&eacute;todo requiere que se
    disponga de un CD de OpenBSD, lo cual se puede hacer visitando 
    <a href="../../es/orders.html">http://www.openbsd.org/es/orders.html</a>.
    &Eacute;sta es, probablemente, la manera m&aacute;s f&aacute;cil de
    instalar OpenBSD.
<li><strong>FTP</strong> - Esta opci&oacute;n requiere un conocimiento
    previo de IP, Netmask, Gateway, etc.  Si tiene estos conocimientos,
    entonces dispone de una gran lista de servidores r&eacute;plicas de
    ftp en todo el mundo que hacen que &eacute;sta sea una forma
    r&aacute;pida de obtener OpenBSD.
<li><strong>DHCP</strong> - Esta opci&oacute;n es igual que la de
    <strong>FTP</strong>, con la diferencia de que su IP, Netmask,
    Gateway y Nameservers se extraen del servidor DHCP.
<li><strong>Local Filesystem</strong> - Esta opci&oacute;n le permite
    instalar desde ficheros ya existentes en un sistema de archivos.
    En el disco de instalaci&oacute;n viene incluido el soporte para
    DOS, EXT2FS y FFS.
<li><strong>NFS</strong> - Esta &uacute;ltima opci&oacute;n le permite
    instalar desde ficheros ubicados en un servidor de nfs.  Para
    m&aacute;s informaci&oacute;n sobre esta opci&oacute;n, lea la
    p&aacute;gina de manual
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_nfs&sektion=8&format=html">mount_nfs(8)</a>.
</ul>

<p>
Todos estos m&eacute;todos de instalaci&oacute;n se encuentran
disponibles en UN disquete.  Estos disquetes se pueden obtener
directamente desde cualquiera de las r&eacute;plicas de ftp (puede ver
una lista de r&eacute;plicas en 
<a href="../../es/ftp.html">http://www.openbsd.org/es/ftp.html</a>).
Cada arquitectura tiene su propio disco;  aseg&uacute;rese de conseguir
la imagen correspondiente para la arquitectura deseada.  En el 
<a href="faq1.html#1.2">cap&iacute;tulo 1 de las Preguntas Frecuentes</a>
puede encontrar una lista de todas las arquitecturas para las que
existe soporte.
</p>

<p>
Las siguientes son unas gu&iacute;as muy completas, totalmente
detalladas, del proceso de instalaci&oacute;n para las arquitecturas
i386 y sparc.  No se olvide de leer tambi&eacute;n los documentos
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.7/i386/INSTALL.i386">INSTALL.i386</a> y
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.7/sparc/INSTALL.sparc">INSTALL.sparc</a>.

<ul>
<li><a href="install-i386.html">install-i386.html</a> para la
arquitectura <strong>i386</strong>.
<li><a href="install-sparc.html">install-sparc.html</a> para la
arquitectura <strong>sparc</strong>.
</ul>

Quienes usen otras arquitecturas deben referirse al documento
INSTALL.<i>&lt;arq&gt;</i> (substituya <i>&lt;arq&gt;</i> por la
arquitectura correspondiente) incluido en la distribuci&oacute;n de
OpenBSD para &eacute;sta, as&iacute; como esta
<a href="../log26.txt">gu&iacute;a gen&eacute;rica de
instalaci&oacute;n.</a>

<h3>Notas para la arquitectura Alpha</h3>

<p>
Su m&aacute;quina alpha debe usar SRM firmware, y no ARC.  En la
arquitectura alpha se puede instalar arrancando desde el CDROM usando
el CD n&uacute;mero 2.  Se puede hacer usando una orden como

<ul>
<strong>boot -fi 2.6/alpha/bsd.rd dkaX</strong>
</ul>

Use <strong>show device</strong> para encontrar el identificador del
dispositivo de su CDROM.  Si no puede arrancar desde el CD, puede usar
el disco de arranque que encontrar&aacute; en
<i>CD2:2.6/alpha/floppy26.fs</i>, generando una imagen de &eacute;ste
del modo que se detalla en el documento para la arquitectura i386.
Despu&eacute;s siga los pasos de la
<a href="../../faq/log26.txt">gu&iacute;a de instalaci&oacute;n
gen&eacute;rica</a>.
</p>

<p>
<a name="4.2"></a>
<h2>4.2 - &iquest;Qu&eacute; ficheros son necesarios para la
instalaci&oacute;n?</h2>
</p>

<p>
Existen muchos paquetes que contienen binarios de OpenBSD pero,
&iquest;cu&aacute;les son los necesarios para que funcione el sistema?
He aqu&iacute; una vista r&aacute;pida de cada paquete:
</p>

<p>
<ul>
   <li><strong>base26.tar.gz</strong> - Contiene la base del sistema de
       OpenBSD - <b>Requerido</b></li>
   <li><strong>etc26.tar.gz</strong> - Contiene todos los ficheros de
       <i>/etc</i> - <b>Requerido</b></li>
   <li><strong>comp26.tar.gz</strong> - Contiene el compilador y sus
       herramientas y bibliotecas - <b>Recomendado</b></li>
   <li><strong>man26.tar.gz</strong> - Contiene las p&aacute;ginas de
       manual - <b>Recomendado</b></li>
   <li><strong>misc26.tar.gz</strong> - Contiene informaci&oacute;n
       miscel&aacute;nea y documentos sobre configuraci&oacute;n.</li>
   <li><strong>game26.tar.gz</strong> - Contiene juegos para OpenBSD.</li>
   <li><strong>xbase26.tar.gz</strong> - Contiene la base para la
       instalaci&oacute;n de X11.</li>
   <li><strong>xfont26.tar.gz</strong> - Contiene el servidor de fuentes
       para X11 y fuentes.</li>
   <li><strong>xlink26.tar.gz</strong> - Contiene el enlace al grupo de 
       servidores de X.</li>
   <li><strong>xserv26.tar.gz</strong> - Contiene los servidores de X
       para X11.</li>
   <li><strong>xshare26.tar.gz</strong> - Contiene p&aacute;ginas de
       manual, configuraciones para la internacionalizaci&oacute;n,
       ficheros include, etc...  para X.</li>
   <li><strong>bsd</strong> - N&uacute;cleo del sistema.
       <b>Requerido</b></li>
</ul>
</p>

<p>
<a name="4.3"></a>
<h2> 4.3 - &iquest;Cu&aacute;nto espacio necesito para instalar
OpenBSD?</h2>
</p>

<p>
Se sugiere usar los siguientes tama&ntilde;os de espacios para una
instalaci&oacute;n completa del sistema.  Las cifras incluyen el
suficiente espacio extra como para una instalaci&oacute;n t&iacute;pica
de un sistema en su casa conectado a internet.

<ul>
<li>Para un sistema multiusuario es recomendable triplicar estos
    valores.
<li>Si va a instalar una cantidad significativa de software de terceras
    partes, haga una partici&oacute;n <i>/usr</i> grande.
    &iexcl;<strong>Como m&iacute;nimo</strong> triplique estos valores!
<li>Para un sistema que vaya a gestionar mucho correo
    electr&oacute;nico o p&aacute;ginas web (almacenados
    respectivamente en <i>/var/mail</i> y <i>/var/www</i>), la
    partici&oacute;n <i>/var</i> deber&aacute; ser bastante m&aacute;s
    grande.
<li>Para un sistema multiusuario que genere muchos mensajes de log, la
    partici&oacute;n <i>/var</i> a&uacute;n tendr&aacute; que ser mucho
    m&aacute;s grande (<i>/var/log</i>).
</ul>

Mientras lea esto recuerde que tanto <i>/usr</i> como <i>/usr/X11R6</i>
son, por regla general, parte del mismo sistema de archivos;  o sea,
parte de <i>/usr</i>, ya que no hay ninguna ventaja importante en
mantenerlos como sistemas de archivos separados.

<ul>
<strong>
<pre>
SYSTEM          /       /usr    /var    /usr/X11R6
alpha           56M     540M    27M     161M
amiga           45M     399M    24M      36M
hp300           31M     234M    24M      47M
i386            35M     229M    24M      72M
mac68k          29M     232M    24M      36M
mvme68k         29M     232M    24M       -  (no Xserver)
pmax            50M     355M    24M      60M
sparc           40M     259M    24M      49M
</pre>
</strong>
</ul>

<p>
Cuando se encuentre en el editor del disco
(&quot;<i>disklabel</i>&quot;), puede escoger que su sistema tenga
s&oacute;lo 'a' (sistema de archivos principal) y 'b' (memoria de
intercambio, <i>swap</i>).  El sistema de archivos 'a' que configure en
<i>disklabel</i> ser&aacute; su partici&oacute;n ra&iacute;z
(<i>root</i>), que se debe componer de la suma de los tres valores
principales anteriores (<i>/</i>, <i>/usr</i>, y <i>/var</i>),
m&aacute;s algo de espacio para <i>/tmp</i>.  La partici&oacute;n 'b'
ser&aacute; la partici&oacute;n <i>swap</i> del sistema.  Para esta
partici&oacute;n recomendamos un m&iacute;nimo de 32MB, pero si dispone
de suficiente espacio en el disco use un m&iacute;nimo de 64MB.  Si
tiene mucho espacio de sobre en el disco, lo mejor es que la haga de
256MB, o incluso de 512MB.

<p>
Existen cuatro razones principales para usar sistemas de archivos
separados en lugar de meterlo todo en dos sistemas de archivos:

<ul>
<li><b>Seguridad</b>: puede marcar algunos sistemas de archivos como
    'nosuid', 'nodev', 'noexec', 'readonly', etc...
<li><b>Estabilidad</b>: un usuario o un programa con un comportamiento
    incorrecto, puede llenar un sistema de archivos de basura si tiene
    permiso de escritura sobre &eacute;ste.  De este modo, los
    programas m&aacute;s cr&iacute;ticos, que por supuesto
    funcionar&aacute;n en un sistema de archivos diferente, no
    ser&aacute;n interrumpidos.
<li><b>Velocidad</b>: un sistema de archivos sobre el que se escriba
    con frecuencia puede acabar algo fragmentado.  Por suerte, el
    sistema de archivos de tipo ffs, que es el que usa OpenBSD, no es
    propenso a la fragmentaci&oacute;n.
<li><b>Integridad</b>: si un sistema de archivos se corrompiera por
    cualquier motivo, el resto de sistemas quedar&iacute;an intactos.
</ul>

<p>
<a name="4.4"></a>
<h2>4.4 - Multiarranque de OpenBSD (i386, alpha)</h2>
</p>

<p>
<strong>OpenBSD y NT</strong>
</p>

<p>
Para tener OpenBSD y NT en una misma m&aacute;quina puede usar el
gestor de arranque del &uacute;ltimo, NTloader.  Para el multiarranque
con NT necesita una copia de su &laquo;registro de la partici&oacute;n
de arranque&raquo; (pbr, <i>partition boot record</i> de OpenBSD.
Despu&eacute;s de ejecutar installboot puede copiarlo del siguiente
modo:
</p>

<ul>
<pre>
	# <strong>dd if=/dev/rsd0c of=openbsd.pbr bs=512 count=1</strong>
</pre>
</ul>

<p>
A continuaci&oacute;n arranque NT y copie openbsd.pbr en c:.
A&ntilde;ada una l&iacute;nea como la siguiente al final de
c:\boot.ini:
</p>

<ul>
<pre>
	c:\openbsd.pbr=&quot;OpenBSD&quot;
</pre>
</ul>

<p>
Cuando reinicie podr&aacute; seleccionar OpenBSD desde el men&uacute;
del gestor de arranque de NT.  Puede encontrar m&aacute;s
informaci&oacute;n sobre NTloader en 
<a href="http://www.dorsai.org/~dcl/publications/NTLDR_Hacking/">NTLDR
Hacking Guide.</a>
</p>

<p>
<strong>OpenBSD y Windows o DOS (i386)</strong>
</p>

<p>
Para arrancar OpenBSD junto con Windows 3.1, Windows95, o DOS, debe
usar un gestor de arranque en el sistema que pueda manejar OpenBSD,
Windows y DOS.  Algunos de estos gestores de arranque son
<a href="http://www.freebird.org/sw-map/bootmanager.html">osbs20b8.zip</a> o
<a href="http://www.users.intercom.com/~ranish/part/">The Ranish
Partition Manager</a>.
Estos dos pueden arrancar las particiones de OpenBSD.
</p>

<p>
<strong>OpenBSD y Linux (i386)</strong>
</p>

<p>
Por favor, lea <a href="INSTALL.linux">INSTALL.linux</a> que incluye
instrucciones a fondo sobre el funcionamiento de OpenBSD con Linux.
</p>

<p>
<a name="4.5"></a>
<h2>4.5 - Enviar el dmesg a dmesg@openbsd.org despu&eacute;s de la
Instalaci&oacute;n</h2>
</p>

<p>
Recuerde que es importante para los desarrolladores de OpenBSD poder
llevar un seguimiento del <i>hardware</i> que funciona, y del que no
funciona del todo bien...
</p>

<p>
De <i>/usr/src/etc/root/root.mail</i>:

<pre>
Si desean asegurarse de que OpenBSD funcione mejor en sus
m&aacute;quinas, h&aacute;ganos un favor (&iexcl;una vez que su sistema
de correo est&eacute; configurado!) ejecutando
	dmesg | mail dmesg@openbsd.org
para que podamos ver qu&eacute; tipo de configuraciones tienen los
usuarios.  Esta informaci&oacute;n ser&aacute; usada para mejorar el
soporte de dispositivos en versiones futuras.  Esta informaci&oacute;n
es mucho m&aacute;s &uacute;til con el n&uacute;cleo GENERIC que se
instala con el sistema, no por un n&uacute;cleo personalizado.  La
informaci&oacute;n sobre los dispositivos que obtengamos nos
ayudar&aacute; a corregir estos dispositivos.
</pre>

Vea tambi&eacute;n la <a href="faq14.html#14.7">secci&oacute;n 14.7</a>
</p>

<p>
Aseg&uacute;rese de que env&iacute;a el mensaje por correo
electr&oacute;nico desde una cuenta en la que tambi&eacute;n pueda
recibir correo, de modo que los desarrolladores puedan contactar con Vd
en el caso que necesitaran que comprobara o cambiara algo para el
funcionamiento correcto.  No es estrictamente necesario que
env&iacute;e el mensaje desde la misma m&aacute;quina en la que haya
instalado OpenBSD;  si esa m&aacute;quina no puede recibir correo,
simplemente haga

<pre>
 dmesg | mail su-cuenta@sucorreo.dom
</pre>

y env&iacute;e ese mensaje a

<pre>
 dmesg@openbsd.org
</pre>

en donde <tt>su-cuenta@sucorreo.dom</tt> es su cuenta de correo normal
(o transfiera la salida de dmesg usando
ftp/scp/disquete/paloma-mensajera/...).
</p>

<p>
<strong>NOTA</strong>: Por favor, env&iacute;e s&oacute;lo el dmesg del
n&uacute;cleo GENERIC.  Los n&uacute;cleos personalizados en los que se
han eliminado dispositivos no son de ayuda.
</p>

<p>
<font color="#0000e0">
<a href="index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq3.html">[Secci&oacute;n 3.0 - Obtener OpenBSD]</a>
<a href="faq5.html">[Secci&oacute;n 5.0 - Configuraci&oacute;n de OpenBSD]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq4.html,v 1.73 2000/09/14 19:19:24 ericj Exp ]<br>
$Translation: faq4.html,v 1.13 2000/11/18 07:43:39 horacio Exp $<br>
$OpenBSD: faq4.html,v 1.8 2000/11/22 18:04:45 jufi Exp $
</small>
</p>
</body>
</html>
