<html>
<head>
<title>5.0 - Configuraci&oacute;n del n&uacute;cleo</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">5.0 - Configuraci&oacute;n del n&uacute;cleo
del sistema (<em>kernel</em>)</font><hr></h2>
</p>

<p>
<ul><h3>Tabla de contenidos</h3>
<li><a href="#Why">5.1 - &iquest;Para qu&eacute; sirve un
n&uacute;cleo personalizado?</a></li>
<li><a href="#Options">5.2 - Opciones de configuraci&oacute;n
del n&uacute;cleo</a></li>
<li><a href="#Building">5.3 - Compilaci&oacute;n del
n&uacute;cleo</a></li>
<li><a href="#BootConfig">5.4 - Configuraci&oacute;n para el
arranque</a></li>
<li><a href="#VerboseBoot">5.5 - Obtenci&oacute;n de una
salida con m&aacute;s informaci&oacute;n durante el
arranque</a></li>
<li><a href="#config">5.6 - Uso de config(8) para cambiar el
binario del n&uacute;cleo</a>
</ul>
</p>

<hr>
<br>

<p>
<a name="Why"></a>
<a name="5.1"></a>
<h2>5.1 - &iquest;Para qu&eacute; sirve un n&uacute;cleo
personalizado?</h2>
</p>

<p>
Existen varias razones, aunque esta pr&aacute;ctica, por regla general,
est&aacute; dirigida hacia usuarios expertos con un conocimiento amplio
y profundo del sistema.

<ul>
   <li>Si su m&aacute;quina dispone de una peque&ntilde;a cantidad de
   memoria de RAM, y quiere preservar tanta como le sea posible eliminando
   dispositivos de control que no le sean de ninguna utilidad.
   <li>Si quiere eliminar opciones que vengan activadas de modo predeterminado
   o a&ntilde;adir otras opciones que no est&eacute;n activadas.
   <li>Si desea activar opciones experimentales 
</ul>
</p>

<p>
En la mayor&iacute;a de los casos NO es necesario compilar un nuevo
n&uacute;cleo.  El n&uacute;cleo GENERIC de la instalaci&oacute;n
predeterminada es todo lo que necesitar&aacute;.  De hecho, existen
varias razones para no crear un nuevo n&uacute;cleo.  La prinicipal
raz&oacute;n es la facilidad para aplicar cambios que parezcan
l&oacute;gicos pero que no funcionen, a la configuraci&oacute;n del
n&uacute;cleo.  Si algo no funciona correctamente, por favor pruebe con
el n&uacute;cleo GENERIC antes de enviar un informe sobre el error.
</p>

<p>
<a name="Options"></a>
<a name="5.2"></a>
<h2>5.2 - Opciones de configuraci&oacute;n del
n&uacute;cleo</h2>
</p>

<p>
Las opciones de configuraci&oacute;n del n&uacute;cleo son opciones que
pueden ser a&ntilde;adidas a la configuraci&oacute;n del n&uacute;cleo
y que implementan varias funcionalidades en &eacute;ste.  Estas opciones
le permiten tener el tipo de soporte exacto que desea, sin que tenga que
mantener el soporte para dispositivos que no son necesarios o de los
que no dispone.  Existe una gran cantidad de opciones que le permiten
personalizar su n&uacute;cleo.  En este documento veremos s&oacute;lo
unas cuantas, aqu&eacute;llas que se usan con m&aacute;s frecuencia.
Si quiere ver una lista m&aacute;s completa de opciones, mire la
p&aacute;gina de manual
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&apropos=0&sektion=4&format=html">options(4)</a>.
Tambi&eacute;n puede verificar los ficheros de muestras de
configuraci&oacute;n que est&eacute;n disponibles para su arquitectura.
</p>

<p>
La compatibilidad entre distintas opciones no ha sido verificada para
todas las opciones del n&uacute;cleo.  &iexcl;No a&ntilde;ada una
opci&oacute;n en su n&uacute;cleo a menos que tenga una buena
raz&oacute;n para hacerlo!  La configuraci&oacute;n del n&uacute;cleo
que m&aacute;s ha sido verificada es la del n&uacute;cleo GENERIC.
Generalmente este n&uacute;cleo es una combinaci&oacute;n de las
opciones existentes en <em>/usr/src/sys/arch/&lt;arq&gt;/conf/GENERIC</em>
(en donde <em>&lt;arq&gt;</em> se debe substituir por el nombre de la
arquitectura correspondiente) y en <em>/usr/src/sys/conf/GENERIC</em>.
</p>

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/alpha/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo para alpha</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/i386/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo para i386</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/mac68k/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo para mac68k</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/pmax/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo para pmax</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo para sparc</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/">Ficheros de configuraci&oacute;n del n&uacute;cleo para otras arquitecturas</a></li>
</ul>
</p>

<p>
Mire esos ficheros con atenci&oacute;n y podr&aacute; ver una
l&iacute;nea como la siguiente:

<pre>
<tt>include "../../../conf/GENERIC"</tt>
</pre>

Esto es una referencia a otro fichero de configuraci&oacute;n distinto.
Este fichero almacena opciones que no dependen de ninguna arquitectura,
por lo que, al crear su fichero de configuraci&oacute;n del n&uacute;cleo,
debe asegurarse de mirar antes en
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/conf/GENERIC">/sys/conf/GENERIC</a>
y comprobar qu&eacute; opciones le interesan.  ALGUNAS de las opciones que
ah&iacute; se encuentran son NECESARIAS.
</p>

<p>
Todas las opciones que aparecen en la lista de m&aacute;s abajo
deben incluirse en el fichero de configuraci&oacute;n de su
n&uacute;cleo en el siguiente formato:

<pre>
<tt>option      OPTION</tt>
</pre>
</p>

<p>
Por ejemplo, para incluir la opci&oacute;n <tt>DEBUG</tt> en el n&uacute;cleo,
a&ntilde;ada una l&iacute;nea como &eacute;sta:

<pre>
<tt>option	    DEBUG</tt>
</pre>
</p>

<p>
Las opciones del n&uacute;cleo de OpenBSD se traducen en opciones de
preprocesador del compilador, por tanto una opci&oacute;n como <tt>DEBUG</tt>
tendr&iacute;a el c&oacute;digo fuente compilado con la opci&oacute;n
<tt>-DDEBUG</tt>.  Esto es equivalente a hacer un <tt>#define DEBUG</tt> en todo
el n&uacute;cleo.
</p>

<p>
OpenBSD dispone de varias opciones de compatibilidad muy &uacute;tiles
que le permitir&aacute;n usar binarios de otros sistemas operativos.
No todas se encuentran disponibles para cada arquitectura, por lo que
debe leer las p&aacute;ginas de manual para cada opci&oacute;n para
comprobar si existe soporte para la opci&oacute;n en su arquitectura.
</p>

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_svr4&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_SVR4(8)</a> - Compatibilidad con binarios de SVR4.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_bsdos&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_BSDOS(8)</a> - Compatibilidad con binarios de BSD/OS.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_LINUX(8)</a> - Compatibilidad con binarios de Linux.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_sunos&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_SUNOS(8)</a> - Compatibilidad con binarios de SunOS.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ultrix&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_ULTRIX(8)</a> - Compatibilidad con binarios de Ultrix.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_freebsd&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_FREEBSD(8)</a> - Compatibilidad con binarios de FreeBSD.</li>
<li>COMPAT_HPUX - Compatibilidad con binarios de HP-UX.
    Disponible s&oacute;lo en algunas arquitecturas m68k.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ibcs2&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_IBCS2(8)</a> - Compatibilidad con binarios de ibcs2.</li>
<li>COMPAT_OSF1 - Compatibilidad con binarios de Digital Unix.
    Disponible s&oacute;lo en la plataforma Alpha.</li>
<li>COMPAT_43 - Compatibilidad con 4.3BSD.
    No se aconseja su uso, aunque es necesario para nuestro porte de
    Navigator.</li>
<li>COMPAT_11 - Compatibilidad con NetBSD 1.1</li>
<li>COMPAT_NOMID - Compatibilidad con ejecutables a.out sin identificador de m&aacute;quina.
</ul>
</p>

<p>
Poder depurar problemas en el n&uacute;cleo del sistema es siempre de
gran ayuda, pero muchos usuarios no a&ntilde;aden estas opciones en
sus n&uacute;cleos porque incrementan el tama&ntilde;o del
n&uacute;cleo.  Sin embargo, estas opciones son extremadamente
&uacute;tiles para casos en los que pudiera existir un error de
programaci&oacute;n.  De este modo ayudar&iacute;a a los
desarrolladores a descubrir la fuente de sus problemas de un modo mucho
m&aacute;s r&aacute;pido.  En la siguiente lista aparecen opciones de
depurado bien conocidas que puede a&ntilde;adir a su n&uacute;cleo.
</p>

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ddb&sektion=4&format=html">DDB</a>
    - Compila el depurador integrado del n&uacute;cleo.  Esta
    opci&oacute;n no est&aacute; disponible en todas las plataformas,
    as&iacute; que deber&aacute; asegurarse antes de a&ntilde;adirla.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gdb&sektion=1&format=html">KGDB</a>
    - Compila un depurador remoto del n&uacute;cleo que usa la
    funcionalidad &quot;remote target&quot; de gdb.</li>
<li>makeoptions  DEBUG=&quot;-g&quot;
    - Compila bsd.gdb junto con bsd.  Esta opci&oacute;n es &uacute;til
    para depurar los volcados de las ca&iacute;das del sistema con
    gdb.</li>
<li>DEBUG
    - Se usa para poner varias opciones de depurado del n&uacute;cleo
    donde el c&oacute;digo fuente las tiene definidas.</li>
<li>KTRACE
    - A&ntilde;ade gancho para facilitar la b&uacute;squeda de llamadas
    del sistema.  Esta opci&oacute;n permite al usuario la
    utilizaci&oacute;n de
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ktrace&sektion=1&format=html">ktrace(1)</a>.</li>
<li>DIAGNOSTIC
    - A&ntilde;ade al n&uacute;cleo c&oacute;digo que lleva a cabo
    comprobaciones de consistencia internas.</li>
<li>GPROF
    - A&ntilde;ade al n&uacute;cleo c&oacute;digo para la
    perfilaci&oacute;n del &eacute;ste con
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kgmon&sektion=8&format=html">kgmon(8)</a>.</li>
<li>makeoptions PROF=&quot;-pg&quot;
    - El indicador -pg hace que el n&uacute;cleo se compile con soporte
      para la perfilaci&oacute;n.  Se require la opci&oacute;n GPROF
      para poder usar esta opci&oacute;n.</li>
</ul>
</p>

<p>
<strong>Opciones para el sistema de archivos:</strong>
<ul>
<li>FFS - Berkeley Fast Filesystem.
    <strong>NOTA:</strong> Esta opci&oacute;n es obligatoria.</li>
<li>EXT2FS - Second Extended File System.
    Necesario para poder leer particiones de Linux.</li>
<li>MFS - Memory File System.
    Almacena ficheros en la memoria de intercambio (<em>swap</em>).</li>
<li>NFS - Network File System.
    Necesario para usar NFS.</li>
<li>CD9660 - iso9660 + rockridge filesystem.
    Requerido para la lectura de CDs.</li>
<li>MSDOSFS - Lee sistemas de archivos MS-DOS FAT.
    Tambi&eacute;n contiene soporte para nombre largos de Windows 95 +
    extensiones de caso mixto.</li>
<li>FDESC - Include el c&oacute;digo para un sistema de archivos que se
    puede montar en <em>/dev/fd</em></li>
<li>KERNFS - Incluye c&oacute;digo que permite montar un sistema de
    archivos especial (generalmente montado en <em>/kern</em>), en el que
    se pueden encontrar ficheros que representan varias variables y
    par&aacute;metros del n&uacute;cleo.</li>
<li>NULLFS - Incluye el c&oacute;digo para un sistema de archivos de
    <em>&quot;loopback&quot;</em>. Puede ver m&aacute;s
    informaci&oacute;n en
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_null&sektion=8&format=html">mount_null(8)</a>.</li>
<li>PROCFS - Incluye c&oacute;digo para un sistema de archivos especial
    (que se suele montar en <em>/proc</em>).</li>
<li>PORTAL - Incluye el sistema de archivos (experimental) portal.
    Este sistema permite la utilizaci&oacute;n de trucos interesantes,
    como abrir <em>sockets</em> TCP al abrir ficheros en el sistema
    archivos.</li>
<li>UMAPFS - Incluye un sistema de archivos de
    <em>&quot;loopback&quot;</em> en el que los identificadores de
    usuario y grupo se pueden reasignar. Esto puede ser &uacute;til
    cuando se monten sistemas de archivos extra&ntilde;os con uids y
    gids diferentes al del sistema local (v.g. NFS remoto).</li>
<li>UNION - Incluye c&oacute;digo para el sistema de archivos
    <em>&quot;union&quot;</em>, que permite montar unos directorios sobre
    otros, de tal modo que ambos sistemas de archivos sean visibles.
    Este c&oacute;digo todav&iacute;a es bastante inestable.</li>
<li>XFS - A&ntilde;ade ganchos para que se pueda usar un sistema de
    archivos que es compatible con el sistema de archivos AFS.
    Actualmente lo usa el c&oacute;digo Arla/AFS.</li>
<li>LFS - Log Structured Filesystem.</li>
<li>FFS_SOFTUPDATES - Permite el uso de <em>softupdates</em>.
    Puede obtener informaci&oacute;n sobre esto en la
    <a href="faq14.html#SoftUpdates">secci&oacute;n sobre
    <em>SoftUpdates</em></a> de las preguntas frecuentes.</li>
<li>NFSSERVER - Permite la inclusi&oacute;n del c&oacute;digo de NFS
    para servidores en el n&uacute;cleo.</li>
<li>NFSCLIENT - Permite la inclusi&oacute;n del c&oacute;digo de NFS
    para clientes en el n&uacute;cleo.</li>
<li>FIFO - Soporte para FIFOs - RECOMENDADO.</li>
<li>NVNODE=integer - En donde &quot;integer&quot; es el tama&ntilde;o
    del cach&eacute; usado por las rutinas de traducci&oacute;n de
    nombre a i-nodo (conocidas como cach&eacute; namei(), aunque
    tambi&eacute;n tienen otros nombres en el c&oacute;digo fuente del
    n&uacute;cleo).</li>
<li>EXT2FS_SYSTEM_FLAG - Esta opci&oacute;n cambia el comportamiento de
    los indicadores APPEND y IMMUTABLE por un fichero en un sistema de
    archivos EXT2FS. M&aacute;s detalles en
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&sektion=4&format=html">options(4)</a>.</li>
<li>QUOTA - Soporte para el sistema de archivos <em>Quota</em>. La
    informaci&oacute;n sobre c&oacute;mo usar cuotas la puede
    obtener en la secci&oacute;n sobre
    <a href="faq10.html#Quotas">cuotas</a>.</li>
</ul>
</p>

<p>
<strong>Opciones miscel&aacute;neas:</strong>

<ul>
<li>PCIVERBOSE - Incrementa la verbosidad durante el inicio del sistema
    sobre perif&eacute;ricos PCI.</li>
<li>EISAVERBOSE - Incrementa la verbosidad durante el inicio del
    sistema sobre perif&eacute;ricos EISA.</li>
<li>PCMCIAVERBOSE - Incrementa la verbosidad durante el inicio del
    sistema sobre perif&eacute;ricos PCMCIA.</li>
<li>APERTURE - Soporte integrado en el n&uacute;cleo para la memoria de 
    almacenamiento intermedio de im&aacute;genes VGA por medio de
    procesos de usuario. Necesaria para que funcione X.</li>
<li>XSERVER - Soporte para el controlador de consola del servidor de X.
    Necesaria para X.</li>
<li>LKM - Soporte para M&oacute;dulos Cargables en el N&uacute;cleo. No
    est&aacute; disponible en todas las arquitecturas. Para m&aacute;s
    informaci&oacute;n lea
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=lkm&sektion=4&format=html">lkm(4)</a>.</li>
<li>INSECURE - Rebaja el nivel de seguridad del n&uacute;cleo a -1.
    M&aacute;s informaci&oacute;n sobre niveles de seguridad del
    n&uacute;cleo en
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=init&sektion=8&format=html">init(8)</a>.</li>
<li>RAM_DISK_HOOKS - Permite que se pueda llamar algunas funciones
    dependientes de la m&aacute;quina cuando el controlador del disco
    de ram (<em>&quot;ramdisk&quot;</em>) est&aacute; configurado.</li>
<li>RAM_DISK_IS_ROOT - Forzar <em>root</em> como disco de ram.</li>
<li>CCDNBUF=integer - Configurar el n&uacute;mero de memorias
    intermedias (<em>&quot;buffers&quot;</em>) usadas por
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccd&sektion=4&format=html">CCD(4)</a>.
    M&aacute;s informaci&oacute;n en la
    <a href="faq11.html#ccd">secci&oacute;n 11.2</a> que trata sobre
    la E/S del disco.</li>
<li>KMEMSTATS - Esto hace que el asignador de memoria del
    n&uacute;cleo, malloc(9), guarde datos estad&iacute;sticos sobre su
    uso. Si se usa la opci&oacute;n DEBUG, config activar&aacute; esta
    opci&oacute;n autom&aacute;ticamente.</li>
<li>BOOT_CONFIG - Soporte para la opci&oacute;n de arranque
    <kbd>-c</kbd>.</li>
</ul>
</p>

<p>
<strong>Opciones de redes</strong><br>

Lea tambi&eacute;n el <a href="faq6.html">cap&iacute;tulo 6</a>,
&laquo;Redes&raquo;, o la secci&oacute;n sobre el
<a href="faq11.html#Network">afinamiento del funcionamento de
la red</a>.

<ul>
<li>GATEWAY - Permite el uso de IPFORWARDING y, en la mayor&iacute;a de
    puertos, incrementa el tama&ntilde;o de NMBCLUSTERS.</li>
<li>NMBCLUSTERS=integer - Controla el tama&ntilde;o del mapa de
    clusters mbuf.</li>
<li>IPFORWARDING - Activa el comportamiento de enrutamiento IP. Con
    esta opci&oacute;n activada, la m&aacute;quina enviar&aacute; entre sus
    interfaces datagramas de IP que est&eacute;n destinados a otras
    m&aacute;quinas.</li>
<li>MROUTING - Incluye soporte para enrutadores multicast IP.</li>
<li>INET - Incluye soporte para el protocolo TCP/IP. REQUERIDA.</li>
<li>MCLSHIFT=value - Esta opci&oacute;n es el logaritmo en base 2 del
    tama&ntilde;o de los clusters mbuf. Para m&aacute;s
    informaci&oacute;n sobre esta opci&oacute;n, lea
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&sektion=4&format=html">options(4)</a>.</li>
<li>NS - Incluye soporte para el protocolo XNS de Xerox. M&aacute;s
    informaci&oacute;n en
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ns&sektion=4&apropos=0&manpath=OpenBSD+Current">ns(4)</a>.</li>
<li>ISO,TPIP - Incluye soporte para el ubicuo protocolo OSI. M&aacute;s
informaci&oacute;n en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=iso&sektion=4&format=html">iso(4)</a>.</li>
<li>EON - Incluye soporte para <em>&quot;tunneling&quot;</em> OSI sobre
    IP.</li>
<li>CCITT,LLC,HDLC - Incluye soporte para el protocolo X.25.</li>
<li>IPX, IPXIP - Incluye soporte para el protocolo de
    &laquo;Intercambio de Paquetes por Redes en Internet&raquo; (IPX),
    muy usado por Novell Netware.</li>
<li>NETATALK - Incluye soporte en el n&uacute;cleo para la familia de
    protocolos AppleTalk.</li>
<li>TCP_COMPAT_42 - Se desaconseja encarecidamente el uso de esta
    opci&oacute;n.  Error de compatibilidad con 4.2BSD. En 4.2BSD, los
    n&uacute;meros de secuencia de TCP eran valores firmados de 32
    bits. Las implementaciones modernas de TCP usan valores no
    firmados.</li>
<li>TCP_NEWRENO - Activa la fase de recuperaci&oacute;n r&aacute;pida
    NewReno, que permite recuperar un segemento perdido por cada viaje
    completo.</li>
<li>TCP_SACK - Activa reconocimientos selectivos.</li>
<li>TCP_FACK - Activa el env&iacute;o de reconocimientos que permiten
    estimar con m&aacute;s precisi&oacute;n datos destacados durante la
    fase de recuperación r&aacute;pida, usando informaci&oacute;n SACK.
    Esta opci&oacute;n se puede usar junto con TCP_SACK.</li>
<li>PPP_FILTER - Esta opci&oacute;n activa el filtrado basado en
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcap&sektion=3&format=html">pcap(3)</a>
    para conexiones ppp.</li>
<li>PPP_BSDCOMP - Compresi&oacute;n BSD para PPP.</li>
<li>PPP_DEFLATE - Usado en conjunci&oacute;n con PPP_BSDCOMP.</li>
<li>IPSEC - Esta opci&oacute;n activa el soporte para el protocolo de
    seguridad de IP. Para una informaci&oacute;n m&aacute;s detallada,
    vea la p&aacute;gina de manual de
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">ipsec(4)</a>.
    Esto implica la opci&oacute;n KEY, que da soporte a PFKEYv2.</li>
<li>ENCDEBUG - Esta opci&oacute;n permite que la informaci&oacute;n de
    depurado aparezca de modo condicional en caso de que IPSEC se
    encuentre con errores.</li>
</ul>
</p>

<p>
<strong>Opciones del subsistema SCSI</strong>

<ul>
<li>SCSITERSE - Errores de mensaje SCSI m&aacute;s escuetos. Omite la
    tabla de informaci&oacute;n de descodificaci&oacute;n ASC/ASCQ,
    ahorrando aproximadamente unos 8 bytes.</li>
<li>SCSIDEBUG - Muestra en consola informaci&oacute;n adicional sobre el
    depurado del subsistema SCSI.</li>
</ul>
</p>


<p>
<a name="Building"></a>
<a name="5.3"></a>
<h2>5.3 - Compilaci&oacute;n del n&uacute;cleo</h2>
</p>

<p>
La p&aacute;gina de manual
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&apropos=0&sektion=8&format=html">afterboot(8)</a>
contiene instrucciones completas sobre c&oacute;mo crear un
n&uacute;cleo personalizado.
</p>

<p>
Para compilar su propio n&uacute;cleo desde el cdrom, antes que nada
necesita disponer del c&oacute;digo fuente.  El c&oacute;digo
fuente se encuentra tanto en el
<a href="../../es/orders.html">CD oficial</a> (en el disco 3)
como en los <a href="../../es/ftp.html">sitios de FTP</a>.  En
el siguiente ejemplo se asume que el tercer CD est&aacute;
montado en <em>/mnt</em>:
</p>

<ul>
<pre>
# <strong>cd /usr/src</strong>
# <strong>tar xvzf /mnt/src.tar.gz</strong>
</pre>
</ul>

<p>
Para crear su propio n&uacute;cleo es m&aacute;s f&aacute;cil comenzar
con el n&uacute;cleo GENERIC.  &Eacute;ste se encuentra ubicado en
<em>/usr/src/sys/arch/${arch}/conf/GENERIC</em>, en donde ${arch} es la
arquitectura de su m&aacute;quina.  En ese directorio tambi&eacute;n
puede encontrar otros ejemplos de configuraciones.  Aqu&iacute;
mostraremos dos ejemplos de c&oacute;mo compilar su n&uacute;cleo.  En
el primer ejemplo se compilar&aacute; el n&uacute;cleo en un
&aacute;rbol de fuentes con permisos de s&oacute;lo lectura.  En el
segundo, en un &aacute;rbol de fuentes con permisos para escritura.
</p>

<ul> 
<pre>
# <strong>cd /directorio</strong>
# <strong>cp /usr/src/sys/arch/$ARCH/conf/FICHERO .</strong>
# <strong>vi FICHERO</strong> (editar para hacer los cambios que desee)
# <strong>config -s /usr/src/sys -b . FICHERO</strong>
</pre>

<pre>
# <strong>make depend</strong> 
</pre>
</ul>

<ul>
(el paso anterior ser&aacute; necesario cuando haya efectuado
alg&uacute;n cambio [incluidos actualizaciones y parches] sobre su
&aacute;rbol de fuentes del n&uacute;cleo.  Este paso se puede omitir
si sigue el paso siguiente)
</ul>

<ul>
<pre>
# <strong>make clean</strong>
</pre>
</ul>

<ul>
(este paso s&oacute;lo es necesario si ha efectuado alg&uacute;n cambio
en las opciones de configuraci&oacute;n de su n&uacute;cleo, y
tambi&eacute;n se recomienda si lleva a cabo alguna
actualizaci&oacute;n importante en su &aacute;rbol de fuentes.  Si no
es as&iacute;, puede ignorar este paso y simplemente usar 'make
depend')
</ul>

<ul>
<pre>
# <strong>make</strong>
</pre>
</ul>

<p>
Para compilar un n&uacute;cleo desde un &aacute;rbol de fuentes con
permisos de escritura, siga los pasos que vienen a continuaci&oacute;n:
</p>

<ul>
<pre>
# <strong>cd /sys/arch/$ARCH/conf</strong>
# <strong>vi FICHERO</strong> (editar para hacer cualquier cambio que desee)
# <strong>config FICHERO</strong> (m&aacute;s informaci&oacute;n al respecto en <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&apropos=0&sektion=8&format=html">config(8)</a>)
# <strong>cd ../compile/FICHERO</strong>
# <strong>make</strong> 
</pre>
</ul>

<p>
En donde $ARCH es la arquitectura de su m&aacute;quina (v.g. i386).
Tambi&eacute;n puede ejecutar <kbd>make depend</kbd> para compilar las
dependencias para la pr&oacute;xima vez que compile su n&uacute;cleo.
</p>

<p>
Para copiar su n&uacute;cleo a su directorio, primero cambie el nombre del
n&uacute;cleo viejo, y luego copie el nuevo:
</p>

<ul>
<pre>
# <strong>cp /bsd /bsd.old</strong>
# <strong>cp /sys/arch/$ARCH/compile/FICHERO/bsd /bsd</strong>
</pre>
</ul>

<p>
Para volver a su viejo n&uacute;cleo durante el arranque, s&oacute;lo
debe hacer
</p>

<ul>
<pre>
boot&gt; <strong>bsd.old</strong>
</pre>
</ul>

<p>
y cargar&aacute; su viejo n&uacute;cleo en lugar de <em>/bsd</em>.
</p>

<p>
Algunas veces, cuando compile un n&uacute;cleo nuevo, le
requerir&aacute; que instale nuevos bloques de arranque
(<em>bootblocks</em>).  Para ello lea la secci&oacute;n sobre
la <a href="faq14.html#InstBoot">instalaci&oacute;n de bloques de
arranque</a>, que le dar&aacute; una idea de c&oacute;mo usar
el cargador del arranque (<em>bootloader</em>) de OpenBSD.
</p>

<p>
<a name="BootConfig"></a>
<a name="5.4"></a> 
<h2>5.4 - Configuraci&oacute;n del arranque</h2>
</p>

<p>
En alguna ocasi&oacute;n, al arrancar el sistema, es posible que note que el
n&uacute;cleo encuentra su dispositivo pero en el IRQ equivocado.  Y
puede que necesite usar este dispositivo enseguida.  Pues bien, en este caso
puede usar la configuraci&oacute;n del n&uacute;cleo de arranque de OpenBSD
sin tener que recompilar su n&uacute;cleo.  De este modo tan
s&oacute;lo corregir&aacute; su problema para una sola vez, y en cuanto
reinicie el sistema tendr&aacute; que repetir este procedimiento.  Ppor lo
tanto &eacute;sta es s&oacute;lo una soluci&oacute;n temporal, y
deber&iacute;a solucionar el problema mediante una recompilaci&oacute;n
de su n&uacute;cleo.  Si embargo, su n&uacute;cleo necesita
<strong>option BOOT_CONFIG</strong> compilada en el n&uacute;cleo, y el
n&uacute;cleo GENERIC la tiene.
</p>

<p>
La mayor parte de lo que aqu&iacute; se explica se puede encontrar en
la p&aacute;gina de manual
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&apropos=0&sektion=8&format=html">boot_config(8)</a>.
</p>

Para iniciar en el modo &quot;<em>User Kernel Config</em>&quot;
(&laquo;configuraci&oacute;n del n&uacute;cleo del usuario&raquo;), o
UKC, en el momento del arranque use la opci&oacute;n -c.

<ul>
<pre>
boot&gt; <strong>boot wd0a:/bsd -c</strong>
</pre>
</ul>

<p>
O cualquier otro n&uacute;cleo que desee arrancar.  Al hacer esto le
llevar&aacute; al punto de pedido de UKC desde donde podr&aacute;
enviar &oacute;rdenes directamente al n&uacute;cleo, especificando los
dispositivos que quiera cambiar o desactivar, o incluso activar.
</p>

<p>
He aqu&iacute; una lista de &oacute;rdenes comunes en UKC.
</p>

<code>
<p>
add <strong>device</strong> - A&ntilde;adir un dispositivo copiando
otro
</p>

<p>
change <strong>devno | device </strong> - Modifificar uno o m&aacute;s
dispositivos
</p>

<p>
disable <strong>devno | device </strong> - Desactivar uno o m&aacute;s
dispositivos 
</p>

<p>
enable <strong>devno | device </strong> - Activar uno o m&aacute;s
dispositivos 
</p>

<p>
find <strong>devno | device </strong> - Encontrar uno o m&aacute;s
dispositivos
</p>

<p>
help - Breve sumario de estas &oacute;rdenes
</p>

<p>
list - Mostrar una lista de TODOS los dispositivos conocidos
</p>

<p>
exit/quit - Continuar el proceso de arranque
</p>

<p>
show <strong>[attr [val]]</strong> - Mostrar dispositivos con un
atributo y, de forma opcional, con un valor especificado
</p>
</code>

<p>
Una vez que haya configurado su dispositivo, use quit o exit y
contin&uacute;e con el proceso de arranque.  Despu&eacute;s de esto
debe corregir la configuraci&oacute;n de su n&uacute;cleo y compilar un
nuevo n&uacute;cleo.  Mire la secci&oacute;n sobre c&oacute;mo
<a href="faq5.html#Building">compilar un n&uacute;cleo
personalizado</a> para obtener ayuda al respecto.
</p>

<p>
<a name="VerboseBoot"></a>
<a name="5.5"></a>
<h2>5.5 - C&oacute;mo obtener una salida con m&aacute;s
informaci&oacute;n durante el arranque</h2>
</p>

<p>
Los mensajes con m&aacute;s verbosidad durante el arranque pueden
ayudar mucho al intentar depurar problemas de arranque.  Si tiene un
problema en el que su disquete de arranque no funciona y necesita
m&aacute;s informaci&oacute;n, s&oacute;lo tiene que reiniciar y, cuando
llegue al punto de pedido &quot;<code>boot&gt;</code>&quot;, arranque con
<kbd>boot -c</kbd>.  Esto le llevar&aacute; al punto de pedido
<code>UKC&gt;</code>, desde donde:
</p>


<ul>
<pre>
UKC&gt; <strong>verbose</strong>
autoconf verbose enabled
UKC&gt; <strong>quit</strong>
</pre>
</ul>

<p>
A continuaci&oacute;n obtendr&aacute; unos mensajes con mucha
verbosidad en el arranque.
</p>

<p>
<a name="config"></a>
<a name="5.6"></a>
<h2>5.6 - Uso de config(8) para cambiar el n&uacute;cleo</h2>
</p>

<p>
Las opciones <strong>-e</strong> y <strong>-u</strong> de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8&amp;format=html">config(8)</a>
pueden ser muy &uacute;tiles y evitar p&eacute;rdidas de
tiempo en la compilaci&oacute;n del n&uacute;cleo.  El
indicador <strong>-e</strong> le permite entrar en UKC en un
sistema en funcionamiento.  Los cambios que se apliquen
comenzar&aacute;n a funcionar a partir del siguiente reinicio
del sistema.  El indicador <strong>-u</strong> comprueba si se
ha efectuado alg&uacute;n cambio al n&uacute;cleo en
funcionamiento durante el arranque.  O sea, si ha usado
<strong>boot -c</strong> para entrar en UKC mientras arrancaba
su sistema.
</p>

<p>
El siguiente ejemplo muestra c&oacute;mo desactivar los
dispositivos <em>ep*</em> en el n&uacute;cleo.  Por motivos de
seguridad deber&iacute;a usar la opci&oacute;n
<strong>-o</strong>, que guarda los cambios efectuados en el
fichero que se le especifique.  Por ejemplo: <strong>config -e
-o bsd.new /bsd</strong> guardar&aacute; los cambios en
bsd.new.  El ejemplo a continuaci&oacute;n no usa la
opci&oacute;n <strong>-o</strong>, por lo tanto los cambios se
ignorar&aacute;n y no se guardar&aacute;n en el binario del
n&uacute;cleo.  Para m&aacute;s informaci&oacute;n con
respecto a los mensajes de errores y de avisos, lea la
p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&sektion=8&format=html">config(8)</a>.
</p>

<ul><pre>
$ <strong>sudo config -e /bsd</strong>
OpenBSD 3.1 (GENERIC) #2: Sat Apr 20 21:44:54 EDT 2002
    root@build:/usr/src/sys/arch/i386/compile/GENERIC
warning: no output file specified
Enter 'help' for information
ukc&gt; ?
        help                            Command help list
        add         dev                 Add a device
        base        8|10|16             Base on large numbers
        change      devno|dev           Change device
        disable     attr val|devno|dev  Disable device
        enable      attr val|devno|dev  Enable device
        find        devno|dev           Find device
        list                            List configuration
        lines       count               # of lines per page
        show        [attr [val]]        Show attribute
        exit                            Exit, without saving changes
        quit                            Quit, saving current changes
        timezone    [mins [dst]]        Show/change timezone
        nmbclust    [number]            Show/change NMBCLUSTERS
        cachepct    [number]            Show/change BUFCACHEPERCENT
        nkmempg     [number]            Show/change NKMEMPAGES
        shmseg      [number]            Show/change SHMSEG
        shmmaxpgs   [number]            Show/change SHMMAXPGS
ukc&gt; <strong>list</strong>
  0 audio* at sb0|sb*|gus0|pas0|sp0|ess*|wss0|wss*|ym*|eap*|eso*|sv*|neo*|cmpci*|clcs*|clct*|auich*|autri*|auvia*|fms*|uaudio*|maestro*|esa*|yds*|emu* flags 0x0
  1 midi* at sb0|sb*|opl*|opl*|opl*|opl*|ym*|mpu*|autri* flags 0x0
  2 nsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  3 nsphyter* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  4 qsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  5 inphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  6 iophy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  7 eephy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  8 exphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
[...snip...]
ukc&gt; <strong>disable ep</strong>
 65 ep0 disabled
 66 ep* disabled
 67 ep* disabled
149 ep0 disabled
150 ep0 disabled
151 ep* disabled
152 ep* disabled
202 ep* disabled
ukc&gt; <strong>quit</strong>
not forced
</pre></ul>

<p>
En el anterior ejemplo, todos los dispositivos ep* han sido
desactivados en el n&uacute;cleo y no ser&aacute;n
comprobados.  En algunas situaciones en las que haya usado UKC
durante el arranque, por medio de <strong>boot -c</strong>,
necesitar&aacute; que esos cambios se guarden permanentemente.
Para ello necesitar&aacute; usar la opci&oacute;n
<strong>-u</strong>.  En el siguiente ejemplo, la
m&aacute;quina se arranc&oacute; en UKC y el dispositivo wi(4)
fue eliminado.  Ya que los cambios efectuados con <strong>boot
-c</strong> NO son permanentes, estos cambios deben ser
guardados.  En este ejemplo los cambios hechos con
<strong>boot -c</strong> se guardan en un nuevo n&uacute;cleo
binario, bsd.new.
</p>

<ul><pre>
$ <strong>sudo config -e -u -o bsd.new /bsd</strong>
OpenBSD 3.1 (GENERIC) #2: Sat Apr 20 21:44:54 EDT 2002
    root@build:/usr/src/sys/arch/i386/compile/GENERIC
Processing history...
105 wi* disabled
106 wi* disabled
Enter 'help' for information
ukc&gt; <strong>quit</strong>
</pre></ul>


<p>
<font color="#0000e0">
<a href="index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq4.html">[Cap&iacute;tulo 4.0 - Gu&iacute;a de instalaci&oacute;n]</a>
<a href="faq6.html">[Cap&iacute;tulo 6.0 - Redes]</a>
</font>
</p>

<hr>
<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq5.html,v 1.59 2002/05/20 01:03:28 nick Exp ]<br>
$Translation: faq5.html,v 1.25 2002/05/20 23:57:20 horacio Exp $<br>
$OpenBSD: faq5.html,v 1.20 2002/05/21 09:30:48 jufi Exp $
</small>
</p>
</body>
</html>
