<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>5 - C&oacute;mo crear un n&uacute;cleo personalizado</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2004 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq4.html">[Cap&iacute;tulo 4 - Gu&iacute;a de instalaci&oacute;n]</a>
<a href="faq6.html">[Cap&iacute;tulo 6 - Redes]</a>
</font>

<h1><font color="#e00000">5 - C&oacute;mo compilar el c&oacute;digo del
sistema</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#Flavors">5.1 - &laquo;Sabores&raquo; de OpenBSD.</a>
<li><a href="#Why">5.2 - &iquest;Qu&eacute; finalidad puede tener un
n&uacute;cleo personalizado?</a>
<li><a href="#Options">5.3 - Ficheros de configuraci&oacute;n del
n&uacute;cleo.</a>
<li><a href="#Building">5.4 - C&oacute;mo crear un n&uacute;cleo
personalizado.</a>
<li><a href="#BootConfig">5.5 - C&oacute;mo configurar el n&uacute;cleo
durante el arranque del sistema.</a>
<li><a href="#VerboseBoot">5.6 - C&oacute;mo obtener m&aacute;s
informaci&oacute;n durante el arranque.</a>
<li><a href= "#config">5.7 - Uso de config(8) para efectuar cambios en
el n&uacute;cleo.</a>
<li><a href="#buildprobs">5.8 - Problemas comunes durante la
compilaci&oacute;n del sistema</a>
   <ul>
   <li><a href="#sig11">5.8.1 - El proceso de compilaci&oacute;n se para
   con un error &quot;<i>Signal 11</i>&quot;</a>
   <li><a href="#snake">5.8.2 - <kbd>make build</kbd> falla con el
   mensaje &quot;<i>cannot open output file snake: is a
   directory</i>&quot;</a>
   </ul>
</ul>
<hr>
<br>


<a name="Flavors"></a>
<h2>5.1 - &laquo;Sabores&raquo; de OpenBSD</h2>
<!-- XXXversion - revise doodle -->
Existen tres tipos de versiones de OpenBSD (tambi&eacute;n conocidos
como &laquo;sabores&raquo;):
<ul>
<li><b>-release:</b> La <b>versi&oacute;n final</b> de OpenBSD que se
hace p&uacute;blica cada seis meses en CD.
<li><b>-stable:</b> La <b>versi&oacute;n estable</b>, una
revisi&oacute;n de la versi&oacute;n final que contiene todos los
parches que se consideran cr&iacute;ticos para la seguridad y fiabilidad
del sistema.
<li><b>-current:</b> La <b>versi&oacute;n en desarrollo</b> de OpenBSD,
que acabar&aacute; convirti&eacute;ndose en la pr&oacute;xima
versi&oacute;n final.
</ul>

He aqu&iacute; un gr&aacute;fico de estos sabores:

<blockquote>
<pre>
       ,------o-----------o----X                    3.1 Stable
       |      .           .
       |      .    ,------o---------o----X          3.2 Stable
       |      .    |      .         .
       |      .    |      .    ,----o----------o--&gt; 3.3 Stable
       |      .    |      .    |    .          .
       |      .    |      .    |    .    ,-----o--&gt; 3.4 Stable
       |      .    |      .    |    .    |     .
       |      .    |      .    |    .    |     .
 --&gt;3.1Rel-----&gt;3.2Rel-----&gt;3.3Rel-----&gt;3.4Rel----&gt; Current 

          Time ---&gt;
</pre>
</blockquote>

<p>
El &aacute;rbol del c&oacute;digo se divide entre las ramas
<i>-current</i>, <i>-release</i> y <i>-stable</i> cada seis meses;
<i>-release</i>, la versi&oacute;n final, es el punto de
congelaci&oacute;n del historial de desarrollo del &aacute;rbol de
fuentes, nunca sufre cambios y es el c&oacute;digo que se incluye en los
<a href="../../es/orders.html">CD</a> y en los
<a href="../../es/ftp.html">servidores de FTP</a>.
<i>-current</i>, la versi&oacute;n en desarrollo, es el &aacute;rbol del
c&oacute;digo en el que se efect&uacute;an todos los cambios, y pasa a
ser la pr&oacute;xima versi&oacute;n final (<i>-release</i>) de OpenBSD
pasados seis meses.

<p>
<i>-stable</i>, la versi&oacute;n estable tambi&eacute;n conocida como
&laquo;rama de parches&raquo;, es una revisi&oacute;n de la
&uacute;ltima versi&oacute;n final, <i>-release</i>, o lo que es lo
mismo una ramificaci&oacute;n del c&oacute;digo principal de OpenBSD.
Seg&uacute;n van apareciendo reparaciones importantes en la
versi&oacute;n en desarrollo, estas reparaciones se
&laquo;retro-portan&raquo; a las versiones estables.  En el
gr&aacute;fico anterior, las l&iacute;neas verticales de puntos
representan reparaciones de errores que son incorporadas en las
versiones estables.  En el ejemplo tambi&eacute;n se puede observar que
la versi&oacute;n <i>3.1-stable</i> finaliz&oacute; con la
versi&oacute;n <i>3.3-release</i>, y que la versi&oacute;n
<i>3.2-stable</i> finaliz&oacute; con la versi&oacute;n
<i>3.4-release</i>.  El soporte para las versiones antiguas s&oacute;lo
se contin&uacute;a durante dos versiones.  Para continuar con el soporte
de versiones antiguas se necesita tiempo y recursos, y aunque
querr&iacute;amos ofrecer soporte continuado para versiones antiguas,
preferimos centrarnos en el desarrollo de nuevas funcionalidades.  La
versi&oacute;n estable es, por su dise&ntilde;o, muy f&aacute;cil de
compilar e instalar partiendo desde la versi&oacute;n final de la misma
versi&oacute;n (o sea, desde <i>3.4-release</i> a <i>3.4-stable</i>).

<p>
La revisi&oacute;n estable (<i>-stable</i>) es, en realidad, la
versi&oacute;n final (<i>-release</i>) m&aacute;s los parches que
aparecen en la <a href="../../es/errata.html">p&aacute;gina de
erratas</a>, adem&aacute;s de algunas peque&ntilde;as reparaciones que
no merecen una entrada en esa p&aacute;gina.  Generalmente, la
operaci&oacute;n en la que se basa el paso de <i>-release</i>
est&aacute; basado en <i>-stable</i>.  Si las
<a href="http://www.openbsd.org/cgi-bin/man.cgi">p&aacute;ginas
del manual</a> tienen que cambiar es probable que no aparezcan en
<i>-stable</i>.  En otras palabras, el soporte de nuevos dispositivos NO
se a&ntilde;ade a <i>-stable</i>, y el soporte de nuevas funcionalidades
s&oacute;lo se a&ntilde;ade en raras ocasiones, cuando se considera que
el cambio es muy importante.

<p>
Aviso:  <i>-current</i> es el c&oacute;digo de la versi&oacute;n en
cont&iacute;nuo desarrollo.  Los cambios se producen casi cada minuto y
puede cambiar varias veces durante el tiempo que alguien tarda en
bajarse el c&oacute;digo fuente.  Con el c&oacute;digo de esta
versi&oacute;n en desarrollo no es posible asegurar que la
compilaci&oacute;n del c&oacute;digo vaya a funcionar siempre ...aunque
siempre queda la esperanza.  Bajarse el c&oacute;digo fuente de la
versi&oacute;n en desarrollo y que falle la compilaci&oacute;n en un
momento dado y que, cinco minutos m&aacute;s tarde s&iacute; que
funcione, es algo bastante frecuente.  <b>Si no se est&aacute; preparado
para este tipo de problemas es aconsejable no utilizar
<i>-current</i>.</b>

<p>
Las versiones que la mayor&iacute;a de usuarios deben utilizar son
<i>-stable</i> o <i>-release</i>.  Aunque hay muchos usuarios que
utilizan <i>-current</i> en sus sistema de producci&oacute;n, y es
importante que los usuarios expertos lo hagan para as&iacute; poder
identificar errores y para probar el funcionamiento de las nuevas
funcionalidades.  Sin embargo, los usuarios que no sepan c&oacute;mo
describir, diagnosticar y tratar correctamente un problema, no deben
utilizar <i>-current</i>.  Decir que algo &laquo;no ha funcionado&raquo;
no es un <a href="../../es/report.html#bugtypes">informe &uacute;til</a>
para los desarrolladores.

<p>
Hay ocasiones en los que un usuario &laquo;normal&raquo; querr&aacute;
ponerse al l&iacute;mite e instalar <i>-current</i>, en especial si el
usuario tiene un dispositivo para el que no existe soporte en la
versi&oacute;n final (y por lo tanto tampoco en la versi&oacute;n
estable), o necesita alguna funcionalidad nueva de la versi&oacute;n en
desarrollo.  En este caso en el que las &uacute;nicas opciones son las
de instalar la versi&oacute;n en desarrollo o no utilizar el
dispositivo, la primera puede ser vista como un mal menor, pero en ese
caso no se puede esperar ayuda de los desarrolladores.

<h3>Las versiones preliminares (<i>snapshots</i>)</h3>

<p>
Entre una versi&oacute;n final de OpenBSD y la siguiente, el proyecto
saca versiones preliminares o instant&aacute;neas, (<i>snapshots</i>), y
las pone en los <a href="../../es/ftp.html">servidores de FTP</a>.
Estas versiones preliminares son versiones que se preparan con todo el
c&oacute;digo existente en el &aacute;rbol de fuentes en el instante en
el que el desarrollador coge una copia del c&oacute;digo para una
plataforma en concreto.  Hay que tener en cuenta que, en algunas
plataformas, puede significar D&Iacute;AS antes de que la versi&oacute;n
instant&aacute;nea sea recogida y disponible para su
distribuci&oacute;n.  No se puede asegurar que las versiones
instant&aacute;neas sean totalmente funcionales, ni siquiera que se
instalen correctamente.  La raz&oacute;n detr&aacute;s de la
distribuci&oacute;n de estas versiones suele ser que haya un cambio para
el que se necesiten informes de pruebas.  En algunas plataformas hay
versiones instant&aacute;neas que se recopilan casi a diario, mientras
que en otras es mucho menos frecuente.  Para alguien que quiera instalar
<i>-current</i> por alg&uacute;n motivo espec&iacute;fico, es muy
probable que s&oacute;lo sea necesario un <i>snapshot</i>, y actualizar
el sistema con un <i>snapshot</i> es un buen comienzo antes de intentar
compilar <i>-current</i>.

<p>
Una precuenta frecuente es si se puede obtener una copia del
c&oacute;digo exacto que se ha usado para recopilar una versi&oacute;n
instant&aacute;nea.  La respuesta es no.  Esto no tiene ning&uacute;n
beneficio significativo, y adem&aacute;s las versiones
instant&aacute;neas se recopilan cuando hay tiempo y recursos
disponibles para hacerlo.  Se pueden recopilar varios <i>snapshots</i>
en un mismo d&iacute;a para una plataforma veloz, y tardar una semana o
incluso m&aacute;s en recopilar un solo <i>snapshot</i> en una
plataforma lenta.  La inclusi&oacute;n de marcas o etiquetado en el
&aacute;rbol de fuentes para cada uno de los <i>snapshot</i> no
ser&iacute;a pr&aacute;ctico.

<h3>Sincronizaci&oacute;n del sistema</h3>

<p>
Es importante que quede claro que OpenBSD es un sistema operativo que
debe ser utilizado al completo, no un n&uacute;cleo para un sistema con
unas cuantas utilidades integradas.  Hay que asegurarse de que los
&aacute;rboles del n&uacute;cleo del sistema, del modo de usuario
(<em>userland</em>, las utilidades y archivos de soporte) y de los
<a href="../../es/ports.html">portes</a> est&eacute;n sincronizados en
todo momento, o de lo contrario nos estaremos exponiendo a problemas
nada agradables.  Dicho de otra forma (debido a que algunos usuarios
siguen cometiendo este error), no es posible tener un &aacute;rbol de
<tt>portes</tt> nuevo funcionando sobre un sistema que ya tenga un mes
de tiempo, ni se puede recomponer un n&uacute;cleo del sistema con el
c&oacute;digo fuente de <em>-current</em> y esperar que funcione con un
sistema de la versi&oacute;n <em>-release</em>.  Esto implica que
ser&iacute;a necesario actualizar todo el sistema si se quisiera
utilizar un nuevo programa que acabara de ser a&ntilde;adido al
&aacute;rbol de fuentes.  Los sentimos, pero OpenBSD dispone de unos
recursos limitados.

<p>
Tambi&eacute;n es importante que quede claro que, cuando se lleva a cabo
una <a href="upgrade-minifaq.html">actualizaci&oacute;n mediante el
c&oacute;digo fuente</a>, el soporte para el proceso de
actualizaci&oacute;n existe en <b>una sola direcci&oacute;n:  de una
versi&oacute;n a otra m&aacute;s reciente</b>, y desde <i>-stable</i> a
<i>-current</i>.  No se puede instalar una <i>3.4-current</i> (o un
<i>snapshot</i>) y luego decidir que es demasiado inestable y pretender
volver a una versi&oacute;n <i>3.4-stable</i>, y esperar para ello
soporte o asistencia por parte de los desarrolladores.  Si alguien elige
un camino distinto debe esperar ninguna ayuda que no sea para reinstalar
el sistema desde cero, y no puede esperar ninguna ayuda del equipo de
desarrolladores de OpenBSD.

<p>
As&iacute; pues, antes de que cualquier usuario se decida a usar la
versi&oacute;n <i>-current</i> es aconsejable que se lo piense bien.


<p>
<a name="Why"></a>
<h2>5.2 - &iquest;Qu&eacute; finalidad puede tener un n&uacute;cleo
personalizado?</h2>

<p>
Existen varias razones por las que un usuario puede decidirse a
personalizar el n&uacute;cleo, aunque esta pr&aacute;ctica es
s&oacute;lo recomendable para aquellos usuarios que tengan un buen
conocimiento general del sistema.

<ul>
  <li>Si la cantidad de memoria de RAM de la m&aacute;quina es limitada,
  se puede conservar una buena parte de &eacute;sta eliminando los
  controladores de dispositivos que no se vayan a utilizar.
  <li>Si se desea eliminar opciones predeterminadas del sistema o
  a&ntilde;adir opciones que no est&eacute;n activadas de forma
  predeterminada.
  <li>Si se desea activar opciones experimentales.
</ul>

<p>
Para la mayor&iacute;a de casos NO ser&aacute; necesario compilar un
n&uacute;cleo personalizado.  El n&uacute;cleo GENERIC contiene todo lo
que el usuario puede necesitar.  Lo cierto es que existen algunos
motivos para no crear un n&uacute;cleo personalizado, y el principal es
que es muy f&aacute;cil aplicar cambios a la configuraci&oacute;n del
n&uacute;cleo que aparentan ser l&oacute;gicos pero que no funcionan.
Esto debe ser considerado como una se&ntilde;al de aviso, si algo en el
sistema no funciona correctamente con el nuevo n&uacute;cleo se debe
probar con el n&uacute;cleo GENERIC antes de enviar un informe sobre el
error.  Los desarrolladores, por regla general, ignorar&aacute;n los
informes de errores con n&uacute;cleos pesonalizados a menos que el
problema tambi&eacute;n pueda ser reproducido con un n&uacute;cleo
GENERIC.

<p>
<a name="Options"></a>
<h2>5.3 - Ficheros de configuraci&oacute;n del n&uacute;cleo.</h2>

La generaci&oacute;n del n&uacute;cleo de OpenBSD se controla mediante
ficheros de configuraci&oacute;n, y &eacute;stos se encuentran en el
directorio <tt>/usr/src/sys/arch/<i>&lt;arq&gt;</i>/conf/</tt>.  Todas
las arquitecturas tienen un fichero, <tt>GENERIC</tt>, que se usa para
generar el n&uacute;cleo est&aacute;ndar de OpenBSD para la plataforma
en concreto.  Tambi&eacute;n puede haber otros ficheros de
configuraci&oacute;n usados para crear n&uacute;cleos con
prop&oacute;sitos diferentes;  por ejemplo, para sistemas con poca RAM,
estaciones sin dispositivo de disco duro, etc...

<p>
El fichero de configuraci&oacute;n se procesa mediante
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>,
que crea un directorio de compilaci&oacute;n y lo llena en
<tt>../compile</tt> ... que en una instalaci&oacute;n normal
estar&iacute;a <tt>/usr/src/sys/arch/&lt;<i>arq</i>&gt;/compile/</tt>.
La utilidad config(8) tambi&eacute;n crea un fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&amp;sektion=1">
Makefile</a> y otros ficheros requeridos para poder componer el
n&uacute;cleo con &eacute;xito.

<p>
Las Opciones de Configuraci&oacute;n del N&uacute;cleo son las opciones
que se pueden a&ntilde;adir a la configuraci&oacute;n del n&uacute;cleo
para incluir ciertas funcionalidades en el n&uacute;cleo del sistema.
De este modo es posible obtener el tipo exacto de soporte deseado, sin
el soporte de aquellos dispositivos que sean innecesarios para el
usuario.  Existe una gran cantidad de opciones que nos permiten
personalizar el n&uacute;cleo, pero aqu&iacute; s&oacute;lo explicaremos
algunas de ellas, las que se usan con m&aacute;s frecuencia.  En la
p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a>
hay una lista completa de opciones;  como las opciones cambian de vez en
cuando, es necesario leer la p&aacute;gina del manual actualizada para
la misma versi&oacute;n de OpenBSD que se vaya compilar.  Tambi&eacute;n
se pueden mirar los ficheros de configuraci&oacute;n de ejemplo que haya
disponibles para la arquitectura.

<p>
<b>&iexcl;No se deben a&ntilde;adir, eliminar, o cambiar opciones en el
n&uacute;cleo a menos que exista una buena raz&oacute;n para ello!</b>
La &uacute;nica configuraci&oacute;n del n&uacute;cleo para la que
ofrece soporte el equipo de OpenBSD es la del n&uacute;cleo GENERIC, la
combinaci&oacute;n de las opciones de
<tt>/usr/src/sys/arch/&lt;<i>arq</i>&gt;/conf/GENERIC</tt> y 
<tt>/usr/src/sys/conf/GENERIC</tt> que <i>incluye el equipo de
OpenBSD</i> (o sea, SIN cambios).  Cuando alguien informa sobre un
problema en un sistema con un n&uacute;cleo personalizado, la respuesta
suele ser siempre que se intente antes reproducir ese mismo problema en
un sistema con un n&uacute;cleo GENERIC.  No todas las opciones son
compatibles entre ellas, y muchas opciones son un requisito para que
funcione el sistema.  Que alguien consiga compilar un n&uacute;cleo
personalizado no significa que vaya a funcionar.

<p>
A continuaci&oacute;n se pueden ver los ficheros de configuraci&oacute;n
espec&iacute;ficos de cada plataforma:
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/alpha/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo de alpha.</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/i386/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo de i386.</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/macppc/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo de macppc.</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo de sparc.</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc64/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo de sparc64.</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/vax/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo de vax.</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/hppa/conf/">Ficheros de configuraci&oacute;n del n&uacute;cleo de hppa.</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/">Otras
arquitecturas.</a>
</ul>

<p>
Si nos fijamos en estos ficheros, por el principio podremos ver una
l&iacute;nea parecida a:<br>

<pre>
	include &quot;../../../conf/GENERIC&quot;
</pre>

<p>
Esto quiere decir que hace referencia a otro fichero de
configuraci&oacute;n, a uno en el que se guardan las opciones
independientes de la plataforma.  Cuando estemos creando nuestra propia
configuraci&oacute;n del n&uacute;cleo debemos asegurarnos de mirar la
configuraci&oacute;n de
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/conf/GENERIC">/sys/conf/GENERIC</a>.

<p>
Las opciones de configuraci&oacute;n del n&uacute;cleo se deben poner en
el fichero de configuraci&oacute;n del n&uacute;cleo, y en el siguiente
formato:

<blockquote>
<tt>option&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</tt><i>nombre</i>
</blockquote>

<p>
Por ejemplo, para incluir la opci&oacute;n &quot;DEBUG&quot; en el
n&uacute;cleo, a&ntilde;adiremos una l&iacute;nea como la siguiente:

<pre>
     option      DEBUG
</pre>

<p>
Las opciones que se incluyan en el n&uacute;cleo de OpenBSD ser&aacute;n
traducidas en opciones del preprocesador del compilador, y por
consiguiente una opci&oacute;n como <tt>DEBUG</tt> se compilar&iacute;a
con la opci&oacute;n <tt>-DDEBUG</tt>, lo que equivale a incluir
<tt>#define DEBUG</tt> por todo el n&uacute;cleo.

<p>
A veces es probable que alguien quiera desactivar una opci&oacute;n que
ya est&eacute; definida en el fichero
&quot;<tt>src/sys/conf/GENERIC</tt>&quot;.  Aunque para ello se
podr&iacute;a modificar una copia de ese fichero, es mejor usar la
declaraci&oacute;n <i>rmoption</i>.  Por ejemplo, para desactivar el
depurador interno del n&uacute;cleo (<i>&iexcl;no es recomendable!</i>),
bastar&iacute;a con a&ntilde;adir una l&iacute;nea como la siguiente

<pre>
     rmoption DDB
</pre>

en el fichero de configuraci&oacute;n del n&uacute;cleo.  Aunque
<tt>option DDB</tt> est&aacute; definido en
<tt>src/sys/conf/GENERIC</tt>, la directriz <tt>rmoption</tt> lo
desactiva.

<p>

La informaci&oacute;n espec&iacute;fica sobre estas opciones se
encuentra en la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a>.
Adem&aacute;s, muchas de las opciones disponen de sus propias
p&aacute;ginas del manual.  Hay que leer toda la informaci&oacute;n
existente sobre una opci&oacute;n antes de a&ntilde;adirla o eliminarla.


<p> 
<a name="Building"></a>
<h2>5.4 - C&oacute;mo crear un n&uacute;cleo personalizado.</h2>

<p>
Las instrucciones completas para la creaci&oacute;n de un n&uacute;cleo
personalizado se encuentran en la p&aacute;gina del manual de
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8">afterboot(8)</a>.

<p>
Para recomponer un n&uacute;cleo desde el CD-ROM el primer paso es
disponer del c&oacute;digo fuente.  El c&oacute;digo fuente se puede
encontrar en el <a href="../../es/orders.html">CD oficial</a> (disco 3)
o en los <a href="../../es/ftp.html">servidores de FTP</a>.  Para el
siguiente ejemplo asumiremos que el CD3 ya est&aacute; montado en /mnt:

<blockquote>
<pre>
# <strong>cd /usr/src</strong>
# <strong>tar xvzf /mnt/src.tar.gz</strong>
</pre>
</blockquote>

<p>
<b>Nota:</b>  Si se va a obtener desde los servidores de FTP, se
encontrar&aacute;n dos archivos, <i>src.tar.gz</i> y <i>sys.tar.gz</i>.
El primero es el &laquo;modo de usuario&raquo; (<em>userland</em>), todo
excepto el n&uacute;cleo del sistema;  el segundo es el c&oacute;digo
fuente del n&uacute;cleo.  Estos archivos hay que extraerlos como se
indica arriba, y la mayor&iacute;a de usuarios necesitar&aacute;n tener
ambos.  En el CD-ROM estos dos archivos est&aacute;n en uno solo.

<p>
A continuaci&oacute;n, para personalizar el n&uacute;cleo es m&aacute;s
f&aacute;cil empezar desde el n&uacute;cleo GENERIC, que se
encontrar&aacute; en <tt>/usr/src/sys/arch/$ARCH/conf/GENERIC</tt>, en
donde $ARCH es la arquitectura de la m&aacute;quina que se vaya a usar.
En ese directorio tambi&eacute;n hay otros ejemplos de
configuraci&oacute;n disponibles.  He aqu&iacute; dos ejemplo de
compilaci&oacute;n del n&uacute;cleo.  En el primer ejemplo se
compilar&aacute; dentro de un &aacute;rbol de fuentes de s&oacute;lo
lectura, y en el segundo en un &aacute;rbol de fuentes con permiso de
escritura.

<blockquote> 
<pre>
# <strong>cd /directorio</strong>
# <strong>cp /usr/src/sys/arch/$ARCH/conf/FICHERO .</strong>
# <strong>vi FICHERO</strong>   <i>(to make the changes you want)</i>
# <strong>config -s /usr/src/sys -b . FICHERO</strong>
</pre>

seguido por:

<pre>
    # <strong>make depend</strong>
         <b><i>- O POR -</i></b>
    # <strong>make clean</strong>
# <strong>make</strong>
</pre>
</blockquote>

Cuando se haya realizado alg&uacute;n cambio en el &aacute;rbol de
fuentes (incluidos actualizaciones y parches) hay que ejecutar
'<tt>make depend</tt>' (en otras palabras, casi siempre a menos que se
necesite ejecutar '<tt>make clean</tt>').

<p>
Si se han efectuado cambios en las opciones de configuraci&oacute;n del
n&uacute;cleo, y/o se han realizado cambios importantes en el
&aacute;rbol de fuentes, se debe usar '<tt>make clean</tt>' en lugar de
'<tt>made depend</tt>'.  N&oacute;tese que siempre es m&aacute;s seguro
ejecutar 'make clean', aunque esto signifique un mayor tiempo de
compilaci&oacute;n ya que se recompilar&aacute;n m&aacute;s partes.

<p>
Para compilar un n&uacute;cleo desde dentro de un &aacute;rbol de
fuentes con permisos de escritura:

<blockquote>
<tt>
# <strong>cd sys/arch/$ARCH/conf</strong><br>
# <strong>vi FICHERO</strong><i> (para aplicar cualquier cambio deseado)</i><br>
# <strong>config FICHERO</strong><i> (m&aacute;s informaci&oacute;n en
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>)</i><br>
# <strong>cd ../compile/FICHERO</strong><br>
# <strong>make</strong> <br>
</tt>
</blockquote>

<p>
En donde $ARCH es la arquitectura de la m&aacute;quina (v.g. i386).
Tambi&eacute;n se puede ejecutar <strong>make depend</strong> para
compilar las dependencias para la pr&oacute;xima vez que se recompile el
n&uacute;cleo.

<p>
Para colocar el n&uacute;cleo en su sitio:

<blockquote>
<pre>
# <strong>cp /bsd /bsd.old</strong>
# <strong>cp /sys/arch/$ARCH/compile/FICHERO/bsd /bsd</strong>
</pre>
</blockquote>

Para usar el n&uacute;cleo antiguo durante el arranque, desde el punto
de arranque:

<blockquote>
<pre>
boot&gt; <strong>bsd.old</strong>
</pre>
</blockquote>

y se cargar&aacute; el n&uacute;cleo antiguo en lugar de /bsd.

<p>
En ocasiones, cuando se compila un nuevo n&uacute;cleo se requiere que
se instalen nuevo bloques de arranque.  La informaci&oacute;n pertinente
se encuentra en la secci&oacute;n
<a href="faq14.html#InstBoot">Instalaci&oacute;n de bloques de
arranque</a>, que ofrece un repaso sobre el uso del cargador de arranque
de OpenBSD.

<p>
<a name="BootConfig"></a>
<h2>5.5 - C&oacute;mo configurar el n&uacute;cleo durante el arranque
del sistema.</h2>

<p>
A veces, cuando se arranca el sistema, puede que el n&uacute;cleo
encuentre un dispositivo en un IRQ err&oacute;neo y que el usuario
necesite utilizar ese dispositivo de forma urgente.  Para ello, sin
tener que recompilar el n&uacute;cleo, se puede usar la
configuraci&oacute;n del n&uacute;cleo en tiempo de arranque de OpenBSD.
De esta forma se corregir&aacute; el problema por una vez, pero cuando
se reinicie el sistema ser&aacute; necesario repetir este procedimiento.
Por lo tanto s&oacute;lo es una soluci&oacute;n temporal, y ser&aacute;
necesario recompilar el n&uacute;cleo para resolver el problema
definitivamente.  Para usar esta funcionalidad el n&uacute;cleo necesita
disponer de la opci&oacute;n <strong>option BOOT_CONFIG</strong>
compilada (el n&uacute;cleo GENERIC la tiene).

<p>
La mayor parte de la informaci&oacute;n en esta secci&oacute;n se puede
encontrar en la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&amp;sektion=8">boot_config(8)</a>.

<p>
Para arrancar en modo UKC (<em>User Kernel Config</em>, la
configuraci&oacute;n del n&uacute;cleo de usuario), hay que usar la
opci&oacute;n <tt>-c</tt> durante el arranque:<br>
<small>
<i>(NdelT:  la configuraci&oacute;n del teclado espa&ntilde;ol no se
habr&aacute; activado, por lo que es necesario pulsar la tecla
<b>'?'</b> para obtener el car&aacute;cter <b>'-'</b>)</i>:
</small>

<blockquote><pre>
boot&gt; <strong>boot hd0a:/bsd -c</strong>
</pre></blockquote>

O cualquiera que sea el n&uacute;cleo con el que se quiera arrancar.
Esto nos situar&aacute; en el punto de inserci&oacute;n UKC, y desde
aqu&iacute; podremos enviar &oacute;rdenes directamente al n&uacute;cleo
especificando los dispositivos que queremos cambiar, desactivar o
activar.

<p>
He aqu&iacute; una lista de &oacute;rdenes comunes desde el punto de
inserci&oacute;n de UKC:

<ul>
<li><tt>add <strong>dispositivo</strong></tt> - A&ntilde;adir un
dispositivo copiando otro.
<li><tt>change <strong>numdisp | dispositivo </strong></tt> - Modificar
uno o m&aacute;s dispositivos.
<li><tt>disable <strong>numdisp | dispositivo </strong></tt> -
Desactivar uno o m&aacute;s dispositivos.
<li><tt>enable <strong>numdisp | dispositivo </strong></tt> - Activar
uno o m&aacute;s dispositivos.
<li><tt>find <strong>numdisp | dispositivo </strong></tt> - Encontrar
uno o m&aacute;s dispositivos.
<li><tt>help</tt> - Breve sumario de estas &oacute;rdenes.
<li><tt>list</tt> - Lista de TODOS los dispositivos que se conocen.
<li><tt>exit/quit</tt> - Continuar con el arranque.
<li><tt>show <strong>[atributo [valor]]</strong></tt> - Mostrar
dispositivos con cierto atributo y, opcionalmente, con un valor
especificado.
</ul>

<p>
Una vez que ya est&eacute; configurado el dispositivo se puede usar
<tt>quit</tt> o <tt>exit</tt> para continuar el proceso de arranque.
Despu&eacute;s de esto se deber&iacute;a corregir la
configuraci&oacute;n del n&uacute;cleo compilando uno nuevo.  Para ello
v&eacute;ase la secci&oacute;n sobre
<a href="faq5.html#Building">C&oacute;mo crear un n&uacute;cleo
personalizado</a>.

<p>
<a name="VerboseBoot"></a>
<h2>5.6 - C&oacute;mo obtener m&aacute;s informaci&oacute;n durante el
arranque.</h2>

La obtenci&oacute;n de una salida con m&aacute;s informaci&oacute;n
puede ser muy &uacute;til cuando se est&aacute; intentando depurar
problemas durante el arranque.  Por ejemplo, si se tiene problemas con
un disco de inicio que no arranca y se necesita m&aacute;s
informaci&oacute;n, basta con reiniciar y, desde el punto de
inserci&oacute;n <tt>boot&gt;</tt>, arrancar con <tt>boot -c</tt>.  Esto
nos llevar&aacute;s al punto de inserci&oacute;n <tt>UKC&gt;</tt>, y
desde ah&iacute;:

<blockquote><pre>
UKC&gt; <strong>verbose</strong>
autoconf verbose enabled
UKC&gt; <strong>quit</strong>
</pre></blockquote>

<p>
Ahora la informaci&oacute;n que aparecer&aacute; durante el arranque
ser&aacute; muy amplia.

<p>
<a name="config"></a>
<h2>5.7 - Uso de config(8) para efectuar cambios en el binario del
n&uacute;cleo.</h2>

<p>
Las opciones <b>-e</b> y <b>-u</b> de la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>
pueden ser muy &uacute;tiles y con ellas se puede evitar malgastar
tiempo compilando el n&uacute;cleo.  El indicador <b>-e</b> nos permite
entrar en el punto de inserci&oacute;n de UKC de un sistema en
ejecuci&oacute;n.  Los cambios aplicados surtir&aacute;n efecto la
pr&oacute;xima vez que se reinicie el sistema.  El indicador <b>-u</b>
comprueba si se ha llevado a cabo alg&uacute;n cambio en el
n&uacute;cleo en ejecuci&oacute;n durante el arranque, o sea si se ha
usado la orden <b>boot -c</b> para entrar en el punto de
inserci&oacute;n de UKC durante el arranque del sistema.

<p>
El siguiente ejemplo se muestra la desactivaci&oacute;n de los
dispositivos ep* en el n&uacute;cleo.  Por seguridad se debe usar la
opci&oacute;n <b>-o</b> que graba los cambios en el fichero que se
especifique.  Por ejemplo, <strong>config -e -o bsd.new /bsd</strong>,
grabar&aacute; los cambios en bsd.new.  En el siguiente ejemplo no se
usa la opci&oacute;n <b>-o</b>, y por lo tanto se ignorar&aacute;n los
cambios y no se grabar&aacute;n en el fichero binario del n&uacute;cleo.
Para m&aacute;s informaci&oacute;n relacionada con mensajes de error y
de aviso, v&eacute;ase la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>.

<blockquote><pre>
$ <strong>sudo config -e /bsd</strong>
OpenBSD 3.4 (GENERIC) #18: Wed Sep 17 03:34:47 MST 2003
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
warning: no output file specified
Enter 'help' for information
ukc&gt; ?
        help                            Command help list
        add         dev                 Add a device
        base        8|10|16             Base on large numbers
        change      devno|dev           Change device
        disable     attr val|devno|dev  Disable device
        enable      attr val|devno|dev  Enable device
        find        devno|dev           Find device
        list                            List configuration
        lines       count               # of lines per page
        show        [attr [val]]        Show attribute
        exit                            Exit, without saving changes
        quit                            Quit, saving current changes
        timezone    [mins [dst]]        Show/change timezone
        nmbclust    [number]            Show/change NMBCLUSTERS
        cachepct    [number]            Show/change BUFCACHEPERCENT
        nkmempg     [number]            Show/change NKMEMPAGES
        shmseg      [number]            Show/change SHMSEG
        shmmaxpgs   [number]            Show/change SHMMAXPGS
ukc&gt; <strong>list</strong>
  0 audio* at sb0|sb*|gus0|pas0|sp0|ess*|wss0|wss*|ym*|eap*|eso*|sv*|neo*|cmpci*
|clcs*|clct*|auich*|autri*|auvia*|fms*|uaudio*|maestro*|esa*|yds*|emu* flags 0x0
  1 midi* at sb0|sb*|opl*|opl*|opl*|opl*|ym*|mpu*|autri* flags 0x0
  2 nsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  3 nsphyter* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|
vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep
*|ep*|ep* phy -1 flags 0x0
  4 qsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  5 inphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  6 iophy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  7 eephy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  8 exphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
[...snip...]
ukc&gt; <strong>disable ep</strong>
 67 ep0 disabled
 68 ep* disabled
 69 ep* disabled
155 ep0 disabled
156 ep0 disabled
157 ep* disabled
158 ep* disabled
210 ep* disabled
ukc&gt; <strong>quit</strong>
not forced
</pre></blockquote>

<p>
En el ejemplo anterior, se han desactivado en el n&uacute;cleo todos los
dispositivos ep*, y ya no se sondear&aacute;n.  Es posible que en
alg&uacute;n caso en el que se haya usado el punto de inserci&oacute;n
de UKC durante el arranque, mediante <b>boot -c</b>, el usuario necesite
grabar los cambios de forma permanente.  Para ello deber&aacute; usar la
opci&oacute;n <b>-u</b>.  En el ejemplo siguiente se ha arrancado la
m&aacute;quina en el punto de inserci&oacute;n de UKC, y se ha
desactivado el dispositivo wi(4).  Como los cambios realizados mediante
<b>boot -c</b> NO son permamentes, hay que grabarlos.  En este ejemplo,
los cambios realizados desde <b>boot -c</b>, se grabar&aacute;n en un
nuevo fichero binario del n&uacute;cleo, <tt>bsd.new</tt>.

<blockquote><pre>
$ <strong>sudo config -e -u -o bsd.new /bsd</strong>
OpenBSD 3.3 (GENERIC) #44: Sat Mar 29 13:22:05 MST 2003
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
Processing history...
105 wi* disabled
106 wi* disabled
Enter 'help' for information
ukc&gt; <strong>quit</strong>
</pre></blockquote>

<p>
<a name="buildprobs"></a>
<h2>5.8 - Problemas comunes durante la compilaci&oacute;n del
sistema</h2>

<a name="sig11"></a>
<h3>5.8.1 - El proceso de compilaci&oacute;n se para con un error
&quot;<i>Signal 11</i>&quot;</h3>

<p>
La compilaci&oacute;n de OpenBSD y de otros programas desde el
c&oacute;digo fuente es una tarea que fuerza al <i>hardware</i> mucho
m&aacute;s que otros procesos, y que conlleva un uso intensivo de CPU,
disco y memoria.  En consecuencia, si el <i>hardware</i> tiene
alg&uacute;n problema, el momento m&aacute;s normal para que aparezca es
durante la compilaci&oacute;n del sistema.  Los fallos de <i>Signal
11</i> est&aacute;n causados <i>generalmente</i> por problemas de
<i>hardware</i>, que muy frecuentemente son debidos a problemas de
memoria, aunque tambi&eacute;n se pueden deber a la CPU, la placa base o
problemas de recalentamiento.  El sistema puede estar muy estable para
otras tareas, pero incapaz de compilar ciertos programas.

<p>
Lo mejor en estos casos es reparar o sustituir los componentes que
causan el problema, ya que los problemas pueden aparecer de otras formas
en el futuro.  Si tenemos un equipo que deseamos utilizar y que no causa
ning&uacute;n otro problema aparte del mencionado, podemos instalar una
versi&oacute;n preliminar o final.

<p>
Para m&aacute;s informaci&oacute;n, v&eacute;ase el documento de
preguntas frecuentes sobre
<a href="http://www.bitwizard.nl/sig11/">Sig11</a>.

<a name="snake"></a>
<h3>5.8.2 - <kbd>make build</kbd> falla con el mensaje &quot;<i>cannot
open output file snake: is a directory</i>&quot;</h3>

<p>
Esto es el resultado de dos errores distintos:

<ul>
<li><b>No hemos bajado o actualizado correctamente el &aacute;rbol de
CVS.</b>  Cuando se realiza una operaci&oacute;n <kbd>checkout</kbd> de
CVS, hay que usar la opci&oacute;n <tt>-P</tt>;  y cuando se actualiza
el &aacute;rbol de fuentes con CVS, debemos usar las opciones
<tt>-Pd</tt> de la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1"
>cvs(1)</a>,
tal y como se explica en la <a href="../../es/anoncvs.html">gu&iacute;a
de anoncvs</a>, en la <a href="upgrade-minifaq.html">gu&iacute;a de
actualizaci&oacute;n</a> y en la
<a href="faq8.html#CVS">secci&oacute;n 8</a> de estos documentos.  El
uso de estas opciones asegura que los nuevos directorios son
a&ntilde;adidos y eliminados del &aacute;rbol seg&uacute;n va
evolucionando OpenBSD.

<li><b>No hemos creado correctamente el directorio <tt>obj</tt> antes de
la compilaci&oacute;n.</b>  No se puede compilar el &aacute;rbol de
fuentes sin un directorio <tt>/usr/obj</tt>.
</ul>

<p>
Es importante seguir las instrucciones con cuidado cuando se est&eacute;
<a href="../../es/anoncvs.html">bajando o actualizando</a> el
c&oacute;digo fuente y se vaya a
<a href="upgrade-minifaq.html">compilar</a> el &aacute;rbol de fuentes.


<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq4.html">[Cap&iacute;tulo 4 - Gu&iacute;a de instalaci&oacute;n]</a>
<a href="faq6.html">[Cap&iacute;tulo 6 - Redes]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq5.html,v 1.90 ]<br>
$Translation: faq5.html,v 1.55 2004/01/04 19:59:59 horacio Exp $<br>
$OpenBSD: faq5.html,v 1.48 2004/01/04 22:23:57 horacio Exp $
</small>
</body>
</html>
