<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>7 - Controles de pantalla y teclado</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq6.html">[Secci&oacute;n 6 - Redes]</a>
<a href="faq8.html">[Secci&oacute;n 8 - Preguntas generales]</a>
</font>

<h1><font color="#e00000">7 - Controles de pantalla y
teclado</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#Keyboard">7.1 - &iquest;C&oacute;mo puedo reasignar el
mapa del teclado? (wscons)</a>
<li><a href="#ConsoleMouse">7.2 - &iquest;Existe algo parecido a gpm en
OpenBSD?</a>
<li><a href="#ConsoleClear">7.3 - &iquest;C&oacute;mo refresco la
consola cada vez que un usuario abandona el sistema?</a>
<li><a href="#Scrollback">7.4 - C&oacute;mo acceder a la memoria
intermedia para retroceder p&aacute;ginas en la consola.
(alpha/macppc/i386)</a>
<li><a href= "#SwitchConsole">7.5 - &iquest;Por qu&eacute; las teclas F9
a F12 ya no cambian de consola en i386?  (i386)</a>
<li><a href="#80x50">7.6 - &iquest;C&oacute;mo puedo usar una
resoluci&oacute;n de consola de 80x50? (i386)</a>
<li><a href="#SerCon">7.7 - &iquest;C&oacute;mo se puede usar una
consola serie?</a>
<li><a href="#Blanker">7.8 - &iquest;C&oacute;mo puedo dejar la consola
en blanco? (wscons)</a>
</ul>

<hr>

<br>
<p>
<a name="Keyboard"></a>
<h2>7.1 - &iquest;C&oacute;mo puedo reasignar el mapa del teclado?
<i>(wscons)</i></h2>

<p>
Las plataformas que usan el control de consola
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&amp;sektion=4">wscons(4)</a>
son: <a href="../../es/alpha.html">alpha</a>,
<a href="../../es/hppa.html">hppa</a>,
<a href="../../es/i386.html">i386</a>,
<a href="../../es/macppc.html">macppc</a>,
<a href="../../es/sparc.html">sparc</a>, y
<a href="../../es/sparc64.html">sparc64</a>.

<p>
Con las consolas wscons(4) la mayor&iacute;a de opciones se pueden
controlar mediante la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl&amp;sektion=8">wsconsctl(8)</a>.
Por ejemplo, para cambiar las asignaciones del teclado con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl&amp;sektion=8">wsconsctl(8)</a>
al teclado espa&ntilde;ol, se ejecutar&iacute;a la siguiente orden:

<blockquote>
<pre>
# <strong>wsconsctl -w keyboard.encoding=es</strong>
</pre>
</blockquote>

<p>
En el siguiente ejemplo, reasignaremos la tecla &quot;Bloq
May&uacute;s&quot; para que sea &quot;Control L&quot;:

<blockquote>
<pre>
# <strong>wsconsctl -w keyboard.map+=&quot;keysym Caps_Lock = Control_L&quot;</strong>
</pre>
</blockquote>


<p>
<a name="ConsoleMouse"></a>
<h2>7.2 - &iquest;Existe algo parecido a gpm en OpenBSD?</h2>

<p>
Para las plataformas <a href="../../es/alpha.html">alpha</a> y
<a href="../../es/i386.html">i386</a>, OpenBSD dispone de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsmoused&amp;sektion=8&amp;arch=i386">wsmoused(8)</a>,
un porte de moused(8) de FreeBSD.  Se puede activar de forma
autom&aacute;tica para que arranque durante el inicio del sistema,
activando la l&iacute;nea apropiada en el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.conf&amp;sektion=8">rc.conf(8)</a>.

<p>
<a name="ConsoleClear"></a>
<h2>7.3 - &iquest;C&oacute;mo refresco la consola cada vez que salga un
usuario?</h2>

<p>
Para refrescar la consola hay que a&ntilde;adir una l&iacute;nea al
fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gettytab&amp;sektion=5">/etc/gettytab(5)</a>,
cambiando la secci&oacute;n

<blockquote>
<pre>
P|Pc|Pc console:\
        :np:sp#9600:
</pre>
</blockquote>

<p>
y a&ntilde;adiendo la l&iacute;nea <tt>&quot;:cl=\E[H\E[2J:</tt>&quot; al
final, de modo que quede como lo siguiente:

<blockquote>
<pre>
P|Pc|Pc console:\
        :np:sp#9600:\
	:cl=\E[H\E[2J:
</pre>
</blockquote>

<p>
<a name="Scrollback"></a>
<h2>7.4 - C&oacute;mo acceder a la memoria intermedia para retroceder
p&aacute;ginas en la consola <i>(i386 y algunos alpha)</i>.</h2>

<p>
En algunas plataformas, OpenBSD dispone de una funcionalidad para
acceder a la memoria de retroceso de p&aacute;ginas.  Esto nos
permitir&aacute; ver informaci&oacute;n que ya haya pasado por la
pantalla.  Para poder retroceder y avanzar en la memoria, se usan las
combinaciones del teclado <tt>[SHIFT]+[ReP&aacute;g]</tt> y
<tt>[SHIFT]+[AvP&aacute;g]</tt>

<p>
La memoria de retroceso predeterminada, o el n&uacute;mero de
p&aacute;ginas de memoria que se puede retroceder para ver, es 8.
Esto es una funcionalidad del controlador
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vga&amp;sektion=4">vga(4)</a>,
y as&iacute; no tendr&aacute; que trabajar sin una tarjeta VGA en
ninguna plataforma (muchos sistemas Alpha tienen v&iacute;deo TGA).


<a name="SwitchConsole"></a>
<h2>7.5 - &iquest;C&oacute;mo cambio entre consolas?
<i>(i386 y algunos Alpha)</i></h2>

<p>
En los sistemas i386 y alpha con tarjetas
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vga&amp;sektion=4">vga(4)</a>,
OpenBSD dispone de seis terminales virtuales preconfiguradas, de
/dev/ttyC0 hasta /dev/ttyC5.  ttyC4 est&aacute; reservada para el
sistema gr&aacute;fico X Window, dejando las restantes cinco terminales
para consola de texto.  Se puede mover entre ellas usando
<tt>[CTRL]+[ALT]+[F1]</tt>, <tt>[CTRL]+[ALT]+[F2]</tt>,
<tt>[CTRL]+[ALT]+[F3]</tt>, <tt>[CTRL]+[ALT]+[F4]</tt> y
<tt>[CTRL]+[ALT]+[F6]</tt>.

<p>
El entorno gr&aacute;fico X usa ttyC4, <tt>[CTRL]+[ALT]+[F5]</tt>.
Desde este entorno, las combinaciones de teclado
<tt>[CTRL]+[ALT]+[F</tt><i>n</i><tt>]</tt> nos llevan a las pantallas de
texto; <tt>[CTRL]+[ALT]+[F5]</tt> nos devuelve al entorno
gr&aacute;fico.

<p>
Para tener m&aacute;s consolas virtuales que las preconfiguradas, se
puede usar la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconscfg&amp;sektion=8">wsconscfg(8)</a>
para crear pantallas para ttyC6, ttyC7 y consiguientes.  Por ejemplo,

<blockquote>
<pre>
wsconscfg -t 80x25 6
</pre>
</blockquote>

crea una terminal virtual para ttyC6, a la que se se accede mediante
<tt>[CTRL]+[ALT]+[F7]</tt>.  Si queremos que esta pantalla adicional
contin&uacute;e configurada despu&eacute;s de reiniciar el sistema, no
hay que olvidarse de a&ntilde;adir esta orden al fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.local&amp;sektion=8"><tt>rc.local(8)</tt></a>.

<p>
N&oacute;tese que en la nueva consola virtual no se obtendr&aacute; un
punto de ingreso <tt>login:</tt> a menos que la configuremos con el
valor &quot;on&quot; en el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ttys&amp;sektion=5"><tt>/etc/ttys(5)</tt></a>,
y se reinicie el sistema a continuaci&oacute;n o se env&iacute;e una
se&ntilde;al HUP a
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=init&amp;sektion=8">init(8)</a>
usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kill&amp;sektion=1">kill(1)</a>.


<a name="80x50"></a>
<h2>7.6 - &iquest;C&oacute;mo puedo usar una resoluci&oacute;n de
consola de 80x50? <i>(i386)</i></h2>

<p>
Los usuarios de i386 suelen tener una pantalla en consola de 25
l&iacute;neas y 80 caracteres por l&iacute;nea.  Sin embargo muchas
tarjetas de v&iacute;deo VGA pueden mostrar una resoluci&oacute;n
m&aacute;s alta de hasta 50 l&iacute;neas y 80 caracteres por
l&iacute;nea.

<p>
Para ello hay que cargar primero una fuente con soporte para la
resoluci&oacute;n que se desee, usando la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsfontload&amp;sektion=8">wsfontload(8)</a>.
La pantalla de texto est&aacute;ndar de 80x25 usa fuentes de 8x16
<i>pixels</i>;  para doblar el n&uacute;mero de l&iacute;neas <!-- la
resoluci&oacute;n vertical --> tendremos que usar fuentes de 8x8
<i>pixels</i>.

<p>
A continuaci&oacute;n tendremos que eliminar y volver a crear una
<a href="#SwitchConsole">consola virtual</a> con la resoluci&oacute;n de
pantalla que deseemos tener, usando la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconscfg&amp;sektion=8">wsconscfg(8)</a>.

<p>
Esto puede hacerse autom&aacute;ticamente durante el arranque,
a&ntilde;adiendo las siguientes l&iacute;neas al final del fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.local&amp;sektion=8"><tt>rc.local</tt>(8)</a>:

<blockquote>
<pre>
wsfontload -h 8 -e ibm /usr/share/misc/pcvtfonts/vt220l.808
wsconscfg -dF 5
wsconscfg -t 80x50 5
</pre>
</blockquote>

<p>
Como con cualquier otra modificaci&oacute;n del sistema de
configuraci&oacute;n, antes es recomendable leer las p&aacute;ginas del
manual correspondientes para llegar a entender cu&aacute;l es la
funci&oacute;n de estas &oacute;rdenes.

<p>
La primera l&iacute;nea carga la fuente de 8x8.  La segunda elimina la
pantalla virtual n&uacute;mero 5 (a la que se accede mediante la
combinaci&oacute;n de teclado <tt>[CTRL]+[ALT]+[F6]</tt>).  La tercera
l&iacute;nea crea una nueva pantalla virtual n&uacute;mero 5 con una
resoluci&oacute;n de 50 l&iacute;neas y 80 caracteres por l&iacute;nea.
De este modo veremos la pantalla principal, y las tres pantallas
virtuales siguientes, con la resoluci&oacute;n est&aacute;ndar de 80x25,
y una nueva pantalla virtual de 80x50, la n&uacute;mero 5, accesible
mediante la combinaci&oacute;n de teclado <tt>[CTRL]+[ALT]+[F6]</tt>,
con la nueva resoluci&oacute;n.

<p>
Recu&eacute;rdese que la combinaci&oacute;n <tt>[CTRL]+[ALT]+[F1]</tt>
corresponde a la pantalla n&uacute;mero 0 (ttyC0).  Para alterar las
otras pantallas basta con repetir los pasos de eliminaci&oacute;n y
adici&oacute;n para cada una de las pantallas que se desee tener con una
resoluci&oacute;n de 80x50.

<p>
Por regla general evitaremos tocar la pantalla n&uacute;mero 4 (ttyC4,
<tt>[CTRL]+[ALT]+[F5]</tt>), que es la que usa X como pantalla
gr&aacute;fica.  Tampoco es posible cambiar la resoluci&oacute;n del
dispositivo primario de consola (o sea, ttyC0).

<p>
Todas estas &oacute;rdenes se pueden ejecutar desde la l&iacute;nea de
&oacute;rdenes como superusuario o, mejor a&uacute;n, usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sudo&amp;sektion=8">
sudo(8)</a>.

<p>
<b>Nota:  esto no funcionar&aacute; en todas las tarjetas de
v&iacute;deo.</b>  No todas las tarjetas de v&iacute;deo tienen soporte
para las fuentes que requiere
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&amp;sektion=4">wscons(4)</a>
para conseguir el modo de texto de 80x50.  En estos casos la
&uacute;nica forma de obtener un modo distinto es en el modo
gr&aacute;fico de X.


<a name="SerCon"></a>
<h2>7.7 - &iquest;C&oacute;mo se puede usar una consola serie?</h2>

<p>
Algunas de las razones para querer usar una consola serie en un sistema
OpenBSD son:

<ul>
<li>Registrar la salida en consola (para documentaci&oacute;n).
<li>Gesti&oacute;n remota.
<li>Un f&aacute;cil mantenimiento de grandes cantidades de
m&aacute;quinas.
<li>Proveer una salida de dmesg &uacute;til desde m&aacute;quinas en las
que de otro modo ser&iacute;a dif&iacute;cil.
<li>Proveer una salida exacta de &quot;trace&quot; y &quot;ps&quot; en
caso de una ca&iacute;da del sistema para que los desarrolladores puedan
obtener informaci&oacute;n para solucionar el problema.
</ul>

<p>
OpenBSD dispone de soporte para consolas serie en la mayor&iacute;a de
las plataformas, aunque las diferencias entre las distintas plataformas
son grandes.

<p>
Trabajar con interfaces serie NO es una tarea f&aacute;cil;  a menudo se
necesitar&aacute;n cables poco usuales, y los puertos no siguen un mismo
est&aacute;ndar en las distintas m&aacute;quinas... en algunos casos ni
siquiera son consistentes en una misma m&aacute;quina.  Se asume que el
usuario sabe cu&aacute;l es el cable apropiado para conectar su
m&aacute;quina y el dispositivo que vaya a actuar como terminal serie.
Una tutorial sobre interfaces serie es algo que va m&aacute;s
all&aacute; del prop&oacute;sito de este art&iacute;culo, aunque podemos
dar una pista:  que los extremos del cable se puedan enchufar no quiere
decir que vaya a funcionar.

<p>
<a name="SerContty"></a>
<h3>Cambios en <tt>/etc/ttys</tt></h3>

<p>
El proceso para conseguir una consola serie funcional en un sistema
OpenBSD se divide en dos partes.  Primero es necesario que OpenBSD use
el puerto serie como una consola en status y en modo mono-usuario.  Esta
parte var&iacute;a mucho seg&uacute;n la plataforma.  Segundo, hay que
activar el puerto serie para que se use como un terminal interactivo, de
modo que un usuario pueda ingresar en &eacute;l cuando se est&eacute;
ejecutando en modo multi-usuario.  Esta parte es muy parecida en todas
las plataformas y aqu&iacute; la explicaremos en detalle.

<p>
Las sesiones de terminal se controlan mediante el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ttys&amp;sektion=5"><tt>/etc/ttys</tt></a>.
Antes de que OpenBSD muestre el punto de ingreso
&quot;<tt>login:</tt>&quot; en un dispositivo, tiene que ser activado en
<tt>/etc/ttys</tt> (al fin y al cabo existen otros usos para un puerto
serie distintos del de un terminal).  En las plataformas que tienen
conectado un teclado y un monitor como consola, el terminal serie se
encuentra desactivado por definici&oacute;n.  Tomaremos la plataforma
i386 como ejemplo.  Para &eacute;sta hay que cambiar la l&iacute;nea:

<pre>
     tty00   "/usr/libexec/getty std.9600"   unknown off
</pre>

<p>
por esta otra:

<pre>
     tty00   "/usr/libexec/getty std.9600"   vt100   on secure
</pre>

<p>
En este caso <tt>tty00</tt> es el puerto serie que usamos como consola.
La clave &quot;<tt>on</tt>&quot; activa
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&amp;sektion=8"><i>getty</i></a>
para ese puerto serie, de forma que presente un punto de ingreso
&quot;<tt>login:</tt>&quot;;  la clave &quot;<tt>secure</tt>&quot;
permite el ingreso como superusuario (uid 0) en esta consola (que puede
no ser lo que deseamos hacer);  y la clave &quot;<tt>9600</tt>&quot; es
la velocidad en baudios del terminal.  N&oacute;tese que es posible usar
una consola serie para la instalaci&oacute;n sin llevar a cabo este
paso, ya que el sistema se encuentra en modo mono-usuario y no usar
<i>getty</i> para el ingreso.

<p>
En algunas plataformas y con algunas configuraciones, si s&oacute;lo se
dispone de una consola serie, es necesario iniciar el sistema en modo
mono-usuario para que este cambio sea efectivo.

<p>
<h3>i386</h3>

<p>
Para que el proceso de arranque use el puerto serie como una consola,
hay que crear o modificar el fichero
<tt><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot.conf&amp;sektion=8&amp;arch=i386">/etc/boot.conf</a></tt>
de modo que incluya la siguiente l&iacute;nea:

<pre>
     set tty com0
</pre>

<p>
(asumiento que queramos usar el primer puerto serie como consola).  La
velocidad en baudios predeterminada es de 9600bps, y se puede cambiar
con una l&iacute;nea en <tt>/etc/boot.conf</tt> usando la opci&oacute;n
<tt>stty</tt>.  Este fichero se coloca en el controlador de arranque,
que podr&iacute;a ser el disquete de instalaci&oacute;n, o se puede
puede invocar la orden desde el punto de inserci&oacute;n
<tt>boot&gt;</tt> desde el
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&amp;sektion=8&amp;arch=i386">cargador de arranque de segunda etapa de OpenBSD</a>
para el uso de la consola serie para una sola vez (o por primera vez).

<p>
<h4>Notas para i386:</h4>

<ul>
<li>OpenBSD enumera los puertos serie empezando por <tt>tty00</tt> y
DOS/Windows empezando por <i>COM1</i>.  Es preciso recordar que
<tt>tty02</tt> es <i>COM3</i>, no <i>COM2</i>.

<li>Algunos sistemas pueden ser capaces de operar sin una tarjeta de
v&iacute;deo en la m&aacute;quina, pero no todos... muchos sistemas
consideran esto como una condici&oacute;n de error.  Algunas
m&aacute;quinas incluso no funcionar&aacute;n sin un teclado conectado.

<li>Algunos sistemas i386 son capaces de usar un puerto serie como
dispositivo de consola.  Los resultados pueden variar (es posible que
este puerto no est&eacute; disponible para el sistema operativo
despu&eacute;s de arrancar, y en este caso ser&aacute; necesaria una
monitorizaci&oacute;n usando DOS puertos serie).

<li>Los ordenadores compatibles con los PC no est&aacute;n
dise&ntilde;ados para funcionar desde una consola serie, a diferencia de
algunas otras plataformas.  Aun aquellos sistemas con soporte para una
consola serie suelen tenerla como una opci&oacute;n de
configuraci&oacute;n de la BIOS y, si la informaci&oacute;n sobre la
configuraci&oacute;n se corrompiera, el sistema empezar&iacute;a a
buscar de nuevo un monitor y un teclado est&aacute;ndar.  Es
recomendable tener un monitor y un teclado a mano para los sistemas i386
en caso de emergencia.

<li>Hay que editar y modificar <tt>/etc/ttys</tt> como se ha explicado
<a href="#SerContty">anteriormente</a>.
</ul>

<p>
<h3>SPARC y UltraSPARC</h3>

<p>
Estas m&aacute;quinas est&aacute;n dise&ntilde;adas para que se puedan
mantener completamente con una consola serie.  Basta con desenchufar el
teclado y el monitor de la m&aacute;quina y el sistema se ejecuta como
serie.

<p>
<h4>Notas para SPARC y UltraSPARC</h4>

<ul>
<li>El nombre de los puertos serie en SPARC es <tt>ttya</tt>,
<tt>ttyb</tt>, etc.

<li>A diferencia de otras plataformas, no es necesario realizar
ning&uacute;n cambio en el fichero <tt>/etc/ttys</tt> para usar una
consola serie.

<li>Los sistemas SPARC/UltraSPARC interpretan una se&ntilde;al BREAK en
el puerto de la consola como si fuera una orden STOP-A, y devuelven el
sistema al punto de inserci&oacute;n de Forth, parando en ese punto
cualquier aplicaci&oacute;n y sistema operativo.  Esto es &uacute;til
cuando es lo que se desea hacer, pero algunos terminales serie y algunos
dispositivos de conmutaci&oacute;n RS-232 env&iacute;an algo a la
m&aacute;quina que &eacute;sta interpreta como una se&ntilde;al BREAK,
parando la m&aacute;quina.  Es preciso verificarlo antes de usarlo para
algo productivo.

<li>Si hay un teclado y un monitor conectados, todav&iacute;a es posible
forzar el uso de la consola serie mediante las siguientes &oacute;rdenes
en el punto de inserci&oacute;n <tt>ok</tt>:

<pre>
    ok <b>setenv input-device ttya</b>
    ok <b>setenv output-device ttya</b>
    ok <b>reset</b>
</pre>

<p>
Si el teclado y el monitor (ttyC0) est&aacute;n activos en
<tt>/etc/ttys</tt> (v&eacute;ase <a href="#SerContty">arriba</a>),
tambi&eacute;n se puede usar el teclado y el monitor en X.  Algunas
combinaciones de <i>hardware</i> de SPARC tienen problemas con el
teclado en OpenBSD 3.2 y en versiones anteriores, pero deber&iacute;an
funcionar bien en OpenBSD 3.3.
</ul>

<p>
<h3>MacPPC</h3>

<p>
Las m&aacute;quinas MacPPC se configuran para consola serie a
trav&eacute;s de OpenFirmware.  Hay que usar las &oacute;rdenes:

<pre>
    ok <b>setenv output-device scca</b>
    ok <b>setenv input-device scca</b>
    ok <b>reset-all</b>
</pre>

<p>
y configurar la consola serie a 57600bps, 8N1.

<p>
<h4>Notas para MacPPC</h4>

<ul>
<li>Desafortunadamente, no es posible usar la consola serie directamente
en la mayor&iacute;a de los MacPPC.  Aunque la mayor&iacute;a de estas
m&aacute;quinas tienen <i>hardware</i> serie, no es accesible desde el
exterior.  Pero por suerte hay unas pocas compa&ntilde;&iacute;as que
tienen dispositivos adicionales para varios modelos de Macintosh, que
har&aacute;n que este puerto est&eacute; disponible para el uso como
consola serie (u otros usos).  Se puede encontrar informaci&oacute;n al
respecto usando un motor de b&uacute;squeda en Internet mediante las
palabras claves <i>&quot;Macintosh internal serial port&quot;</i>.

<li>Hay que cambiar <tt>tty00</tt> en <tt>/etc/ttys</tt> a <tt>on</tt> y
configurar la velocidad a 57600 en lugar de la predeterminada de 9600,
tal y como se ha explicado <a href="#SerContty">anteriormente</a>, en
modo mono-usuario antes de un arranque multiusuario y poder disponer de
una consola serie funcional.
</ul>

<p>
<h3>Mac68k</h3>

<p>
La consola serie se selecciona en el programa <i>Booter</i>, desde el
men&uacute; &quot;<tt>Options</tt>&quot; y el submen&uacute;
&quot;<tt>Serial Ports</tt>&quot;.  Hay que pulsar sobre el bot&oacute;n
&quot;<tt>Serial Console</tt>&quot; y luego escoger el puerto del
m&oacute;dem o el de la impresora.  Tambi&eacute;n se necesita un cable
de m&oacute;dem o impresora de Macintosh para conectarlo a los puertos
serie de Mac.  Si se desea que &eacute;ste sea el modo predeterminado,
hay que indicarle al programa <i>Booter</i> que guarde las opciones.

<p>
<h4>Notas para Mac68k</h4>

<ul>
<li>El puerto del m&oacute;dem es <tt>tty00</tt>, y el puerto de la
impresora es <tt>tty01</tt>.

<li>Mac68k no aparece en su puerto serie hasta que se le llama, por lo
que no se ver&aacute; ninguna se&ntilde;al en el puerto serie de Mac
hasta que el proceso de arranque de OpenBSD haya iniciado.

<li>Hay que activar el puerto (<tt>tty00</tt> o <tt>tty01</tt>) como se
ha indicado <a href="#SerContty">anteriormente</a>.
</ul>


<a name="Blanker"></a>
<h2>7.8 - &iquest;C&oacute;mo puedo dejar la consola en blanco?
(wscons)</h2>

<p>
Para dejar la consola en blanco despu&eacute;s de un cierto periodo de
inactividad sin usar X, hay que modificar las siguientes variables de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&amp;sektion=4">wscons(4)</a>:

<ul>
<li><b><tt>display.vblank</tt></b>, configurada con el valor <tt>on</tt>
desactiva el pulso de sincronizaci&oacute;n vertical, lo que hace que
muchos monitores entren en modo &quot;energy saver&quot;.  En este modo
el tiempo necesario para que la pantalla vuelva a su estado anterior es
mayor, pero tambi&eacute;n se reduce el consumo de energ&iacute;a y el
calentamiento de los monitores m&aacute;s nuevos;  si se configura con
el valor <tt>off</tt>, el monitor seguir&aacute; recibiendo los pulsos
de sincronizaci&oacute;n vertical y horizontal, por lo que la vuelta al
estado anterior de la pantalla ser&aacute; casi instant&aacute;nea.

<li><b><tt>display.screen_off</tt></b> determina el tiempo que debe
permanecer en blanco en mil&eacute;simas de segundo o sea, un valor de
60000 configurar&aacute; el tiempo l&iacute;mite en un minuto.

<li><b><tt>display.kbdact</tt></b> determina si la actividad del teclado
debe o no restaurar la pantalla al estado anterior.  Esto es lo
m&aacute;s deseable en la mayor&iacute;a de los casos.

<li><b><tt>display.outact</tt></b> determina si un producto de salida en
pantalla restaurar&aacute; o no la pantalla al estado anterior.
</ul>

<p>
Estas variables se pueden configurar desde la l&iacute;nea de
&oacute;rdenes usando la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl&amp;sektion=8">wsconsctl(8)</a>:

<pre>
     # <b>wsconsctl -w display.screen_off=60000</b>
     display.screen_off -&gt; 60000
</pre>

<p>
o se pueden configurar de forma permanente desde el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl.conf&amp;sektion=5"><tt>/etc/wsconsctl.conf</tt></a>
para que estos cambios sean efectivos a partir del siguiente arranque:

<pre>
     display.vblank=on               # &laquo;blanqueo&raquo; para la
                                     # sincronizaci&oacute;n vertical
     display.screen_off=600000       # tiempo m&aacute;ximo de la pantalla
                                     # en blanco de 10 minutos
     display.kbdact=on               # restaurar la pantalla con
                                     # una entrada del teclado
     display.outact=off              # restaurar la pantalla con
                                     # una salida en el monitor
</pre>

<p>
El &laquo;blanqueador&raquo; se activar&aacute; si cualquiera de las
variables <tt>display.kbdact</tt> o <tt>display.outact</tt> se
encuentran configuradas con el valor <tt>on</tt>.


<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq6.html">[Secci&oacute;n 6 - Redes]</a>
<a href="faq8.html">[Secci&oacute;n 8 - Preguntas generales]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq7.html,v 1.53 2003/07/23 01:53:01 nick Exp ]<br>
$Translation: faq7.html,v 1.36 2003/07/26 16:34:03 horacio Exp $<br>
$OpenBSD: faq7.html,v 1.34 2003/07/27 15:30:08 jufi Exp $
</small>
</body>
</html>
