<html>
<head>
<title>8.0 - Preguntas Generales</title>
<link rev="made"           href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2000 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238E">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">8.0 - Preguntas generales</font><hr></h2>
</p>
   
<p>
<ul><h3>Tabla de contenidos</h3>
<li><a href="faq8.html#8.1">8.1 - &iquest;Qu&eacute; significan esos
    avisos de Kerberos cuando ingreso por primera vez?</a></li>
<li><a href="faq8.html#8.2">8.2 - &iquest;C&oacute;mo puedo cambiar
    entre terminales virtuales?</a> (s&oacute;lo i386).</li>
<li><a href="faq8.html#8.3">8.3 - He olvidado mi contrase&ntilde;a...
     &iexcl;qu&eacute; puedo hacer!</a></li>  
<li><a href="faq8.html#8.4">8.4 - XWindows no arranca, muestra muchos
    mensajes de error.</a></li>
<li><a href="faq8.html#8.5">8.5 - &iquest;Qu&eacute; es CVS y
    c&oacute;mo se usa?</a></li>
<li><a href="faq8.html#8.6">8.6 - &iquest;Qu&eacute; es el &aacute;rbol
    de portes?</a></li>
<li><a href="faq8.html#8.7">8.7 - &iquest;Qu&eacute; son los
    paquetes?</a></li>
<li><a href="faq8.html#8.8">8.8 - &iquest;Existe alg&uacute;n modo de
    usar la disquetera si no estaba instalada durante el
    arranque?</a></li>
<li><a href="faq8.html#8.9">8.9 - El gestor de arranque de OpenBSD</a>
    <i>(espec&iacute;fico para i386)</i>.</li>
<li><a href="faq8.html#8.10">8.10 - C&oacute;mo usar S/Key en
    OpenBSD.</a></li>
<li><a href="faq8.html#8.11">8.11 - &iquest;Por qu&eacute; se retrasa
    el reloj en mi Macintosh?</a></li>
<li><a href="faq8.html#8.12">8.12 - &iquest;Funcionar&aacute; OpenBSD
    en m&aacute;quinas con multiprocesadores?</a></li>
<li><a href="faq8.html#8.13">8.13 - Obtengo errores de entrada/salida
    al intentar usar mis dispositivos de tty.</a>
<li><a href="faq8.html#8.14">8.14 - &iquest;D&oacute;nde puedo
    encontrar binarios de Netscape para OpenBSD?</a></li>
<li><a href="faq8.html#8.15">8.15 - &iquest;C&oacute;mo puedo usar el
    editor mg?</a></li>
<li><a href="faq8.html#8.16">8.16 - &iexcl;Ksh no lee mi
    <em>.profile</em>!</a></li>
<li><a href= "faq8.html#8.17">8.17 - &iquest;Por qu&eacute; se
    sobreescribe el fichero <em>/etc/motd</em> cuando lo
    modifico?</a></li>
<li><a href="faq8.html#8.18">8.18 - &iquest;Por qu&eacute;
    www.openbsd.org est&aacute; hospedado en un sistema Solaris?</a>
<li><a href= "faq8.html#8.19">8.19 - Tengo problemas con la
    detecci&oacute;n de dispositivos PCI en OpenBSD 2.8.</a>
</ul>
</p> 
<hr> 

<br>

<p>
<a name="8.1"></a>
<h2>8.1 - &iquest;Qu&eacute; Significan esos Avisos de Kerberos Cuando
Ingreso por Primera Vez?</h2>
</p>

<p>
<strong>Nota:</strong> Esta secci&oacute;n es obsoleta para aquellos
que hayan actualizado a <a href="../../es/stable.html">2.8-stable</a>
(parche: <a href="ftp://ftp.openbsd.org/pub/OpenBSD/patches/2.8/common/008_kerberos.patch">ftp://ftp.openbsd.org/pub/OpenBSD/patches/2.8/common/008_kerberos.patch</a>).
</p>

<p>
Al instalar por primera vez el sistema, es posible que vea un mensaje
de aviso parecido al siguiente:
</p>

<ul>
<kbd>
Warning: no Kerberos tickets issued.
</kbd>
</ul>

<p>
<strong>
ESTE AVISO NO ES RELEVANTE Y S&Oacute;LO DEBER&Iacute;A SER ELIMINADO
SI FUERA COMPLETAMENTE NECESARIO
</strong>
</p>

<p>
Como probablemente Vd. no habr&aacute; configurado Kerberos en su
sistema, no obtendr&aacute; ning&uacute;n &quot;ticket&quot; de
&eacute;ste.  Si tuviera Kerberos funcionando, entonces deber&iacute;a
verificar ese aviso.  Lea la <a href="faq10.html#10.11">secci&oacute;n
10.11 (&laquo;Configuraci&oacute;n de Kerberos&raquo;)</a> de las
Preguntas Frecuentes.  Si le molesta ese aviso y no va a usar nunca
Kerberos, lea aqu&iacute; c&oacute;mo librarse de &eacute;l para
siempre.

<ul>
<li>Aseg&uacute;rese de tener el c&oacute;digo fuente.</li>
<li>Edite el fichero /usr/share/mk/bsd.own.mk y escriba el valor 'no'
    en KERBEROS, o cree un fichero /etc/mk.conf que lo haga.</li>
<li>cd /usr/src/usr.bin/login ; make clean ; make ; make install</li>
</ul>
</p>

<br>

<p>
<a name="8.2"></a>
<h2>8.2 - &iquest;C&oacute;mo puedo cambiar entre terminales
virtuales?</h2>
</p>

<p>
Simplemente pulsando <kbd>[ctrl] - [alt] - [un tecla de
funci&oacute;n]</kbd> (i386).
</p>

<p>
S&oacute;lo la arquitectura i386 tiene capacidad para terminales
virtuales.  Tambi&eacute;n puede usar los terminales virtuales mientras
est&eacute; en X.  Por ejemplo, si inici&oacute; X desde el terminal 1
y cambia al terminal 2 con [ctrl]-[alt]-[F2], X desaparecer&aacute; de
su pantalla y no reaparecer&aacute; cuando vuelva a cambiar al terminal
1.  Para volver a X debe pulsar [ctrl]-[alt]-[F5].
</p>

<br>

<p>
<a name="8.3"></a>
<h2>8.3 - He Olvidado mi contrase&ntilde;a... &iquest;qu&eacute; puedo
hacer?</h2>
</p>

<p>
La puede recuperar siguiendo los pasos a continuaci&oacute;n

<ol>
<li>Arranque en modo monousuario.
    En la arquitectura i386, escriba desde el punto de arranque:
<ul>
   <kbd>boot&gt; <b>boot -s</b></kbd>
</ul>
<li>Monte los controladores:
<ul>
   <kbd>bsd# <b>fsck -p / && mount -u /</b></kbd>
</ul>
<li>Si /usr no es la misma partici&oacute;n que / (no deber&iacute;a
    serlo), entonces también tendr&aacute; que montarlo:
<ul>
   <kbd>bsd# <b>fsck -p /usr && mount /usr</b></kbd>
</ul>

<li>Ejecute <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&sektion=1&format=html">passwd(1)</a>;
<li>arranque en modo multiusuario... &iexcl;y <i>recuerde</i> su
    contrase&ntilde;a!
</ol>
</p>

<p>
<a name="8.4"></a>
<h2>8.4 - XWindows no arranca, muestra muchos mensajes de error.</h2>
</p>

<p>
Si tiene totalmente configurado X y est&aacute; usando un fichero
XF86Config que sabe con seguridad que es correcto, entonces es posible
que el problema se encuentre en machdep.allowaperture.
Aseg&uacute;rese tambi&eacute;n de que
</p>

<ul>
<pre>
option XSERVER
option APERTURE
</pre>
</ul>

<p>
est&eacute;n en la configuraci&oacute;n del n&uacute;cleo de su sistema
(LOS DOS se encuentran en el n&uacute;cleo GENERIC).
</p>

<p>
Para solucionarlo, edite el fichero <i>/etc/sysctl.conf</i> para
permitir que X pueda acceder al controlador de apertura;  escriba
<b>machdep.allowaperture=1</b>.
Si durante la instalaci&oacute;n hubiera contestado correctamente a la
pregunta sobre si quer&iacute;a tener XWindows funcionando, esta
configuraci&oacute;n aparecer&iacute;a por definici&oacute;n.  OpenBSD
requiere que todos los servidores de X tengan activado el acceso al
controlador de apertura, debido a que controla el acceso a los puertos
E/S en las placas de v&iacute;deo.
</p>

<p>
Si tiene otros problemas con X en i386, consulte el documento de
Preguntas Frecuentes de XFree86 en
<a href="http://www.xfree86.org/FAQ/">http://www.xfree86.org/FAQ/</a>.
</p>

<p>
<a name="8.5"></a>
<h2>8.5 - &iquest;Qu&eacute; es CVS y c&oacute;mo se usa?</h2>
</p>

<p>
CVS es el sistema que utiliza el Proyecto OpenBSD para controlar los
cambios al c&oacute;digo fuente.  CVS son las siglas de
&quot;Concurrent Versions System&quot; (&laquo;Sistema de Versiones
Concurrentes&raquo;).  Puede obtener m&aacute;s informaci&oacute;n
sobre CVS en
<a href="http://www.cyclic.com/">http://www.cyclic.com/</a>.
CVS puede ser utilizado por un usuario final para mantenerse
sincronizado con los cambios en los fuentes, y con los cambios en el
&aacute;rbol de portes.  Con CVS es muy f&aacute;cil bajarse los
fuentes a trav&eacute;s de uno de las muchas r&eacute;plicas de CVS del
Proyecto.
</p>


<h3>C&oacute;mo configurar su entorno de CVS inicial</h3>

<p>
Existen unas cuantas maneras para configurar su entorno inicial de CVS.
Primero necesitar&aacute; un repositorio local del &aacute;rbol de
fuentes con el que empezar.  Si dispone del CD de OpenBSD, est&aacute;
de suerte, porque contiene el repositorio de CVS para la versi&oacute;n
que haya adquirido.  Lo puede extraer desde su CD mediante uno de los
siguientes m&eacute;todos:
</p>

<p>
1) copie el &aacute;rbol desde el CD a su sistema (se asume que el CD
se encuentra montado en /mnt):
</p>

<ul>
<pre>
# <strong>mkdir /usr/src</strong>
# <strong>cd /mnt; cp -Rp CVS Makefile bin distrib etc games gnu \
include kerberosIV lib libexec lkm regress sbin share \
sys usr.bin usr.sbin /usr/src</strong>
</pre>
</ul>

<p>
2) O, de forma alternativa, use un montaje de uni&oacute;n con el CD en
un directorio para el que tenga permiso de escritura.  Tenga en cuenta
que el c&oacute;digo del sistema de archivo de uni&oacute;n no
est&aacute; libre de errores.
</p>

<ul>
<pre>
# <strong>mkdir /usr/src</strong>
# <strong>mount -t union -o -b /mnt /usr/src</strong>
</pre>
</ul>

<p>
Despu&eacute;s de esto, dispondr&aacute; en /usr/src de un &aacute;rea
de repositorio en donde todas las &oacute;rdenes de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=1&manpath=OpenBSD+Current&format=html">cvs(1)</a>
funcionar&aacute;n bien.
</p>

<p>
Si no dispone de un CD de OpenBSD, tendr&aacute; que obtener los
fuentes desde uno de los servidores de AnonCVS de OpenBSD.  Puede
encontrar una lista de estos servidores en 
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a>.
Despu&eacute;s de escoger un servidor, deber&aacute; escoger el
m&oacute;dulo que vaya a bajarse.  Existen tres m&oacute;dulos
principales disponibles desde el &aacute;rbol de CVS, que son:
</p>

<ul>
   <li><i>src</i> - El m&oacute;dulo src contiene el c&oacute;digo
       fuente de OpenBSD completo.  Esto incluye los fuentes del modo
       usuario y del n&uacute;cleo del sistema.</li>
   <li><i>ports</i> - El m&oacute;dulo ports contiene todo lo necesario
       para obtener un &aacute;rbol de portes de OpenBSD.  Para
       m&aacute;s informaci&oacute;n sobre el &aacute;rbol de portes de
       OpenBSD, lea la <a href="faq8.html#8.6">secci&oacute;n 8.6</a>
       de las Preguntas Frecuentes.</li>
   <li><i>www</i> - El m&oacute;dulo www contiene todas las
       p&aacute;ginas web de OpenBSD, incluidas las Preguntas
       Frecuentes.</li>
</ul>

<p>
Ahora que ya ha decidido qu&eacute; m&oacute;dulo desea obtener, queda
un paso m&aacute;s que tendr&aacute; que llevar a cabo para poder
obtenerlo.  Debe decidir qu&eacute; m&eacute;todo usar.  Por
definici&oacute;n, CVS baja los ficheros usando 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rsh&apropos=0&sektion=1&manpath=OpenBSD+Current&format=html">rsh(1)</a>,
pero algunos servidores de CVS An&oacute;nimo no permiten este tipo de
acceso, por lo que en cualquier caso es mejor usar siempre ssh.  Para
los que se encuentren detr&aacute;s de un cortafuegos, existe la
opci&oacute;n de pserver, y tambi&eacute;n algunos servidores permiten
el acceso ssh por el puerto 2022.  Aseg&uacute;rese de leer
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a> 
para saber qu&eacute; protocolos est&aacute;n soportados en los
diferentes servidores.  En el ejemplo usaremos un servidor de CVS
An&oacute;nimo ubicado en los EE.UU., pero recuerde que si se encuentra
fuera de los EE.UU. debe usar un servidor que se encuentre ubicado
m&aacute;s cerca de Vd.  Existen mucho servidores de CVS An&oacute;nimo
esparcidos por todo el mundo, as&iacute; que escoja el m&aacute;s
cercano.  Tambi&eacute;n usaremos ssh para obtener los ficheros.
</p>

<ul>
<pre>
ericj@oshibana:~&gt; <strong>export CVS_RSH=/usr/bin/ssh</strong>
ericj@oshibana:~&gt; <strong>echo $CVS_RSH</strong>
/usr/bin/ssh
ericj@oshibana:~&gt; <strong>export CVSROOT=anoncvs@anoncvs.usa.openbsd.org:/cvs</strong>
ericj@oshibana:~&gt; <strong>cvs get src</strong>
Warning: Remote host denied X11 forwarding, perhaps xauth program could not be run on the server side.
cvs checkout: in directory src:
cvs checkout: cannot open CVS/Entries for reading: No such file or directory
cvs server: Updating src
U src/Makefile
[snip]
</pre>
</ul>

<p>
N&oacute;tese que tambi&eacute;n se ha activado la variable de entorno
CVSROOT.  Esta variable indica a 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&sektion=1&format=html">cvs(1)</a>
el servidor de CVS An&oacute;nimo que debe usar.  Tambi&eacute;n se
puede especificar esta variable usando la opci&oacute;n <i>-d</i>, por
ejemplo:
</p>

<ul>
<pre>
ericj@oshibana:~&gt; <strong>cvs -d anoncvs@anoncvs.usa.openbsd.org:/cvs get src</strong>
</pre>
</ul>

<p>
Estas &oacute;rdenes deber&iacute;an ser ejecutadas desde el directorio
<i>/usr</i>, ya que as&iacute; se crear&aacute;n los directorios
<i>/usr/src</i>, <i>/usr/ports</i>, y <i>/usr/www</i>, dependiendo, por
supuesto, del m&oacute;dulo que indique para bajar.  Puede bajarse
estos m&oacute;dulos en cualquier parte, pero si lo que quiere es
trabajar con ellos (o sea, 'make build'), se supone que deben estar en
los directorios arriba mencionados.
</p>

<h3>Mantener actualizado el &aacute;rbol de CVS</h3>

<p>
Una vez que haya obtenido su &aacute;rbol inicial, mantenerlo
actualizado ser&aacute; una tarea f&aacute;cil.  Puede actualizar en
cualquier momento que desee;  algunos servidores de CVS An&oacute;nimo
se actualizan con m&aacute;s frecuencia que otros, por lo que
deber&aacute; comprobar
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a>.
En el siguiente ejemplo actualizaremos el m&oacute;dulo www desde
anoncvs.usa.openbsd.org.  F&iacute;jese en la opci&oacute;n -q que
usaremos, sirve para que la informaci&oacute;n en pantalla que nos
llegue del servidor no sea excesiva.
</p>

<ul>
<pre>
ericj@oshibana:~&gt; <strong>echo $CVSROOT</strong>                                 
anoncvs@anoncvs.usa.openbsd.org:/cvs
ericj@oshibana:~&gt; <strong>cvs -q up -PAd www</strong>
Warning: Remote host denied X11 forwarding, perhaps xauth program could not be run on the server side.
U www/want.html
M www/faq/faq8.html
ericj@oshibana:~&gt;
</pre>
</ul>

<h3>Otras opciones para cvs</h3>

<p>
Para algunos, el ancho de banda y el tiempo de conexi&oacute;n
representan serios problemas cuando actualizan desde repositorios como
&eacute;stos.  CVS tiene una opci&oacute;n -z[1-9] que usa gzip para
comprimir los datos.  Para usar esta opci&oacute;n a&ntilde;ada
-z[nivel-de-compresi&oacute;n];  por ejemplo, -z3 para un nivel 3 de
compresi&oacute;n.
</p>

<p>
<a name="8.6"></a>
<h2>8.6 - &iquest;Qu&eacute; es el &aacute;rbol de portes?</h2>
</p>

<p>
El &aacute;rbol de portes es un conjunto de ficheros Makefile listos
para ser bajados, parcheados, configurados e instalados en programas de
modo usuario para que pueda ejecutarlos en el entorno de OpenBSD sin
tener que hacerlo todo a mano.  Puede obtener el &aacute;rbol de portes
desde el directorio <kbd>/pub/OpenBSD/2.6/ports.tar.gz</kbd> en
cualquiera de los servidores de ftp de OpenBSD.  Los portes m&aacute;s
recientes se encuentran disponibles desde el m&oacute;dulo
&quot;ports&quot; del &aacute;rbol de cvs, o por ftp en
<kbd>/pub/OpenBSD/snapshots/ports.tar.gz</kbd>.  Sin embargo, para la
mayor&iacute;a de usuarios, instalar los paquetes en lugar de los
portes ser&aacute; una opci&oacute;n mejor.  Los paquetes se generan
desde los portes, y vienen precompilados y listos para usar.  Para
m&aacute;s informaci&oacute;n sobre los paquetes, lea la 
<a href="#8.7">secci&oacute;n 8.7</a>.
</p>

<h3>C&oacute;mo obtener la versi&oacute;n m&aacute;s reciente del
&aacute;rbol de portes</h3>

<p>
Si va a instalar la &uacute;ltima versi&oacute;n del &aacute;rbol de
portes, deber&iacute;a tener la &uacute;ltima versi&oacute;n de
OpenBSD.  De este modo le facilitar&aacute; la interacci&oacute;n de la
&uacute;ltima versi&oacute;n del &aacute;rbol de portes con el resto de
su sistema OpenBSD, ya que se aplican cambios y soluciones de errores
constantemente en el &aacute;rbol de portes.  Si no sigue estos pasos,
es probable que cuando actualice tenga algunos peque&ntilde;os
problemas.
</p>

<p>
El mejor modo para mantenerse actualizado con su &Aacute;rbol de Portes
de OpenBSD es por medio de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&sektion=1&format=html">cvs(1)</a>.
El Proyecto OpenBSD tiene un grupo de servidores de CVS An&oacute;nimo
que se encuentran disponibles para cualquier usuario.  Para m&aacute;s
informaci&oacute;n sobre cvs, lea
<a href="../../es/anoncvs.html">www.openbsd.org/es/anoncvs.html</a> y
la <a href="#8.5">secci&oacute;n 8.5</a> de este documento.
</p>

<p>
A&uacute;n as&iacute;, si no dispone de ning&uacute;n &aacute;rbol de
portes, lo puede obtener a trav&eacute;s de los servidores de ftp de
OpenBSD.  Puede ver una lista de servidores de ftp en
<a href="../../es/ftp.html">www.openbsd.org/es/ftp.html</a>.
Desde aqu&iacute; puede bajarse /pub/OpenBSD/2.5/ports.tar.gz y
desarchivarlo en <i>/usr/ports</i> del modo siguiente:
</p>

<ul>
<pre>
ericj@oshibana&gt; <strong>ftp ftp://ftp.openbsd.org/pub/OpenBSD/2.5/ports.tar.gz</strong>
ericj@oshibana&gt; <strong>sudo cp ports.tar.gz /usr</strong>
ericj@oshibana&gt; <strong>cd /usr; sudo tar xfz ports.tar.gz</strong>
</pre>
</ul>

<p>
Una vez hecho esto, puede usar 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&sektion=1&format=html">cvs(1)</a>
para actualizar su &aacute;rbol de portes.  Si comenz&oacute; desde una
base del &aacute;rbol de portes para 2.5, tendr&aacute; que aplicar
algunos cambios.  Sobre todo, necesitar&aacute; actualizar
<i>/usr/share/mk</i>, que contiene los ficheros usados por 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&sektion=1&format=html">make(1)</a>.
Si tiene el &aacute;rbol de fuentes en su sistema, puede actualizar
<i>/usr/share/mk</i> a trav&eacute;s de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&sektion=1&format=html">cvs(1)</a>
e instalar sin m&aacute;s:
</p>

<ul>
<pre>
ericj@oshibana&gt; <strong>cd /usr/src/share/mk; sudo make install</strong>
</pre>
</ul>

<p>
De este modo pondr&aacute; los ficheros que deba en su lugar
correspondiente.  Despu&eacute;s de esto, es posible que tambi&eacute;n
necesite la &uacute;ltima versi&oacute;n del binario de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&sektion=1&format=html">make(1)</a>.
Si no dispone de los fuentes de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&sektion=1&format=html">make(1)</a>
en el &aacute;rbol de fuentes en su sistema, los puede obtener a
trav&eacute;s de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&sektion=1&format=html">cvs(1)</a>
y compilarlo del siguiente modo:
</p>

<ul>
<pre>
ericj@oshibana&gt; <strong>export CVS_RSH=/usr/bin/ssh</strong>
ericj@oshibana&gt; <strong>cvs -danoncvs@any.anoncvs.server:/cvs get src/usr.bin/make</strong>
cvs server: Updating src/usr.bin/make
U src/usr.bin/make/Makefile
U src/usr.bin/make/Makefile.boot
U src/usr.bin/make/arch.c
U src/usr.bin/make/bit.h
U src/usr.bin/make/buf.c
U src/usr.bin/make/buf.h
U src/usr.bin/make/compat.c
[SNIP] 
ericj@oshibana&gt; <strong>cd src/usr.bin/make; sudo make install</strong>
</pre>
</ul>

<p>
Si ya tiene de estos fuentes en su m&aacute;quina, basta con que
actualice y lo instale.  De momento esto es todo lo que tendr&aacute;
que hacer para poder tener el &aacute;rbol de portes funcionando
correctamente.
</p>

<p>
A diario se crea un versi&oacute;n del &aacute;rbol de portes
(&quot;snapshot&quot;), y &eacute;sta se puede obtener desde cualquiera
de los <a href="../../es/ftp.html">servidores de ftp de OpenBSD</a>,
desde <strong>/pub/OpenBSD/snapshots/ports.tar.gz</strong>.
</p>

<h3>&iquest;Cu&aacute;les son los portes disponibles, y c&oacute;mo los
puedo encontrar?</h3>

<p>
Existen dos maneras para buscar portes.  La primera es comprobar 
<a href="../../es/portstat.html">www.openbsd.org/es/portstat.html</a>.
Ah&iacute; podr&aacute; encontrar una lista actualizada de los portes
que se encuentren disponibles.  La segunda es usar el &aacute;rbol de
portes para buscar por palabras clave.  Para ello use <kbd>make search
key=&quot;palabra_clave&quot;</kbd>.  A continuaci&oacute;n puede ver
un ejemplo de una b&uacute;squeda de 'samba':
</p>

<ul>
<pre>
ericj@oshibana&gt; <strong>make search key=&quot;samba&quot;</strong>
Port:   samba-2.0.5a
Path:   /usr/ports/net/samba
Info:   free SMB and CIFS client and server for UNIX
Maint:  ports@openbsd.org
Index:  net
B-deps:
R-deps:
Archs:  any

Port:   ADMsmb-0.2
Path:   /usr/ports/security/ADMsmb
Info:   Samba security scanner
Maint:  dugsong@monkey.org
Index:  security
B-deps:
R-deps:
Archs:  any
</pre>
</ul>

<h3>C&oacute;mo instalar los portes</h3>

<p>
Los portes se configuran para que sean EXTREMEDAMENTE f&aacute;ciles de
compilar e instalar.  A continuaci&oacute;n sigue un ejemplo de un
usuario que quiere instalar el programa xfig para X11.  Podr&aacute;
observar que las dependencias se detectan y resuelven de forma
autom&aacute;tica:
</p>

<p>
Para empezar necesita cambiar al directorio del programa que desea.  Si
est&aacute; buscando un programa, puede actualizar su base de datos
local, o bien usar la funci&oacute;n de b&uacute;squeda que se ha
mencionado anteriormente.  Una vez que se encuentre en el directorio
del programa que desee instalar, ejecute <kbd>make install</kbd>.  Por
ejemplo:

<ul>
<pre>
fenetyllin:/usr/ports/graphics/xfig# <strong>make install</strong>
===&gt;  Extracting for xfig-3.2.2
===&gt;  xfig-3.2.2 depends on shared library: jpeg.62. - /usr/local/lib/libjpeg.so.62.0 found
===&gt;  xfig-3.2.2 depends on shared library: Xaw3d.6. - not found
===&gt;  Verifying install for Xaw3d.6. in /usr/ports/x11/Xaw3d
&gt;&gt; Xaw3d-1.3.tar.gz doesn't seem to exist on this system.
&gt;&gt; Attempting to fetch from ftp://crl.dec.com/pub/X11/contrib/widgets/Xaw3d/R6.1/.
Connected to crl.dec.com.
220 crl.dec.com FTP server (Digital UNIX Version 5.60) ready.
331 Guest login ok, send ident as password.
230 Guest login ok, access restrictions apply.
Remote system type is UNIX.
Using binary mode to transfer files.
200 Type set to I.
250 CWD command successful.
250 CWD command successful.
Retrieving pub/X11/contrib/widgets/Xaw3d/R6.1/Xaw3d-1.3.tar.gz
local: Xaw3d-1.3.tar.gz remote: Xaw3d-1.3.tar.gz
227 Entering Passive Mode (192,58,206,2,5,14)
150 Opening BINARY mode data connection for Xaw3d-1.3.tar.gz (0.0.0.0,0) (290277 bytes).
100% |**************************************************|   283 KB    00:00 ETA
226 Transfer complete.
290277 bytes received in 101.09 seconds (2.80 KB/s)
221 Goodbye.
===&gt;  Extracting for Xaw3d-1.3
/bin/mkdir -p /usr/ports/x11/Xaw3d/work/xc/lib/Xaw3d/X11/Xaw3d
cd /usr/ports/x11/Xaw3d/work/xc/lib/Xaw3d/X11/Xaw3d; ln -sf ../../*.h .
===&gt;  Patching for Xaw3d-1.3
===&gt;  Configuring for Xaw3d-1.3
mv -f Makefile Makefile.bak
imake -DUseInstalled -I/usr/X11R6/lib/X11/config
make Makefiles
[snip]
</pre>
</ul>
</p>


<h3>C&oacute;mo obtener una lista de todos los portes y paquetes
instalados</h3>

<p>
Puede ver una lista, tanto para portes como para paquetes, usando la
orden pkg_info.

<ul>
<pre>
bsd# <strong>/usr/sbin/pkg_info</strong>
zsh-3.0.5           The Z shell.
screen-3.7.4        A multi-screen window manager.
ssh-1.2.21          Secure shell client and server (remote login program).
emacs-20.2          GNU editing macros.
lynx-2.7.1ac-0.107  An alphanumeric display oriented World-Wide Web Client.
tcsh-6.07.02        An extended C-shell with many useful features.
bash-2.01           The GNU Borne Again Shell.
zip-2.2             Create/update ZIP files compatabile with pkzip.
mm-2.7              Implementation of MIME, the Multipurpose Internet Mail Exten
ircii-2.8.2-epic3.004 An enhanced version of ircII, the Internet Relay Chat client
ispell-3.1.20       An interactive spelling checker.
tin-1.3.970930      TIN newsreader (termcap based)
procmail-3.11p7     A local mail delivery agent.
strobe-1.03         Fast scatter/gather TCP port scanner
lsof-4.15           Lists information about open files.
xntp3-5.92          Network Time Protocol Implementation.
ncftp-2.4.3        
nmh-0.27            The New MH mail handling program
bzip2-0.1p12        A block-sorting file compressor
</pre>
</ul>


<h3>M&aacute;s informaci&oacute;n</h3>

<p>
Puede encontrar m&aacute;s informaci&oacute;n sobre los portes en la
p&aacute;gina de manual 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&sektion=7&format=html">ports(7)</a>.
</p>

<p>
Nuestro &aacute;rbol de fuentes se encuentra en cont&iacute;nua
expansi&oacute;n, si quiere ayudar, por favor lea 
<a href="../../es/ports.html">http://www.openbsd.org/es/ports.html</a>.
</p>

<br>

<p>
<a name="8.7"></a>
<h2>8.7 - &iquest;Qu&eacute; son los paquetes?</h2>
</p>

<p>
Los paquetes son binarios precompilados de algunos de los programas
m&aacute;s usados.  Est&aacute;n preparados para usarlos directamente
en un sistema OpenBSD.  Al igual que los portes, los paquetes son muy
f&aacute;ciles de mantener y actualizar.  Aseg&uacute;rese de comprobar
qu&eacute; paquetes adicionales existen para cada versi&oacute;n del
sistema, ya que continuamente se est&aacute;n a&ntilde;adiendo paquetes
nuevos.
</p>

<p>
Aqu&iacute; puede ver una lista de las herramientas que se utilizan
para gestionar paquetes.<br>

<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add">pkg_add(1)</a> - utilidad para instalar distribuciones de paquetes de software</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_create">pkg_create(1)</a> - utilidad para crear distribuciones de paquetes de software</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete">pkg_delete(1)</a> - utilidad para desinstalar distribuciones de paquetes de software previamente instalados</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info">pkg_info(1)</a> - utilidad para mostrar informaci&oacute;n sobre paquetes de software</li>
</ul>

<h3>D&oacute;nde encontrar los paquetes</h3>

<p>
Si es Vd. un usuario avispado y compr&oacute; uno de los 
<a href="../../es/orders.html">CDs de OpenBSD</a>, entonces
podr&aacute; encontrar los paquetes en uno de los dos CDs, dependiendo
de su arquitectura.  Si no dispone de los CDs de OpenBSD, puede obtener
los paquetes baj&aacute;ndoselos de cualquiera de las r&eacute;plicas
del servidor de ftp.  Hay una lista de las r&eacute;plicas del servidor
de ftp en 
<a href="../../es/ftp.html">http://www.openbsd.org/es/ftp.html</a>.
Los paquetes est&aacute;n ubicados en <i>/pub/OpenBSD/2.6/packages</i>;
desde ah&iacute; los paquetes se subdividen dependiendo de la
arquitectura.
</p>

<h3>C&oacute;mo instalar los paquetes</h3>

<p>
Para instalar paquetes se utiliza la herramienta
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add">pkg_add(1)</a>.
pkg_add(1) es muy fácil de usar, y en los dos ejemplos que aparecen a
continuaci&oacute;n puede ver c&oacute;mo instalar un paquete con
pkg_add(1).  El primer ejemplo muestra c&oacute;mo instalar con
pkg_add(1) un paquete que est&eacute; ubicado en un disco local,
mientras que el segundo ejemplo muestra la instalaci&oacute;n de un
paquete por medio de ftp.  En ambos ejemplos se instalar&aacute;
screen-3.7.6.

<ul>Instalaci&oacute;n desde un disco local
<pre>
$ <strong>sudo pkg_add -v screen-3.7.6.tgz</strong>
Requested space: 749864 bytes, free space: 2239117312 bytes in /var/tmp/instmp.cpsHA27596
Running install with PRE-INSTALL for `screen-3.7.6'
extract: Package name is screen-3.7.6
extract: CWD to /usr/local
extract: /usr/local/bin/screen-3.7.6
extract: execute 'ln -sf screen-3.7.6 /usr/local/bin/screen'
extract: /usr/local/man/man1/screen.1
extract: /usr/local/info/screen.info
extract: execute '[ -f /usr/local/info/dir ] || sed -ne '1,/Menu:/p' /usr/share/info/dir &gt; /usr/local/info/dir'
extract: execute 'install-info /usr/local/info/screen.info /usr/local/info/dir'
extract: /usr/local/lib/screen/screencap
extract: /usr/local/lib/screen/screenrc
extract: CWD to .
Running mtree for `screen-3.7.6'
mtree -q -U -f +MTREE_DIRS -d -e -p /usr/local
Running install with POST-INSTALL for `screen-3.7.6'

+---------------
| The file /etc/screenrc has been created on your system.
| You may want to verify/edit its contents
|
| The file /usr/local/lib/screen/screencap contains a
| termcap like description of the screen virtual terminal.
| You may use it to update your terminal database.
| See <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=termcap&sektion=5&format=html">termcap(5)</a>.
+---------------

Attempting to record package into `/var/db/pkg/screen
Package `screen-3.7.6' registered in `/var/db/pkg/screen-3.7.6'
</pre>
</ul>

<p>
En este ejemplo se ha usado el indicador <b>-v</b> para obtener una
salida con m&aacute;s informaci&oacute;n;  esta opci&oacute;n no es
necesaria, pero ayuda a depurar y se ha usado aqu&iacute; para ofrecer
una visi&oacute;n m&aacute;s detallada del proceso llevado a cabo por
pkg_add(1).  Habr&aacute; notado que aparece un mensaje en el que se
menciona el fichero <i>/etc/screenrc</i>.  Este tipo de mensaje
aparecer&aacute;n tanto si usa la opci&oacute;n <b>-v</b> como si no.
</p>

<ul>Instalaci&oacute;n desde ftp
<pre>
$ <strong>sudo pkg_add ftp://ftp.openbsd.org/pub/OpenBSD/2.6/packages/i386/screen-3.7.6.tgz</strong>
&gt;&gt;&gt; ftp -o - ftp://ftp.openbsd.org/pub/OpenBSD/2.6/packages/i386/screen-3.7.6.tgz

+---------------
| The file /etc/screenrc has been created on your system.
| You may want to verify/edit its contents
|
| The file /usr/local/lib/screen/screencap contains a
| termcap like description of the screen virtual terminal.
| You may use it to update your terminal database.
| See <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=termcap&sektion=5&format=html">termcap(5)</a>.
+---------------
</pre>
</ul>

<p>
En este ejemplo puede observar que se ha instalado el paquete indicando
la arquitectura i386, lo que deber&aacute; cambiar Vd. si su
arquitectura es distinta.  N&oacute;tese que no todas las arquitecturas
disponen de los mismos paquetes.  Algunos portes no funcionan en
ciertas arquitecturas.  En el ejemplo no se ha usado la opci&oacute;n
<b>-v</b>, as&iacute; que s&oacute;lo se ha mostrado la
informaci&oacute;n NECESARIA.
</p>

<h3>C&oacute;mo ver y eliminar los paquetes ya instalados</h3>

<p>
Para ver una lista de todos los paquetes que se encuentren instalados
en su sistema, puede usar la herramienta
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info">pkg_info(1)</a>.
Por regla general, necesitar&aacute; usar esta herramienta para poder
ver el nombre exacto de un paquete antes de proceder a su
eliminaci&oacute;n.  Para ver qu&eacute; paquetes se encuentran
instalados en su sistema, ejecute la siguiente orden:

<ul>
<pre>
$ <strong>pkg_info</strong>
sslUSA26           ssl26.1 USA-only non-commercial crypto libs incl. SSL &amp; RSA
mpg123-0.59q       mpeg audio 1/2 layer 1, 2 and 3 player
nmap-2.3b6         port scanning large networks
ircii-2.8.2-epic3.004enhanced version of ircII (internet relay chat)
screen-3.7.6       multi-screen window manager
unzip-5.40         extract, list &amp; test files in a ZIP archive
xntp3-5.93e-export Network Time Protocol implementation
icb-5.0.9          Internet CB - mostly-defunct chat client
</pre>
</ul>

<p>
Para eliminar un paquete, tome el nombre del paquete tal y como se
muestra con la orden pkg_info(1), y use la herramienta
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete">pkg_delete(1)</a> para eliminarlo.
En el siguiente ejemplo se muestra c&oacute;mo eliminar el paquete
screen.  En algunos casos existen instrucciones sobre algunos objetos
que deben ser eliminados y que pkg_delete(1) no eliminar&aacute;, y que
por tanto deber&aacute; eliminarlos Vd. mismo.  Como se hizo
anteriormente con pkg_add(1), puede usar la opci&oacute;n <b>-v</b>
para obtener una informaci&oacute;n m&aacute;s amplia del proceso.
</p>

<ul>
<pre>
$ <strong>sudo pkg_delete screen-3.7.6</strong>

+---------------
| To completely deinstall the screen-3.7.6 package you need to perform
| this step as root:
|
|           rm -f /etc/screenrc
|
| Do not do this if you plan on re-installing screen-3.7.6
| at some future time.
+---------------
</pre>
</ul>

<p>
<a name="8.8"></a>
<h2>8.8 -  &iquest;Existe alg&uacute;n modo de usar la disquetera si no
estaba instalada durante el arranque?</h2>
</p>

<p>
Por supuesto.  Para ello debe a&ntilde;adir &quot;flags 0x20&quot; al
final de la entrada fd* y recompilar el n&uacute;cleo de su sistema.
La l&iacute;nea debe quedar del siguiente modo:

</p>
<ul>
<pre>  fd*     at fdc? drive ? flags 0x20</pre>
</ul>

<p>
Despu&eacute;s de hacer esto ya puede usar la unidad de la disquetera
en cualquier momento, sin importar si la instal&oacute; antes o
despu&eacute;s del arranque.
</p>

<p>
<a name="8.9"></a>
<h2>8.9 - Opciones de arranque - C&oacute;mo usar el gestor de arranque
de OpenBSD</h2>
</p>

<p>
Al iniciar su sistema OpenBSD habr&aacute; visto el punto de arranque
del sistema.
<p>

<p>
<ul>boot&gt;</ul>
</p>

<p>
La mayor&iacute;a de los usuarios no tendr&aacute;n que hacer nada en
este punto, ya que iniciar&aacute; el sistema de forma
autom&aacute;tica a menos que se le pase alguna orden.  Pero algunas
veces pueden surgir problemas, o se puede necesitar de alguna
funci&oacute;n especial.  Para entender el punto de arranque debe leer
la p&aacute;gina de manual
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&sektion=8&format=html">boot(8)</a>.
En esta secci&oacute;n trataremos &uacute;nicamente las &oacute;rdenes
m&aacute;s comunes para el gestor de arranque.
</p>

<p>
En principio, si no se introduce ninguna orden, el gestor de arranque
tratar&aacute; de iniciar la imagen del n&uacute;cleo
<strong>/bsd</strong> de forma autom&aacute;tica.  Si esto fallara,
intentar&iacute;a iniciar <strong>/obsd</strong>, y otros hasta que
encontrara una imagen del n&uacute;cleo con la que poder arrancar.
Puede especificar el n&uacute;cleo para el arranque a mano,
escribiendo:
</p>

<ul>
boot&gt; <strong>boot wd0a:/bsd</strong>
</ul>
&oacute;
<ul>
boot&gt; <strong>b /bsd</strong>
</ul>
</p>

<p>
Esto s&oacute;lo funcionar&aacute; si el dispositivo wd0a est&aacute;
configurado como el dispositivo ra&iacute;z del sistema.
</p>

<p>
He aqu&iacute; una breve lista de opciones que puede usar con el
n&uacute;cleo de OpenBSD.

<ul>
<li><strong>-a</strong> : Le permite especificar un dispositivo
    ra&iacute;z alternativo despu&eacute;s de arrancar el
    n&uacute;cleo.</li>
<li><strong>-c</strong> : Le permite introducir la configuraci&oacute;n
    para el arranque.  Lea la secci&oacute;n 
    <a href="faq5.html#5.4">&laquo;Configuraci&oacute;n del
    Arranque&raquo;</a> de las Preguntas Frecuentes.</li>
<li><strong>-s</strong> : Le permite iniciar en modo monousuario.</li>
<li><strong>-d</strong> : Le permite volcar el n&uacute;cleo en el
    depurador ddb.  Tenga en cuenta que DDB debe estar configurado en
    el n&uacute;cleo.</li>
<li><strong>-b</strong> : Atajo para RB_HALT.</li>
</ul>
</p>

<p>
Estas opciones se introducen de la siguiente forma:
<strong>boot [ imagen [-abcds]]</strong>
</p>

<p>
Para m&aacute;s informaci&oacute;n, lea la p&aacute;gina de manual
<a href="http://www.OpenBSD.org/cgi-bin/man.cgi?query=boot_i386&sektion=8&format=html">boot_i386(8)</a>.
</p>

<p>
<a name="8.10"></a>
<h2>8.10 - S/Key</h2>
</p>

<p>
S/Key es un esquema de &laquo;contrase&ntilde;a de una sola vez&raquo;.
Con S/Key se pueden usar contrase&ntilde;as que se usar&aacute;n
s&oacute;lo una vez en canales sin ning&uacute;n tipo de seguridad
implementada.  Esto puede ser muy &uacute;til para aquellos que no
puedan usar ssh o cualquier otro canal cifrado.  La
implementaci&oacute;n de S/Key en OpenBSD puede hacer uso de varios
algoritmos como &quot;hash&quot; de una direcci&oacute;n.  En la
siguiente lista puede ver los algoritmos disponibles:
</p>

<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md4&sektion=3&format=html">md4</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md5&sektion=3&format=html">md5</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sha1&sektion=3&format=html">sha1</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rmd160&sektion=3&format=html">rmd160</a>.</li>
</ul>

<h3>Configuraci&oacute;n de S/Key - Primeros pasos</h3>

<p>
Para empezar debe existir el fichero <i>/etc/skeykeys</i>.  Si no
existiera este fichero, p&iacute;dale al administrador que lo cree.
Para crear este fichero basta con ejecutar:
</p>

<ul>
<strong>
<pre>
# touch /etc/skeykeys
</pre>
</strong>
</ul>

<p>
Una vez que exista ese fichero, podr&aacute; iniciar S/Key.  Para
iniciar S/Key debe usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skeyinit&sektion=1&format=html">skeyinit(1)</a>.
Con skeyinit(1), lo primero que le preguntar&aacute; ser&aacute; por su
contrase&ntilde;a en el sistema.  &Eacute;sta es la misma que usa para
ingresar en el sistema.  La ejecuci&oacute;n de skeyinit(1) en un canal
no seguro no es recomendable, as&iacute; que deber&iacute;a ejecutarlo
por un canal seguro como ssh o desde la consola.  Una vez que se haya
autorizado a s&iacute; mismo mediante la contrase&ntilde;a del sistema,
le pedir&aacute; que introduzca otra contrase&ntilde;a.  &Eacute;sta
ser&aacute; su <i>contrase&ntilde;a secreta</i>, y <strong>NO</strong>
su contrase&ntilde;a del sistema.  El l&iacute;mite de caracteres para
la contrase&ntilde;a secreta no es de 8 como en la contrase&ntilde;a
del sistema, y de hecho debe estar compuesta por un m&iacute;nimo de 10
caracteres.  Adem&aacute;s se sugiere que la contrase&ntilde;a
est&eacute; formada por una frase, y no por una sola palabra.  He
aqu&iacute; un ejemplo de c&oacute;mo a&ntilde;adir un usuario:
</p>

<ul>
<pre>
oshibana:ericj&gt; <strong>skeyinit ericj</strong>
[Adding ericj]
Reminder - Only use this method if you are directly connected
   or have an encrypted channel.  If you are using telnet
   or rlogin, exit with no password and use skeyinit -s.
Enter secret password:
Again secret password:

ID ericj skey is otp-md5 99 oshi45820             
Next login password: HAUL BUS JAKE DING HOT HOG
</pre>
</ul>

<p>
La l&iacute;nea <i>ID ericj skey is otp-md5 99 oshi45820</i> es de
especial importancia.  Esta l&iacute;nea muestra mucha
informaci&oacute;n al usuario.  Analicemos la l&iacute;nea por partes y
seg&uacute;n importancia:
</p>

<ul>
<li><i>otp-md5</i> - Indica que &quot;hash&quot; se us&oacute; para
    crear la &laquo;contrase&ntilde;a de una sola vez&raquo; (otp,
    &quot;One-Time Password&quot;).</li>
<li><i>99</i> - El n&uacute;mero de la secuencia.  Es un n&uacute;mero
    entre 100 y 1.  En cuanto alcanza 1, es necesario crear otra
    contrase&ntilde;a secreta.</li>
<li><i>oshi45820</i> - La clave.</li>
</ul>

<p>
Pero lo m&aacute;s importante es la contraseña.  En el ejemplo, la
contrase&ntilde;a consiste de 6 peque&ntilde;as palabras que,
combinadas e incluyendo espacios y cualquier otro car&aacute;cter,
forman la contrase&ntilde;a.
</p>

<h3>C&oacute;mo usar S/Key para el ingreso
(<em>&quot;login&quot;</em>)</h3>

<p>
Asumiremos que su skey ya ha sido iniciada, y que ya tiene su
contrase&ntilde;a.  Ahora ya est&aacute; preparado para ingresar.  He
aqu&iacute; una sesi&oacute;n de ejemplo en la que se usar&aacute;
s/key para ingresar:
</p>

<ul>
<pre>
oshibana:ericj&gt; ftp localhost
Connected to localhost.
220 oshibana.shin.ms FTP server (Version 6.4/OpenBSD) ready.
Name (localhost:ericj): ericj
331 Password [ otp-md5 96 oshi45820 ] for ericj required.
Password:
230- OpenBSD 2.5-current (OSHIBANA) #8: Tue Jun 22 19:20:16 EDT 1999
230-
230- Welcome to OpenBSD: The proactively secure Unix-like operating system.
230-
230- Please use the sendbug(1) utility to report bugs in the system.
230- Before reporting a bug, please try to reproduce it with the latest
230- version of the code.  With bug reports, please try to ensure that
230- enough information to reproduce the problem is enclosed, and if a
230- known fix for it exists, include that as well.
230-
230 User ericj logged in.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp&gt; quit
221 Goodbye.
</pre>
</ul>

<p>
Puede que haya notado que el n&uacute;mero de la secuencia ha cambiado:
<i>otp-md5 96 oshi45820</i>.  Esto se debe a que s/key ya ha sido usada
para ingresar varias veces.  Pero, &iquest;c&oacute;mo obtendr&aacute;
su contrase&ntilde;a despu&eacute;s de haber ingresado una vez?  Pues
bien, para ello necesitar&aacute; saber su clave y qu&eacute;
n&uacute;mero de secuencia est&aacute; usando.  Probablemente
est&eacute; pensando en c&oacute;mo puede recordar qu&eacute;
n&uacute;mero de secuencia est&aacute; usando en ese momento... Bueno,
esto es f&aacute;cil, use
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skeyinfo&sektion=1&format=html">skeyinfo(1)</a>
le dir&aacute; el n&uacute;mero de secuencia actual.  En el ejemplo,
hay que generar otra contrase&ntilde;a para un posible ingreso en el
futuro (recuerde que en el ejemplo se asume que se encuentra en un
canal seguro):
</p>

<ul>
<pre>
oshibana:ericj&gt; <strong>skeyinfo</strong>
95 oshi45820
</pre>
</ul>

<p>
Con esta informaci&oacute;n ya se puede crear una contrase&ntilde;a
para el pr&oacute;ximo ingreso.  Para ello se usar&aacute; 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&sektion=1&format=html">skey(1)</a>.
Se puede usar la informaci&oacute;n tal y como aparece para generar la
contrase&ntilde;a.
</p>

<ul>
<pre>
oshibana:ericj&gt; <strong>skey 95 oshi45820</strong>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password:
NOOK CHUB HOYT SAC DOLE FUME
</pre>
</ul>

<p>
Como es probable que muchos usuarios no siempre podr&aacute;n disponer
de una conexi&oacute;n segura para generar la contrase&ntilde;a, y
generarla en una conexi&oacute;n insegura no es factible, &iquest;se
podr&iacute;an generar m&uacute;ltiples contrase&ntilde;as de una sola
vez?  S&iacute;, ejecute skey(1) con el n&uacute;mero de
contrase&ntilde;as que desee generar.  Puede imprimir estas
contrase&ntilde;as y llev&aacute;rselas consigo.
</p>

<ul>
<pre>
oshibana:ericj&gt; <strong>skey -n 5 95 oshi45820</strong>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password:
91: SHIM SET LEST HANS SMUG BOOT
92: SUE ARTY YAW SEED KURD BAND
93: JOEY SOOT PHI KYLE CURT REEK
94: WIRE BOGY MESS JUDE RUNT ADD
95: NOOK CHUB HOYT SAC DOLE FUME
</pre>
</ul>

<p>
Nota: La &uacute;ltima contrase&ntilde;a es la primera que
deber&aacute; usar, ya que es una cuenta atr&aacute;s desde 100.
</p>

<h4>Usar S/Key con telnet(1), ssh(1), y rlogin(1)</h4>

<p>
Usar S/Key con telnet(1), ssh(1), o rlogin(1) es muy parecido a hacerlo
con ftp, s&oacute;lo su primera contrase&ntilde;a debe ser
&quot;s/key&quot;.  Por ejemplo:
</p>

<ul>
<pre>
ericj@oshibana&gt; <strong>telnet localhost</strong>
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

OpenBSD/i386 (oshibana) (ttyp2)

login: ericj
Password:              &lt;------------ "s/key" entered.
otp-md5 98 oshi45821
Response: <strong>SCAN OLGA BING PUB REEL COCA</strong>
Last login: Thu Oct  7 12:21:48 on ttyp1 from 156.63.248.77
Warning: no Kerberos tickets issued.
OpenBSD 2.5-current (OSHIBANA) #4: Thu Sep  2 23:36:16 EDT 1999

Welcome to OpenBSD: The proactively secure Unix-like operating system.

Please use the sendbug(1) utility to report bugs in the system.
Before reporting a bug, please try to reproduce it with the latest
version of the code.  With bug reports, please try to ensure that
enough information to reproduce the problem is enclosed, and if a
known fix for it exists, include that as well.

You have mail.
ericj@oshibana&gt;
</pre>
</ul>

<h3>Controlar S/Key</h3>

<p>
Puede conseguir m&aacute;s control sobre S/Key con el fichero
<i>/etc/skey.access</i> (este fichero no existe por definici&oacute;n,
por tanto debe crearlo antes).  Este fichero puede restringir S/Key de
tres maneras principales:
</p>

<ul>
   <li>permit internet - Permite la conexi&oacute;n y uso de s/key
       s&oacute;lo a los IPs que se indiquen.</li>
   <li>permit user - Permite el uso de s/key s&oacute;lo a los usuarios
       que se indiquen por nombre de ingreso.</li>
   <li>permit port - S&oacute;lo es de utilidad para puertos asignados
       (o sea, dial-up).</li>
</ul>

<p>
Si quisiera permitir el acceso a un s&oacute;lo usuario (ericj), desde
una cierta IP (10.1.1.5), crear&iacute;a un fichero como el siguiente:
</p>

<ul>
<pre>
# <strong>cat /etc/skey.access</strong>
permit internet 10.1.1.5
permit user ericj
</pre>
</ul>


<p>
<a name="8.11"></a>
<h2>8.11 - &iques;Por qu&eacute; se retrasa el reloj en mi
macintosh?</h2>

<p>
Esto se debe a un error en el hardware.  OpenBSD usa las se&ntilde;ales
de interrupci&oacute;n del reloj del hardware para hacer seguimientos
de la hora actual, pero estas se&ntilde;ales de interrupci&oacute;n
tienen la prioridad m&aacute;s baja en la arquitectura de Apple.  Bajo
mucha presi&oacute;n (como actividad del disco o de la red), las
se&ntilde;ales de interrupci&oacute;n del reloj se pierden y el reloj
de Unix no avanza como debiera.
</p>

<p>        
MacOS solventa este problema leyendo siempre el reloj del hardware,
pero OpenBSD s&oacute;lo lee el reloj del hardware al iniciar y a
partir de ah&iacute; lo ignora.  Al apagar el sistema, el n&uacute;cleo
no tiene la suficiente confianza como para grabar el tiempo de Unix en
el reloj del hardware debido a que conoce de sobra este problema de
&laquo;p&eacute;rdida del tiempo&raquo;.
</p>

<p>
El mejor modo de solucionar esto es ejecutar xntpd (que se puede
encontrar en la colecci&oacute;n de portes) y conformarse con pérdidas
ocasionales.  Algunas veces estas p&eacute;rdidas son tan graves que
incluso xntpd se niega a pasarlas por alto.  En este caso a&ntilde;ada
la opci&oacute;n -g a ntpd en el fichero /etc/rc.securelevel, para
forzalo a llevar un seguimiento del tiempo.
</p>

<p>
Otra soluci&oacute;n m&aacute;s simple, pero menos precisa, es ejecutar 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&sektion=8&format=html">rdate(8)</a>
con regularidad, por ejemplo a&ntilde;adiendo una entrada a crontab,
preferiblemente con la opci&oacute;n <strong>-a</strong> para que no
haya &laquo;saltos&raquo; de tiempo.  Otro sitio bueno desde donde
lanzar 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&sektion=8&format=html">rdate(8)</a>
es desde el fichero /etc/ppp/ppp.linkup, siempre que no est&eacute;
permanentemente conectado y sea un usuario PPP.
</p>

<p>
Ver tambi&eacute;n:
<a href="http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17">http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17</a>

<p>
<a name="8.12"></a>
<h2>8.12 - &iquest;Funciona OpenBSD en m&aacute;quinas con
multiprocesadores?</h2>

No.  OpenBSD/i386 no usar&aacute; procesadores m&uacute;ltiples, pero
funcionar&aacute; usando un s&oacute;lo procesador en una placa con un
sistema de multiprocesadores.  OpenBSD/sparc no funcionar&aacute; de
ning&uacute;n modo en un sistema de multiprocesadores.  En la
actualidad, ninguna otra plataforma tiene soporte para
multiprocesadores.

<p>
La raz&oacute;n es bien sencilla:  no hay suficientes desarrolladores
con acceso a m&aacute;quinas MP.  Si desea donar hardware MP, por favor
mire en
<a href="../../es/donations.html">http://www.openbsd.org/es/donations.html</a>.
Nuestros desarrolladores est&aacute;n pidiendo donaciones de hardware
de multiprocesadores para i386, sparc, hppa y otras para poder empezar
a desarrollar el soporte para SMP.  Existe un proyecto en marcha para
el desarrollo de soporte de multiprocesadores en OpenBSD, y puede
comprobar su progreso en
<a href="../../es/smp.html">http://www.openbsd.org/es/smp.html</a>.
</p>

<p>
<a name="8.13"></a>
<h2>8.13 - Obtengo errores de Entrada/Salida al intentar usar mis
dispositivos de tty...</h2>

<p>
A partir de la versi&oacute;n 2.6 de OpenBSD, debe usar /dev/cuaXX para
conexiones iniciadas desde el sistema OpenBSD;  los dispositivos
/dev/ttyXX son s&oacute;lo para uso de terminales o conexiones
entrantes.  Aunque era posible usar los dispositivos tty, el
n&uacute;cleo de OpenBSD ya no es compatible con este uso.

<p>
De la p&aacute;gina de manual 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cua&sektion=4&format=html">cua(4)</a>:

<p>
Para los puertos de los terminales, existe soporte para conexiones
salientes a trav&eacute;s de nodos de dispositivos que concuerdan
llamados unidades de llamada.  Por ejemplo, el terminal /dev/tty03
tendr&iacute;a una unidad de llamada que concordar&iacute;a, de nombre
/dev/cua03.  Estos dos dispositivos se diferencian normalmente creando
el nodo del dispositivo de la unidad de llamada con un n&uacute;mero
menor, 128 veces mayor que el del nodo del dispositivo de la
conexi&oacute;n entrante.
<i>Mientras el dispositivo de llamada entrante (tty) suele necesitar
una se&ntilde;al de hardware para indicar al sistema que est&aacute;
activo, el dispositivo de llamada saliente (cua) no, y por lo tanto se
puede comunicar sin impedimentos con un dispositivo como pueda ser un
modem.</i>
Esto quiere decir que un proceso como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&sektion=8&format=html">getty(8)</a>
esperar&aacute; en un dispositivo de llamada entrante hasta que se
establezca una conexi&oacute;n.  Mientras tanto, se podr&aacute;
establecer una conexi&oacute;n saliente en el dispositivo de llamada
saliente (para el mismo puerto del terminal) sin interferir con ninguna
otra parte del sistema.  El proceso
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&sektion=8&format=html">getty(8)</a>
se encargar&aacute; de ello correctamente, sin haber notado la
acci&oacute;n de la llamada saliente.

<p>
<a name="8.14"></a>
<h2>8.14 - &iquest;D&oacute;nde puedo encontrar binarios de Netscape
para OpenBSD?</h2>

<p>
No existen binarios de Netscape para OpenBSD.  Sin embargo, dado que
OpenBSD tiene soporte para la emulaci&oacute;n de binarios de muchos
otros sistemas operativos, se pueden usar los binarios de otros
sistemas.
</p>

<ul>
   <li>Para sistemas en i386, es mejor usar el binario de BSDI.
   <li>Para sistemas sparc, es mejor usar el binario de SunOS.
</ul>

<p>
Si usa el <a href="../../es/ports.html">Sistema de Portes</a>, puede
instalar estos binarios sin ning&uacute;n problema.  Una vez que haya
instalado el &aacute;rbol de portes, el porte de Navigator y de
Communicator los podr&aacute; encontrar en
<i>/usr/ports/www/netscape</i>.
</p>

<p>
<a name="8.15"></a>
<h2>8.15 - &iquest;C&oacute;mo puedo usar el editor mg (parte de
OpenBSD desde 2.6)?</h2>

<p>
mg es un micro editor de texto del estilo de Emacs.
Micro porque es peque&ntilde;o (&iexcl;Emacs es demasiado grande!).
Puede encontrar informaci&oacute;n b&aacute;sica en la p&aacute;gina de manual
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mg&sektion=1">mg(1)</a>
y en el
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/mg/tutorial?rev=1.1">tutorial</a>
que tambi&eacute;n se incluye con el c&oacute;digo fuente.  Cualquier
duda m&aacute;s interesante (como &laquo;&iexcl;No tengo una tecla
Meta!&raquo;) la puede resolver leyendo las
<a href="http://www.lerner.co.il/emacs/faq_toc.html">Preguntas
Frecuentes de Emacs</a>.

<p>
N&oacute;tese que debido a que mg es una peque&ntilde;a
implementaci&oacute;n de Emacs, y que es m&aacute;s parecido al editor
de texto Emacs 17, no tiene implementadas muchas de las otras funciones
de Emacs (incluidas las funciones de correo, noticias, y otras como
nodos para Lisp, C++, Lex, Awk, Java, etc... ).

<p>
<a name="8.16"></a>
<p>
<h2>8.16 - &iexcl;Ksh no lee mi .profile!</h2>

<p>
Existen dos posibles motivos para esto:

<ul>
   <li>Que Vd. no sea el propietario de .profile.
       Esto tiene f&aacute;cil arreglo:  Para <b>usuario</b>,

<p>
 <ul><tt>
 # <b>chown usuario ~usuario/.profile</b>
 </tt></ul>

<p>
<li>Que est&eacute; usando ksh desde X windows.

<p>
En xterm, argv[0] para ksh no va precedido por un gui&oacute;n.
Anteponer - a argv[0] har&aacute; que csh y ksh sepan que deben
interpretar sus ficheros de ingreso (en csh este fichero es .login, con
un fichero .cshrc separado que se interpreta siempre que inicia csh;
en ksh s&oacute;lo hay un gui&oacute;n de inicio, .profile.  Este
fichero se ignora a menos que la shell sea una shell de ingreso
(&quot;login shell&quot;).

<p>
Para solucionarlo, debe crear un fichero en su directorio de usuario
llamado .Xdefaults, con la l&iacute;nea <i>XTerm*loginShell: true</i>
en &eacute;l.

<p>
 <ul><tt>
 $ <b>echo &quot;XTerm*loginShell: true&quot; &gt; ~/.Xdefaults</b>
 </tt></ul>

<p>
Es posible que anteriormente no haya tenido que hacer esto, porque
algunas instalaciones de X Windows vienen con esta configuraci&oacute;n
por definici&oacute;n.  OpenBSD ha escogido seguir el modo de XFree86.
</ul>


<a name="8.17"></a>
<h2>8.17 - &iquest;Por qu&eacute; se sobreescribe el fichero /etc/motd
cuando lo modifico?</h2>

<p>
El fichero <i>/etc/motd</i> se edita cada vez que se arranca el
sistema, substituyendo la primera l&iacute;nea con la
informaci&oacute;n con informaci&oacute;n sobre el n&uacute;cleo del
sistema.  Cuando edite este fichero, aseg&uacute;rese de empezar a
escribir a partir de la tercera l&iacute;nea desde arriba, para evitar
que <i>/etc/rc</i> elimine esas l&iacute;neas cuando edite
<i>/etc/motd</i> durante el arranque.


<a name="8.18"></a>
<h2>8.18 - &iquest;Por qu&eacute; www.openbsd.org est&aacute; alojado
en un sistema Solaris?</h2>

<p>
Aunque ninguno de los desarrolladores piense que sea de particular
importancia, esta pregunta aparece en las listas de correo con la
frecuencia suficiente como para que sea contestada aqu&iacute;.
<i>www.openbsd.org</i> y el sitio de ftp principal de OpenBSD
est&aacute;n hospedados en un SunSITE en la Universidad de Alberta, en
Canad&aacute;.  Estos sitios est&aacute;n hospedados en un gran sistema
Sun, que dispone de acceso a grandes cantidades de espacio de
almacenamiento y de ancho de banda de Internet.  La presencia del
SunSITE permite al grupo de OpenBSD acceso a este ancho de banda.
&Eacute;sta es la raz&oacute;n por la que el sitio principal
est&aacute; aqu&iacute; hospedado.  Muchos de las r&eacute;plicas
est&aacute;n hospedadas en sistemas OpenBSD, pero como no tienen
garantizado el acceso a esta gran cantidad de ancho de banda, el grupo
escogi&oacute; hospedar el sitio principal en el SunSITE de la
Universidad de Alberta.


<a name="8.19"></a>
<h2>8.19 - Tengo problemas con la detecci&oacute;n de dispositivos PCI
en OpenBSD 2.8.</h2>

<p>
Existe una condici&oacute;n en OpenBSD 2.8 por la que algunas
m&aacute;quinas podr&iacute;an no detectar algunos dispositivos PCI
correctamente, o podr&iacute;an colgarse mientras detectan
m&uacute;ltiples NICs en una sola m&aacute;quina.  Esto se debe al
PCIBIOS, y tan s&oacute;lo es necesario un peque&ntilde;o ajuste para
que funcione correctamente.  Todo lo que hay que hacer es introducir la
configuraci&oacute;n de inicio y desactivar PCIBIOS.  Mire un ejemplo:
</p>

<ul>
<table border="0" width="800">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
boot&gt; <strong>boot -c</strong>
OpenBSD 2.8 (GENERIC) #377: Tue Oct 24 03:04:08 MDT 2000
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
cpu0: Intel Pentium III (Coppermine) (&quot;GenuineIntel&quot; 686-class) 390 MHz
cpu0: FPU,V86,DE,PSE,TSC,MSR,PAE,MCE,CX8,SYS,MTRR,PGE,MCA,CMOV,PAT,PSE36,MMX,FXS
R,SIMD
real mem  = 66629632 (65068K)
avail mem = 56770560 (55440K)
using 838 buffers containing 3432448 bytes (3352K) of memory
UKC&gt; <strong>disable pcibios</strong>
UKC&gt; <strong>quit</strong>
[... snip ...]
</pre>
                </td>
        </tr>
</table>
</ul>

<p>
En cuanto haya terminado con esto, puede seguir las instrucciones de la
<a href="faq5.html#5.6">secci&oacute;n 5.6</a> para crear un nuevo
n&uacute;cleo y as&iacute; no tendr&aacute; que preocuparse por esto en
el futuro.
</p>


<p>
<font color="#0000e0">
<a href="index.html">[Volver al &iacute;ndice principal]</a>
<a href="faq7.html">[Secci&oacute;n 7.0 - Controles del teclado]</a>
<a href="faq9.html">[Secci&oacute;n 9.0 - Consejos para usuarios de Linux]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq8.html,v 1.59 2001/01/27 22:19:48 ericj Exp ]<br>
$Translation: faq8.html,v 1.18 2001/02/24 22:41:06 horacio Exp $<br>
$OpenBSD: faq8.html,v 1.15 2001/02/25 20:15:35 jufi Exp $
</small>
</p>
</body>
</html>
