<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>8 - Preguntas generales</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords" content="openbsd,faq,documentación">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1998-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq7.html">[Secci&oacute;n 7 - Controles de teclado y
pantalla]</a>
<a href="faq9.html">[Secci&oacute;n 9 - Migrando desde un sistema
Linux</a>
</font>

<h1><font color="#e00000">8 - Preguntas generales</font></h1>
<hr>
   
<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#LostPW">8.1 - He olvidado mi contrase&ntilde;a...
&iexcl;qu&eacute; puedo hacer!</a>
<li><a href="#X">8.2 - XWindows no arranca, muestra muchos mensajes de
error.</a>
<li><a href="#CVS">8.3 - &iquest;Qu&eacute; es CVS y c&oacute;mo se
usa?</a>
<li><a href="#Ports">8.4 - &iquest;Qu&eacute; es el &aacute;rbol de
portes?</a>
<li><a href="#Packages">8.5 - &iquest;Qu&eacute; son los paquetes?</a>
<li><a href="#PortsvsPkgs">8.6 - &iquest;Qu&eacute; debo usar, los
Portes o los Paquetes?</a>
<li><a href="#NoFloppy">8.8 - &iquest;Existe alg&uacute;n modo de usar
la disquetera si no estaba instalada durante el arranque?</a>
<li><a href="#Bootloader">8.9 - El gestor de arranque de OpenBSD</a>
<i>(espec&iacute;fico para i386)</i>.
<li><a href="#SKey">8.10 - C&oacute;mo usar S/Key en OpenBSD.</a>
<li><a href="#SMP">8.12 - &iquest;Hay soporte para SMP
(multiprocesadores sim&eacute;tricos) en OpenBSD?</a>
<li><a href="#TTY">8.13 - A veces veo errores de entrada/salida al
intentar usar los dispositivos de tty.</a>
<li><a href="#Browsers">8.14 - &iquest;Qu&eacute; navegadores de
Internet hay para OpenBSD?</a>
<li><a href="#mg">8.15 - &iquest;C&oacute;mo puedo usar el editor
mg?</a>
<li><a href="#ksh">8.16 - &iexcl;ksh(1) no lee mi <tt>.profile</tt>!</a>
<li><a href="#motd">8.17 - &iquest;Por qu&eacute; se sobreescribe el
fichero <tt>/etc/motd</tt> cuando lo modifico?</a>
<li><a href="#wwwsolaris">8.18 - &iquest;Por qu&eacute; www.openbsd.org
est&aacute; hospedado en un sistema Solaris?</a>
<li><a href="#PCI">8.19 - Tengo problemas con la detecci&oacute;n de
dispositivos PCI.</a>
<li><a href="truetype.html">8.20 - Fuentes Antialias y TrueType en
XFree86</a>
<li><a href="#Journaling">8.21 - &iquest;Existe soporte para sistemas de
archivos tipo ReiserFS en OpenBSD?</a>
<li><a href="#RevDNS">8.22 - DNS inversa o por qu&eacute; tardo tanto
para ingresar</a>
<li><a href="#wwwnotstd">8.23 - &iquest;Por qu&eacute; las
p&aacute;ginas <i>web</i> de OpenBSD no son conformes con
HTML4/XHTML?</a>
<li><a href="#NTPerror">8.24 - &iquest;Por qu&eacute; el reloj del
sistema tiene un lapsus de veintipico segundos?</a>
</ul>

<hr> 

<p>
<a name="LostPW"></a>
<h2>8.1 - He Olvidado mi contrase&ntilde;a...  &iquest;qu&eacute; puedo
hacer?</h2>

<p>
La puede recuperar siguiendo los pasos a continuaci&oacute;n

<ol>
<li>Arranque en modo monousuario.  En la arquitectura i386, escriba
<kbd>boot -s</kbd> desde el punto de arranque.
<li>Monte los controladores:
<div style="margin-left: 2em">
<kbd># <b>fsck -p / &amp;&amp; mount -uw /</b></kbd>
</div>
<li>Si /usr no es la misma partici&oacute;n que / (no deber&iacute;a
serlo), entonces también tendr&aacute; que montarlo:
<div style="margin-left: 2em">
<kbd># <b>fsck -p /usr &amp;&amp; mount /usr</b></kbd>
</div>

<li>Ejecute
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&amp;sektion=1">passwd(1)</a>;
<li>arranque en modo multiusuario... &iexcl;y <i>recuerde</i> su
contrase&ntilde;a!
</ol>

<p>
<a name="X"></a>
<h2>8.2 - XWindows no arranca, muestra muchos mensajes de error.</h2>

<p>
Si tiene totalmente configurado X y est&aacute; usando un fichero
XF86Config que sabe con seguridad que es correcto, entonces es posible
que el problema se encuentre en machdep.allowaperture.  Aseg&uacute;rese
tambi&eacute;n de que

<blockquote><pre>
option APERTURE
</pre></blockquote>

<p>
est&eacute; en la configuraci&oacute;n del n&uacute;cleo de su sistema
(ya se encuentra en el n&uacute;cleo GENERIC).

<p>
Para solucionarlo, edite el fichero <tt>/etc/sysctl.conf</tt> para
permitir que X pueda acceder al controlador de apertura; escriba
<b>machdep.allowaperture=2</b>.  Si durante la instalaci&oacute;n se
hubiera contestado que s&iacute; a la pregunta sobre si quer&iacute;a
tener XWindows funcionando, esta configuraci&oacute;n aparecer&iacute;a
por definici&oacute;n.  OpenBSD requiere que todos los servidores de X
tengan activado el acceso al controlador de apertura, debido a que
controla el acceso a los puertos E/S en las placas de v&iacute;deo.

<p>
Si tiene otros problemas con X en i386, consulte la documentaci&oacute;n
de XFree86 en
<a href="http://www.xfree86.org/support.html">http://www.xfree86.org/support.html</a>.

<p>
<a name="CVS"></a>
<h2>8.3 - &iquest;Qu&eacute; es CVS y c&oacute;mo se usa?</h2>

<p>
CVS es la herramienta que utiliza el Proyecto OpenBSD para controlar los
cambios al c&oacute;digo fuente.  CVS son las siglas de &quot;Concurrent
Versions System&quot; (&laquo;Sistema de Versiones Concurrentes&raquo;).
Puede obtener m&aacute;s informaci&oacute;n sobre CVS en
<a href="http://www.cvshome.org/">http://www.cvshome.org/</a>.  CVS
puede ser utilizado por un usuario final para mantenerse sincronizado
con los cambios en los fuentes, y con los cambios en el &aacute;rbol de
portes.  Con CVS es muy f&aacute;cil bajarse los fuentes a trav&eacute;s
de uno de las muchas r&eacute;plicas de CVS del Proyecto.

<p>
<h3>C&oacute;mo configurar su entorno de CVS inicial</h3>

<p>
Puede obtener el c&oacute;digo fuente desde uno de los servidores de
AnonCVS de OpenBSD.  Puede encontrar una lista de estos servidores en 
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a>.
Despu&eacute;s de escoger un servidor, deber&aacute; escoger el
m&oacute;dulo que vaya a bajarse.  Existen tres m&oacute;dulos
principales disponibles desde el &aacute;rbol de CVS, que son:

<ul>
<li><tt>src</tt> - El m&oacute;dulo src contiene el c&oacute;digo fuente
de OpenBSD completo.  Esto incluye los fuentes del modo usuario y del
n&uacute;cleo del sistema.
<li><tt>ports</tt> - El m&oacute;dulo ports contiene todo lo necesario
para obtener un &aacute;rbol de portes de OpenBSD.  Para m&aacute;s
informaci&oacute;n sobre el &aacute;rbol de portes de OpenBSD, lea la
secci&oacute;n sobre <a href="#Ports">portes</a>.
<li><tt>XF4</tt> - El m&oacute;dulo XF4 contiene el c&oacute;digo fuente
para compilar XFree 4.
</ul>

<p>
Ahora que ya ha decidido qu&eacute; m&oacute;dulo desea obtener, queda
un paso m&aacute;s que tendr&aacute; que llevar a cabo para poder
obtenerlo.  Debe decidir qu&eacute; m&eacute;todo usar.  Por
definici&oacute;n, CVS baja los ficheros usando 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh&amp;sektion=1">ssh(1),</a> 
pero algunos servidores de AnonCVS puede permitir el uso de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rsh&amp;sektion=1">rsh(1)</a>.
Para los que se encuentren detr&aacute;s de un cortafuegos, existe la
opci&oacute;n de <i>pserver</i> y de algunos servidores que permiten el
acceso ssh por el puerto 2022.  Aseg&uacute;rese de leer
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a> 
para saber qu&eacute; protocolos est&aacute;n soportados en los
diferentes servidores.  A continuaci&oacute;n mostraremos un ejemplo
sobre c&oacute;mo llevar a cabo una simple descarga del c&oacute;digo
fuente.  En este ejemplo usaremos un servidor de CVS an&oacute;nimo
ubicado en los EE.UU., pero recuerde que si Vd se encuentra fuera de los
EE.UU. debe usar un servidor que est&eacute; ubicado m&aacute;s cerca de
Vd.  Hay muchos servidores de CVS an&oacute;nimo por todo el mundo,
as&iacute; que escoja el que tenga m&aacute;s cerca.  Tambi&eacute;n
usar&eacute; ssh para bajar los ficheros.

<blockquote><pre>
$ <b>export CVSROOT=anoncvs@anoncvs.usa.openbsd.org:/cvs</b>
$ <b>cvs get src</b>
Warning: Remote host denied X11 forwarding, perhaps xauth program could not be run on the server side.
cvs checkout: in directory src:
cvs checkout: cannot open CVS/Entries for reading: No such file or directory
cvs server: Updating src
U src/Makefile
[snip]
</pre></blockquote>

<p>
N&oacute;tese que tambi&eacute;n se ha activado la variable de entorno
CVSROOT.  Esta variable indica a 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1">cvs(1)</a>
el servidor de CVS An&oacute;nimo que debe utilizar.  Tambi&eacute;n se
puede especificar esta variable usando la opci&oacute;n <tt>-d</tt>, por
ejemplo:

<blockquote><pre>
$ <b>cvs -d anoncvs@anoncvs.usa.openbsd.org:/cvs get src</b>
</pre></blockquote>

<p>
Estas &oacute;rdenes deber&iacute;an ser ejecutadas desde el directorio
<tt>/usr</tt>, ya que as&iacute; se crear&aacute;n los directorios
<tt>/usr/src</tt>, <tt>/usr/ports</tt>, y <tt>/usr/www</tt>,
dependiendo, por supuesto, del m&oacute;dulo que indique para bajar.
Puede bajarse estos m&oacute;dulos en cualquier parte, pero si lo que
quiere es trabajar con ellos (o sea, 'make build'), se supone que deben
estar en los directorios arriba mencionados.

<p>
<h3>Mantener actualizado el &aacute;rbol de CVS</h3>

<p>
Una vez que haya obtenido su &aacute;rbol inicial, mantenerlo
actualizado ser&aacute; una tarea f&aacute;cil.  Puede actualizar en
cualquier momento que desee;  algunos servidores de CVS An&oacute;nimo
se actualizan con m&aacute;s frecuencia que otros, por lo que
deber&aacute; comprobar
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a>.
En el siguiente ejemplo actualizaremos el m&oacute;dulo www desde
anoncvs.usa.openbsd.org.  F&iacute;jese en la opci&oacute;n -q que
usaremos, sirve para que la informaci&oacute;n en pantalla que nos
llegue del servidor no sea excesiva.

<blockquote><pre>
$ <b>echo $CVSROOT</b>                                 
anoncvs@anoncvs.usa.openbsd.org:/cvs
$ <b>cvs -q up -Pd www</b>
Warning: Remote host denied X11 forwarding, perhaps xauth program could not be run on the server side.
U www/want.html
M www/faq/faq8.html
$
</pre></blockquote>

<p>
<h3>Otras opciones para cvs</h3>

<p>
Para algunos, el ancho de banda y el tiempo de conexi&oacute;n
representan serios problemas cuando actualizan desde repositorios como
&eacute;stos.  CVS tiene una opci&oacute;n -z[1-9] que usa gzip para
comprimir los datos.  Para usar esta opci&oacute;n a&ntilde;ada
-z[nivel-de-compresi&oacute;n]; por ejemplo, -z3 para un nivel 3 de
compresi&oacute;n.

<p>
<a name="Ports"></a>
<h2>8.4 - &iquest;Qu&eacute; es el &aacute;rbol de
portes?</h2>

<!-- XXXversion -->
<p>
El &aacute;rbol de portes es un conjunto de ficheros Makefile listos
para ser bajados, parcheados, configurados e instalados en programas de
modo usuario para que pueda ejecutarlos en el entorno de OpenBSD sin
tener que hacerlo todo a mano.  Puede obtener el &aacute;rbol de portes
desde el directorio <kbd>/pub/OpenBSD/3.4/ports.tar.gz</kbd> en
cualquiera de los servidores de FTP de OpenBSD.  Los portes m&aacute;s
recientes se encuentran disponibles desde el m&oacute;dulo
&quot;ports&quot; del &aacute;rbol de cvs, o por ftp en
<kbd>/pub/OpenBSD/snapshots/ports.tar.gz</kbd>.  Sin embargo, para la
mayor&iacute;a de usuarios, instalar los paquetes en lugar de los portes
ser&aacute; una opci&oacute;n mejor.  Los paquetes se generan desde los
portes, y vienen precompilados y listos para usar.  Para m&aacute;s
informaci&oacute;n sobre los paquetes, lea la secci&oacute;n sobre
<a href="#Packages">paquetes</a>.

<p>
<h3>Nota importante sobre el estado de sincronizaci&oacute;n del sistema
y de los portes</h3>

<p>
OpenBSD tiene en todo momento tres versiones &laquo;activas&raquo;:

<ul>
<li><a href="../../es/orders.html">Release</a>: La versi&oacute;n final
que se incluye en el CD.<br>
<li><a href="../../es/stable.html">Stable</a>: La versi&oacute;n
estable, o sea la final con mejoras de seguridad y fiabilidad
a&ntilde;adidas.<br>
<li><a href="upgrade-minifaq.html">Current</a>: La versi&oacute;n en
desarrollo de OpenBSD.
</ul>

<p>
<b>&iexcl;NO mezcle versiones del sistema y de los portes de OpenBSD
distintas!</b>

<p>
Si su sistema pertenece a la versi&oacute;n final (<i>-release</i>), use
la versi&oacute;n final del &aacute;rbol de portes.  No intente usar una
versi&oacute;n en desarrollo (<i>-current</i>) del &aacute;rbol de
portes en un sistema de la versi&oacute;n final o estable
(<i>-stable</i>).  Esto no s&oacute;lo no funcionar&aacute;, sino que
causar&aacute; molestias en las listas cuando pida ayuda porque
&laquo;nada funciona&raquo;.  N&oacute;tese que tambi&eacute;n hay una
rama <a href="../../es/stable.html">-stable</a> del &aacute;rbol de
portes, a la que se le aplican las reparaciones cr&iacute;ticas de los
portes de la rama <i>-release</i>.

<p>
En efecto, esto quiere decir que un nuevo porte no funcionar&aacute; con
casi total seguridad en un sistema &laquo;viejo&raquo; (aun en el caso
en que el sistema sea de una versi&oacute;n de desarrollo de hace
s&oacute;lo unas pocas semanas).

<p>
Si no tiene el &aacute;rbol de portes instalado, puede obtenerlo por
medio de cualquiera de los <a href="../../es/ftp.html">servidores de
FTP</a> de OpenBSD o, por supuesto, mediante el
<a href="../../es/orders.html">CD-ROM</a>.  El archivo con los portes es
<tt>ports.tar.gz</tt>, y debe desempaquetarlo en el directorio
<tt>/usr</tt>, creando <tt>/usr/ports</tt>, del siguiente modo:

<pre>
     $ <strong>ftp ftp://ftp.openbsd.org/pub/OpenBSD/3.4/ports.tar.gz</strong>
     $ <strong>sudo cp ports.tar.gz /usr</strong>
     $ <strong>cd /usr; sudo tar xzf ports.tar.gz</strong>
</pre>

<p>
Tambi&eacute;n se crea a diario una archivo preliminar del &aacute;rbol
de portes que se puede obtener desde cualquiera
de los <a href="../../es/ftp.html">servidores de FTP de OpenBSD</a> como
<kbd>/pub/OpenBSD/snapshots/ports.tar.gz</kbd>.  Si va a instalar una
versi&oacute;n preliminar (<i>snapshot</i>) del sistema de OpenBSD,
deber&aacute; usar un archivo preliminar de los portes que coincida con
aqu&eacute;lla.  Insistimos en que debe mantener su &aacute;rbol de
portes y el sistema de OpenBSD sincronizados.

<p>
<h3>&iquest;Cu&aacute;les son los portes disponibles?
&iquest;C&oacute;mo los puedo encontrar?</h3>

<p>
Use el &aacute;rbol de portes para buscar palabras claves.  Para ello
use <kbd>make search key=&quot;palabra_clave&quot;</kbd>.  A
continuaci&oacute;n puede ver un ejemplo de una b&uacute;squeda de
'samba':

<blockquote><pre>
$ <strong>make search key=&quot;samba&quot;</strong>
  [...]
Port:   amanda-client-2.4.2.2
Path:   misc/amanda,-client
Info:   network-capable tape backup (client only)
Maint:  Tom Schutter &lt;t.schutter@att.net&gt;
Index:  misc
L-deps:
B-deps: :devel/gmake gnuplot-*:math/gnuplot gtar-*:archivers/gtar samba-*:net/samba/stable
R-deps:
Archs:  any

Port:   samba-2.2.8a
Path:   net/samba/stable
Info:   SMB and CIFS client and server for UNIX
Maint:  The OpenBSD ports mailing-list &lt;ports@openbsd.org&gt;
Index:  net
L-deps: popt::devel/popt
B-deps: :devel/autoconf/2.13 :devel/metaauto
R-deps:
Archs:  any
  [...]
</pre></blockquote>

<p>
<h3>C&oacute;mo instalar los portes</h3>

<p>
Los portes se configuran para que sean EXTREMEDAMENTE f&aacute;ciles de
compilar e instalar.  A continuaci&oacute;n sigue un ejemplo en donde se
muestra como instalar el programa <tt>xfig</tt> para X11.  Podr&aacute;
observar que las dependencias se detectan y resuelven de forma
autom&aacute;tica.

<p>
Para empezar necesita cambiar al directorio del programa que desea.  Si
est&aacute; buscando un programa, puede actualizar su base de datos
local, o bien usar la funci&oacute;n de b&uacute;squeda que se ha
mencionado anteriormente.  Una vez que se encuentre en el directorio el
programa que desee instalar, ejecute <kbd>make install</kbd>.  Por
ejemplo:

<blockquote><pre>
$ <b>sudo make install</b>
===&gt;  Checking files for xfig-3.2.4
&gt;&gt; xfig.3.2.4.full.tar.gz doesn't seem to exist on this system.
&gt;&gt; Attempting to fetch /usr/ports/distfiles/xfig.3.2.4.full.tar.gz from http://w
ww.xfig.org/xfigdist/.
100% |**************************************************|  5042 KB    00:31
&gt;&gt; Checksum OK for xfig.3.2.4.full.tar.gz. (sha1)
===&gt;  xfig-3.2.4 depends on: jpeg.62 - jpeg.62 missing...
===&gt;  Verifying install for jpeg.62 in graphics/jpeg
===&gt;  Checking files for jpeg-6b
&gt;&gt; jpegsrc.v6b.tar.gz doesn't seem to exist on this system.
&gt;&gt; Attempting to fetch /usr/ports/distfiles/jpegsrc.v6b.tar.gz from ftp://ftp.uu
.net/graphics/jpeg/.
'EPSV': command not understood.
100% |**************************************************|   598 KB    00:06
&gt;&gt; Checksum OK for jpegsrc.v6b.tar.gz. (sha1)
===&gt;  Extracting for jpeg-6b
===&gt;  Patching for jpeg-6b
===&gt;  Configuring for jpeg-6b
checking for gcc... cc
checking whether the C compiler (cc -O2   ) works... yes
checking whether the C compiler (cc -O2   ) is a cross-compiler... no
checking whether we are using GNU C... yes
  [...]
</pre></blockquote>

<p>
<h3>Uso de <i>Flavors</i></h3>

<p>
Muchas de las aplicaciones en el &aacute;rbol de portes tienen soporte
para diferentes opciones de instalaci&oacute;n, llamadas <i>flavors</i>
(&laquo;sabores&raquo;).  Si un porte tiene m&uacute;ltiples opciones,
puede usar estas opciones configurando una variable de entorno antes de
compilar el porte.  Si se necesita varias de las opciones, se puede
configurar la variable <tt>FLAVOR</tt> como una lista delimitada por
espacios de las opciones que se deseen y de que se dispongan.  En este
momento, muchos portes disponen de opciones que incluyen soporte para
bases de datos, para sistemas sin X, o adiciones de red como SSL e IPv6.

<blockquote><pre>
$ <b>pwd</b>
/usr/ports/net/mtr
$ <b>make show=FLAVORS</b>
no_x11
$ <b>env FLAVOR="no_x11" make</b>
===&gt;  mtr-0.49-no_x11 depends on: gmake-3.80 - not found
===&gt;  Verifying install for gmake-3.80 in devel/gmake
===&gt;  Checking files for gmake-3.80
&gt;&gt; make-3.80.tar.gz doesn't seem to exist on this system.
&gt;&gt; Attempting to fetch /usr/ports/distfiles/make-3.80.tar.gz from ftp://ftp.gnu.
org/gnu/make/.
Unknown command.
100% |**************************************************|  1183 KB    00:07
&gt;&gt; Checksum OK for make-3.80.tar.gz. (sha1)
  [...]
$ <b>sudo env FLAVOR="no_x11" make install</b>
===&gt;  Faking installation for mtr-0.49-no_x11
  [...]
===&gt;  Building package for mtr-0.49-no_x11
Creating package /usr/ports/packages/i386/All/mtr-0.49-no_x11.tgz
Using SrcDir value of /usr/ports/net/mtr/w-mtr-0.49-no_x11/fake-i386-no_x11/usr/
local
Creating gzip'd tar ball in '/usr/ports/packages/i386/All/mtr-0.49-no_x11.tgz'
===&gt;  Installing mtr-0.49-no_x11 from /usr/ports/packages/i386/All/mtr-0.49-no_a
x11.tgz
</pre></blockquote>

<p>
<h3>C&oacute;mo obtener una lista de todos los portes y paquetes
instalados</h3>

<p>
Puede ver una lista, tanto para portes como para paquetes, usando la
orden pkg_info.

<blockquote><pre>
$ <b>/usr/sbin/pkg_info</b>
zsh-4.1.1           The Z shell.
screen-3.9.15       A multi-screen window manager.
emacs-21.3          GNU editing macros.
tcsh-6.12.00        An extended C-shell with many useful features.
bash-2.05b          The GNU Borne Again Shell.
zip-2.3             Create/update ZIP files compatible with pkzip.
ircII-20030314      An enhanced version of ircII, the Internet Relay Chat client
ispell-3.2.06       An interactive spelling checker.
tin-1.6.1           TIN newsreader (termcap based)
procmail-3.22       A local mail delivery agent.
strobe-1.06         Fast scatter/gather TCP port scanner
lsof-4.68           Lists information about open files.
ntp-4.1.74          Network Time Protocol Implementation.
ncftp-3.1.5p0       ftp replacement with advanced user interface
nmh-1.0.4p1         The New MH mail handling program
bzip2-1.0.2         A block-sorting file compressor
</pre></blockquote>

<p>
<h3>M&aacute;s informaci&oacute;n</h3>

<p>
Puede encontrar m&aacute;s informaci&oacute;n sobre los portes en la
p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&amp;sektion=7">ports(7)</a> 
o en la <a href="../../es/ports.html">p&aacute;gina sobre portes</a>.

<p>
Nuestro &aacute;rbol de fuentes se encuentra en cont&iacute;nua
expansi&oacute;n;  si quiere ayudar, por favor lea
<a href="../../es/porting.html">
http://www.openbsd.org/es/porting.html</a>.


<p>
<a name="Packages"></a>
<h2>8.5 - &iquest;Qu&eacute; son los paquetes?</h2>

<p>
Los paquetes son binarios precompilados de algunos de los programas
m&aacute;s usados.  Est&aacute;n preparados para usarlos directamente en
un sistema OpenBSD.  Al igual que los portes, los paquetes son muy
f&aacute;ciles de mantener y actualizar.  Aseg&uacute;rese de comprobar
qu&eacute; paquetes adicionales existen para cada versi&oacute;n del
sistema, ya que continuamente se est&aacute;n a&ntilde;adiendo paquetes
nuevos.

<p>
Aqu&iacute; puede ver una lista de las herramientas que se utilizan para
gestionar paquetes.<br>

<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add">
pkg_add(1)</a> - utilidad para instalar distribuciones de paquetes de
<i>software</i>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_create">
pkg_create(1)</a> - utilidad para crear distribuciones de paquetes de
<i>software</i>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete">
pkg_delete(1)</a> - utilidad para desinstalar distribuciones de paquetes
de <i>software</i> previamente instalados
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info">
pkg_info(1)</a> - utilidad para mostrar informaci&oacute;n sobre
paquetes de<i> software</i>
</ul>

<p>
<h3>D&oacute;nde encontrar los paquetes</h3>

<!-- XXXversion -->
<p>
Si es Vd. un usuario avispado y compr&oacute; los
<a href="../../es/orders.html">CDs de OpenBSD</a>, entonces podr&aacute;
encontrar los paquetes en uno de los tres CDs, dependiendo de su
arquitectura.  Si no dispone de los CDs de OpenBSD, puede obtener los
paquetes baj&aacute;ndoselos de cualquiera de las r&eacute;plicas del
servidor de ftp.  Hay una lista de las r&eacute;plicas del servidor de
ftp en 
<a href="../../es/ftp.html">http://www.openbsd.org/es/ftp.html</a>.
Los paquetes est&aacute;n ubicados en
<tt>/pub/OpenBSD/3.4/packages</tt>; desde ah&iacute; los paquetes se
subdividen dependiendo de la arquitectura.

<p>
<h3>C&oacute;mo instalar los paquetes</h3>

<p>
Para instalar paquetes se utiliza la herramienta
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add">pkg_add(1)</a>.
pkg_add(1) es muy fácil de usar, y en los dos ejemplos que aparecen a
continuaci&oacute;n puede ver c&oacute;mo instalar un paquete con
pkg_add(1).  El primer ejemplo muestra c&oacute;mo instalar con
pkg_add(1) un paquete que est&eacute; ubicado en un disco local,
mientras que el segundo ejemplo muestra la instalaci&oacute;n de un
paquete por medio de ftp.  En ambos ejemplos se instalar&aacute;
screen-3.9.15.

<p>
Instalaci&oacute;n desde un disco local
<blockquote><pre>
$ <b>sudo pkg_add -v screen-3.9.15.tgz</b>
Requested space: 749864 bytes, free space: 2239117312 bytes in /var/tmp/instmp.cpsHA27596
Running install with PRE-INSTALL for `screen-3.9.15'
extract: Package name is screen-3.9.15
extract: CWD to /usr/local
extract: /usr/local/bin/screen-3.9.15
extract: execute 'ln -sf screen-3.9.15 /usr/local/bin/screen'
extract: /usr/local/man/man1/screen.1
extract: /usr/local/info/screen.info
extract: execute '[ -f /usr/local/info/dir ] || sed -ne '1,/Menu:/p' /usr/share/info/dir &gt; /usr/local/info/dir'
extract: execute 'install-info /usr/local/info/screen.info /usr/local/info/dir'
extract: /usr/local/lib/screen/screencap
extract: /usr/local/lib/screen/screenrc
extract: CWD to .
Running mtree for `screen-3.9.15'
mtree -q -U -f +MTREE_DIRS -d -e -p /usr/local
Running install with POST-INSTALL for `screen-3.9.15'

+---------------
| The file /etc/screenrc has been created on your system.
| You may want to verify/edit its contents
|
| The file /usr/local/lib/screen/screencap contains a
| termcap like description of the screen virtual terminal.
| You may use it to update your terminal database.
| See <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=termcap&amp;sektion=5">termcap(5)</a>.
+---------------

Attempting to record package into `/var/db/pkg/screen
Package `screen-3.9.15' registered in `/var/db/pkg/screen-3.9.15'
</pre></blockquote>

<p>
En este ejemplo se ha usado el indicador <b>-v</b> para obtener una
salida con m&aacute;s informaci&oacute;n; esta opci&oacute;n no es
necesaria, pero ayuda a depurar y se ha usado aqu&iacute; para ofrecer
una visi&oacute;n m&aacute;s detallada del proceso llevado a cabo por
pkg_add(1).  Habr&aacute; notado que aparece un mensaje en el que se
menciona el fichero <tt>/etc/screenrc</tt>.  Este tipo de mensaje
aparecer&aacute;n tanto si usa la opci&oacute;n <b>-v</b> como si no.

<p>
Instalaci&oacute;n desde ftp
<blockquote><pre>
$ <strong>sudo pkg_add ftp://ftp.openbsd.org/pub/OpenBSD/3.4/packages/i386/screen-3.9.15.tgz</strong>
&gt;&gt;&gt; ftp -o - ftp://ftp.openbsd.org/pub/OpenBSD/3.4/packages/i386/screen-3.9.15.tgz

+---------------
| The file /etc/screenrc has been created on your system.
| You may want to verify/edit its contents
|
| The file /usr/local/lib/screen/screencap contains a
| termcap like description of the screen virtual terminal.
| You may use it to update your terminal database.
| See <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=termcap&amp;sektion=5">termcap(5)</a>.
+---------------
</pre></blockquote>

<p>
En este ejemplo puede observar que se ha instalado el paquete indicando
la arquitectura i386.  Si la arquitectura es otra distinta, entonces hay
que sustituir <i>i386</i> (en el ejemplo anterior) con la arquitectura
correspondiente.  N&oacute;tese que no todas las arquitecturas disponen
de los mismos paquetes.  Algunos portes no funcionan en ciertas
arquitecturas.  En el ejemplo no se ha usado la opci&oacute;n <b>-v</b>,
as&iacute; que s&oacute;lo se ha mostrado la informaci&oacute;n
NECESARIA.

<p>
<h3>C&oacute;mo ver y eliminar los paquetes ya instalados</h3>

<p>
Para ver una lista de todos los paquetes que se encuentren instalados en
su sistema, puede usar la herramienta
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info">pkg_info(1)</a>.
Por regla general, necesitar&aacute; usar esta herramienta para poder
ver el nombre exacto de un paquete antes de proceder a su
eliminaci&oacute;n.  Para ver qu&eacute; paquetes se encuentran
instalados en su sistema, ejecute la siguiente orden:

<blockquote><pre>
$ <b>pkg_info</b>
mpg123-0.59rp1     mpeg audio 1/2 layer 1, 2 and 3 player
nmap-3.00          port scanning large networks
ircII-20030314     enhanced version of ircII (internet relay chat)
screen-3.9.15      multi-screen window manager
unzip-5.50r2       extract, list &amp; test files in a ZIP archive
ntp-4.1.74         Network Time Protocol implementation
icb-5.0.9p1        Internet CB - mostly-defunct chat client
</pre></blockquote>

<p>
Para eliminar un paquete, tome el nombre del paquete tal y como se
muestra con la orden pkg_info(1), y use la herramienta
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete">pkg_delete(1)</a> para eliminarlo.
En el siguiente ejemplo se muestra c&oacute;mo eliminar el paquete
screen.  En algunos casos existen instrucciones sobre algunos objetos
que deben ser eliminados y que pkg_delete(1) no eliminar&aacute;, y que
por tanto deber&aacute; eliminarlos Vd. mismo.  Como se hizo
anteriormente con pkg_add(1), puede usar la opci&oacute;n <b>-v</b> para
obtener una informaci&oacute;n m&aacute;s amplia del proceso.

<blockquote><pre>
$ <b>sudo pkg_delete screen-3.9.15</b>

+---------------
| To completely deinstall the screen-3.9.15 package you need to perform
| this step as root:
|
|           rm -f /etc/screenrc
|
| Do not do this if you plan on re-installing screen-3.9.15
| at some future time.
+---------------
</pre></blockquote>

<p>
<a name="PortsvsPkgs"></a>
<h2>8.6 - &iquest;Qu&eacute; debo usar, los Portes o los Paquetes?</h2>

<p>
Como regla general, es MUY recomendable usar los
<a href="#Packages">paquetes</a> antes que compilar una
aplicaci&oacute;n desde los <a href="#Ports">portes</a>.  El equipo de
portadores de OpenBSD considera que los paquetes son el objetivo final
de su trabajo, y no los portes en s&iacute;.

<p>
La compilaci&oacute;n de una aplicaci&oacute;n a partir del
c&oacute;digo fuente no es una tarea trivial.  La aplicaci&oacute;n no
s&oacute;lo debe compilarse , sino que tambi&eacute;n deben compilarse
las herramientas necesarias para su compilaci&oacute;n.
Desafortunadamente, tanto OpenBSD como las herramientas y las
aplicaciones son c&oacute;digo en evoluci&oacute;n, y con frecuencia es
todo un reto conseguir que todas las piezas funcionen juntas.  Una vez
que todo est&eacute; funcionando, una revisi&oacute;n en cualquiera de
las piezas al d&iacute;a siguiente puede echarlo todo a perder.  Cada
<a href="faq1.html#Next">seis meses</a>, seg&uacute;n sale una nueva
<a href="faq5.html#Flavors">versi&oacute;n final</a> de OpenBSD, se
lleva a cabo un esfuerzo por realizar pruebas de control de la
compilaci&oacute;n de cada uno de los portes en cada una de las
plataformas, pero es muy posible que algo se estropee durante el ciclo
de desarrollo.

<p>
Adem&aacute;s de conseguir que todas las piezas funcionen al
un&iacute;sono, tambi&eacute;n est&aacute; el asunto del tiempo y los
recursos que se requieren para compilar algunas aplicaciones a partir
del c&oacute;digo fuente.  Un ejemplo muy com&uacute;n es el de
<a href="http://www.cvsup.org/">CVSup</a>, una herramienta que suele
usarse para el <a href="../../es/cvsup.html">seguimiento del
&aacute;rbol de fuentes de OpenBSD</a>.  La instalaci&oacute;n de CVSup
en un sistema moderadamente r&aacute;pido con una conexi&oacute;n a
Internet decente puede tardar s&oacute;lo unos diez segundos, el tiempo
necesario para descargar y desempaquetar un archivo de paquete de 511kB.
En contraste, compilar CVSup a partir del c&oacute;digo fuente en esa
misma m&aacute;quina es una tarea de enormes dimensiones, y para la que
se necesitan muchas herramientas y un mecanismo de arranque para un
compilador, se tardar&iacute;a casi media hora.  Otras aplicaciones,
como <a href="http://www.mozilla.org">Mozilla</a> o
<a href="http://www.kde.org">KDE</a>, pueden tardar horas y consumir
grandes cantidades de espacio en disco y de memoria de <i>RAM/swap</i>
para la compilaci&oacute;n.  &iquest;Para qu&eacute; tanto tiempo y
esfuerzo cuando los programas ya est&aacute;n compilados y esperando a
ser usados en el <a href="../../es/orders.html">CD-ROM</a> o en la
<a href="../../es/ftp.html">r&eacute;plica del servidor de FTP</a>?

<p>
Por supuesto que hay casos en los que existen unas cuantas buenas
razones para usar los portes en lugar de los paquetes:

<ul>
<li>Cuando las reglas de distribuci&oacute;n prohiben a OpenBSD
distribuir un paquete.
<li>Cuando se desea modificar o depurar una aplicaci&oacute;n, o
estudiar su c&oacute;digo fuente.
<li>Cuando se necesita un SABOR (<i>FLAVOR</i>) concreto de un porte que
est&eacute; en el paquete precompilado por el equipo de portadores de
OpenBSD.
<li>Cuando se quiere alterar la composici&oacute;n del directorio (o
sea, modificar PREFIX o SYSCONFDIR).
</ul>

<p>
Sin embargo, para la mayor&iacute;a de usuarios y de aplicaciones, el
uso de los paquetes es mucho m&aacute;s f&aacute;cil, adem&aacute;s de
ser el modo recomendado de a&ntilde;adir aplicaciones a OpenBSD.

<p>
<a name="NoFloppy"></a>
<h2>8.8 -  &iquest;Existe alg&uacute;n modo de usar la disquetera si no
estaba instalada durante el arranque?</h2>

<p>
Por supuesto.  Para ello debe a&ntilde;adir &quot;flags 0x20&quot; al
final de la entrada fd* y recompilar el n&uacute;cleo de su sistema.  La
l&iacute;nea debe quedar del siguiente modo:

<blockquote><pre>
fd*     at fdc? drive ? flags 0x20
</pre></blockquote>

<p>
Despu&eacute;s de hacer esto ya puede usar la unidad de la disquetera en
cualquier momento, sin importar si la instal&oacute; antes o
despu&eacute;s del arranque.

<p>
<a name="Bootloader"></a>
<h2>8.9 - El cargador de arranque de OpenBSD (<i>espec&iacute;fico para
i386</i>)</a></h2>

<p>
Al iniciar su sistema OpenBSD habr&aacute; visto el punto de arranque
del sistema.

<p>
<blockquote>
boot&gt;
</blockquote>

<p>
La mayor&iacute;a de los usuarios no tendr&aacute;n que hacer nada en
este punto, ya que iniciar&aacute; el sistema de forma autom&aacute;tica
a menos que se le pase alguna orden.  Pero algunas veces pueden surgir
problemas, o se puede necesitar de alguna funci&oacute;n especial.  Para
entender el punto de arranque debe leer la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&amp;sektion=8&amp;arch=i386">boot(8)</a>.
En esta secci&oacute;n trataremos &uacute;nicamente las &oacute;rdenes
m&aacute;s comunes para el gestor de arranque.

<p>
En principio, si no se introduce ninguna orden, el gestor de arranque
tratar&aacute; de iniciar la imagen del n&uacute;cleo
<strong>/bsd</strong> de forma autom&aacute;tica.  Si esto fallara,
intentar&iacute;a iniciar <strong>/obsd</strong> y, si esto falla, lo
intentar&aacute; con <strong>/bsd.old</strong>.  Se puede especificar un
n&uacute;cleo de arranque a mano, mediante:

<blockquote><pre>
boot&gt; <strong>boot hd0a:/bsd</strong>
</pre></blockquote>

&oacute;

<blockquote><pre>
boot&gt; <strong>b /bsd</strong>
</pre></blockquote>

<p>
Esto arrancar&aacute; el n&uacute;cleo <tt>bsd</tt> desde la
partici&oacute;n 'a' de la primera BIOS reconocida del disco duro.

<p>
He aqu&iacute; una breve lista de opciones que puede usar con el
n&uacute;cleo de OpenBSD.

<ul>
<li><b>-a</b> : Le permite especificar un dispositivo ra&iacute;z
alternativo despu&eacute;s de arrancar el n&uacute;cleo.
<li><b>-c</b> : Le permite introducir la configuraci&oacute;n para el
arranque.  Lea la secci&oacute;n sobre la
<a href="faq5.html#BootConfig">configuraci&oacute;n durante el
arranque</a> del cap&iacute;tulo 5 de estos documentos.
<li><b>-s</b> : Le permite iniciar en modo monousuario.
<li><b>-d</b> : Le permite volcar el n&uacute;cleo en el depurador ddb.
Tenga en cuenta que DDB debe estar configurado en el n&uacute;cleo.
</ul>

<p>
Estas opciones se introducen de la siguiente forma:
<b>boot [ imagen [-acds]]</b>

<p>
Para m&aacute;s informaci&oacute;n, lea la p&aacute;gina del manual de
<a href="http://www.OpenBSD.org/cgi-bin/man.cgi?query=boot_i386&amp;sektion=8">boot_i386(8)</a>.

<p>
<a name="SKey"></a>
<h2>8.10 - S/Key</h2>

<p>
S/Key es un esquema de &laquo;contrase&ntilde;a de una sola vez&raquo;.
Con S/Key se pueden usar contrase&ntilde;as que se usar&aacute;n
s&oacute;lo una vez en canales sin ning&uacute;n tipo de seguridad
implementada.  Esto puede ser &uacute;til para aquellos que no puedan
usar ssh o cualquier otro canal cifrado.  La implementaci&oacute;n de
S/Key en OpenBSD puede hacer uso de varios algoritmos como
&quot;hash&quot; de una direcci&oacute;n.  Se encuentran disponibles los
siguientes algoritmos:

<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md4&amp;sektion=3">md4</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md5&amp;sektion=3">md5</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sha1&amp;sektion=3">sha1</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rmd160&amp;sektion=3">rmd160</a>.
</ul>

<p>
<h3>Configuraci&oacute;n de S/Key - Primeros pasos</h3>

<p>
Para empezar debe existir el fichero <tt>/etc/skey</tt>.  Si no
existiera este fichero, p&iacute;dale al administrador que lo cree.
Para crear este fichero basta con ejecutar:

<blockquote><pre>
<strong># mkdir /etc/skey</strong>
</pre></blockquote>

<p>
Una vez que exista ese directorio, se podr&aacute; iniciar S/Key.  Para
iniciar S/Key hay que usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skeyinit&amp;sektion=1">skeyinit(1)</a>.
Con skeyinit(1), lo primero que le preguntar&aacute; ser&aacute; por su
contrase&ntilde;a en el sistema.  &Eacute;sta es la misma que usa para
ingresar en el sistema.  La ejecuci&oacute;n de skeyinit(1) en un canal
no seguro no es recomendable, as&iacute; que deber&iacute;a ejecutarlo
por un canal seguro como ssh o desde la consola.  Una vez que se haya
autorizado a s&iacute; mismo mediante la contrase&ntilde;a del sistema,
le pedir&aacute; que introduzca otra contrase&ntilde;a.  &Eacute;sta es
la <i>contrase&ntilde;a secreta</i> de S/Key, y <b>NO</b> su
contrase&ntilde;a del sistema.  Su contrase&ntilde;a secreta debe
contener un m&iacute;nimo de 10 caracteres.  Le aconsejamos que use como
contrase&ntilde;a una frase que pueda recordar y que se componga de
varias palabras.  En el siguiente ejemplo se muestra c&oacute;mo
a&ntilde;adir un usuario.

<blockquote><pre>
oshibana:ericj&gt; <b>skeyinit ericj</b>
[Adding ericj]
Reminder - Only use this method if you are directly connected
   or have an encrypted channel.  If you are using telnet
   or rlogin, exit with no password and use skeyinit -s.
Enter secret password:
Again secret password:

ID ericj skey is otp-md5 99 oshi45820             
Next login password: HAUL BUS JAKE DING HOT HOG
</pre></blockquote>

<p>
La l&iacute;nea <i>ID ericj skey is otp-md5 99 oshi45820</i> es de
especial importancia.  Esta l&iacute;nea muestra mucha
informaci&oacute;n al usuario.  Analicemos la l&iacute;nea por partes y
seg&uacute;n importancia:

<ul>
<li><i>otp-md5</i> - Indica que &quot;hash&quot; se us&oacute; para
crear la &laquo;contrase&ntilde;a de una sola vez&raquo; (otp,
&quot;One-Time Password&quot;).
<li><i>99</i> - El n&uacute;mero de la secuencia.  Es un n&uacute;mero
entre 100 y 1.  En cuanto alcanza 1, es necesario crear otra
contrase&ntilde;a secreta.
<li><i>oshi45820</i> - La clave.
</ul>

<p>
Pero lo m&aacute;s importante es la contraseña.  En el ejemplo, la
contrase&ntilde;a consiste de 6 peque&ntilde;as palabras que, combinadas
e incluyendo espacios y cualquier otro car&aacute;cter, forman la
contrase&ntilde;a.

<p>
<h3>C&oacute;mo usar S/Key para el ingreso (<i>login</i>)</h3>

<p>
Ahora que su skey ya ha sido iniciada, y que ya tiene su
contrase&ntilde;a, ya est&aacute; preparado para ingresar.  Aqu&iacute;
puede ver una sesi&oacute;n de muestra en la que se usa S/Key para
ingresar.  A partir de la versi&oacute;n 3.0 de OpenBSD, el ingreso
mediante S/Key es diferente.  En OpenBSD 3.0 y versiones posteriores
debe anteponer <b>:skey</b> a su nombre de ingreso.  En las versiones
anteriores a OpenBSD 3.0 use <b>s/key</b> para la contrase&ntilde;a y le
pedir&aacute; su contrase&ntilde;a de S/Key (excepto ftpd(8), que
siempre presenta un desaf&iacute;o de S/Key para usuarios con S/Key
activado en sistemas anteriores a OpenBSD 3.0).  En los ejemplos
siguientes se asume que la versi&oacute;n de OpenBSD es la 3.0 o
posterior.

<blockquote><pre>
oshibana:ericj&gt; ftp localhost
Connected to localhost.
220 oshibana.shin.ms FTP server (Version 6.5/OpenBSD) ready.
Name (localhost:ericj): ericj:skey
331- otp-md5 96 oshi45820
331 S/Key Password: 
230- OpenBSD 3.4 (GENERIC) #18: Wed Sep 17 03:34:47 MDT 2003
230-
230- Welcome to OpenBSD: The proactively secure Unix-like operating system.
230-
230- Please use the sendbug(1) utility to report bugs in the system.
230- Before reporting a bug, please try to reproduce it with the latest
230- version of the code.  With bug reports, please try to ensure that
230- enough information to reproduce the problem is enclosed, and if a
230- known fix for it exists, include that as well.
230-
230 User ericj logged in.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp&gt; quit
221 Goodbye.
</pre></blockquote>

<p>
N&oacute;tese que he precedido mi nombre de usuario con
&laquo;:skey&raquo;.  De este modo indico a ftpd que quiero usar S/Key
como m&eacute;todo de autenticaci&oacute;n.  Es probable que haya notado
que mi n&uacute;mero de secuencia ha cambiado a <i>otp-md5 96
oshi45820</i>.  Esto se debe a que ya he usado varias veces S/Key para
el ingreso.  Pero, &iquest;c&oacute;mo se obtiene la contrase&ntilde;a
despu&eacute;s de haber ingresado una vez?  Pues bien, para ello debe
saber qu&eacute; n&uacute;mero de secuencia est&aacute; usando y su
clave.  Probablemente est&eacute; pensando en c&oacute;mo puede recordar
qu&eacute; n&uacute;mero de secuencia est&aacute; usando en ese
momento... bueno, esto es f&aacute;cil, use
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skeyinfo&amp;sektion=1">skeyinfo(1)</a>,
le dir&aacute; el n&uacute;mero de secuencia actual.  En el ejemplo, hay
que generar otra contrase&ntilde;a para un posible ingreso en el futuro
(recuerde que en el ejemplo se asume que se encuentra en un canal
seguro):

<blockquote><pre>
oshibana:ericj&gt; <b>skeyinfo</b>
95 oshi45820
</pre></blockquote>

<p>
Una forma a&uacute;n mejor es usar <b>skeyinfo -v</b>, que produce una
orden ejecutable por el int&eacute;rprete de &oacute;rdenes
(<i>shell</i>).  Por ejemplo:

<blockquote><pre>
oshibana:ericj&gt; <b>skeyinfo -v</b>
otp-md5 95 oshi45820
</pre></blockquote>
 
<p>
<i>otp-md5</i> no es s&oacute;lo una descripci&oacute;n del resumen
criptogr&aacute;fico (<i>hash</i>) usado, sino tambi&eacute;n un nombre
alternativo para la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&amp;sektion=1">
skey(1)</a>.  Por consiguiente, la forma m&aacute;s simple de generar la
contrase&ntilde;a de S/Key siguiente es:

<blockquote><pre>
oshibana:ericj&gt; <b>`skeyinfo -v`</b>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password:
NOOK CHUB HOYT SAC DOLE FUME
</pre></blockquote>

<p>
N&oacute;tense el tipo de comillas usado en el ejemplo anterior.

<p>
Como es probable que muchos usuarios no siempre podr&aacute;n disponer
de una conexi&oacute;n segura para generar la contrase&ntilde;a, y
generarla en una conexi&oacute;n insegura no es factible, &iquest;se
podr&iacute;an generar m&uacute;ltiples contrase&ntilde;as de una sola
vez?  S&iacute;, ejecute skey(1) con el n&uacute;mero de
contrase&ntilde;as que desee generar.  Puede imprimir estas
contrase&ntilde;as y llev&aacute;rselas consigo.

<blockquote><pre>
oshibana:ericj&gt; <b>otp-md5 -n 5 95 oshi45820</b>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password:
91: SHIM SET LEST HANS SMUG BOOT
92: SUE ARTY YAW SEED KURD BAND
93: JOEY SOOT PHI KYLE CURT REEK
94: WIRE BOGY MESS JUDE RUNT ADD
95: NOOK CHUB HOYT SAC DOLE FUME
</pre></blockquote>

<p>
Nota: La &uacute;ltima contrase&ntilde;a es la primera que deber&aacute;
usar, ya que es una cuenta atr&aacute;s desde 100.

<p>
<h4>Usar S/Key con telnet(1), ssh(1), y rlogin(1)</h4>

<p>
Usar S/Key con telnet(1), ssh(1), o rlogin(1) es muy parecido a hacerlo
con ftp;  s&oacute;lo tiene que a&ntilde;adir &laquo;:skey&raquo; al
final de su nombre de usuario.

<blockquote><pre>
$ <b>telnet localhost</b>
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

OpenBSD/i386 (oshibana) (ttyp2)

login: ericj:skey
otp-md5 98 oshi45821
S/Key Password: <b>SCAN OLGA BING PUB REEL COCA</b>
Last login: Thu Oct  7 12:21:48 on ttyp1 from 156.63.248.77
OpenBSD 3.4 (GENERIC) #18: Wed Sep 17 03:34:47 MDT 2003

Welcome to OpenBSD: The proactively secure Unix-like operating system.

Please use the sendbug(1) utility to report bugs in the system.
Before reporting a bug, please try to reproduce it with the latest
version of the code.  With bug reports, please try to ensure that
enough information to reproduce the problem is enclosed, and if a
known fix for it exists, include that as well.

You have mail.
$
</pre></blockquote>


<p>
<a name="SMP"></a>
<h2>8.12 - &iquest;Hay soporte para SMP (multiprocesadores
sim&eacute;tricos) en OpenBSD?</h2>

<p>
Todav&iacute;a no.  Estamos trabajando sobre ello, y existe un
<a href="../../es/smp.html">proyecto SMP para OpenBSD</a>, aunque no
a&uacute;n no hay nada que se pueda utilizar ni hay una fecha
l&iacute;mite para el soporte de SMP.

<p>
En la mayor&iacute;a de las plataformas, OpenBSD funciona en sistemas
SMP, aunque s&oacute;lo utiliza un procesador.  La &uacute;nica
excepci&oacute;n es la plataforma
<a href="../../es/sparc.html">SPARC</a>.  OpenBSD/sparc
necesitar&aacute; algunas veces que se extraigan del sistema los
m&oacute;dulos MBus adicionales para que arranque el sistema.  Los
sistemas con multiprocesador SPARC64 funcionar&aacute;n siempre y cuando
exista <a href="../../es/sparc64.html">soporte</a> para la
m&aacute;quina que se utilice.

<p>
<b>&iquest;C&oacute;mo se puede ayudar?</b><br>
<ul>
<li>Escribiendo c&oacute;digo.  Hay mucho trabajo por hacer.
<li>Donando equipos y componentes.  El objetivo del proyecto SMP para
OpenBSD es el de conseguir soporte para tantas plataformas como sea
posible, incluidas
<a href="../../es/sparc.html">SPARC</a>, 
<a href="../../es/sparc64.html">SPARC64</a>, 
<a href="../../es/alpha.html">Alpha</a>, 
<a href="../../es/macppc.html">MacPPC</a> 
y, por supuesto, <a href="../../es/i386.html">i386</a>.
&iexcl;Cualquier donaci&oacute;n de
<a href="../../es/want.html"><i>hardware</i> que necesitamos</a> es
bienvenida!<br>
<li>No se ofrezca para hacer pruebas.  El proyecto SMP no forma parte
del proyecto principal de OpenBSD en este instante, debido a que
todav&iacute;a no est&aacute; listo para ser productivo, ni siquiera
para pruebas generales.  No tiene ning&uacute;n sentido que en este
momento env&iacute;e ning&uacute;n informe a los desarrolladores sobre
el fallo de funcionamiento en su equipo, a menos que aporte
c&oacute;digo que pueda funcionar.
<a href="../es/faq4.html#SendDmesg">Env&iacute;e el producto de
dmesg</a>, y si un desarrollador ve algo interesante contactar&aacute;
con Vd para hacer pruebas.
</ul>

<p>
<a name="TTY"></a>
<h2>8.13 - Veo errores de Entrada/Salida al intentar usar los
dispositivos de tty...</h2>

<p>
Debe usar /dev/cuaXX para conexiones iniciadas desde el sistema OpenBSD;
los dispositivos /dev/ttyXX son s&oacute;lo para uso de terminales o
conexiones entrantes.  Aunque era posible usar los dispositivos tty, el
n&uacute;cleo de OpenBSD ya no es compatible con este uso.

<p>
De la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cua&amp;sektion=4">cua(4)</a>:

<p>
Para los puertos de los terminales, existe soporte para conexiones
salientes a trav&eacute;s de nodos de dispositivos que concuerdan
llamados unidades de llamada.  Por ejemplo, el terminal /dev/tty03
tendr&iacute;a una unidad de llamada que concordar&iacute;a, de nombre
/dev/cua03.  Estos dos dispositivos se diferencian normalmente creando
el nodo del dispositivo de la unidad de llamada con un n&uacute;mero
menor, 128 veces mayor que el del nodo del dispositivo de la
conexi&oacute;n entrante.  <i>Mientras el dispositivo de llamada
entrante (tty) suele necesitar una se&ntilde;al de hardware para indicar
al sistema que est&aacute; activo, el dispositivo de llamada saliente
(cua) no, y por lo tanto se puede comunicar sin impedimentos con un
dispositivo como pueda ser un modem.</i> Esto quiere decir que un
proceso como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&amp;sektion=8">getty(8)</a>
esperar&aacute; en un dispositivo de llamada entrante hasta que se
establezca una conexi&oacute;n.  Mientras tanto, se podr&aacute;
establecer una conexi&oacute;n saliente en el dispositivo de llamada
saliente (para el mismo puerto del terminal) sin interferir con ninguna
otra parte del sistema.  El proceso
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&amp;sektion=8">getty(8)</a>
se encargar&aacute; de ello correctamente, sin haber notado la
acci&oacute;n de la llamada saliente.

<p>
<a name="Browsers"></a>
<h2>8.14 - &iquest;Qu&eacute; navegadores de Internet hay para
OpenBSD?</h2>

<p>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=lynx&amp;sektion=1">
Lynx</a> es un navegador en modo de texto, forma parte del sistema base
y tiene soporte para SSL.  Otros navegadores en el
<a href="#Ports">&aacute;rbol de portes</a> son:
 
<p>
<b>Navegadores gr&aacute;ficos (modo X)</b>
<ul>
 <li><a href="http://www.dillo.org/">Dillo</a>, con funcionalidades
 m&iacute;nimas, muy r&aacute;pido y peque&ntilde;o, funciona bien en
 m&aacute;quinas lentas.
 <li><a href="http://www.konqueror.org/">Konqueror</a> Se instala como
 parte del <a href="http://www.kde.org/">entorno de escritorio KDE</a>.
 <li><a href="http://www.konqueror.org/embedded.html">
 Konqueror-embedded</a> (konq-e) Konqueror, usando s&oacute;lo las
 bibliotecas de KDE en lugar del entorno completo de KDE.
 <li><a href="http://www.netscape.com/">Netscape 4</a> S&oacute;lo para
 sparc y i386, no es de c&oacute;digo abierto y no est&aacute;
 disponible en paquete precompilado.
 <li><a href="http://www.opera.com/">Opera</a> Navegador comercial,
 s&oacute;lo para i386.
 <li><a href="http://www.w3.org/Amaya/">Amaya</a> El editor y navegador
 del W3C.
<li><a href="http://atrey.karlin.mff.cuni.cz/~clock/twibright/links/">
Links+</a> Otro navegador gr&aacute;fico veloz y peque&ntilde;o
(tambi&eacute;n tiene un modo de texto).
<li><i>(nuevo en 3.4)</i> <a href="http://www.mozilla.org">Mozilla</a>
y <a href="http://www.mozilla.org/products/firebird/">Firebird</a>
Navegadores cargados de funcionalidades.  Mozilla incluye muchas
funcionalidades no espec&iacute;ficas de un navegador (cliente de
correo, cliente de IRC, etc.);  Firebird es simplemente un navegador
basado en Mozilla.  Funcionan en las plataformas alpha, i386, sparc, y
sparc64.
</ul>

<p>
<b>Navegadores de Consola (modo texto)</b>
<ul>
 <!-- li><a href="http://www.w3m.org/">w3m</a>
 Tiene soporte para tablas y marcos (tambi&eacute;n tiene un modo
 gr&aacute;fico).  (XXX will be back for 3.5 -->
 <li><a href="http://artax.karlin.mff.cuni.cz/~mikulas/links/">links</a>
 Tiene soporte para tablas.
</ul>

<p>
Todos estos navegadores se pueden encontrar en la
<a href="../../es/ports.html">colecci&oacute;n de portes</a> de OpenBSD.
Despu&eacute;s de la instalaci&oacute;n del &aacute;rbol de portes, se
encontrar&aacute;n en el directorio <tt>/usr/ports/www/</tt>.  La
mayor&iacute;a de ellos tambi&eacute;n se encuentran disponibles como
<a href="../../es/ports.html">paquetes</a> precompilados en los
<a href="../../es/ftp.html">servidores de FTP</a> y en el
<a href="../../es/orders.html">CD-ROM</a>.  Dado que la mayor&iacute;a
de los navegadores gr&aacute;ficos son de gran tama&ntilde;o y tardan
mucho en bajarse y compilar, es <a href="#PortsvsPkgs">muy
aconsejable</a> usar los paquetes siempre que existan en lugar de
compilarlos de los portes.

<p>
Debido a un error en una de las bibliotecas usadas por
<a href="http://www.w3m.org/">w3m</a>, este navegador no funciona en
ninguna de las plataformas de la versi&oacute;n final de OpenBSD 3.4.

<p>
<a name="mg"></a>
<h2>8.15 - &iquest;C&oacute;mo puedo usar el editor mg?</h2>

<p>
mg es un micro editor de texto del estilo de Emacs incluido en OpenBSD.
Micro porque es peque&ntilde;o (&iexcl;Emacs es demasiado grande!).
Puede encontrar informaci&oacute;n b&aacute;sica en la p&aacute;gina del
manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mg&amp;sektion=1">mg(1)</a>
y en el
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/mg/tutorial?rev=1.2">tutorial</a>
que tambi&eacute;n se incluye con el c&oacute;digo fuente.  Cualquier
duda m&aacute;s interesante (como &laquo;&iexcl;No tengo una tecla
Meta!&raquo;) la puede resolver leyendo las
<a href="http://www.lerner.co.il/emacs/faq_toc.html">Preguntas
Frecuentes de Emacs</a>.

<p>
N&oacute;tese que debido a que mg es una peque&ntilde;a
implementaci&oacute;n de Emacs, y que es m&aacute;s parecido al editor
de texto Emacs 17, no tiene implementadas muchas de las otras funciones
de Emacs (incluidas las funciones de correo, noticias, y otras como
nodos para Lisp, C++, Lex, Awk, Java, etc... ).

<p>
<a name="ksh"></a>
<h2>8.16 - &iexcl;ksh(1) no lee mi <tt>.profile</tt>!</h2>

<p>
Existen dos posibles motivos para que parezca que
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ksh&amp;sektion=1">
ksh(1)</a> ignora el fichero <tt>.profile</tt> de un usuario.

<ul>
<li>El propietario de <tt>.profile</tt> no es el usuario.  Para
solucionarlo para el usuario <b>user</b>,

<blockquote><tt>
# <b>chown user ~user/.profile</b>
</tt></blockquote>

<p>
<li>Que se est&eacute; usando ksh(1) desde X Window System.

<p>
En
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=xterm&amp;sektion=1">xterm(1)</a>,
argv[0] para ksh(1) no va precedido por un gui&oacute;n ('-').
Anteponer un gui&oacute;n a argv[0] har&aacute; que csh(1) y ksh(1)
sepan que deben interpretar sus ficheros de ingreso (en csh(1) este
fichero es <tt>.login</tt>, con un fichero <tt>.cshrc</tt> separado que
se interpreta siempre que inicia csh(1); en ksh(1) s&oacute;lo hay un
gui&oacute;n de inicio, <tt>.profile</tt>.  Este fichero se ignora a
menos que la shell sea una shell de ingreso (&quot;login shell&quot;).

<p>
Para solucionarlo, hay que a&ntilde;adir la l&iacute;nea
&quot;<tt>XTerm*loginShell: true</tt>&quot; al fichero
<tt>.Xdefaults</tt> de su directorio.  N&oacute;tese que este fichero no
existe y deber&aacute; crearlo Vd mismo.

<blockquote><tt>
$ <b>echo &quot;XTerm*loginShell: true&quot; &gt;&gt; ~/.Xdefaults</b>
</tt></blockquote>

<p>
Es posible que no haya tenido que hacer esto en otros sistemas, y es
debido a que algunas instalaciones del X Window System vienen con esta
configuraci&oacute;n predeterminada.  OpenBSD ha escogido seguir el modo
de XFree86.
</ul>

<p>
<a name="motd"></a>
<h2>8.17 - &iquest;Por qu&eacute; se sobreescribe el fichero
<tt>/etc/motd</tt> cuando lo modifico?</h2>

<p>
El fichero <tt>/etc/motd</tt> se edita cada vez que se arranca el
sistema, sustituyendo hasta la primera l&iacute;nea en blanco excluida
con la informaci&oacute;n sobre la versi&oacute;n del n&uacute;cleo del
sistema.  Cuando se edite este fichero hay que asegurarse de empezar
despu&eacute;s de esta l&iacute;nea en blanco, para evitar que
<tt>/etc/rc</tt> elimine esas l&iacute;neas cuando edite
<tt>/etc/motd</tt> durante el arranque.

<p>
<a name="wwwsolaris"></a>
<h2>8.18 - &iquest;Por qu&eacute; www.openbsd.org est&aacute; alojado en
un sistema Solaris?</h2>

<p>
Aunque ninguno de los desarrolladores piense que sea de particular
importancia, esta pregunta aparece en las listas de correo con la
frecuencia suficiente como para que sea contestada aqu&iacute;.
<i>www.openbsd.org</i> y el sitio de ftp principal de OpenBSD
est&aacute;n hospedados en un
<a href="http://sunsite.ualberta.ca">SunSITE</a> en la Universidad de
Alberta, en Canad&aacute;.  Estos sitios est&aacute;n hospedados en un
gran sistema Sun, que dispone de acceso a grandes cantidades de espacio
de almacenamiento y de ancho de banda de Internet.  La presencia del
SunSITE permite al grupo de OpenBSD acceso a este ancho de banda.
&Eacute;sta es la raz&oacute;n por la que el sitio principal est&aacute;
aqu&iacute; hospedado.  Muchos de las r&eacute;plicas est&aacute;n
hospedadas en sistemas OpenBSD, pero como no tienen garantizado el
acceso a esta gran cantidad de ancho de banda, el grupo escogi&oacute;
hospedar el sitio principal en el SunSITE de la Universidad de Alberta.

<p>
<a name="PCI"></a>
<h2>8.19 - Tengo problemas con la detecci&oacute;n de dispositivos
PCI.</h2>

<p>
Existe una condici&oacute;n por la que algunas m&aacute;quinas
podr&iacute;an no detectar algunos dispositivos PCI correctamente, o
podr&iacute;an colgarse mientras detectan m&uacute;ltiples NICs en una
sola m&aacute;quina.  Esto se debe al PCIBIOS, y tan s&oacute;lo es
necesario un peque&ntilde;o ajuste para que funcione correctamente.
Todo lo que hay que hacer es introducir la configuraci&oacute;n de
inicio y desactivar PCIBIOS.  Mire un ejemplo:

<div style="margin-left: 2em">
<table border="0" width="650">
        <tr>
                <td nowrap bgcolor="#eeeeee">
<pre>
boot&gt; <b>boot -c</b>
Copyright (c) 1982, 1986, 1989, 1991, 1993
        The Regents of the University of California.  All rights reserved.
Copyright (c) 1995-2002 OpenBSD. All rights reserved.  http://www.OpenBSD.org

OpenBSD 3.4 (GENERIC) #18: Wed Sep 17 03:34:47 MDT 2003
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/RAMDISK_CD
cpu0: Intel Pentium III (Coppermine) (&quot;GenuineIntel&quot; 686-class, 128KB L2 cache)
1 GHz
cpu0: FPU,V86,DE,PSE,TSC,MSR,PAE,MCE,CX8,SYS,MTRR,PGE,MCA,CMOV,PAT,PSE36,MMX,FXS
R,SIMD
real mem  = 267956224 (261676K)
avail mem = 243347456 (237644K)
using 3296 buffers containing 13500416 bytes (13184K) of memory
User Kernel Config
UKC&gt; <b>disable pcibios</b>
UKC&gt; <b>quit</b>
[... snip ...]
</pre>
                </td>
        </tr>
</table>
</div>

<p>
En cuanto haya terminado con esto, puede seguir las instrucciones de la
secci&oacute;n sobre la <a href="faq5.html#Building">compilaci&oacute;n
del n&uacute;cleo</a> para crear un nuevo n&uacute;cleo y as&iacute; no
tendr&aacute; que preocuparse por esto en el futuro.

<p>
<a name="TrueType"></a>
<h2>8.20 - Fuentes Antialias y TrueType en XFree86</h2>

<p>
Ve&aacute;se <a href="truetype.html">este documento</a>.

<p>
<a name="Journaling"></a>
<h2>8.21 - &iquest;Existe soporte para sistemas de archivos tipo
ReiserFS en OpenBSD?</h2>

<p>
No existe.  Utilizamos un mecanismo diferente para obtener resultados
similares, y que se llama <a href="faq14.html#SoftUpdates">Soft
Updates</a>.  Por favor, lea la secci&oacute;n que se indica para
obtener una informaci&oacute;n m&aacute;s detallada.

<p>
<a name="RevDNS"></a>
<h2>8.22 - DNS inverso<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<small>- o -</small><br>
&iquest;Por qu&eacute; tardo tanto para ingresar?</h2>

<p>
Muchos de los nuevos usuarios de OpenBSD experimentan un retraso de dos
minutos en el ingreso cuando usan servicios como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh&amp;sektion=1">ssh(1)</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp&amp;sektion=1">ftp(1)</a>, o <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=telnet&amp;sektion=1">telnet(1)</a>.
Tambi&eacute;n puede ocurrir cuando se usa una <i>proxy</i>, como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp-proxy&amp;sektion=8">ftp-proxy(8)</a>,
o cuando se env&iacute;a correo desde una estaci&oacute;n de trabajo a
trav&eacute;s de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendmail&amp;sektion=8">sendmail(8)</a>.

<p>
Esto se debe casi siempre a un problema de DNS inverso.  Las siglas DNS
son de &laquo;Servicios de Nombres de Dominio&raquo;, el sistema que usa
Internet para convertir un nombre, como &quot;www.openbsd.org&quot;, en
una direcci&oacute;n IP num&eacute;rica.  Otra de las tareas de DNS es
la de poder tomar una direcci&oacute;n num&eacute;rica y convertirla de
vuelta en un &laquo;nombre&raquo;;  esto es &laquo;DNS inverso&raquo;.

<p>
Para ofrecer un mejor ingreso, OpenBSD lleva a cabo una b&uacute;squeda
de DNS inverso en cualquier m&aacute;quina a la que se conecte por
cualquiera de las muchas formas diferentes, como por
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh&amp;sektion=1">ssh(1)</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp&amp;sektion=1">ftp(1)</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=telnet&amp;sektion=1">telnet(1)</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendmail&amp;sektion=8">sendmail(8)</a>, o <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp-proxy&amp;sektion=8">ftp-proxy(8)</a>.
Desafortunadamente, en algunos casos la m&aacute;quina que lleva a cabo
la conexi&oacute;n no tiene una entrada apropiada de DNS inversa.

<p>
<h3>Un ejemplo de esta situaci&oacute;n:</h3>
Un usuario configura un sistema OpenBSD como cortafuegos y pasarela para
su red interna en casa, asignando todas sus m&aacute;quinas internas a
una IP externa mediante <a href="faq6.html#NAT">NAT</a>.  Tambi&eacute;n
la puede usar como un repetidor de correo (<i>mail relay</i>) saliente.
Para ello sigue las instrucciones de instalaci&oacute;n y encuentra que
los resultados son satisfactorios, pero con una excepci&oacute;n: cada
vez que intenta conectar la m&aacute;quina de cualquier modo experimenta
un retraso de dos minutos antes de que empiece a pasar algo.

<p>
<h3>Qu&eacute; sucede:</h3>
Desde una estaci&oacute;n de trabajo que se encuentra detr&aacute;s del
NAT de la pasarela con una direcci&oacute;n
<a href="http://www.geektools.com/rfc/rfc1918.txt">IP no registrada</a>
de 192.168.1.35, el usuario utiliza
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh&amp;sektion=1">ssh(1)</a>
para acceder a la pasarela.  El cliente de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh&amp;sektion=1">ssh(1)</a>
le pide el nombre de usuario y la contrase&ntilde;a, y los env&iacute;a
a la pasarela.  La pasarela intenta entonces averiguar qui&eacute;n
est&aacute; intentando ingresar, y para ello lleva a cabo una
b&uacute;squeda de DNS inverso de la direcci&oacute;n 192.168.1.35.  El
problema es que las direcciones 192.168.0.0 son para uso privado, y como
un servidor de DNS externo a su red que est&eacute; correctamente
configurado lo sabe, no tiene informaci&oacute;n sobre estas
direcciones.  Algunos servidores devolver&aacute;n r&aacute;pidamente un
mensaje de error, en cuyo caso OpenBSD asumir&aacute; que no se puede
obtener m&aacute;s informaci&oacute;n y cesar&aacute; inmediatamente,
admitiendo al usuario.  Otros servidores de DNS no devolver&aacute;n
NINGUNA respuesta.  En este caso habr&aacute; un tiempo de espera hasta
que el resolucionador de nombres de OpenBSD agote el tiempo, lo que
tarda unos dos minutos antes de que se permita el ingreso para poder
continuar.  En el caso de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp-proxy&amp;sektion=8">ftp-proxy(8)</a>,
algunos clientes de ftp agotar&aacute;n el tiempo antes de que lo agote
el requerimiento de DNS inverso, dando la impresi&oacute;n de que el
ftp-proxy no funciona.

<p>
Esto puede resultar bastante molesto.  Por fortuna, existe una
soluci&oacute;n f&aacute;cil.

<p>
<h3>Soluci&oacute;n usando <tt>/etc/hosts</tt>:</h3>
La soluci&oacute;n m&aacute;s f&aacute;cil es la de llenar el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hosts&amp;sektion=5"><tt>/etc/hosts</tt>(5)</a> 
con todas las estaciones de trabajo que tenga en su red interna, y
asegurarse de que el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=resolv.conf&amp;sektion=5"><tt>/etc/resolv.conf</tt>(5)</a> 
contenga la l&iacute;nea <tt>lookup file bind</tt>, que asegura que el
resolucionador sabe empezar con el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hosts&amp;sektion=5"><tt>/etc/hosts</tt>(5)</a>,
y si esto falla, usar los servidores de DNS especificados por las
l&iacute;neas del &laquo;nombre de servidor&raquo; en el fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=resolv.conf&amp;sektion=5"><tt>/etc/resolv.conf</tt>(5)</a>.

<p>
El fichero <tt>/etc/hosts</tt> ser&aacute; algo parecido a esto:

<div style="margin-left: 2em">
<table border="0" width="650"> <tr> <td nowrap bgcolor="#eeeeee">
<pre>
::1 localhost.in.example.org localhost
127.0.0.1 localhost.in.example.org localhost
192.168.1.1 gw.in.example.org gw
192.168.1.20 scrappy.in.example.org scrappy
192.168.1.35 shadow.in.example.org shadow
</pre>
</td></tr></table>
</div>

<p>
El fichero <tt>resolv.conf</tt> ser&aacute; algo como esto:

<div style="margin-left: 2em">
<table border="0" width="650"> <tr> <td nowrap bgcolor="#eeeeee">
<pre>
search in.example.org 
nameserver 24.2.68.33
nameserver 24.2.68.34
lookup file bind
</pre>
</td></tr></table>
</div>

<p>
Una objeci&oacute;n com&uacute;n a esto es &laquo;...pero, &iexcl;yo uso
DHCP para mi red interna!  &iquest;C&oacute;mo puede configurar entonces
mi fichero <tt>/etc/hosts</tt>?&raquo;  Es f&aacute;cil.  Introduzca la
l&iacute;neas para todas las direcciones que su servidor de DHCP vaya a
entregar, y cualquier dispositivo est&aacute;tico:

<div style="margin-left: 2em">
<table border="0" width="650"> <tr> <td nowrap bgcolor="#eeeeee">
<pre>
::1 localhost.in.example.org localhost
127.0.0.1 localhost.in.example.org localhost
192.168.1.1 gw.in.example.org gw
192.168.1.20 scrappy.in.example.org scrappy
192.168.1.35 shadow.in.example.org shadow
192.168.1.100 d100.in.example.org d100
192.168.1.101 d101.in.example.org d101
192.168.1.102 d102.in.example.org d102
         [... etc ...] 
192.168.1.198 d198.in.example.org d198
192.168.1.199 d199.in.example.org d199
</pre>
</td></tr></table>
</div>

<p>
En este caso se asume que tiene el rango de DHCP configurado desde
192.168.1.100  hasta 192.168.1.199, y las tres definiciones
est&aacute;ticas tal y como aparecen en la parte superior del fichero.

<p>
Si su pasarela debe usar DHCP para la configuraci&oacute;n, es posible
que se encuentre con un problema:
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dhclient&amp;sektion=8">dhclient(8)</a>
anular&aacute; su fichero <tt>/etc/resolv.conf</tt> cada vez que renueve
la conexi&oacute;n, eliminando as&iacute; la l&iacute;nea <i>look file
bind</i>.  Esto se puede solucionar incluyendo la l&iacute;nea <i>look
file bind</i> en el fichero <tt>/etc/resolv.conf.tail</tt>.

<p>
<h3>Soluci&oacute;n usando un servidor de DNS local:</h3>
Los detalles sobre esta soluci&oacute;n van m&aacute;s all&aacute; del
objetivo de este documento, pero el truco est&aacute; en configurar su
servidor de DNS favorito y asegurarse de que &eacute;ste sepa que es
autoritativo, tanto para la resoluci&oacute;n inversa como la directa de
DNS para todos los nodos de su red, y asegurarse de que sus
m&aacute;quinas (incluida la pasarela) sepan c&oacute;mo usarlo como
servidor de DNS.

<p>
<a name="wwwnotstd"></a>
<h2>8.23 - &iquest;Por qu&eacute; las p&aacute;ginas <i>web</i> de
OpenBSD no son conformes con HTML4/XHTML?</h2>

<p>
Al escribir las p&aacute;ginas <i>web</i> actuales se ha puesto mucho
cuidado para que se puedan ver con una gran variedad de navegadores
modernos desde las versiones 4.0 en adelante.  No queremos que estas
p&aacute;ginas sean conformes con HTML4 o XHTML hasta que estemos
seguros de que tambi&eacute;n se podr&aacute;n ver con navegadores
m&aacute;s antiguos;  no es una prioridad.  Aunque agradecemos cualquier
nueva contribuci&oacute;n en este respecto, creemos que es mejor usar el
tiempo en escribir c&oacute;digo o en documentar nuevos aspectos del
sistema, en lugar de cambiar la p&aacute;ginas <i>web</i> para que sean
conformes con nuevas especificaciones.

<p>
<a name="NTPerror"></a>
<h2>8.24 - &iquest;Por qu&eacute; el reloj del sistema tiene un lapsus
de veintipico segundos?</h2>

<p>
Al utilizar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&amp;sektion=8">rdate(8)</a>
para sincronizar el reloj del sistema con un servidor de NTP es posible
que exista un lapsus de tiempo de veintipico segundos con la
definici&oacute;n horaria local.

<p>
Esto es debido a una diferencia entre el tiempo UTC (Tiempo Universal
Coordinado, basado en observaciones astron&oacute;micas) y el tiempo TAI
(Tiempo At&oacute;mico Internacional, basado en relojes
at&oacute;micos).  Para compensar las variaciones en la rotaci&oacute;n
de la tierra, se introducen &laquo;saltos de segundos&raquo; en el
tiempo UTC, pero esto desajusta el tiempo TAI.  Estos saltos de segundos
son la causa de esta desincronizaci&oacute;n.  Para m&aacute;s
informaci&oacute;n sobre esto se puede buscar en Internet con las
palabras clave &quot;<tt>leap seconds UTC TAI</tt>&quot;.

<p>
Este problema es f&aacute;cil de solucionar.  En la mayor&iacute;a de
pa&iacute;ses se puede obtener la hora correcta usando el
par&aacute;metro <tt>-c</tt> con la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&amp;sektion=8">rdate(8)</a>,
y usando una de las franjas horarias del directorio
<tt>/usr/share/zoneinfo/right/</tt>.  Por ejemplo, si la
ubicaci&oacute;n fuera Alemania, se podr&iacute;a usar estas
&oacute;rdenes:

<pre>
     # <b>cd /etc && ln -sf /usr/share/zoneinfo/right/CET localtime</b>
     # <b>rdate -ncv ptbtime1.ptb.de</b>
</pre>

<p>
Las reglas pueden variar seg&uacute;n el pa&iacute;s.


<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq7.html">[Secci&oacute;n 7 - Controles de teclado y
pantalla]</a>
<a href="faq9.html">[Secci&oacute;n 9 - Migrando desde un sistema
Linux</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq8.html,v 1.138 ]<br>
$Translation: faq8.html,v 1.83 2003/11/24 15:08:58 horacio Exp $<br>
$OpenBSD: faq8.html,v 1.73 2003/11/24 15:26:21 horacio Exp $
</small>
</body>
</html>
