<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>9 - Consejos para usuarios de Linux (y otros sistemas
operativos libres tipo Unix)</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,faq,documentación">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq8.html">[Secci&oacute;n 8 - Preguntas generales]</a>
<a href="faq10.html">[Secci&oacute;n 10 - Administraci&oacute;n del sistema]</a>
</font>

<h1><font color="#e00000">9 - C&oacute;mo migrar desde
Linux</font></h1>
<hr>

<p>
<h3>&Iacute;ndice de contenidos</h3>
<ul>
<li><a href="#Linux">9.1 - Consejos para usuarios de Linux (y otros
sistemas operativos tipo Unix).</a>
<li><a href="#DualBoot">9.2 - Arranque dual de Linux y OpenBSD.</a>
<li><a href="#passwd">9.3 - Conversi&oacute;n del fichero de la
contrase&ntilde;a de Linux (u otro System-7) a BSD.</a>
<li><a href="#Interact">9.4 - Interacci&oacute;n entre OpenBSD y
Linux.</a>
</ul>

Los usuarios de Linux pueden obtener m&aacute;s informaci&oacute;n en
<a href="http://sites.inka.de/mips/unix/bsdlinux.html">
http://sites.inka.de/mips/unix/bsdlinux.html</a>.

<hr>
<br>

<p>
<a name="Linux"></a>
<h2>9.1 - Consejos simples para usuarios de Linux (y otros sistemas
operativos tipo Unix)</h2>

<p>
Existen varias diferencias entre OpenBSD y Linux.  Estas diferencias
incluyen, aunque no se limitan a, el procedimiento de arranque, el uso
de la interfaz de red, y la gesti&oacute;n del disco.  La mayor&iacute;a
de diferencias est&aacute;n bien documentadas, pero es necesario que se
busquen en las p&aacute;ginas del manual.  Este documento es tan
s&oacute;lo un &iacute;ndice de esas diferencias.

<p>
<ul>
   <li>OpenBSD dispone de un <a href="../../es/ports.html">&aacute;rbol
   de portes</a>.  El motivo para &eacute;ste es el de paliar el hecho
   de que en este momento no existen muchas aplicaciones nativas del
   sistema OpenBSD.  Esto es un intento de obtener m&aacute;s
   aplicaciones que funcionen para los usuarios finales de OpenBSD, y
   para obtener m&aacute;s aplicaciones hechas con OpenBSD en mente.
   Con el tiempo, estos portes se acaban utilizando para hacer grupos de
   <a href="../../es/ports.html#Get">packages</a> de binarios.
   
   <li>OpenBSD usa CVS para los cambios en el c&oacute;digo fuente.  En
   Linux, el c&oacute;digo fuente se disemina entre distribuciones
   separadas.  OpenBSD fue pionero en el uso de CVS an&oacute;nimo, que
   permite que cualquier usuario pueda extraer el &aacute;rbol completo
   de c&oacute;digo fuente de cualquier versi&oacute;n de OpenBSD (desde
   la versi&oacute;n 2.0 a la actual, y todas las revisiones de todos
   los ficheros entre medio) en cualquier momento.  Tambi&eacute;n
   existe una <a href="http://www.openbsd.org/cgi-bin/cvsweb/">interfaz
   de web para CVS</a> muy conveniente y muy f&aacute;cil de usar.

   <li>OpenBSD lanza revisiones de las versiones de prueba
   peri&oacute;dicamente para varias arquitecturas, y produce una
   versi&oacute;n oficial, estable, en CD cada 6 meses.

   <li>OpenBSD contiene CRIPTOGRAF&Iacute;A FUERTE, que los sistemas
   operativos con base en EE.UU. no pueden contener (v&eacute;se
   <a href="../../es/crypto.html">
   http://www.openbsd.org/es/crypto.html</a>).  OpenBSD tambi&eacute;n
   ha pasado por una intensiva auditor&iacute;a de seguridad y muchas
   funcionalidades ya han sido implementadas dentro del &aacute;rbol de
   fuentes (IPSEC, KERBEROS).
   
   <li>El n&uacute;cleo del sistema (<i>kernel</i>) de
   OpenBSD es /bsd.

   <li>Los nombres para referirse a los discos duros son generalmente
   <tt>/dev/wd</tt> (IDE) y <tt>/dev/sd</tt> (dispositivos SCSI o ATA en
   emulaci&oacute;n de SCSI).

   <li>En Linux,
   <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ifconfig&amp;sektion=8">/sbin/ifconfig</a>
   sin argumentos da como resultado el estado de todas las interfaces.
   En OpenBSD necesita el indicador <tt>-a</tt>.

   <li>En Linux,
   <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=route&amp;sektion=8">/sbin/route</a>
   sin argumentos da como resultado el estado de todas las rutas
   activas.  En OpenBSD necesita el par&aacute;metro <i>show</i>, o en
   su lugar, ejecutar <b>netstat -r</b>.

   <li>OpenBSD NO dispone de soporte para sistemas de archivo tipo
   ReiserFS, JFS de IBM o XFS de SGI.  En su lugar usamos
   <a href="faq14.html#SoftUpdates">Soft Updates</a>.

   <li>OpenBSD viene con Packet Filter (PF), no con ipfw, ipchains,
   netfilter, iptables o ipf.  Esto quiere decir que:

   <ul>
     <li>La Traducci&oacute;n de Direcciones de Red, NAT, (conocido como
     enmascaramiento de IP, IP-Masquerading, en Linux) se realiza
     mediante <kbd>pfctl</kbd>, usando el indicador <kbd>-N</kbd>.
     (<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8">pfctl(8)</a>)
     <li>ipfwadm se hace a trav&eacute;s de pfctl.
     (<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8">pfctl(8)</a>,
     <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=pf&amp;sektion=4">pf(4)</a>, y
     <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=pf.conf&amp;sektion=5">pf.conf(5)</a>).
     <li>Para una informaci&oacute;n más detallada y asistencia en la
     configuraci&oacute;n, lea la <a href="faq6.html">cap&iacute;tulo
     6</a> de estos documentos.
   </ul>
   
   <li>La direcci&oacute;n de la interfaz se almacena en
   <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hostname.if&amp;sektion=5">/etc/hostname.&lt;nombre_de_interfaz&gt;</a>.
   Puede ser un nombre de anfitri&oacute;n en lugar de una
   direcci&oacute;n IP.

   <li>El nombre de la m&aacute;quina est&aacute; en
   <tt>/etc/myname</tt>.

   <li>La pasarela (<i>gateway</i> predefinida est&aacute; en
   <tt>/etc/mygate</tt>.

   <li>El int&eacute;rprete de &oacute;rdenes (<i>shell</i>)
   predefinido en OpenBSD es /bin/sh, que es Korn shell.  Otros como
   bash y tcsh se pueden a&ntilde;adir como paquetes o instalar desde el
   &aacute;rbol de portes.

   <li>La gesti&oacute;n de la contrase&ntilde;a cambia mucho.  Los
   ficheros principales son diferentes
   (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&amp;sektion=1">passwd(1)</a>,
   <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&amp;sektion=5">passwd(5)</a>).

   <li>Los dispositivos se nombran por el controlador, no por el tipo.
   Por ejemplo, no existen dispositivos eth*, sino que ser&iacute;a ne0
   para las tarjetas de ethernet ne2000, y xl0 para las tarjetas de
   ethernet Etherlink XL y Fast Etherlink XL de 3Com, etc.

   <li>Los desarrolladores de OpenBSD hacen serios esfuerzos por
   mantener las p&aacute;ginas del manual actualizadas y con
   informaci&oacute;n exacta.  Use la orden
   <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=man">man(1)</a>
   para encontrar informaci&oacute;n.
</ul>

<br>

<p>
<a name="DualBoot"></a>
<h2>9.2 - Arranque dual de Linux y OpenBSD</h2>

<p>
&iexcl;S&iacute;, es posible!

<p>
Lea <a href= "ftp://ftp.openbsd.org/pub/OpenBSD/3.3/i386/INSTALL.linux">
INSTALL.linux</a>.

<p>
<a name="passwd"></a>
<h2>9.3 - Conversi&oacute;n del fichero de la contrase&ntilde;a de Linux
(u otro System-7) a BSD</h2>

<p>
Primero, averig&uuml;e si su contrase&ntilde;a de Linux es de tipo
<i>shadow</i> o no.  Si lo fuera, obtenga
<a href="http://www.openwall.com/john/">John the Ripper</a> y use la
utilidad para &laquo;desensombrecer&raquo; que le acompa&ntilde;a, para
fusionar sus ficheros <tt>passwd</tt> y <tt>shadow</tt> en un solo
fichero de estilo System 7.

<p>
En el fichero de su contrase&ntilde;a de Linux, que llamaremos
<tt>linux_passwd</tt>, necesita a&ntilde;adir ::0:0 introduzca los
campos cuatro y siete.  Lo puede hacer con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=awk&amp;sektion=1">
awk(1)</a>:

<blockquote>
<pre>
# <b>cat linux_passwd | awk -F : '{printf(&quot;%s:%s:%s:%s::0:0:%s:%s:%s\n&quot;,$1,$2,$3,$4,$5,$6,$7); }' &gt; new_passwd</b>
</pre>
</blockquote>

A partir de este momento debe editar el fichero <tt>new_passwd</tt> y
eliminar la entrada de root y otras entradas del sistema que se
encuentren presentes en el fichero de su contrase&ntilde;a de OpenBSD, o
que no sean aplicables a OpenBSD (o sea, todas).  Aseg&uacute;rese
tambi&eacute;n de que no haya nombres o IDs de usuario duplicados entre
<tt>new_passwd</tt> y su fichero <tt>/etc/passwd</tt> de OpenBSD.  La
forma m&aacute;s f&aacute;cil para hacer esto es empezar con un fichero
<tt>/etc/passwd</tt> nuevo:

<blockquote>
<pre>
# <b>cat new_passwd &gt;&gt; /etc/master.passwd</b>
# <b>pwd_mkdb -p /etc/master.passwd</b>
</pre>
</blockquote>

El &uacute;ltimo paso, <tt>pwd_mkdb</tt>, es necesario para reconstruir
los ficheros /etc/spwd.db y /etc/pwd.db.  Tambi&eacute;n crea un fichero
de contrase&ntilde;a del estilo System 7 (menos las contrase&ntilde;as
cifradas) en <tt>/etc/passwd</tt> para los programas que lo usen.
OpenBSD usa un cifrado m&aacute;s fuerte para contrase&ntilde;as,
blowfish, que no es factible encontrar en ning&uacute;n sistema que use
ficheros de contrase&ntilde;as del estilo System 7 en su totalidad.
Para pasar a este cifrado m&aacute;s fuerte, los usuarios deben invocar
'passwd' y cambiar sus contrase&ntilde;as.  La nueva contrase&ntilde;a
que introduzcan ser&aacute; cifrada con su configuraci&aacute;n
predefinida (blowfish, a menos que haya editado /etc/login.conf para
cambiarla).  O, como usuario root, puede invocar 'passwd
&lt;nombre_de_usuario&gt;'.


<p>
<a name="Interact"></a>
<h2>9.4 - Interacci&oacute;n entre OpenBSD y Linux</h2>

<p>
Si est&aacute; migrando desde Linux a OpenBSD, notar&aacute; que OpenBSD
tiene la opci&oacute;n COMPAT_LINUX activada por definici&oacute;n en el
n&uacute;cleo GENERIC.  Para ejecutar cualquier binario de Linux que no
est&eacute; enlazado est&aacute;ticamente (la mayor&iacute;a de ellos),
debe seguir las instrucciones que encontrar&aacute; en la p&aacute;gina
del manual
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&amp;sektion=8">compat_linux(8)</a>.
Un forma simple de tener la mayor&iacute;a de bibliotecas &uacute;tiles
de Linux, es instalar <tt>redhat/base</tt> desde la colecci&oacute;n de
portes.  Para obtener m&aacute;s informaci&oacute;n sobre la
colecci&oacute;n de portes, lea la
<a href="faq8.html#Ports">secci&oacute;n sobre Puertos</a> del
cap&iacute;tulo 8 de estos documentos.  Si ya tiene el &aacute;rbol de
portes instalado, use las &oacute;rdenes que ver&aacute; a
continuaci&oacute;n para instalar las bibliotecas de Linux.

<blockquote>
<pre>
# <strong>cd /usr/ports/emulators/redhat/base</strong>
# <strong>make install</strong>
</pre>
</blockquote>

<p>
OpenBSD tiene soporte para el sistema de archivo EXT2FS.  Use
<b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&amp;sektion=8">disklabel (8)</a> <i>disco</i></b>
(en donde <b><i>disco</i></b> es el nombre del dispositivo para su
disco) para ver c&oacute;mo reconoce OpenBSD su partici&oacute;n de
Linux (pero <strong>no</strong> use disklabel o fdisk para efectuar
cambios en ella).  Para m&aacute;s informaci&oacute;n sobre el uso de
disklabel, lea la <a href="faq14.html#disklabel">secci&oacute;n sobre
Disklabel</a> del cap&iacute;tulo 14 de estos documentos.



<p>
<font color="#0000e0">
<a href="index.html">[&Iacute;ndice de documentos]</a>
<a href="faq8.html">[Secci&oacute;n 8 - Preguntas generales]</a>
<a href="faq10.html">[Secci&oacute;n 10 - Administraci&oacute;n del sistema]</a>
</font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq9.html,v 1.52 ]<br>
$Translation: faq9.html,v 1.35 2003/10/12 17:31:47 horacio Exp $<br>
$OpenBSD: faq9.html,v 1.35 2003/10/12 17:59:50 horacio Exp $
</small>
</body>
</html>
