<html>
<head>
<title>IPF - IP Filter (OpenBSD 2.9 y versiones anteriores)</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="preguntas frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,preguntas frecuentes,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1998-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">

<p>
<h2><font color="#e00000">IPF - IP Filter (OpenBSD 2.9 y
versiones anteriores)</font><hr></h2>
</p>

<p>
<h4>Nota: IPF ha sido reemplazado por PF (<em>Packet
Filter</em>) en OpenBSD 3.0 y versiones posteriores.  Este
documento se mantiene como referencia para aquellos que usen
versiones m&aacute;s antiguas de OpenBSD</h4>
</p>

<p>
<ul><h3>Tabla de contenidos</h3>
<li><a href="#6.2">6.2 - IP Filter</a>
<li><a href="#6.3">6.3 - Traducci&oacute;n de direcciones de
red (NAT)</a>
</ul>
</p>

<hr>
<br>

<p>
<a name="6.2"></a>
<h2>6.2 - IP Filter</h2>
</p>

<p>
El paquete de IPFilter fue creado para gestionar dos tareas,
tratar con permisos de reenv&iacute;o a nivel de paquetes,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipf&sektion=8&manpath=OpenBSD+2.7">ipf(8)</a>,
y la asignaci&oacute;n de anfitriones/subredes a un rango de
direcciones externas,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&sektion=8&manpath=OpenBSD+2.7">ipnat(8)</a>. 
Los ficheros de configuraci&oacute;n para estos dos servicios
son <em>/etc/ipf.rules</em> y <em>/etc/ipnat.rules</em>.
</p>

<p>
Para iniciar estos servicios desde su sistema, antes debe
editar el fichero </em>/etc/rc.conf</em> y configurar las
siguientes l&iacute;neas as&iacute;:
</p>

<ul>
<pre>
ipfilter=YES
ipnat=YES
</pre>
</ul>

<p>
<strong>NOTA:</strong> No siempre es necesario tener las dos
opciones activadas, a menos que se est&eacute;n usando ambas
funcionalidades.  Pero si va a usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&sektion=8&manpath=OpenBSD+2.7">ipnat(8)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipf&sektion=8&manpath=OpenBSD+2.7">ipfilter(8)</a>
tambi&eacute;n debe estar activado.
</p>

<p>
Si va a usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&sektion=8&manpath=OpenBSD+2.7">ipnat(8)</a>,
es muy probable que tambi&eacute;n quiera configurar el valor
&quot;net.inet.ip.forwarding&quot; de sysctl a 1.  Puede
hacerlo activando las l&iacute;neas correspondientes en el
fichero <em>/etc/sysctl.conf</em>.
</p>

<p>
Si IPF est&aacute; compilado en el n&uacute;cleo de su sistema
pero no lo ha activado en su fichero de configuraci&oacute;n
<em>/etc/rc.conf</em>, puede activarlo f&aacute;cilmente:

<ul>
<pre>
# <strong>ipf -Fa -f /etc/ipf.rules -E</strong>
# <strong>ipnat -CF -f /etc/ipnat.rules</strong>
</pre>
</ul>
</p>

<p>
El indicador <em>-E</em> en ipf activa IPF.  El indicador
<em>-Fa</em> elimina cualquier regla anterior.
<kbd>ipf -f /etc/ipf.rules</kbd> carga las reglas de
<em>/etc/ipf.rules</em>.
</p>

<p>
Si realiza cambios en el fichero <em>/etc/ipf.rules</em> antes
de cargar ipf, puede recargar sus reglas muy f&acute;cilmente:

<ul>
<pre>
# <strong>ipf -Fa -f /etc/ipf.rules</strong>
</pre>
</ul>

Lo mismo para ipnat...

<ul>
<pre>
# <strong>ipnat -CF -f /etc/ipnat.rules</strong>
</pre>
</ul>
</p>

<p>
Tambi&eacute;n es probable que quiera activar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipmon&sektion=8&manpath=OpenBSD+2.7">ipmon(8)</a>
para depurar.

<ul>
<pre>
# <strong>ipmon -Ds</strong>
</pre>
</ul>
</p>

<p>
En este documento trataremos algunos conceptos b&aacute;sicos
de la configuraci&oacute;n de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipf&sektion=8&manpath=OpenBSD+2.7">ipf(8)</a> e
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&sektion=8&manpath=OpenBSD+2.7">ipnat(8)</a>.
En el directorio <em>/usr/share/ipf/</em> puede encontrar
varios ejemplos para ipnat e ipf.  Le sugerimos que elija
aqu&eacute;l que m&aacute;s se acerque a lo que Vd necesite, y
que lo modifique para que se adapte a sus necesidades.
Tambi&eacute;n puede encontrar m&aacute;s informaci&oacute;n
sobre IPF en los <a href="http://false.net/ipfilter/">archivos
de la lista de correo de IP Filter</a>, en el
<a href="http://coombs.anu.edu.au/~avalon/">sitio oficial de
IP Filter</a>, y finalmente en el documento
<a href="http://www.obfuscation.org/ipf/">IP Filter HOWTO</a>.
</p>

<p>
<h3>IPF</h3>
</p>

<p>
Para activar IPF en el momento del arranque, debe modificar el
fichero de configuraci&oacute;n del sistema
<em>/etc/rc.conf</em> y activar la l&iacute;nea IPFILTER=YES.
IPF se controla desde el fichero de configuraci&oacute;n
<em>/etc/ipf.rules</em>, que el sistema leer&aacute; durante
el arranque.  Puede obtener una informaci&oacute;n m&aacute;s
detallada en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipf&sektion=5&manpath=OpenBSD+2.7">ipf(5)</a>.
En los ejemplos que siguen a continuaci&oacute;n,
<em>fxp0</em> representar&aacute; la interfaz externa a
Internet.  La suya ser&aacute; diferente dependiendo del
adaptador de ethernet que tenga en su m&aacute;quina.  En
estas reglas se asume que dispone de una conexi&oacute;n
permanente a Internet, como ser&iacute;a en el caso de un
servidor de <em>web</em>.
</p>

<p>
Las reglas de IPF se procesan de forma secuencial desde arriba
hacia abajo, y el tener que pasar por cada reglas antes de
alcanzar su destino ayuda a visualizar cada paquete.
</p>

<p>
Por ejemplo, el grupo de reglas predefinido permite la entrada
y la salida de todos los paquetes:

<ul><pre>
pass out from any to any 
pass in from any to any
</pre></ul>

Ahora supongamos que no quisi&eacute;ramos permitir las
conexiones entrantes por el puerto 3306 (mysql) porque
queremos que la base de datos s&oacute;lo fuera accesible
desde una m&aacute;quina local.  Nuestro grupo de reglas
ser&iacute;a como sigue:

<ul><pre>
pass out from any to any
pass in from any to any
block in on fxp0 from any to any port = 3306
</pre></ul>

Lo que significa &laquo;bloquear todos los paquetes entrantes,
desde cualquier procedencia hacia cualquier direcci&oacute;n,
cuyo destino sea 3306&laquo;.  De este modo, un paquete cuyo
destino fuera el puerto 3306 en la interfaz <em>fxp0</em>
pasar&iacute;a la primera regla &quot;pass in&quot; y a
continuaci&oacute;n ser&iacute;a bloqueado por la regla
&quot;block in port = 3306&quot;.  Si invirti&eacute;ramos el
orden de nuestras reglas entrantes (recuerde que el orden es
importante):

<ul><pre>
pass out from any to any
block in on fxp0 from any to any port = 3306
pass in from any to any
</pre></ul>

los paquetes con destino al puerto 3306 pasar&iacute;an porque
la &uacute;ltima regla del grupo permite que pasen todos los
paquetes.  Es esencial tener esto en cuenta cuando se escriben
las reglas: <strong>la &uacute;ltima regla que concuerde tiene
preferencia</strong>.
</p>

<p>
Pero siempre existen excepciones para toda reglas.  La
opci&oacute;n <em>quick</em> bloquea el paquete ante la
primera regla que concuerda.  Volvamos al ejemplo
err&oacute;neo anterior, a&ntilde;adiendo <em>quick</em> a la
regla &quot;block in&quot;:

<ul><pre>
pass out from any to any
block in quick on fxp0 from any to any port = 3306
pass in from any to any
</pre></ul>
</p>

<p>
Un paquete con destino al puerto 3306 de nuestro
anfitri&oacute;n se encontrar&iacute;a con la regla
&quot;block in quick&quot; y ser&iacute;a bloqueado de forma
inmediata.  Todos los paquetes que tuvieran otro destino no
encontrar&iacute;an una regla que coincidiera hasta llegar a
la regla &quot;pass in&quot;, que permite pasar a todos los
paquetes.
</p>

<strong>Denegaci&oacute;n predefinida</strong>

<p>
La pol&iacute;tica m&aacute;s segura de filtrado de paquetes
es la de denegaci&oacute;n predefinida.  Todo el
tr&aacute;fico cuyo paso no se haya permitido de forma
expl&iacute;cita, ser&aacute; bloqueado.  Esta pol&iacute;tica
es mucho m&aacute;s segura que la de denegar cada servicio
protegido expl&iacute;citamente, se obtienen grupos de reglas
m&aacute;s peque&ntilde;os, y puede protegernos de un servicio
que se haya dejado mal configurado de forma accidental.
</p>

<p>
Veamos otro ejemplo con grupos de reglas del mundo real,
explic&acute;ndolo l&iacute;nea por l&iacute;nea.  El
siguiente ejemplo es para un servidor de <em>web</em> con una
pol&iacute;tica de denegaci&oacute;n predefinida que
s&oacute;lo permite las conexiones por ssh (para la
administraci&oacute;n) y conexiones http (por el puerto 80) y
https (puerto 443).

<ul><pre>
pass in quick on fxp0 from any to any port = 22
pass in quick on fxp0 from any to any port = 80
pass in quick on fxp0 from any to any port = 443
block in quick on fxp0 from any to any
pass out on fxp0 from any to any
</pre></ul>

<p>
Este grupo de reglas permitir&aacute; el paso a las conexiones
entrantes con cualquier procedencia y con destino a los
puertos 22 (ssh), 80 (http) y 443 (https).  Otros intentos de
conexi&oacute;n ser&aacute;n bloqueados, y permitir&aacute; el
paso de todas las conexiones salientes.  Es un grupo de reglas
bastante estricto.  Pero, &iquest;y si s&oacute;lo
quisi&eacute;ramos permitir la conexi&oacute;n por ssh a
anfitriones internos de nuestro bloque de direcci&oacute;n
1.1.1.0, y al mismo tiempo permitir las conexiones externas
por http y https?

<ul><pre>
pass in quick on fxp0 from 1.1.1.0/24 to any port = 22
pass in quick on fxp0 from any to any port = 80
pass in quick on fxp0 from any to any port = 443
block in quick on fxp0 from any to any
pass out on fxp0 from any to any
</pre></ul>

Bien, pero, &iquest;y si s&oacute;lo quisi&eacute;ramos
permitir la administraci&oacute;n remota del servidor de
<em>web</em> a una sola m&aacute;quina (1.1.1.1)?  En ese caso
podr&iacute;amos cambiarlo lo esto

<ul><pre>
pass in quick on fxp0 from 1.1.1.0/24 to any port = 22
</pre></ul>

a esto

<ul><pre>
pass in quick on fxp0 from 1.1.1.1/32 to any port = 22
</pre></ul>

IPF tiene soporte para formas de direcci&oacute;n de
m&aacute;scaras de red (<em>netmask</em>) CIDR y decimales.
Lo anterior tambi&eacute;n se podr&iacute;a escribir
as&iacute;:

<ul><pre>
pass in quick on fxp0 from 1.1.1.1/255.255.255.255 to any port = 22
</pre></ul>

pero, &iquest;para qu&eacute;?
</p>

<strong>Reglas de muestra</strong>

<p>
He aqu&iacute; algunos ejemplos &uacute;tiles de reglas que
pueden usar todos (en estas reglas se asume que <em>fxp0</em>
es la interfaz externa conectada a Internet).  Para empezar
configuraremos una simple protecci&oacute;n contra la
falsificaci&oacute;n de direcciones (<em>IP spoofing</em>):

<ul><pre>
block in quick on fxp0 from 127.0.0.0/8 to any
block in quick on fxp0 from 192.168.0.0/16 to any
block in quick on fxp0 from 172.16.0.0/12 to any
block in quick on fxp0 from 10.0.0.0/8 to any
block out quick on fxp0 from any to 127.0.0.1/8
block out quick on fxp0 from any to 192.168.0.0/16
block out quick on fxp0 from any to 172.16.0.0/12
block out quick on fxp0 from any to 10.0.0.0/8
</pre></ul>

Tambi&eacute;n es una buena idea separar la interfaz de bucle
(<em>loopback</em>) de las otras reglas.

<ul><pre>
pass out quick on lo0
pass in quick on lo0
</pre></ul>

Nuestro grupo de reglas ya empieza a pintar bien;  al ponerlo
todo junto, obtenemos algo as&iacute;:

<ul><pre>
# Reglas de loopback
pass out quick on lo0
pass in quick on lo0

# no permitir que alguien puede falsificar
# direccciones no enrutables

block in quick on fxp0 from 127.0.0.0/8 to any
block in quick on fxp0 from 192.168.0.0/16 to any
block in quick on fxp0 from 172.16.0.0/12 to any
block in quick on fxp0 from 10.0.0.0/8 to any
block out quick on fxp0 from any to 127.0.0.1/8
block out quick on fxp0 from any to 192.168.0.0/16
block out quick on fxp0 from any to 172.16.0.0/12
block out quick on fxp0 from any to 10.0.0.0/8

# s&oacute;lo permitir la conexi&oacute;n a nuestra
# m&aacute;quina de administraci&oacute;n por ssh

pass in quick on fxp0 from 1.1.1.1/32 to any port = 22

# pemitir a otros el uso de http y https

pass in quick on fxp0 from any to any port = 80
pass in quick on fxp0 from any to any port = 443

# para acabar, bloquear el resto con una
# denegaci&oacute;n predefinida

block in quick on fxp0 from any to any

# y permitir el paso del tr&aacute;fico saliente

pass out on fxp0 from any to any
</pre></ul>
</p>

<strong>Registro de paquetes</strong>

<p>
Lo que hemos hecho ya est&aacute; bastante bien, pero
podr&iacute;a estar mejor.  &iquest;Y si quisi&eacute;ramos
registrar informaci&oacute;n sobre cualquier intento de
conexi&oacute;n al puerto 22 (ssh) que fuera bloqueado por
nuestro filtro?  IPF puede hacerlo con la clave <em>log</em>:

<ul><pre>
pass in quick on fxp0 from 1.1.1.1/32 to any port = 22
block in log quick on fxp0 from any to any port = 22
</pre></ul>

Esta regla permitir&aacute; a nuestra m&aacute;quina de
administraci&oacute;n remota la conexi&oacute;n por el puerto
22, pero bloquear&aacute;, y registrar&aacute; la
informaci&oacute;n, cualquier otro intento de conexi&oacute;n
por el puerto 22.
</p>

<strong>Filtrado de paquetes basado en el protocolo</strong>

<p>
IPF puede filtrar cualquier protocolo de IP que aparezca en el
fichero
<a href="file://localhost/etc/protocols">/etc/protocols</a>,
bas&aacute;ndose en su n&uacute;mero o nombre.  Para
simplificarlo, s&oacute;lo trataremos con los protocolos tcp,
udp e icmp.  Estos protocolos son los de uso m&aacute;s
com&uacute;n.  Todas las aplicaciones b&aacute;sicas de
internet dependen de la existencia y de la correcta
operabilidad de estos protocolos.
</p>

<p>
Para que IPF filtre bas&aacute;ndose en el protocolo se debe
usar la clave <em>proto</em>.  Para nuestro ejemplo anterior
con ssh, y como ssh funciona por tcp, s&oacute;lo
deber&iacute;amos permitir la conexi&oacute;n de paquetes tcp.
Si usamos la clave <em>proto</em> para permitir s&oacute;lo
paquetes tcp, obtendremos esta regla:

<ul><pre>
pass in quick on fxp0 proto tcp from 1.1.1.1/32 to any port = 22
</pre></ul>

Pero, &iquest;y si necesit&aacute;ramos permitir las
conexiones a un servicio que funcionara por tcp y udp, como
bind?  En el caso de tcp/udp IPF le permite agrupar ambos
protocolos en uno (Nota:  esto s&oacute;lo es aplicable para
tcp/udp).  Bas&aacute;ndonos en el ejemplo anterior de
<em>bind</em>, una regla que permitiera las conexiones tcp y
udp dentro de un entorno de denegaci&oacute;n predefinida
ser&iacute;a:

<ul><pre>
pass in quick on fxp0 proto tcp/udp from any to any port = 53
</pre></ul>
</p>

<strong>Filtrado de paquetes</strong>

<p> 
Adem&aacute;s de filtrar bas&aacute;ndose en el protocolo, IPF
tambi&eacute;n es capaz de gestionar paquetes IP fragmentados
(un m&eacute;todo com&uacute;n para vencer a los filtros de
paquetes).  Existen dos claves posibles que se pueden usar
para tratar con paquetes fragmentados, <em>frag</em> para
paquetes IP fragmentados comunes, o <em>short</em> para
paquetes IP con cabeceras demasiado peque&ntilde;as como para
que puedan ser comparadas.  Como, dependiendo de las
condiciones de enlace, la fragmentaci&oacute;n de paquetes
puede llegar a ser algo usual, es mejor filtrar s&oacute;lo
los paquetes con cabeceras demasiado peque&ntilde;as.  Para
ello se usar&iacute;a la siguiente regla:

<ul><pre>
block in quick proto tcp all with short
</pre></ul>

Y, &iquest;qu&eacute; hay de <em>IP Options</em>?  IPF
tambi&eacute;n se puede encargar de esos paquetes.  Los
paquetes se pueden bloquear si tienen <em>IP Options</em>
activado, o se pueden bloquear dependiendo de las opciones que
tengan activadas.  Por ejemplo, la siguiente regla
bloquear&iacute;a todos los paquetes con <em>IP Options</em>
activado y registrar&iacute;a la informaci&oacute;n

<ul><pre>
block in log quick on fxp0 all with ipopts
</pre></ul>

Pero esto podr&iacute;a estropear algunas cosas, como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=traceroute&sektion=8&format=html">traceroute(8)</a>.
En lugar de esto, podr&iacute;mos especificar a qu&eacute;
opciones no se debe permitir el paso.  Por ejemplo,
podr&iacute;mos bloquear todos los paquetes con opciones de
enrutamiento de origen del siguiente modo:

<ul><pre>
block in quick on fxp0 all with opt lsrr
block in quick on fxp0 all with opt ssrr
</pre></ul>
</p>

<strong>Indicadores de TCP, mantenimiento de conexiones
establecidas y mantenimiento de estado</strong>

<p>
Ahora ya empezamos a tener un filtrado funcional.  Una de las
mejores funcionalidades de IPF es su capacidad para filtrar
paquetes bas&aacute;ndose en los indicadores de TCP y para
mantener las conexiones establecidas y del estado de la
conexi&oacute;n.  Se recomienda que todos los usuarios que
quieran filtrar paquetes bas&aacute;ndose en los indicadores
de TCP, entiendan antes cu&aacute;l es la funci&oacute;n que
desempe&ntilde;a cada indicador.  As&iacute; pues, si
quisi&eacute;ramos denegar el paso a todos los paquetes con
los indicadores FIN, URG y PSH activados (como por ejemplo en
un intento de identificaci&oacute;n del sistema operativo
mediante <em>nmap</em>), podr&iacute;mos usar una regla como
la siguiente:

<ul><pre>
block in quick on fxp0 proto tcp from any to any flags FUP
</pre></ul>

(Gracias a <a href=mailto:halogen@nol.net>Kyle Hargraves</a>
por esta regla)
</p>

<p>
El siguiente truco de IPF consiste en su capacidad para
mantener el estado de la conexi&oacute;n.  El mantenimiendo de
estado se define como &laquo;no hablar hasta que le
pregunten&raquo;, o en otras palabras, una vez que se haya
establecido una conexi&oacute;n, los paquetes ya no tienen que
pasar a trav&eacute;s de los grupos de reglas.  &Eacute;sta es
una funcionalidad muy potente que permite escribir reglas
mucho m&aacute;s simples y seguras.

<p>
Veamos como podr&iacute;amos aplicar el mantenimiento del
estado a nuestro ejemplo de reglas anterior.  Pero antes
repasemos lo que tenemos:  estamos permitiendo el acceso para
la administraci&oacute;n desde nuestra clase C al puerto 22
(ssh), y permitiendo el paso de todo el tr&aacute;fico
<em>web</em> entrante por los puertos 80 (http) y 443 (https);
estamos bloqueando el resto de tr&aacute;fico entrante.
&iquest;Y si quisi&eacute;ramos establecer una conexi&oacute;n
saliente mediante ssh?  &iquest;y si necesit&aacute;ramos usar
lynx para buscar algo entre las preguntas frecuentes?  La
respuesta es que no podr&iacute;amos ya que habr&iacute;amos
bloqueado todas las conexiones entrantes a excepci&oacute;n de
las que usaran los puertos especificados.  Aunque esta
configuraci&oacute;n es la m&aacute;s segura, tambi&eacute;n
puede ser muy poco conveniente.  Pero a&ntilde;adiendo la
clave <em>keep state</em> a nuestra regla &laquo;pass
out&raquo; podemos permitir la entrada de conexiones entrantes
que se generen como respuesta a conexiones salientes que
iniciemos nosotros desde nuestro servidor de <em>web</em>,
como por ejemplo cuando navegamos por la <em>web</em>.
Recuerde que es necesario especificar el protocolo para el que
se est&eacute; manteniendo el estado.

<ul><pre>
pass in quick on fxp0 from 1.1.1.0/24 to any port = 22
pass in quick on fxp0 from any to any port = 80
pass in quick on fxp0 from any to any port = 443
block in quick on fxp0 from any to any
pass out on fxp0 proto tcp from any to any keep state
</pre></ul>
</p>

<p>
Este peque&ntilde;o cambio incrementar&aacute; de forma
dram&aacute;tica la flexibilidad y la seguridad de nuestro
grupo de reglas porque IPF es altamente flexible.  Por
ejemplo, en el grupo de reglas anterior, estamos permitiendo
el paso de todo el tr&aacute;fico tcp hacia los puertos 80 y
443.  A&uacute;n es posible hacerlo m&aacute;s estricto.  Para
que se establezca una conexi&oacute;n tcp s&oacute;lo tenemos
que permitir que se produzca el &laquo;saludo inicial de
conexi&oacute;n&raquo; (<em>handshake</em>), y una vez que
esto tiene lugar ya podemos bloquear el tr&aacute;fico a ese
puerto y dejar que nuetra regla &quot;keep state&quot; se
encargue de gestionar la conexi&oacute;n.  Para que el saludo
inicial se complete, lo &uacute;nicos indicadores activos
necesarios en el paquete son SYN y SYNACK.  Si s&oacute;lo
permitimos el paso a paquetes con SYN y SYNACK activado
podemos prevenir muchos tipos de barridos de puertos (<em>port
scanning</em>) como el barrido de FIN.  Ahora las reglas
quedan del siguiente modo:

<ul><pre>
pass in quick on fxp0 from 1.1.1.0/24 to any port = 22
pass in quick on fxp0 from any to any port = 80 flags S/SA
pass in quick on fxp0 from any to any port = 443 flags S/SA
block in quick on fxp0 from any to any
pass out on fxp0 proto tcp from any to any keep state
</pre></ul>
</p>

<p>
Empecemos a poner un poco de orden agrupando todas las reglas
que hasta ahora tenemos.  Esta agrupaci&oacute;n tendr&aacute;
una pol&iacute;tica de denegaci&oacute;n predefinida,
s&oacute;lo permitir&aacute; las conexiones desde una red
interna para la administraci&oacute;n (a trav&eacute;s de
ssh), y permitir&aacute; el tr&aacute;fico entrante por los
puertos 80 (http) y 443 (https).  Tambi&eacute;n estar&aacute;
protegida contra la falsificaci&oacute;n de direcciones IP no
enrutables, y bloquear&aacute; todos los paquetes cuya
fragmentaci&oacute;n sea excesiva para que permita su
inspecci&oacute;n.  Una configuraci&oacute;n bastante completa
para un servidor de <em>web</em> p&uacute;blico.  He
aqu&iacute; como quedar&iacute;a <em>/etc/ipf.rules</em>:

<ul><pre>
# reglas de loopback
pass out quick on lo0
pass in quick on lo0

# bloquear los fragmentos diminutos
block in quick proto tcp all with short

# bloquear paquetes enrutados desde el origen
block in quick on fxp0 all with opt lsrr
block in quick on fxp0 all with opt ssrr

# no permitir la falsificaci&oacute;n
# de direcciones no enrutables
block in quick on fxp0 from 127.0.0.0/8 to any
block in quick on fxp0 from 192.168.0.0/16 to any
block in quick on fxp0 from 172.16.0.0/12 to any
block in quick on fxp0 from 10.0.0.0/8 to any
block out quick on fxp0 from any to 127.0.0.1/8
block out quick on fxp0 from any to 192.168.0.0/16
block out quick on fxp0 from any to 172.16.0.0/12
block out quick on fxp0 from any to 10.0.0.0/8

# permitir la conexi&oacute;n a nuestras m&aacute;quinas
# s&oacute;lo a trav&eacute;s de ssh
pass in quick on fxp0 from 1.1.1.0/24 to any port = 22

# permitir que otros usen http y https
pass in quick on fxp0 from any to any port = 80 flags S/SA
pass in quick on fxp0 from any to any port = 443 flags S/SA

# finalmente, bloquear el resto con una pol&iacute;tica de
# denegaci&oacute;n predefinida
block in quick on fxp0 from any to any

# y dejar pasar el tr&aacute;fico saliente y mantener el
# estado en las conexiones establecidas
# -- Los indicadores S en <em>keep state</em> son para
#    asegurar que el seguimiento del estado empieza
#    s&oacute;lo en el primer paquete saliente en una
#    sesi&oacute;n tcp.
# -- El indicador s s&oacute;lo funciona con el protocolo tcp,
#    as&iacute; que se requieren tres entradas para cubrir los
#    tres protocolos (tcp, udp, icmp).

pass out	quick on fxp0 proto tcp  from any to any flags S keep state
pass out 	quick on fxp0 proto udp  from any to any         keep state
pass out 	quick on fxp0 proto icmp from any to any         keep state
</pre></ul>
</p>

<p>
Si tiene problemas, puede activar el registro de
informaci&oacute;n en reglas individuales para poder
resolverlos de forma efectiva, o sea: 
pass in log quick on fxp0 from 1.1.1.0/24 to any port = 22<br>
Cuando modifique el fichero de configuraci&oacute;n para el
registro de paquetes, &iexcl;no se olvide de ejecutar
<kbd>ipf -Fa -f /etc/ipf.rules</kbd> para que los cambios
surtan efecto!<br>
<em>ipmon</em> escribir&aacute; la informaci&oacute;n de las
entradas de registro a <em>/var/log/ipflog</em>.

<p>
Puede ver m&aacute;s informaci&oacute;n ingl&eacute;s sobre
IPF en el documento
<a href=http://www.obfuscation.org/ipf/ipf-howto.txt>IPF
HOWTO</a>, que es una fuente excelente, as&iacute; como los
recursos disponibles desde las p&aacute;ginas de
<a href=http://coombs.anu.edu.au/~avalon/ip-filter.html>IP
Filter</a>.
</p>

<p>
<a name="6.3"></a>
<h2>6.3 - IPNAT</h2>
</p>

<p>
Wayne Fergerstrom &lt;wayne@methadonia.net&gt; inici&oacute;
el trabajo sobre esta secci&oacute;n.
</p>

<a name="nat1.0"></a>
<h3><u>6.3.1 Introducci&oacute;n a NAT</u></h3>

<a name="nat1.1"></a>
<strong>Introducci&oacute;n</strong>

<p>
El objetivo de esta secci&oacute;n es el de ayudar a instalar
y configurar la &laquo;Traducci&oacute;n de Direcciones de
Red&raquo; (<em>Network Address Translation</em>,
&quot;NAT&quot;) en una m&aacute;quina con OpenBSD.

Se asume que el usuario ya ha instalado y configurado una
m&aacute;quina con OpenBSD y dos tarjetas de red (una
conectada a Internet y la otra a una red local).  IP NAT
funcionar&aacute; en m&aacute;quinas con un s&oacute;lo NIC;
sin embargo, como los paquetes entrar&aacute;n y
saldr&aacute;n por la misma interfaz, las colisiones de
<em>ethernet</em> ralentizar&aacute;n bastante el rendimiento.
</p>

<p>
Basado en la especificaci&oacute;n
<a href="http://www.geektools.com/rfc/rfc1631.txt">RFC 1631</a>,
<em>ipnat</em> ofrece una forma f&aacute;cil para asignar
redes internas a una &uacute;nica direcci&oacute;n de Internet
enrutable (&laquo;real&raquo;).  Si no dispone de direcciones
asignadas oficialmente para cada m&aacute;quina de su red
interna, esto le ser&aacute; de gran utilidad.  Cuando
configure sus redes privadas/internas, puede aprovechar los
bloques de direcciones reservadas (asignadas en el documento
<a href="http://www.geektools.com/rfc/rfc1918.txt">RFC
1918</a>), como las siguientes:

<p>
10.0.0.0/8 (10.0.0.0 - 10.255.255.255)<br>
172.16.0.0/12 (172.16.0.0 - 172.31.255.255)<br>
192.168.0.0/16 (192.168.0.0 - 192.168.255.255)<br>
</p>

<a name="nat1.2"></a>
<strong>Terminolog&iacute;a</strong>

<p>
Las convenciones utilizadas en este documento son bastante
simples.  A modo informativo, revisaremos algunos de los
t&eacute;rminos usados en este documento y su formato.
</p>

<ul>
<strong>&quot;NAT&quot;</strong>
<p>
Es el acr&oacute;nimo que se utiliza para referirse a la
&laquo;traducci&oacute;n de direcciones de red&raquo;
(<em>Network Address Translation</em>).  El proceso de
&quot;NAT&quot; se describir&aacute; m&aacute;s adelante.
</p>
</ul>

<ul>
<strong>&quot;ipnat&quot;</strong>
<p>
Es una abreviaci&oacute;n de &quot;IP NAT&quot;.  Este
t&eacute;rmino es intercambiable con el de &quot;NAT&quot;,
aunque a lo largo de este documento &quot;ipnat&quot; se usa
s&oacute;lo para referirse a la orden ejecutable.
</p>
</ul>

<ul>
<strong>&quot;IPF&quot;</strong>
<p>
Es un acr&oacute;nimo y abreviaci&oacute;n de &quot;IP
Filter&quot;.  &quot;IPF&quot; es un sistema de filtrado que
se incluye como parte de OpenBSD.  IPF debe estar activado
antes que &quot;ipnat&quot;.  Para ello hay que editar el
fichero de configuraci&oacute;n del arranque
<em>/etc/rc.conf</em> y cambiar la l&iacute;nea
<em>ipfilter=NO</em> por <em>ipfilter=YES</em>.  Este cambio
s&oacute;lo es efectivo para la secuencia de inicio,
as&iacute; que tambi&eacute;n tendr&aacute; que ejecutar la
orden <kbd>ipf -E</kbd> para activar IPF despu&eacute;s de
iniciar el sistema.  Todo esto se explicar&aacute; con
m&aacute;s detalle a continuaci&oacute;n.
</p>
</ul>

<br>
<a name="nat1.3"></a>
<strong>Configuraci&oacute;n</strong>

<p>
Hemos escogido unos ejemplos de configuraci&oacute;n para este
documento, pero su configuraci&oacute;n diferir&aacute; en
mayor o menor grado, y aqu&iacute; s&oacute;lo pretendemos
mostrarle c&oacute;mo hacerlo para que luego lo pueda adaptar
a su configuraci&oacute;n.
</p>

<ul>
<strong>Sistema Operativo: </strong>OpenBSD v2.7 i386<br>
<br>
<strong>NIC (tarjetas de red): </strong>
<ul>
	NetGear 10/100MB <strong>dc0</strong><br>
	Conectada a una LAN (o WAN) EXTERNA<br>
	<strong>Direcci&oacute;n IP: </strong>24.5.0.5<br>
	<strong>M&aacute;scara de red (<em>Netmask</em>): </strong>255.255.255.0<br>
	<br>
	NetGear 10/100MB <strong>dc1</strong><br>
	Conectada a una LAN INTERNA<br>
	<strong>Direcci&oacute;n IP: </strong>192.168.1.1<br>
	<strong>M&aacute;scara de red: </strong>255.255.255.0<br>	
</ul>
<br>
<strong>IP externa enrutable por Internet (provista por un
ISP, un proveedor de Internet, que en este ejemplo es un
proveedor de m&oacute;dem cable)</strong><br>
<ul>
	<strong>Direcci&oacute;n IP: </strong>24.5.0.5<br>
	<strong>M&aacute;scara de red: </strong>255.255.255.0<br>
	<strong>Pasarela (<em>Gateway</em>): </strong>24.5.0.1<br>
</ul>
<br>
<strong>Red de &Aacute;rea Local (LAN)</strong><br>
<ul>
En este ejemplo, las m&aacute;quinas de la LAN usan el esquema
de direcciones IP 192.168.1.xxx (en donde xxx es un
n&uacute;mero &uacute;nico).  Hay una variedad de sistemas
operativos diferentes en la LAN interna, incluyendo Windows
98, Windows NT, OpenBSD y Linux.  Cada m&aacute;quina
est&aacute; conectada a un concentradro (<em>hub</em>)
designado para el uso interno.  Para los ejemplos de este
documento, se asumir&aacute; que la direcci&oacute;n IP del
cliente de esta LAN es 192.168.1.40.
</ul>
<br>
<strong>Diagrama de configuraci&oacute;n</strong>
<ul><pre>
+-----+              +---------+         +----------+
| Hub |--------- dc1 |   NAT   | dc0 ----| Internet |
+-----+              +---------+         +----------+
  | |
  | +-- Cliente A
  +---- M&aacute;s clientes 

                              +-------------------------+
                              |          LEYENDA        |
                              +-------------------------+
                              |  NIC dc0 - 24.5.0.5     |
                              |  NIC dc1 - 192.168.1.1  |
                              | Cliente A - 192.168.1.40|
                              +-------------------------+

</pre></ul>
</ul>

<br>
<a name="nat2.0"></a>
<h3><u>6.3.2 Traducci&oacute;n de Direcciones de Red
(NAT)</u></h3>
<br>

<a name="nat2.1"></a>
<strong>Introducci&oacute;n a NAT</strong>

<p>
A medida que m&aacute;s compa&ntilde;&iacute;as y usuarios van
apareciendo en Internet, se incrementa la necesidad de que
cada uno tenga una direcci&oacute;n IP.  Las direcciones IP
p&uacute;blicas son cada vez m&aacute;s dif&iacute;ciles de
conseguir.  Para mucha gente, la soluci&oacute;n es la
&laquo;traducci&oacute;n de direcciones de red&raquo;, o NAT.
NAT es muy simple, y aun as&iacute; una forma muy potente para
conectar una LAN a Internet sin tener que comprar o alquilar
direcciones IP para cada m&aacute;quina.  Entre los usuarios
de Linux, NAT se conoce como &laquo;enmascaramiento IP&raquo;.
</p>

<p>
Cuando NAT est&aacute; en funcionamiento, permite que los
usuarios de la LAN interna puedan acceder a Internet a
trav&eacute;s de una direcci&oacute;n IP diferente (la que
haya configurado con su proveedor de servicios de Internet).
Cada m&aacute;quina dentro de la LAN usa la direcci&oacute;n
IP (de forma transparente) de la m&aacute;quina que haya sido
configurada para utilizar la direcci&oacute;n IP asignada por
el proveedor.
</p>

<p>
NAT funciona de un modo incre&iacute;blemente simple.  Cuando
un cliente desde dentro de la LAN quiere conectarse a una
m&aacute;quina en Internet, env&iacute;a un paquete TCP para
requerir la conexi&oacute;n.  Dentro de la cabecera del
paquete TCP se encuentra la direcci&oacute;n IP del cliente
(192.168.1.40 para nuestro ejemplo) y la direcci&oacute;n IP
del anfitri&oacute;n al que enviamos la petici&oacute;n
(123.45.67.89 en este caso).  La m&aacute;quina que usamos
para NAT intercepta este paquete TCP y cambia la
direcci&oacute;n IP del cliente de 192.168.1.40 por la
direcci&oacute;n IP de la m&aacute;quina conectada a Internet
(o sea, 24.5.0.5).  De este modo enga&ntilde;a a la
m&aacute;quina anfitriona haci&eacute;ndole creer que la
conexi&oacute;n proviene de la m&aacute;quina con NAT, y no de
la m&aacute;quina cliente.  As&iacute;, el anfitri&oacute;n
enviar&aacute; las repuestas de vuelta a la m&aacute;quina con
NAT, como si &eacute;sta fuera la que requer&iacute;a la
conexi&oacute;n.  Cuando la m&aacute;quina con NAT recibe la
respuesta, r&aacute;pidamente traduce la direcci&oacute;n IP
de destino desde la suya propia a la de la m&aacute;quina
cliente, y env&iacute;a el paquete al cliente.  El cliente no
se ha enterado de lo que ha ocurrido y la conexi&oacute;n a
Internet ha sido falsificada de un modo totalmente
transparente.
</p>

<p>
El siguiente ejemplo ilustra con claridad el funcionamiento de
NAT:
</p>

<ul><pre>
Client ----------------- dc1 [ NAT ] dc0 ---------- Internet Host
192.168.1.40 --- 192.168.1.1 [ NAT ] 24.5.0.5 --- 123.45.67.89

paquete TCP SALIENTE                      paquete TCP SALIENTE
desde: 192.168.1.40     &gt;&gt;=== NAT ===&gt;&gt;   desde: 24.5.0.5
hacia: 123.45.67.89                       hacia: 123.45.67.89

paquete TCP ENTRANTE                      paquete TCP ENTRANTE
desde: 123.45.67.89 			  desde: 123.45.67.89
hacia: 192.168.1.40     &lt;&lt;=== NAT ===&lt;&lt;   hacia: 24.5.0.5
</pre></ul>

<br>
<a name="nat2.2"></a>
<strong>&iquest;Por qu&eacute; utilizar NAT?</strong>

<p>
Cuando me instalaron la l&iacute;na por cable en mi nuevo
apartamento, tambi&eacute;n me crearon un nuevo, aunque
peque&ntilde;o, problema.  &iquest;C&oacute;mo puedo hacer que
mis compa&ntilde;eros de apartamento accedan a Internet si el
m&oacute;dem cable est&aacute; en mi habitaci&oacute;n?
Entre las opciones que ten&iacute;a, y que pasaban desde la
obtenci&oacute;n de direcciones IP adicionales a la
implementaci&oacute;n de un servidor <em>proxy</em>, estaba la
instalaci&oacute;n de NAT (no deje que este siemple ejemplo le
enga&ntilde;e, &iexcl;NAT es lo suficientemente potente como
para enmascarar toda una larga red con cientos o incluso miles
de m&aacute;quinas!).
</p>

<p>
Hab&iacute;a muchos motivos por los que quise instalar NAT.
El m&aacute;s importante era el ahorro de dinero.  En mi
apartamento ten&iacute;a dos compa&ntilde;eros, cada uno con
su propio ordenador, y yo que dispon&iacute;a de tres
ordenadores.  Mi proveedor s&oacute;lo ofrec&iacute;a tres
direcciones IP por apartamento, por lo que no
dispon&iacute;amos de bastantes IP para que cada
m&aacute;quina pudiera acceder a Internet.
</p>

<p>
Pero utilizando NAT cada m&aacute;quina tendr&iacute;a una
direcci&oacute;n IP &uacute;nica (interna), y
compartir&iacute;an la &uacute;nica direcci&oacute;n IP que
nos dio el proveedor.  El coste se redujo.
</p>

<br>
<a name="nat2.3"></a>
<strong>Preconfiguraci&oacute;n</strong>

<p>
Para poder activar NAT en una m&aacute;quina con OpenBSD
necesitar&aacute; antes activar IPF y NAT.  Esto es
f&aacute;cil de hacer editando los ficheros que se citan a
continuaci&oacute;n (cambie estos ficheros de modo que queden
como los que siguen):
</p>

<p>
<strong>/etc/rc.conf</strong> (este fichero se usa para
iniciar los servicios durante el arranque)
</p>

<ul>
	ipfilter=YES<br>
	ipnat=YES
</ul>

<p>
<strong>/etc/sysctl.conf</strong>
</p>

<ul>
	net.inet.ip.forwarding=1
</ul>

<p>
Despu&eacute;s de hacer estos cambios, la m&aacute;quina
estar&aacute; preparada para la configuraci&oacute;n de NAT.
</p>

<br>
<a name="nat2.4"></a>
<strong>Configuraci&oacute;n</strong>

<p>
El primer paso es configurar el fichero de reglas de IPF
(<em>/etc/ipf.rules</em>).  Para el ejemplo de este documento
permitiremos el paso del tr&aacute;fico a trav&eacute;s de
este cortafuegos sin ninguna interferencia.  El fichero
deber&iacute;a quedar as&iacute;:
</p>

<ul><pre>
pass in from any to any
pass out from any to any
</pre></ul>

<p>
Para m&aacute;s informaci&oacute;n puede leer la
<a href="#6.2">secci&oacute;n 6.2</a>.
</p>

<p>
following entry:
El fichero de configuraci&oacute;n de NAT
(<em>/etc/ipnat.rules</em>) tiene una sintaxis muy sencilla.
Para la configuraci&oacute;n que usamos anteriormente, el
fichero deber&iacute;a contener las siguientes entradas:
</p>

<ul><pre>
map dc0 192.168.1.0/24 -&gt; 24.5.0.5/32 portmap tcp/udp 10000:60000
map dc0 192.168.1.0/24 -&gt; 24.5.0.5/32
</pre></ul>

<p>
He aqu&iacute; una explicaci&oacute;n de lo que significan
estas l&iacute;neas:
</p>

<ul>
<strong>&quot;map&quot;</strong>
<p>
Mediante esta instrucci&oacute;n se le indica a ipnat que esta
entrada es una entrada para cambiar la direcci&oacute;n IP
entre la LAN e Internet.
</p>
</ul>

<ul>
<strong>&quot;dc0&quot;</strong>
<p>
&Eacute;sta es la interfaz de red que est&aacute; conectada a
Internet.
</p>
</ul>

<ul>
<b>&quot;192.168.1.0/24&quot;</b>
<p>
Es la direcci&oacute;n de IP y la m&aacute;scara de red
(<em>netmask</em>, en formato CIDR).  En combinaci&oacute;n
signfican que &laquo;cualquier direcci&oacute;n IP con un
valor entre 192.168.1.1 y 192.168.1.254&quot; debe ser
asignada.  Si prefiere no usar la notaci&oacute;n tipo CIDR,
puede substituir &quot;/24&quot; por
&quot;/255.255.255.0&quot;.
</p>
</ul>

<ul>
<b>&quot;24.5.0.5/32&quot;</b>
<p>
Esta direcci&oacute;n IP y m&aacute;scara de red indican el
estado de la direcci&oacute;n IP a la que ser&aacute;n
asignadas las direcciones IP de la LAN.  /32 significa una
sola direcci&oacute;n IP.  Tambi&eacute;n se puede asignar a
direcciones /24 &oacute; 256 (&oacute; /27, &oacute; cualquier
n&uacute;mero de bits que quiera).  Esto le ser&iacute;a de
utilidad si tuviera varios miles de m&aacute;quinas clientes
detr&aacute;s de su m&aacute;quina NAT (&iexcl;esto
s&oacute;lo ser&aacute; de utilidad si ese /24 est&aacute;
siendo enrutado a su m&aacute;quina OpenBSD!).
</p>
</ul>

<ul>
<b>&quot;portmap tcp/udp 10000:60000&quot;</b>
<p>
Asigna todos los paquetes tcp/udp a los puertos dentro del
rango 10000 a 60000.
</p>
</ul>

<p>
La segunda l&iacute;nea tiene casi la misma entrada, a
excepci&oacute;n de la &uacute;ltima parte.  &Eacute;sta
indica a ipnat que asigne cualquier otra cosa (no tcp/udp, ya
que esos paquetes ya han sido asignados por la primer
l&iacute;nea) a lo que requiera el puerto (se usa para icmp y
otros protocolos).  Una vez que todo esto est&eacute;
configurado en el fichero, todo lo que faltar&aacute;
ser&aacute; ejecutar el d&aelig;mon de IPF.
</p>

<br>

<a name="nat2.5"></a>
<strong>NAT selectivo</strong>

<p>
Es probable que desee evitar que NAT funcione para
alg&uacute;n rango de direcciones externas.  Partiendo del
ejemplo anterior, vamos a suponer que hubiera anfitriones en
la red 25.5.0.0/28 para los que no quisiera que su pasarela
NAT actuara con un simple enrutador, sin traducci&oacute;n de
direcciones.  Se puede suprimir la traducci&oacute;n de
direcciones para el tr&aacute;fico hacia esta subred
procedente de la interfaz <em>dc0</em> del siguiente modo:
</p>

<ul><pre>
map dc0 from 192.168.1.0/24 ! to 24.5.0.0/28 -&gt; 24.5.0.5/32 portmap tcp/udp 10000:60000
map dc0 from 192.168.1.0/24 ! to 24.5.0.0/28 -&gt; 24.5.0.5/32
</pre></ul>

<a name="nat2.6"></a>
<strong>Ejecuci&oacute;n</strong>

<p>
La ejecuci&oacute;n de NAT es un proceso muy simple.  Una vez
que la configuraci&oacute;n est&eacute; completa, hay dos
formas de activar NAT.  La primera (y la mejor si fuera
posible probarlo durante el proceso de configuraci&oacute;n)
es la de reiniciar la m&aacute;quina con OpenBSD.  Para ello
hay que usar la orden <kbd>reboot</kbd>.
</p>

<p>
Si desea ejecutar ipnat desde la l&iacute;nea de
&oacute;rdenes, use las siguientes &oacute;rdenes:
</p>

<ul><pre>
# ipf -Fa -f /etc/ipf.rules -E
# ipnat -CF -f /etc/ipnat.rules
</pre></ul>

<p>
Con la primera l&iacute;nea de &oacute;rdenes se activa IPF
(recuerde que NAT depende de IPF, y por lo tanto IPF debe
estar funcionando antes de cargar NAT).  Las opciones
<em>-Fa</em> para la orden <em>ipf</em> eliminan cualquier
entrada existente que estuviera activada.  La opci&oacute;n
<em>-f /etc/ipf.rules</em> indica a IPF d&oacute;nde puede
encontrar su fichero de reglas.  Finalmente, <em>-E</em> es el
indicador que activa el d&aelig;mon de IPF.
</p>

<p>
Con la segunda l&iacute;nea de &oacute;rdenes se activa NAT.
Las opciones <em>-CF</em> para la orden <em>ipnat</em>
eliminan cualquier entrada existente en la tabla de NAT.  La
opci&oacute;n <em>-f /etc/ipnat.rules</em> indica a NAT
d&oacute;nde puede encontrar su fichero de reglas.  A partir
de este momento ya se encuentra funcionando NAT.  As&iacute;
de simple.
</p>


<p>
<strong>Nota:</strong> para volver a cargar las reglas de NAT
(en casa que editara el fichero y lo modificara, y que no
quisiera reiniciar el sistema) ejecute la segunda orden de
nuevo.  La configuraci&oacute;n ser&aacute; desactivada y se
volver&aacute; a cargar y a activar.
</p>

<br>
<a name="nat3.0"></a>
<h3><u>6.3.3 Base de conocimientos de NAT</u></h3>

<br>
<a name="nat3.1"></a>
<strong>Comprobaci&oacute;n del estado de NAT</strong>

<p>
Si quiere saber c&oacute;mo est&aacute; funcionando NAT, o
asegurarse de que las configuraciones han sido efectivas,
puede usar la opci&oacute;n <em>-l</em>.  Con esta
opci&oacute;n obtendr&aacute; una lista de todas las
configuraciones y sesiones que est&eacute;n siendo usadas por
ipnat en el momento actual:
</p>

<ul><pre>
# <strong>ipnat -l</strong>
map dc0 192.168.1.0/24 -&gt; 24.5.0.5/32 portmap tcp/udp 10000:60000
map dc0 192.168.1.0/24 -&gt; 24.5.0.5/32

List of active sessions:
MAP 192.168.1.40  2473  &lt;- -&gt; 24.5.0.5  13463 [129.128.5.191 80]
</pre></ul>

<p>
El prop&oacute;sito de las primeras dos l&iacute;neas es el de
confirmar que las configuraciones que se escribieron
anteriormente en el fichero <em>/etc/ipnat.rules</em>.  La
l&iacute;nea o l&iacute;neas posteriores le mostrar&aacute;n
una lista de las conexiones que est&eacute;n siendo
controladas actualmente por NAT.
</p>

<ul>
<strong>&quot;MAP 192.168.1.40  2473&quot;</strong>
<p>
Le muestra la direcci&oacute;n IP de la m&aacute;quina de la
LAN que est&aacute; usando NAT, seguida del n&uacute;mero del
puerto usado para la conexi&oacute;n.
</p>
</ul>

<ul>
<strong>&quot;&lt;- -&gt;&quot;</strong>
<p>
Le indica que NAT est&aacute; manejando el flujo de
tr&aacute;fico en ambas direcciones.
</p>
</ul>

<ul>
<strong>&quot;24.5.0.5  13463&quot;</strong>
<p>
Indica que la conexi&oacute;n sale a Internet a trav&eacute;s
de la direcci&oacute;n IP 24.5.0.5 por el puerto 13463.
</p>
</ul>

<ul>
<strong>&quot;129.128.5.191 80&quot;</strong>
<p>
La direcci&oacute;n IP y el puerto al que se est&aacute;
conectando.
</p>
</ul>

<a name="nat3.2"></a>
<strong>Limitaciones de NAT (en FTP)</strong>

<p>
NAT tiene unas pocas limitaciones.  Una de ellas es con FTP.
Cuando un usuario se conecta a un servidor de FTP remoto y
pide informaci&oacute;n o un fichero a &eacute;ste, el
servidor de FTP se conecta con el cliente y transfiere los
datos requeridos.  Esto se hace a trav&eacute;s de un puerto
aleatorio que se encuentre libre.  Pero esto representa un
problema para los usuarios que intenten acceder a servidores
de FTP desde dentro de la LAN.  Cuando el servidor de FTP
env&iacute;a sus datos, lo hace a un NIC externo y en un
puerto aleatorio.  La m&aacute;quina NAT los recibe, pero como
no tiene ninguna asignaci&oacute;n para el paquete
desconocido ni para ese puerto, lo rechaza y no lo entrega.

<p>
En este caso la soluci&oacute;n pasa por poner la
m&aacute;quina cliente de FTP en &laquo;modo pasivo&raquo;.
De este modo le indica al servidor que desea conectarse, y no
que s&oacute;lo quiere leer.  As&iacute;, cuando se lleve a
cabo la conexi&oacute;n, NAT la manejar&aacute; correctamente.

<p>
IPF dispone de otra soluci&oacute;n para esta
situaci&oacute;n, que consiste en un <em>proxy</em> de ftp
integrado en el c&oacute;digo de NAT.  Para activarlo, ponga
una l&iacute;nea como la siguiente <strong>antes</strong> que
cualquier otra asignaci&oacute;n de NAT:

<pre>
map dc0 192.168.1.0/24 -&gt; 24.5.0.5/32 proxy port ftp ftp/tcp
</pre>

Con esto, el n&uacute;cleo del sistema reconocer&aacute; sus
conexiones de FTP por la orden &quot;PORT&quot; que proviene
del cliente de ftp, y substituir&aacute; la direcci&oacute;n
IP y el puerto con su propia direcci&oacute;n IP externa y con
un puerto de su elecci&oacute;n.  A continuaci&oacute;n
abrir&aacute; ese puerto y levantar&aacute; un t&uacute;nel
para los datos hacia el puerto que haya pedido su cliente ftp.
L&oacute;gicamente, esto requiere algo m&aacute;s de recursos,
pero a menos que su m&aacute;quina NAT/IPF est&eacute;
alcanzando l&iacute;mites cr&iacute;ticos, no deber&iacute;a
tener ning&uacute;n problema.
</p>


<br>
<a name="nat3.3"></a>
<strong>Redireccionamiento del tr&aacute;fico</strong>

<p>
En ocasiones puede que necesite redireccionar el
tr&aacute;fico entrante o saliente para cierto protocolo o
puerto.  Un buen ejemplo de esto es cuando existe un servidor
que se encuentra dentro de la LAN y que hospeda un servidor de
<em>web</em>.  Las conexiones entrantes a su IP v&aacute;lida
de Internet se encontrar&aacute;n con que, a menos que su
m&aacute;quina NAT sea un servidor de <em>web</em>, no
podr&aacute;n conectarse.  Para evitar esto se puede utilizar
la directiva '<strong>rdr</strong>' de NAT en el fichero de
reglas, con el fin de pasar instrucciones sobre d&oacute;nde
redireccionar (o enrutar) una cierta conexi&oacute;n.
</p>

<p>
Como ejemplo supondremos que el servidor de <em>web</em>
residiera dentro de la LAN con la direcci&oacute;n IP
192.168.1.80.  El fichero de reglas de NAT necesita una nueva
directiva para poder manejar esto.  A&ntilde;ada una
l&iacute;nea parecida a la siguiente en su fichero
<em>ipnat.rules</em>:
</p>

<ul><pre>
rdr dc0 24.5.0.5/32 port 80 -&gt; 192.168.1.80 port 80
</pre></ul>

<p>
El signficado de esto es:
</p>

<ul>
<strong>&quot;rdr&quot;</strong>
<p>
La orden que se pasa a ipnat.  Indica a ipnat que &eacute;sta
es una entrada para redireccionar una conexi&oacute;n.
</p>
</ul>

<ul>
<strong>&quot;dc0&quot;</strong>
<p>
La interfaz de red que est&aacute; conectada a Internet.
</p>
</ul>

<ul>
<strong>&quot;24.5.0.5/32&quot;</strong>
<p>
Una conexi&oacute;n entrante a esta direcci&oacute;n IP
(s&oacute;lo en <em>dc0</em>, como anteriormente).
</p>
</ul>

<ul>
<strong>&quot;port 80&quot;</strong>
<p>
El puerto que deber&iacute;a ser redireccionado.  No es
necesario usar el n&uacute;mero del puerto, '80';
tambi&eacute;n se puede usar el nombre del servicio, en este
caso '<em>port www</em>', para especificar una
redirecci&oacute;n del puerto 80.  Si quiere usar un nombre en
lugar de un n&uacute;mero, es nombre del servicio y el puerto
correspondiente deben existir en el fichero
<em>/etc/services</em>.
</p>
</ul>

<ul>
<strong>&quot;192.168.1.80&quot;</strong>
<p>
La direcci&oacute;n IP y la m&aacute;scara de red de la
m&aacute;quina LAN a la que son redireccionados los paquetes.
La m&aacute;scara de red (<em>netmask</em>) es siempre
&quot;/32&quot; (y por tanto no es necesario especificarla)
para que los paquetes puedan ser redireccionados a una
m&aacute;quina en concreto.
</p>
</ul>

<p>
Cuando haya hecho todo esto, vuelva a cargar las reglas de NAT
y el redireccionamiento empezar&aacute; con car&aacute;cter
inmediato.
</p>

<br>
<a name="nat3.4"></a>
<strong>NAT frente Proxy</strong>

<p>
La diferencia entre NAT y una aplicaci&oacute;n basada en
<em>proxy</em> es que el programa de <em>proxy</em>
act&uacute;a como un intermediario entre Internet y las
m&aacute;quinas conectadas a la LAN.  Esto no est&aacute; mal,
pero cada aplicaci&oacute;n que quiera ejecutar en su
m&aacute;quina y que conecte a Internet a trav&eacute;s de su
<em>proxy</em> DEBER&Aacute; ser capaz de usar un servidor de
<em>proxy</em>.  No todas las aplicaciones son capaces de
hacerlo (los juegos en especial).  Adem&aacute;s, no existen
aplicaciones de servidor de <em>proxy</em> para todos los
servicios que existen en Internet.  NAT se encarga de las
asignaciones de su red interna de forma transparente, de modo
que pueda conectarla a Internet.  La &uacute;nica ventaja de
seguridad que tiene proxy sobre NAT es que puede que proxy
haya sido dise&ntilde;ado con m&aacute;s seguridad, y puede
filtrar seg&uacute;n el contexto, proteger su m&aacute;quina
Windows de los virus de macros, proteger de desbordamientos de
memoria a los programas del cliente, y otros.  Pero mantener
esos filtros suele ser una tarea muy exigente.
</p>

<a name="nat4.0"></a>
<strong>6.3.4 Enlaces y referencias cruzadas</strong>

<p>
Ficheros de OpenBSD:
<ul>
<li>/etc/ipnat.rules - fichero de reglas de NAT
<li>/etc/rc.conf - fichero de inicio de ipnat e ipf durante el
arranque del sistema
<li>/etc/sysctl.conf - fichero para activar <em>IP
forwarding</em>
<li>/usr/share/ipf/nat.1 - muestras de ipnat.rules
</ul>
</p>

<p>
Enlaces de NAT en Internet:
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&sektion=8&manpath=OpenBSD+2.7">http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&sektion=8</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&sektion=5&manpath=OpenBSD+2.7">p&aacute;gina del manual que muestra la sintaxis correcta de ipnat.rules</a>
<li><a href="http://coombs.anu.edu.au/~avalon/">http://coombs.anu.edu.au/~avalon/</a>
<li><a href="http://www.geektools.com/rfc/rfc1631.txt">http://www.geektools.com/rfc/rfc1631.txt</a>
</ul>
<p>

<br>


<p>
<font color="#0000e0">
<a href="index.html">[volver al &iacute;ndice]</a>
<a href="faq6.html">[volver a la secci&oacute;n 6.0]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[back]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faqipf.html,v 1.3 2002/03/20 03:54:33 nick Exp ]<br>
$Translation: faqipf.html,v 1.4 2002/03/29 10:02:50 horacio Exp $<br>
$OpenBSD: faqipf.html,v 1.4 2002/03/30 11:49:56 jufi Exp $
</small>
</p>
</body>
</html>
