<html>
<head>
<title>Intalaci&oacute;n de OpenBSD en la arquitectura sparc</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2000 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Intalaci&oacute;n de OpenBSD en sparc</font><hr></h2>
</p>

<h3>Tabla de Contenidos</h3>
<ul>
<li><a href="#1.1">Antes de empezar.</a>
<li><a href="#1.2">Crear discos de arranque de OpenBSD.</a>
<li><a href="#1.3">Iniciar OpenBSD en Sparc.</a>
<li><a href="#1.4">Configurar las clasificaciones de OpenBSD con disklabel.</a>
<li><a href="#1.5">Configurar los puntos de montaje y formatear las
    clasificaciones.</a>
<li><a href="#1.6">Configurar la red.</a>
<li><a href="#1.7">Escoger el medio de instalaci&oacute;n.</a>
<li><a href="#1.8">Instalar desde un CD-ROM.</a>
<li><a href="#1.9">Instalar desde un sistema de archivo local.</a>
<li><a href="#1.10">Instalar desde FTP o DHCP.</a> 
<li><a href="#1.11">Instalar desde NFS.</a>
<li><a href="#1.12">Escoger los paquetes de instalaci&oacute;n y finalizar la
    instalaci&oacute;n.</a>
<li><a href="#1.13">Despu&eacute;s de reiniciar.</a>
<li><a href="#1.14">Otros recursos de informaci&oacute;n y preguntas comunes.</a>
</ul>

<p>
<h3>Enlaces para la configuraci&oacute;n del disco</h3>
<ul>
<li><a href="faq14.html#14.1">C&oacute;mo usar el disklabel(8) de OpenBSD</a>
</ul>

<hr>

<p>
<a name="1.1"></a>
<h2>Antes de empezar</h2>

<p>
Este documento se basa en parte en
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/sparc/INSTALL.sparc">ftp://ftp.openbsd.org/pub/OpenBSD/2.6/sparc/INSTALL.sparc</a>,
que se incluye con la distribuci&oacute;n de OpenBSD/sparc.
Si tiene m&aacute;s preguntas o problemas de instalaci&oacute;n, por favor
lea el fichero INSTALL.sparc ya que &eacute;ste contiene informaci&oacute;n
detallada que no est&aacute; incluida en este documento.

<p>
Hay algunas comprobaciones que debe hacer antes de que intente instalar
OpenBSD.

<ul>
<li>La primera y m&aacute;s importante es asegurarse de que exista soporte
    para su hardware en OpenBSD.
    Puede ver una lista del hardware para el que existe soporte en OpenBSD en
    la actualidad en 
    <a href="../../es/sparc.html">http://www.openbsd.org/es/sparc.html</a>.
<li>Si va a instalar OpenBSD a trav&eacute;s de su dispositivo de red, es
    primordial que se asegure de que haya soporte para su dispositivo de red
    (por suerte, no existen muchos controladores de red para los sistemas
    sparc).
<li>Aseg&uacute;rese de hacer copias de seguridad (de respaldo) de toda su
    informaci&oacute;n de importancia.
</ul>

<p>
<a name="1.2"></a>
<h2>Crear discos de arranque de OpenBSD</h2>

<p>
OpenBSD para sparc puede iniciarse desde un disquete, un disco duro SCSI, un
CD-ROM, o desde la red...

<ul>
<li><h2>Disquete:</h2>
Cuando cree un disquete de arranque, aseg&uacute;rese primero de usar un
disquete que ya est&eacute; formateado (el proceso de formateado le provee de
la composici&oacute;n b&aacute;sica de un disco, con sectores y pistas para
que el controlador del disquete sepa como leerla).

<p>
Para formatearlo desde MS-DOS, use la orden FORMAT.
Desde OpenBSD debe usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdformat&sektion=1&format=html">fdformat(1)</a>
del siguiente modo (note que <kbd>fd0a</kbd> se refiere al disquete completo, a
menos que ya tenga una &laquo;clasificaci&oacute;n del disco&raquo;
(&quot;disklabel&quot;) en su disquete):

<ul>
<pre>
# <b>fdformat /dev/fd0a</b>
Format 1440K floppy `/dev/fd0a'? (y/n): <b>y</b>
Processing VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV done.
</pre>
</ul>

<p>
Hay muchas formas para crear un disco de arranque, dependiendo de la
arquitectura de su m&aacute;quina.
En el directorio <a href="ftp://ftp.openbsd.org/pub/OpenBSD/tools/">tools</a>
en cualquiera de los servidores de ftp, o en <code>2.6/tools</code> en el CD1 
de OpenBSD puede encontrar varios programas.
Si ya est&aacute; usando un sistema operativo de tipo UNIX (o un sistema
operativo Unix como Solaris), puede usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1&format=html">dd(1)</a>
para grabar su disco de arranque.
He aqu&iacute; un ejemplo del uso de dd(1) para grabar el disco de arranque
de OpenBSD correctamente:

<ul>
<pre>
# <strong>dd if=floppy26.fs of=/dev/fd0c bs=126b</strong>
</pre>
</ul>

<p>
La opci&oacute;n bs=126b se puede ignorar si su versi&oacute;n de dd no
incluye soporte para bloques de un tama&ntilde;o tan grande.

<p>
Si est&aacute; usando otro sistema Unix distinto a OpenBSD, es posible que
tenga que adaptar esta l&iacute;nea conforme a las convenciones locales sobre
nombres para la disquetera, y a las opciones que correspondan para copiar una
imagen al disquete.
El tema clave es que el nombre del dispositivo que se use para el disquete
<i>debe</i> ser uno que haga referencia a toda la imagen del bloque 2880, no
a una partici&oacute;n ni a un modo de compatibilidad, y la orden para
copiar debe ser compatible con la que se requiere para grabar a un
dispositivo virgen y se debe hacer en bloques m&uacute;ltiples de 512 bytes.
Las variantes existentes son interminables y van m&aacute;s all&aacute; del
objetivo de este documento.

<p>
Los usuarios de Solaris pueden usar /dev/rfd0c como su dispositivo de
disquete.

<p>
Si quiere usar una m&aacute;quina i386 con MS-DOS, Windows, o Windows NT 
para copiar la imagen del disco de arranque para sparc, por favor lea la
<a href="install-i386.html#1.2">secci&oacute;n 1.2 de install-i386.html</a>.

<p>
<li><h2>Disco Duro SCSI:</h2>

<p>
Si no tiene una disquetera, puede copiar la imagen de instalaci&oacute;n del
disquete &quot;floppy26.fs&quot; al disco duro desde el que vaya a arrancar.
La forma tradicional de hacerlo es usando dd(1), para poner la imagen del
sistema de archivo de arranque en la partici&oacute;n de swap del disco (debe
haber iniciado en modo monousuario), e iniciar desde esa partici&oacute;n.

<p>
Usando la partici&oacute;n <b>b</b> podr&aacute; iniciar sin anular ninguna
parte &uacute;til del disco;  tambi&eacute;n puede usar otra
partici&oacute;n, pero no use las particiones <b>a</b> ni <b>c</b> sin
comprender los temas que se describen un poco m&aacute;s adelante sobre 
disklabel como &laquo;sistemas incompatibles&raquo;.

<p>
Esto requiere que est&eacute; en un sistema SunOS, Solaris, OpenBSD o NetBSD,
que tienen una visi&oacute;n compatible sobre las particiones y
clasificaciones del disco de SunOS.

<p>
Use la utilidad dd(1) para copiar el fichero al disco duro.
En SunOS, la orden ser&iacute;a:

<ul>
<pre>
# <strong>dd if=floppy26.fs of=/dev/rsd0b bs=36b</strong>
</pre>
</ul>

<p>
El tama&ntilde;o de bloques (<kbd>bs</kbd>) es arbitrario siempre que sea un
m&uacute;ltiplo de 512 bytes y no sobrepase el m&aacute;ximo del controlador;
o sea, es posible que <kbd>bs=36b</kbd> no funcione en todos los casos.
Tambi&eacute;n pueden variar los nombres del dispositivo y/o
partici&oacute;n, dependiendo del sistema operativo.

<p>
Si est&aacute; preparando el dispositivo del disco en un sistema
incompatible, o si no le importan los contenidos del disco duro, puede
instalar la imagen de arranque empezando por el principio del disco.
Esto le permite preparar un disco duro con opci&oacute;n de arranque aunque
no tenga un sistema operativo instalado en su Sparc, pero es importante que
comprenda que la imagen de arranque instalada de esta forma incluye una
clasificaci&oacute;n del disco que puede borrar cualquier
clasificaci&oacute;n ya existente o particionar el dispositivo.

<p>
Para copiar la imagen a todo el disco, anulando las clasificaciones:

<p>
<ul>
<pre>
# <strong>dd if=floppy26.fs of=/dev/rsdXc bs=36b</strong>
</pre>
</ul>

<p>
Debe substituir <kbd>X</kbd> con el n&uacute;mero del disco, que <i>no</i> es
el disco o partici&oacute;n que indica su partici&oacute;n ra&iacute;z
actual.
Tambi&eacute;n aqu&iacute;, los nombres pueden variar dependiendo del sistema
operativo.
Despu&eacute;s de esto, la clasificaci&oacute;n del disco ser&aacute; la
apropiada para un disquete, o sea una partici&oacute;n de bloque 2880, y
probablemente tenga que cambiarla m&aacute;s tarde.

<p>
Para copiar la imagen al disco duro, preservando las clasificaciones de
SunOS, Solaris, NetBSD, u OpenBSD:

<ul>
<pre>
# <strong>dd if=floppy26.fs of=/dev/rsdXc bs=1b skip=1 seek=1</strong>
</pre>
</ul>

<p>
Debe asegurarse de que su versi&oacute;n de dd(1) tenga soporte para los
operandos &quot;skip&quot; y &quot;seek&quot;.  De lo contrario puede
intentar esta t&eacute;cnica:

<ul>
<pre>
# <strong>dd if=/dev/rsdXc of=/tmp/label bs=1b count=1</strong>
# <strong>dd if=floppy26.fs of=/dev/rsdXc bs=36b</strong>
# <strong>dd if=/tmp/label of=/dev/rsdXc bs=1b count=1</strong>
</pre>
</ul>

<p>
En cualquier caso, habr&aacute; creado una situaci&oacute;n en la que la
informaci&oacute;n sobre la clasificaci&oacute;n del disco y sobre el sistema
de archivo no estar&aacute;n de acuerdo sobre el tama&ntilde;o y la
geometr&iacute;a de la partici&oacute;n.
Aseg&uacute;rese de configurar esto correctamente cuando inicie el sistema.

<p>
<li><h2>CDROM:</h2>

<p>
Para arrancar desde un CD-ROM, introduzca el CD de OpenBSD en su dispositivo.
Si su m&aacute;quina Sun s&oacute;lo tiene un dispositivo de CD-ROM, vaya al
punto de pedido de arranque desde donde puede ejecutar '<kbd>boot
cdrom</kbd>':

<ul>
<pre>
ok <b>boot cdrom</b>
</pre>
</ul>

Por supuesto, esto s&oacute;lo funcionar&aacute; en el nuevo modo de 
&oacute;rdenes.
Si est&aacute; en un punto de pedido del modo antiguo de &oacute;rdenes (una 
flecha a la derecha), escriba 'n' para pasar al modo nuevo (si est&aacute; 
usando una vieja sparc que sea anterior a sun4c, probablemente no tenga un 
modo nuevo de &oacute;rdenes, en cuyo caso tendr&aacute; que experimentar).
Si tiene m&uacute;ltiples dispositivos de CD-ROM, debe iniciar desde el que
sea correcto.
Intente con <kbd>probe-scsi</kbd> desde el modo nuevo de &oacute;rdenes.

<ul>
<pre>
ok <b>probe-scsi</b>
Target 0
  Unit 0   Disk     QUANTUM LIGHTNING 365S
Target 1
  Unit 0   Removable Disk     QUANTUM EMPIRE_1080S   
Target 3
  Unit 0   Removable Disk     Joe's CD ROMs
</pre>
</ul>

<p>
Averig&uuml;e qu&eacute; disco es el CD-ROM desde el que quiere iniciar.
F&iacute;jese en el n&uacute;mero en &quot;Target&quot;.

<ul>
<pre>
ok <b>boot /sbus/esp/sd@X,0</b>
</pre>
</ul>

Substituya <kbd>X</kbd> con el n&uacute;mero correspondiente a su CD-ROM.

<p>
<li><H2>Arranque desde Red:</H2>

<p>
Los detalles sobre c&oacute;mo configurar un entorno de arranque desde una
red var&iacute;an considerablemente, dependiendo del anfitri&oacute;n de la
red.
Le recomendamos que la p&aacute;gina de manual de OpenBSD de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=diskless&sektion=8&format=html">diskless(8)</a>.
Tambi&eacute;n tendr&aacute; que tomar como referencia las p&aacute;ginas de
manual relevantes o la gu&iacute;a de administraci&oacute;n correspondiente
al sistema de la m&aacute;quina anfitriona.

<p>        
B&aacute;sicamente, tendr&aacute; que configurar <i>reverse-arp</i>
(<i>rarpd</i>) y la informaci&oacute; sobre el <i>par&aacute;metro de 
arranque</i> (<i>bootpd</i>), crear los bloques de arranque de OpenBSD, la
partici&oacute;n kernel/miniroot, y un fichero de swap.

<p>
</ul>
<a name="1.3"></a>
<h2>Iniciar OpenBSD en Sparc</h2>

<p>
Primero, debe saber cu&aacute;l es la configuarci&oacute;n por
definici&oacute;n de Sun para que el primer dispositivo SCSI exista como el
dispositivo SCSI 3 (&quot;target 3&quot;).
Normalmente, OpenBSD no se fija en esto, por lo que si inicia OpenBSD desde
el dispositivo 3 SCSI, cualquier disco en el dispositivo 0, 1 &oacute; 2
ser&aacute; reconocido como <code>sd0</code> por el n&uacute;cleo del sistema
antes que el disco en el dispositivo 3 (que asumiendo que es su disco
principal, deber&iacute;a ser <code>sd0</code>).
Para solucionar esto inicie el n&uacute;cleo bsd.scsi3:

<ul>
<pre>
ok <b>boot bsd.scsi3</b>
</pre>
</ul>

Este n&uacute;cleo tiene scsi target 3 configurado en el c&oacute;digo como
<code>sd0</code>, para que coincida con el comportamiento de SunOS/Solaris.
Es probable que quiera copiar este fichero a <i>/bsd</i> para automatizar el
arranque.

<p>
Si arranca desde la imagen <i>floppy26.fs</i>, el n&uacute;cleo del sistema y 
todos los programas que usa OpenBSD para instalarse se cargar&aacute;n en la 
memoria.
Si surgieran problemas y su disco de arranque no iniciara, es probable que el
problema se deba un disquete con errores.
¡Este problema es extremadamente com&uacute;n!
Si su disco de arranque fallara al iniciar, int&eacute;ntelo otra vez, y si
&eacute;sta tambi&eacute;n falla tire el disquete y pruebe con uno nuevo.
Cuando su disquete falla en el arranque, aun cuando el disquete le funcionaba
bien antes, tenga en cuenta que OpenBSD usa casi todos los bits disponibles
del disquete.
Cualquier peque&ntilde;o error en el disco evitar&aacute; que se cargue
OpenBSD.

<p>
Si est&aacute; iniciando desde el disco duro o alg&uacute;n otro medio, es
obvio que las consideraciones sobre los disquetes err&oacute;neos no son
aplicables.

<p>
Cuando arranque con &eacute;xito ver&aacute; un mont&oacute;n de pruebas del
n&uacute;cleo, que le indicar&aacute;n qu&eacute; dispositivos ha encontrado
y d&oacute;nde.
Entonces ver&aacute; lo siguiente:

<ul>
<pre>
sh: /etc/rc: No such file or directory
Enter pathname of shell or RETURN for sh: <b>&lt;Enter&gt;</b>
erase ^?, werase ^W, kill ^U, intr ^C
</pre>
</ul>

Por supuesto que aqu&iacute; quiere contestar <kbd>I</kbd> para instalar.

<ul>
<pre>
(I)nstall, (U)pgrade or (S)hell? <b>I</b>
</pre>
</ul>

Entonces ver&aacute; unas descripciones de la instalaci&oacute;n, y le
preguntar&aacute; por su tipo de terminal... pulse <kbd>intro</kbd>, sun es
el tipo de terminal correcto.

<ul>
<pre>
You can run a shell command at any prompt via '!foo'
or escape to a shell by simply typing '!'.

Specify terminal type [sun]: <b>&lt;Intro&gt;</b>
</pre>
</ul>

A continuaci&oacute;n puede seleccionar el disco que usar&aacute; para
instalar OpenBSD.
Si tiene datos en este disco y quiere hacer una copia de ellos,
aseg&uacute;rese de hacerlo antes de empezar este proceso.

<ul>
<pre>
Available disks are:

sd0

Which disk is the root disk? [sd0]
</pre>
</ul>

<code>sd0</code> ser&iacute;a la respuesta correcta si estuviera intentando
formatear su primer disco SCSI.
Si fuera a instalar OpenBSD en su segundo o tercer disco, deber&iacute;a
seleccionar el apropiado.
Si la respuesta entre corchetes (en este ejemplo <code>[sd0]</code>) es la
que quiere, basta con que pulse intro.

<p>
<a name="1.4"></a>
<h2>Configurar los sistemas de archivo de OpenBSD con disklabel</h2>

<p>
Mire en la <a href="faq14.html#14.1">secci&oacute;n 14.1</a> de las preguntas
frecuentes para ver m&aacute;s detalles sobre el uso de disklabel.
Mire en la <a href="faq4.html#4.3">secci&oacute;n 4.3</a> de las preguntas
frecuentes para saber qu&eacute; tama&ntilde;os puede usar para sus sistemas
de archivo.

<p>
Para una m&aacute;quina multiusuario es mejor crear, por lo menos, cinco
sistemas de archivo separados, uno para su sistema de archivo /, otro para
swap, otro para /var, otro para /tmp, y otro para /usr.
Si sus usuarios van a almacenar ficheros de gran tama&ntilde;o,
tambi&eacute;n puede crear un sistema de archivo /home separado.

<p>
Hay cuatro razones principales para usar sistemas de archivo separados, en
lugar de meterlo todo en uno o dos sistemas de archivo:

<ul>
<li><b>Seguridad</b>: Puede marcar algunos sistemas de archivo como 'nosuid',
'nodev', 'noexec', 'readonly', etc...
<li><b>Estabilidad</b>: Un usuario, o un programa, puede llegar a llenar un
sistema de archivo con basura si tienen permisos de escritura para
&eacute;ste.
Sus programas cr&iacute;ticos, que por supuesto estar&aacute;n en un sistema
de archivo diferente, no se interrumpir&aacute;n.
<li><b>Velocidad</b>: Un sistema de archivo en el que se escribe con
frecuencia, puede acabar algo fragmentado (por suerte, el sistema de archivo
ffs que usa OpenBSD, no es propenso a la fragmentaci&oacute;n).
<li><b>Integridad</b>: Si un sistema de archivo est&aacute; corrompido por
alg&uacute;n motivo, entonces sus otros sistemas de archivo todav&iacute;a
se mantendr&aacute;n bien.
</ul>

<p>
<a name="1.5"></a>
<h2>Configurar los puntos de montaje y formatear los sistemas de archivo</h2>

<p>
La configuraci&oacute;n de los puntos de montaje es mucho m&aacute;s simple
de lo que parece.

<p>
Despu&eacute;s de configurar los sistemas de archivo con disklabel,
ver&aacute; algo parecido a lo que sigue:
</p>

<ul>
<pre>
The following filesystems will be used for the root filesystem and swap:
        sd0a    /
        sd0b    swap

Mount point for sd0d (size=65520k) [/tmp, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for sd0e (size=65520k) [/var, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for sd0g (size=307440k) [/usr, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for sd0h (size=1926256k) [/home, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
Esto muestra que <code>sd0<b>a</b></code> se ha configurado como el sistemas de
archivo ra&iacute;z, y <code>sd0<b>b</b></code> como swap.
Y as&iacute; consecutivamente para todos los sistemas de archivo excepto, por
supuesto, <code>sd0</code> que se cambiar&aacute; de acuerdo con el
dispositivo de disco que est&eacute; usando.
En el ejemplo anterior nuestros puntos de montaje ya han sido determinados
por medio de disklabel(8), pero aun as&iacute; deber&iacute;a asegurarse de
que toda la informaci&oacute;n sea la correcta  ¡es la &uacute;ltima
oportunidad para hacerlo!
Para los usuarios que tengan m&uacute;ltiples discos, &eacute;ste ser&aacute;
el momento para configurar sus otros discos.
No debe apurarse e intentar meter todos los puntos de montaje en un disco.
Ver&aacute; una lista como la siguiente:
</p>

<ul>
<pre>
Now you can select another disk to initialize.  (Do not re-select a
disk you have already entered information for).  Available disks are:

sd0
sd1

Which one? [done] <strong>&lt;Intro&gt;</strong>

You have configured the following devices and mount points:

sd0a /
sd0d /tmp
sd0e /var
sd0g /usr
sd0h /home

Filesystems will now be created on these devices.
If you made any mistakes, you may edit this now.
Edit using ed? [n] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
Como puede observar, se ha decidido no usar <code>sd1</code> de momento.
Si se hubiera decidido configurar el segundo disco, se habr&iacute;a hecho
exactamente igual que con el primero.
Todav&iacute;a tiene una oportunidad para corregir los cambios por medio de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ed&sektion=1&format=html">ed(1)</a>,
pero es mucho m&aacute;s f&aacute;cil verificar la informaci&oacute;n de
antemano.
Una vez que los sistemas de archivo han sido configurados, llega el momento
de formatear los discos.
Ver&aacute; un aviso que le dir&aacute; que toda la informaci&oacute;n
existente en las particiones ser&aacute; borrada.
&Eacute;sta es la raz&oacute;n por la que, si su sistema es de multiarranque
(m&aacute;s de un sistema operativo), es muy importante que haya hecho copias
de seguridad.
He aqu&iacute; un ejemplo:
</p>

<ul>
<pre>
============================================================
The next step will overwrite any existing data on:
        sd0a sd0d sd0e sd0g sd0h

Are you really sure that you're ready to proceed? [n] <strong>y</strong>
</pre>
</ul>

<p>
Note que esta respuesta es no por definici&oacute;n (<code>[n]</code>), 
as&iacute; que tendr&aacute; que indicar que formatee sus discos
(<strong>y</strong>).
Pero si decide no formatearlos, pasar&aacute; a una shell desde la que
podr&aacute; comenzar la instalaci&oacute;n de nuevo escribiendo
<kbd>install</kbd> o reiniciando con el disco de arranque.
Por el contrario, si decide seguir adelante contestando <kbd>y</kbd>,
comenzar&aacute; a formatear todos los sistemas de archivo, lo que puede
tardar un tiempo dependiendo del tama&ntilde;o de su disco.
</p>

<p>
<a name="1.6"></a>
<h2>Configurar la red</h2>

<p>
Ahora es el momento de configurar la red.
Esto es de extrema importancia si va a llevar a cabo alguna
instalaci&oacute;n por red, considerando que dicho tipo de instalaci&oacute;n
se basar&aacute; en la informaci&oacute;n que introduzca aqu&iacute;.
A continuaci&oacute;n vienen los pasos de la secci&oacute;n de
configuraci&oacute;n de la red para el proceso de instalaci&oacute;n.
</p>

<ul>
<pre>
You will now be given the opportunity to configure the network.  This will be
useful if you need to transfer the installation sets via FTP, HTTP, or NFS.
Even if you choose not to transfer installation sets that way, this information
will be preserved and copied into the new root filesystem.

Configure the network [y] <strong>&lt;Intro&gt;</strong>
Enter system hostname (short form): [] <strong>mybox</strong>
Enter DNS domain name: [] <strong>someisp.com</strong>

If you have any devices being configured by a DHCP server
it is recommended that you do not enter a default route or
any name servers.

You may configure the following network interfaces (the interfaces marked
with [X] have been successfully configured):

        [ ] le0
        [ ] hme0

Configure which interface? (or, enter 'done') [le0] <strong>&lt;Intro&gt;</strong>
IP address (or 'dhcp')? [] <strong>199.185.137.55</strong>
Symbolic (host) name? [mybox] <strong>&lt;Intro&gt;</strong>
Netmask ? [255.255.255.0] <strong>&lt;Intro&gt;</strong>
Your network interface might require non-default
media directives.  The default media is:
        media: Ethernet 10baseT half-duplex
This is a list of supported media:
        media autoselect
        media 100baseTX mediaopt full-duplex
        media 100baseTX mediaopt half-duplex
        media 100baseTX
        media 10baseT mediaopt full-duplex
        media 10baseT
        media 10baseT mediaopt half-duplex
If the default is not satisfactory, and you wish to use another
media, copy that line from above (ie. &quot;media 100baseTX&quot;)
Media directives? [] <strong>&lt;Intro&gt;</strong>

You may configure the following network interfaces (the interfaces marked
with [X] have been successfully configured):

        [X] le0
        [ ] hme0

Configure which interface? (or, enter 'done') [done] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
<i>Nota: en el ejemplo, <b>mybox</b> se debe substituir por el nombre que
quiera dar a su m&aacute;quina, y <b>someisp</b> por el nombre del dominio de
su proveedor.</i>

<p>
En este ejemplo tenemos dos interfaces de red, pero s&oacute;lo configuramos
una de ellas.
Durante la instalaci&oacute;n tiene la posibilidad de configurar ambas, pero
para simplificarlo s&oacute;lo configuramos una.
Para empezar, si no est&aacute; usando DHCP, debe conocer la
informaci&oacute;n sobre su configuraci&oacute;n de red, o sea su IP, Netmask
y pasarela.
Si est&aacute; usando DHCP, pondr&aacute; <kbd>DHCP</kbd> como su IP y el
resto de la informaci&oacute;n la obtendr&aacute; por usted.
Si su NIC tiene soporte para alg&uacute;n tipo de directiva de medios, se le
ofrece la posibilidad de especificarla.
A continuaci&oacute;n podr&aacute; especificar su ruta y nombre de servidor
que vaya a usar por definici&oacute;n.
Esto es necesario para una instalaci&oacute;n por red.
</p>

<ul>
<pre>
Configure which interface? (or, enter 'done') [done] <strong>&lt;Intro&gt;</strong>
Enter IP address of default route: [none] <strong>199.185.137.128</strong>
Enter IP address of primary nameserver: [none] <strong>199.185.137.1</strong>
Would you like to use the nameserver now? [y] <strong>&lt;Intro&gt;</strong>

You will now be given the opportunity to escape to the command shell to do
any additional network configuration you may need.  This may include adding
additional routes, if needed.  In addition, you might take this opportunity
to redo the default route in the event that it failed above.
Escape to shell? [n] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
Desde aqu&iacute; ya puede &laquo;escapar&raquo; a una shell que le
permitir&aacute; llevar a cabo correcciones a su configuraci&oacute;n de red,
o cualquier cambio espec&iacute;fico que no le permitiera el gui&oacute;n de
instalaci&oacute;n.
La mayor&iacute;a no necesitar&aacute; esto.
</p>

<p>
<a name="1.7"></a>
<h2>Escoger el medio de instalaci&oacute;n</h2>

<p>
Despu&eacute;s de configurar su red, el gui&oacute;n de instalaci&oacute;n le
dar&aacute; la oportunidad de realizar cambios en su configuraci&oacute;n de
la red (principalmente si se ha producido alg&uacute;n error).
Entonces, montar&aacute; los sistemas de archivo que haya creado y
activar&aacute; una contrase&ntilde;a para el usuario &quot;root&quot; (el
administrador del sistema).
De este modo, sus discos locales estar&aacute;n preparados para que se
instalen en ellos los paquetes de OpenBSD.
Despu&eacute;s de que sus discos locales est&eacute;n preparados,
podr&aacute; escoger el medio de instalaci&oacute;n.
Puede ver una lista de opciones al final del ejemplo.
</p>


<ul>
<pre>
You will now be given the opportunity to escape to the command shell to do
any additional network configuration you may need.  This may include adding
additional routes, if needed.  In addition, you might take this opportunity
to redo the default route in the event that it failed above.
Escape to shell? [n] <strong>&lt;Intro&gt;</strong>
/dev/sd0a on /mnt type ffs (rw, asynchronous, local)
/dev/sd0d on /mnt/tmp type ffs (rw, asynchronous, local)
/dev/sd0e on /mnt/var type ffs (rw, asynchronous, local)
/dev/sd0g on /mnt/usr type ffs (rw, asynchronous, local)
/dev/sd0h on /mnt/home type ffs (rw, asynchronous, local)

Please enter the initial password that the root account will have.
Password (will not echo): _
Password (again): _

It is now time to extract the installation sets onto the hard disk.  Make sure
the sets are either on a local device (i.e. tape, CD-ROM) or on a network
server.  You will have the chance to repeat this step or to extract sets from
several places, so you don't have to try to load all the sets in one try and
can recover from some errors.

Install from (f)tp, (h)ttp, (t)ape, (C)D-ROM, (N)FS or local (d)isk? <strong>&lt;Introduzca su opci&oacute;n&gt;</strong>
</pre>
</ul>

<p>
<a name="1.8"></a>
<h2>Instalar desde un CD-ROM</h2>

<p>
Para instalar desde un CD-ROM, debe seleccionar la opci&oacute;n <kbd>C</kbd>
cuando escoja su medio de instalaci&oacute;n.
Con esto obtendr&aacute; una lista de dispositivos que hayan sido 
indentificados en su m&aacute;quina como dispositivos de CD-ROM.
La mayor&iacute;a de usuarios tendr&aacute;n uno;  si su m&aacute;quina no
dispone de un dispositivo de CD-ROM, tendr&aacute; que asegurarse de elegir
el dispositivo desde el que vaya a instalar OpenBSD.
Despu&eacute;s de escoger el dispositivo correcto, le preguntar&aacute; por
el sistema de archivo en el que se encuentran ubicados los ficheros de
instalaci&oacute;n.
Si est&aacute; usando el CD-ROM de OpenBSD, debe responder <kbd>c</kbd>, ya
que 'c' representa a todo el disco.
Por ejemplo:
</p>

<ul>
<pre>
Install from (f)tp, (h)ttp, (t)ape, (C)D-ROM, (N)FS or local (d)isk? <strong>c</strong>

The following CD-ROM devices are installed on your system; please select
the CD-ROM device containing the partition with the installation sets:

cd0

Which is the CD-ROM with the installation media? [abort] <strong>cd0</strong>
Partition? [c] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
A continuaci&oacute;n le preguntar&aacute; por el tipo de sistema de archivo
que debe usar para leer el CD-ROM, y por el directorio en el que se
encuentran los ficheros de instalaci&oacute;n.
Si est&aacute; usando el CD-ROM oficial de OpenBSD, escoger&aacute;
<kbd>cd9660</kbd> como tipo de sistema de archivo (es la opci&oacute;n por
omisi&oacute;n).
El directorio que debe indicar como lugar de ubicaci&oacute;n de los ficheros
es <kbd>/2.6/sparc/</kbd> (tambi&eacute;n &eacute;sta es la opci&oacute;n por
omisi&oacute;n).
Despu&eacute;s de esto ver&aacute; una lista de paquetes para instalar.
Puede obtener una descripci&oacute;n de estos ficheros en la
<a href="faq4.html#4.2">secci&oacute;n 4.2</a> de las preguntas frecuentes.
Esto es lo que ver&aacute;:
</p>

<ul>
<pre>
There are two CD-ROM filesystem types currently supported by this program:
cd9660          ISO-9660
ffs             Berkeley Fast Filesystem

Which filesystem type? [cd9660] <strong>&lt;Intro&gt;</strong>
Enter the directory relative to the mount point that
contains the file. [/2.6/sparc] <strong>&lt;Intro&gt;</strong>

You will now be asked for files to extract.  In addition to the
files listed in the selector you may enter any file located in
/mnt2//2.6/sparc.  You can also enter 'all' to install all the standard
sets, or 'list' to list the files available in /mnt2/2.6/sparc.
When you are done selecting files, enter 'done'.
Some of these sets are required for your install and some are optional --
You will want at least the base and bsd sets.
Consult the intallation notes if you are not sure which sets are required!
</pre>
</ul>

<p>
Cuando haya acabado, pase a la <a href="#1.12">secci&oacute;n 1.12
(&laquo;Escoger los paquetes de instalaci&oacute;n y finalizar la
instalaci&oacute;n&raquo;)</a> de este documento, para finalizar la
instalaci&oacute;n.
</p>

<p>
<a name="1.9">
<h2>Instalar desde un sistema de archivo local</h2>
</a>

<p>
<a name="1.10">
<h2>Instalar desde FTP o DHCP</h2>
</a>

<p>
<a name="1.11">
<h2>Instalar desde NFS</h2>
</a>

<p>
<a name="1.12"></a>
<h2>Escoger los paquetes de instalaci&oacute;n y finalizar 
la instalaci&oacute;n</h2>

<p>
En este punto tendr&aacute; que escoger qu&eacute; paquetes instalar&aacute;.
Puede obtener una descripci&oacute;n de estos ficheros en la
<a href="faq4.html#4.2">secci&oacute;n 4.2</a> de las preguntas frecuentes.
Los ficheros que encuentre el disco de instalaci&oacute;n los mostrar&aacute;
en su pantalla.
Lo &uacute;nico que tiene que hacer es especificar qu&eacute; ficheros
quiere.
S&oacute;lo hay cuatro paquetes preseleccionados, <code>base26.tar.gz</code>,
<code>etc26.tar.gz</code>, <code>man26.tar.gz</code> y <code>bsd</code>.
El motivo de esto es que los tres primeros ficheros DEBEN estar presentes
para que tenga un sistema funcional, y el fichero <code>bsd</code> es el
n&uacute;cleo del sistema.
El resto se deja a su elecci&oacute;n.
El ejemplo siguiente muestra una instalaci&oacute;n completa menos el paquete
<code>games</code>.
</p>

<ul>
<pre>
The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base26.tar.gz
        [X] etc26.tar.gz
        [ ] misc26.tar.gz
        [ ] comp26.tar.gz
        [X] man26.tar.gz
        [ ] game26.tar.gz
        [ ] xbase26.tar.gz
        [ ] xshare26.tar.gz
        [ ] xfont26.tar.gz
        [ ] xserv26.tar.gz
        [X] bsd

File name []? <strong>*</strong>

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base26.tar.gz
        [X] etc26.tar.gz
        [X] misc26.tar.gz
        [X] comp26.tar.gz
        [X] text26.tar.gz
        [X] man26.tar.gz
        [X] game26.tar.gz
        [X] xbase26.tar.gz
        [X] xshare26.tar.gz
        [X] xfont26.tar.gz
        [X] xserv26.tar.gz
        [X] bsd
File name []? <strong>-game*</strong>

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base26.tar.gz
        [X] etc26.tar.gz
        [X] misc26.tar.gz
        [X] comp26.tar.gz
        [X] text26.tar.gz
        [X] man26.tar.gz
        [ ] game26.tar.gz
        [X] xbase26.tar.gz
        [X] xshare26.tar.gz
        [X] xfont26.tar.gz
        [X] xserv26.tar.gz
        [X] bsd
File name []? <strong>done</strong>
</pre>
</ul>

<p>
Una vez que haya escogido los paquetes que quiera instalar, le
preguntar&aacute; si est&aacute; seguro de querer extraer estos paquetes, y
los instalar&aacute;.
Podr&aacute; ver una barra de progreso que le mantendr&aacute; informado
sobre el tiempo que tardar&aacute;.
El tiempo para la instalaci&oacute;n depender&aacute; del sistema en el que
est&eacute; instalando OpenBSD.
Despu&eacute;s de esto, sus ficheros de configuraci&oacute;n (de la red y del
sistema de archivo) se copiar&aacute;n a sus discos desde el disco de
instalaci&oacute;n.
</p>

<ul>
<pre>
Ready to extract selected file sets? [y] <strong>&lt;Intro&gt;</strong>

/mnt2//2.6/sparc/base26.tar.gz:
100% |***************************************************| 17774 KB   00:00 ETA
/mnt2//2.6/sparc/etc26.tar.gz:
100% |***************************************************|   161 KB   00:00 ETA
/mnt2//2.6/sparc/bsd:
100% |***************************************************|  2281 KB   00:00 ETA
/mnt2//2.6/sparc/misc26.tar.gz:
100% |***************************************************|  1637 KB   00:00 ETA
/mnt2//2.6/sparc/comp26.tar.gz:
100% |***************************************************| 11481 KB   00:00 ETA
/mnt2//2.6/sparc/man26.tar.gz:
100% |***************************************************|  3543 KB   00:00 ETA
/mnt2//2.6/sparc/xbase26.tar.gz:
100% |***************************************************|  5376 KB   00:00 ETA
/mnt2//2.6/sparc/xshare26.tar.gz:
100% |***************************************************|  1482 KB   00:00 ETA
/mnt2//2.6/sparc/xfont26.tar.gz:
100% |***************************************************|  6017 KB   00:00 ETA
/mnt2//2.6/sparc/xserv26.tar.gz:
100% |***************************************************| 15188 KB   00:00 ETA

Extract more sets? [n] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
Todav&iacute;a no ha terminado con la elecci&oacute;n de paquetes.
Falta una biblioteca que no se encuentra en el CD y que debe obtenerla
primero.
Como se explica durante la instalaci&oacute;n, si todav&iacute;a no dispone
de conexi&oacute;n, la puede a&ntilde;adir m&aacute;s tarde.
En este ejemplo de instalaci&oacute;n se asume que existe la disponibilidad
de una red y que est&aacute; preparada durante la instalaci&oacute;n.
Primero ver&aacute; una explicaci&oacute;n y a continuaci&oacute;n le
dar&aacute; a elegir qu&eacute; paquete quiere seleccionar.
Despu&eacute;s de que haya seleccionado el paquete, debe configurar su red.
 </p>

<ul>
<pre>
Two OpenBSD libraries (libssl and libcrypto, based on OpenSSL) implement many
cryptographic functions which are used by OpenBSD programs like ssh, httpd, and
isakmpd.  Due to patent licensing reasons, those libraries may not be included
on the CD -- instead the base distribution contains libraries which have had
the troublesome code removed -- the programs listed above will not be fully
functional as a result.  Libraries which _include_ the troublesome routines
are available and can be FTP installed, as long as you meet the follow (legal)
criteria:
  (1) Outside the USA, no restrictions apply. Use ssl26.tar.gz.
  (2) Inside the USA, non-commercial entities may install sslUSA26.tar.gz.
  (3) Commercial entities in the USA are left in the cold, due to how the
      licences work.  (This is how the USA crypto export policy feels to the
      rest of the world.)

If you do not install the ssl package now, it is easily installed at
a later time (see the afterboot(8) and ssl(8) manual pages)."
Install (U)SA, (I)nternational, or (N)one? [none] <strong>i</strong>
Install SSL+RSA libraries via (f)tp, (h)ttp, or (c)ancel? [ftp] <strong>f</strong>
[SNIP]
</pre>
</ul>

<p>
Ahora debe configurar su red;  si necesita ayuda para esta parte, puede tomar
como referencia la <a href="#1.6">secci&oacute;n 1.6 (&laquo;Configurar la
red&raquo;)</a> de este documento.
Cuando haya configurado sus interfaces de red correctamente, ver&aacute; una
lista de servidores de ftp y sus ubicaciones respectivas.
Debe elegir uno de los servidores.
</p>

<ul>
<pre>
HTTP/FTP proxy URL? (ie. &quot;http://proxy:8080&quot;, or &quot;none&quot;) [none] <strong>&lt;Intro&gt;</strong>

By default, ftp will attempt a passive connection and fall back to a normal
(active) connection if that doesn't work.  However, there are some very
old ftp servers that claim to support passive mode, but really do not.
In this case, you should explicitly request an active session.
Do you want to use active ftp? [n] <strong>n</strong>
Do you want a list of potential ftp servers? [y] <strong>y</strong>

     1  ftp://ftp.openbsd.org/pub/OpenBSD                       Alberta, Canada
     2  ftp://ftp1.usa.openbsd.org/pub/OpenBSD                  Michigan, USA
     3  ftp://ftp.op.net/pub/OpenBSD                            Pennsylvania, USA
     4  ftp://ftp.de.openbsd.org/pub/unix/OpenBSD               Germany
     5  ftp://ftp.jp.openbsd.org/OpenBSD                        Japan
     6  ftp://ftp.dti.ad.jp/pub/OpenBSD                         Japan
     7  ftp://ftp.lip6.fr/pub/OpenBSD                           France
     8  ftp://ftp.univ-evry.fr/pub/OpenBSD                      France
[SNIP]
Server IP address, hostname, or list#? [] <strong>1</strong>
Using   ftp://ftp.openbsd.org/pub/OpenBSD                       Alberta, Canada
Server IP address, hostname, or list#? [ftp.openbsd.org] <strong>&lt;Intro&gt;</strong>
Server directory? [pub/OpenBSD/2.6/sparc] <strong>&lt;Intro&gt;</strong>
Login? [anonymous] <strong>&lt;Intro&gt;</strong>

You will now be asked for files to extract. In addition to the files listed,
you may select any file located at ftp.openbsd.org:pub/OpenBSD/2.6/sparc
You can also enter 'all' to install all the standard sets, or 'list' to list
the files available. When you are done selecting files, enter 'done'. Some of
these sets are required for your install and some are optional -- you will want
at least the base and bsd sets. Consult the installation notes if you are not
sure which sets are required!

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] ssl26.tar.gz
File name? [] <strong>done</strong>

Fetching files via ftp may take a long time, especially over a slow network
connection.  Ready to download files? [y] <strong>y</strong>

Getting ssl26.tar.gz ...
100% |**************************************************|  1522 KB    00:00 ETA

Copying hostname.le0, hosts, myname, mygate, resolv.conf,  ...done.
</pre>
</ul>

<p>
Una vez que haya acabado, todo lo que le queda por hacer es configurar su
franja horaria e instalar los bloques de arranque.
La configuraci&oacute;n de la franja horaria es muy f&aacute;cil.
Escoja el &aacute;rea en donde vive e introduzca el nombre.
¡Eso es todo!

<ul>
<pre>
Select a time zone for your location. Timezones are represented on the
system by a directory structure rooted in &quot;/usr/share/timezone&quot;. Most
timezones can be selected by entering a token like &quot;MET&quot; or &quot;GMT-6&quot;.
Other zones are grouped by continent, with detailed zone information
separated by a slash (&quot;/&quot;), e.g. &quot;US/Pacific&quot; or &quot;Canada/Mountain&quot;.

To get a listing of what's available in /usr/share/zoneinfo, enter &quot;?&quot;
at the prompts below.

What timezone are you in [`?' for list] [GMT]? <strong>?</strong>
Africa/      Chile/       GMT          Jamaica      Navajo       UCT
America/     Cuba         GMT+0        Japan        PRC          US/
Antarctica/  EET          GMT-0        Kwajalein    PST8PDT      UTC
Arctic/      EST          GMT0         Libya        Pacific/     Universal
Asia/        EST5EDT      Greenwich    MET          Poland       W-SU
Atlantic/    Egypt        HST          MST          Portugal     WET
Australia/   Eire         Hongkong     MST7MDT      ROC          Zulu
Brazil/      Etc/         Iceland      Mexico/      ROK          posixrules
CET          Europe/      Indian/      Mideast/     Singapore
CST6CDT      Factory      Iran         NZ           SystemV/
Canada/      GB           Israel       NZ-CHAT      Turkey
What timezone are you in [`?' for list] [GMT]? <strong>Canada</strong>
There are several timezones available within zone 'Canada'
Select a sub-timezone [`?' for list]: <strong>?</strong>
Atlantic            Eastern             Pacific
Central             Mountain            Saskatchewan
East-Saskatchewan   Newfoundland        Yukon
Select a sub-timezone [`?' for list]: <strong>Mountain</strong>
You have selected timezone &quot;Canada/Mountain&quot;.
Installing timezone link...done.
Installing boot block...
boot: /mnt/boot
proto: /usr/mdec/biosboot
device: /dev/rsd0c
/usr/mdec/biosboot: entry point 0
proto bootblock size 512
room for 12 filesystem blocks at 0x16f
Will load 6 blocks of size 8192 each.
Using disk geometry of 63 sectors and 128 heads.
 0: 19 @(0 93 45) (5903-5921)
 1: 63 @(0 94 1) (5922-5984)
 2: 14 @(0 95 1) (5985-5998)
/mnt/boot: 3 entries total

Making all device nodes (by running /dev/MAKEDEV) ...... done.
Unmounting filesystems... /mnt/usr /mnt/var /mnt/tmp /mnt ... Done.
Done.

CONGRATULATIONS!  You have successfully installed OpenBSD!  To boot the
installed system, enter halt at the command prompt. Once the system has
halted, reset the machine and boot from the disk.

# <strong>reboot</strong>
</pre>
</ul>

<p>
<a name="1.13"></a>
<h2>Despu&eacute;s de reiniciar</h2>

<p>
Esta secci&oacute;n le dar&aacute; algunas pistas sobre lo que debe hacer al
principio, despu&eacute;s de haber instalado su sistema OpenBSD.
Esto se basa en el modelo de la p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&sektion=8&format=html">afterboot(8)</a>.
Uno de los primeros pasos que deber&iacute;a dar despu&eacute;s de instalar
OpenBSD es leer esta p&aacute;gina de manual.
A continuaci&oacute;n puede ver una tabla con puntos de especial relevancia
en diferentes secciones de las preguntas frecuentes.

<ul>
   <li><a href="faq10.html#10.8">C&oacute;mo a&ntilde;adir usuarios en
       OpenBSD</a>
   <li><a href="faq6.html#6.1">Configuraci&oacute;n inicial de la red</a>
   <li><a href="faq2.html#2.3">P&aacute;ginas de manual de &oacute;rdenes de
       utilidad</a>
   <li><a href="http://www.openbsd.org/cgi-bin/man.cgi">P&aacute;ginas de
       manual de OpenBSD en internet</a>
   <li><a href="faq8.html#8.7">Paquetes de OpenBSD</a> - paquetes de binarios
       precompilados.
</ul>

<p>
<p>
A modo de recordatorio, es importante que los desarrolladores de OpenBSD
puedan llevar un seguimiento del hardware que funciona, y del que no funciona
perfectamente...
</p>

<p>
Una cita de /usr/src/etc/root/root.mail

<pre>
<cite>
Si quiere asegurarse de que OpenBSD funcione mejor en sus m&aacute;quinas,
por favor (¡despu&eacute;s de configurar su sistema de correo!) escriba
	dmesg | mail dmesg@openbsd.org
para que podamos ver qu&eacute; tipos de configuraciones tienen los usuarios.
Esta informaci&oacute;n la usaremos para mejorar el soporte para los
controladores de dispositivos en las versiones venideras (esta
informaci&oacute;n nos es de utilidad con el n&uacute;cleo provisto con la
instalaci&oacute;n GENERIC, no con un n&uacute;cleo compilado personalizado).
La informaci&oacute;n sobre controladores de dispositivos que obtengamos de
aqu&iacute; nos ayuda a mejorar los controladores ya existentes.
</cite>
</pre>

Lea tambi&eacute;n la <a href="faq14.html#14.7">secci&oacute;n 14.7</a> de
las preguntas frecuentes.
</p>

<p>
Aseg&uacute;rese de enviar el mensaje desde una cuenta en la que
tambi&eacute;n pueda recibir mensajes, para que los desarrolladores puedan
contactar con Vd. si hubiera algo que quisieran que comprobara o que cambiara
para el mejor funcionamiento de su configuraci&oacute;n.
No es importante que env&iacute;e el mensaje desde la misma m&aacute;quina en
la que haya instalado OpenBSD;  si no puede enviar o recibir correo en esa
m&aacute;quina, escriba
<pre>
 dmesg | mail su-cuenta@sucorreo.dom
</pre>

y env&iacute;enos ese mensaje a

<pre>
 dmesg@openbsd.org
</pre>

donde <kbd>su-cuenta@sucorreo.dom</kbd> es su cuenta de correo regular (o
transfiera la salida de <code>dmesg</code> usando ftp, scp, disquete, paloma
mensajera, etc... ).
</p>

<p>
<strong>NOTA</strong> - Por favor, env&iacute;e s&oacute;lo la salida de
<code>dmesg</code> para el n&uacute;cleo GENERIC.
Los n&uacute;cleos personalizados que tienen controladores de dispositivos
eliminados no son de ninguna ayuda.
</p>

<p>
<a name="1.14"></a>
<h2>Otros recursos de informaci&oacute;n y preguntas comunes</h2>

<ul>
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/sparc/INSTALL.sparc">INSTALL.sparc</a> - Documentaci&oacute;n extensiva sobre la instalaci&oacute;n.
</ul>

<p>
<strong>Pregunta:</strong> ¿Puedo obtener una imagen ISO de OpenBSD?
</p>

<p>
<strong>Respuesta:</strong> No puede.  La composici&oacute;n del CD-ROM
oficial de OpenBSD es propiedad de Theo de Raadt, a modo de incentivo para
que los usuarios compren los CDs.

Los derechos de propiedad s&oacute;lo se aplican a la composici&oacute;n,
OpenBSD es libre.
Nada puede evitar que cualquier persona coja OpenBSD y haga su propio CD.
</p>


<p>
<hr>
<font color="#0000e0">
<a href="index.html">[Volver al &Iacute;ndice Principal]</a>
<a href="faq4.html">[Secci&oacute;n 4.0 - Gu&iacute;a de Instalaci&oacute;n]</a>
<a href="faq6.html">[Secci&oacute;n 6.0 - Redes]</a>
</font>
</p>

<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: install-sparc.html,v 1.12 2000/05/12 14:42:53 ericj Exp ]<br>
$Translation: install-sparc.html,v 1.2 2000/05/15 00:15:06 horacio Exp $<br>
$OpenBSD: install-sparc.html,v 1.2 2000/05/15 00:36:26 wvdputte Exp $
</small>
</p>


</body>
</html>
