<html>
<head>
<title>Intalaci&oacute;n de OpenBSD en la arquitectura i386</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2000 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238E">

<img alt="[OpenBSD]" height="30" width="141" src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Instalaci&oacute;n de OpenBSD en i386</font><hr></h2>
</p>

<h3>Tabla de Contenidos</h3>
<ul>
<li><a href="#1.1">Antes de Comenzar</a>
<li><a href="#1.2">Crear Discos de Arranque de OpenBSD</a>
<li><a href="#1.3">Del Arranque al ``fdisk''</a>
<li><a href="#1.4">Configurar el Disco de OpenBSD con
    ``disklabel''</a>
<li><a href="#1.5">Configurar los Puntos de Montaje y Formatear el Disco</a>
<li><a href="#1.6">Configurar la Red</a>
<li><a href="#1.7">Escoger el Medio de Instalaci&oacute;n</a>
<li><a href="#1.8">Instalar desde un CDROM</a>
<li><a href="#1.9">Instalar desde un Sistema de Archivo Local</a>
<li><a href="#1.10">Instalar desde FTP o DHCP</a> 
<li><a href="#1.11">Instalar desde NFS</a>
<li><a href="#1.12">Elegir Paquetes de Instalaci&oacute;n y Finalizar la
    Instalaci&oacute;n</a>
<li><a href="#1.13">Notas Post-Inicio</a>
<li><a href="#1.14">Otros Recursos de Informaci&oacute;n y Preguntas Comunes</a>
</ul>

<h3>Enlaces para la configuraci&oacute;n del disco</h3>

<ul>
<li><a href="faq14.html#14.2">Usar el fdisk(8) de OpenBSD</a>
<li><a href="faq14.html#14.1">Usar el disklabel(8) de OpenBSD</a>
</ul>

<hr>

<p>
<a name="1.1"></a>
<h2>Antes de Empezar</h2>

<p>
Antes de intentar instalar OpenBSD es necesario llevar a cabo unas
cuantas comprobaciones.
</p>

<ul>
<li>La primera y principal es la de asegurarse de que exista soporte
    para su hardware en OpenBSD.
    Puede ver una lista actualizada de hardware para el que existe
    soporte en
    <a href="../../es/i386.html">http://www.openbsd.org/es/i386.html</a>.
<li>Si tiene pensado instalar OpenBSD por medio de su dispositivo de
    red, es primordial que se asegure de que exista soporte para su
    dispositivo de red.
<li>Aseg&uacute;rese de haber hecho copias de seguridad (respaldo) de
    toda la informaci&oacute;n que necesite, especialmente si quiere
    configurar un sistema con multiarranque.
</ul>

<p>
<a name="1.2"></a>
<h2>Crear Discos de Arranque de OpenBSD</h2>

<p>
Si la BIOS de su m&aacute;quina tiene implementado el arranque directo
desde el CDROM, puede arrancar desde el CD de OpenBSD y de este modo no
necesitar&aacute; crear ning&uacute;n disco de arranque.  Si esta
opci&oacute;n existe la podr&aacute; econtrar en la BIOS de su
m&aacute;quina, en la secci&oacute;n que trate sobre la
configuraci&oacute;n de arranque.

<p>
OpenBSD se distribuye con dos im&aacute;genes de los discos de arranque
separadas, las cuales contienen soporte para diferentes dispositivos.
Puede ver las diferencias a continuaci&oacute;n.  En cualquier caso
necesitar&aacute; leer 
<a href="../../es/i386.html">http://www.openbsd.org/es/i386.html</a> 
para ver si existe soporte para otros dispositivos en uno u otro disco.

<ul>
<li><b>floppy26.fs</b> tiene soporte para los siguientes dispositivos
    (que no est&aacute;n soportados en floppy26B.fs):
<p>

Ethernet:
<ul>
<li>NE2000 PCMCIA
<li>3com 3c5xx PCMCIA
<li>Xircom PCMCIA
</ul>

Disco:
<ul>
<li>ISAPNP/PCMCIA IDE 
    (<i>las dos im&aacute;genes contienen soporte para ISA y PCI</i>)
<li>BusLogic [57]4X SCSI
<li>Adaptec 154[02] SCSI
<li>Adaptec 174[024] SCSI
<li>Adaptec 274X/284X/2940 SCSI
<li>NCR 538XX SCSI
<li>AdvanSys 1200A/B/Ultra/Ultrawide SCSI
<li>Seagate ST0[12] SCSI
</ul>

<p>

<li><b>floppyB26.fs</b> contiene soporte para los siguientes
    dispositivos (para los que no hay soporte en floppy26.fs):
<p>

Disco:
<ul>
<li>Qlogic ISP [12]0x0 SCSI/FibreChannel
<li>UltraStor [123]4f SCSI
<li>WD7000/TMC-7000 SCSI
</ul>
</ul>

<p>
Una vez haya obtenido la imagen del disco de arranque correcta, debe
crear su disco de arranque.  Para ello aseg&uacute;rese de que utiliza
un disquete que ya haya sido formateado (el proceso de formateado le
dar&aacute; la composici&oacute;n b&aacute;sica del disco, con sectores
y pistas, de modo que el dispositivo de la disquetera lo pueda
reconocer).

<p>
En DOS, use la orden FORMAT.
En OpenBSD debe usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdformat&sektion=1&format=html">fdformat(1)</a> 
del modo siguiente (nota: <code>fd0a</code> se refiere a todo el
disquete, a menos que tenga una &laquo;clasificaci&oacute;n del
disco&raquo; (&quot;disklabel&quot;) en su disquete):

<ul>
<pre>
# <b>fdformat /dev/fd0a</b>
Format 1440K floppy `/dev/fd0a'? (y/n): <b>y</b>
Processing VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV done.
</pre>
</ul>

<p>
Seg&uacute;n la arquitectura que use, existen varias maneras diferentes
de crear un disco de arranque.  Hay algunas herramientas disponibles en
el directorio
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/tools/">tools</a>, que puede
encontrarlo en cualquiera las r&eacute;plicas del servidor de ftp, o en
el directorio <code>2.6/tools</code> del primer CD de OpenBSD.  Si lo
hace desde un Sistema Operativo de tipo UNIX, puede usar la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1&format=html">dd(1)</a> para copiar la imagen a su disquete.
A continuaci&oacute;n puede ver un ejemplo de c&oacute;mo usar dd(1)
para copiar una imagen del disco de arranque de OpenBSD a un disquete:
</p>

<ul>
<pre>
# <strong>dd if=floppy26.fs of=/dev/rfd0c bs=126b</strong>
</pre>
</ul>

A continuaci&oacute;n debe asegurarse de que su disquete est&eacute; en
buen estado.  La mayor&iacute;a de disquetes viejos no pasan esta
prueba (y si no lo hizo para probarlo, fallar&aacute;n en llevar a cabo
un arranque correcto de todos modos).

<ul>
<pre>
# <strong>cmp /dev/rfd0c floppy26.fs</strong>
</pre>
</ul>

Si la pasa, <i>cmp</i> no mostrar&aacute; nada.  Simplemente
ver&aacute; otro punto de shell.

<p>
Windows o NT no disponen de esta opci&oacute;n.  Para &eacute;stos
existen otras opciones.  Los usuarios de Windows necesitar&aacute;n el
programa <i>rawrite</i> que pueden encontrar en el CD de OpenBSD o por
ftp.

<ul>
Ejemplo del uso de <i>rawrite</i>:

<pre>
C:\&gt; <b>rawrite</b>
RaWrite 1.2 - Write disk file to raw floppy diskette

Enter source file name: <b>floppy26.fs</b>
Enter destination drive: <b>a</b>
Please insert a formatted diskette into drive A: and press -ENTER- : <b>&gt;Intro&lt;</b>
</pre>
</ul>

<p>
Rawrite no funciona en NT.  Sin embargo existen otras herramientas como
<i>fdimage</i> o <i>ntrw</i> para copiar im&aacute;genes.  Estas dos se
encuentran disponibles en el CD de OpenBSD o por ftp.
<br>
Ejemplos del uso de cada uno de estos programas:
</p>

<ul>
Ejemplo del uso de <i>fdimage</i>:
<pre>
C:\&gt; <strong>fdimage -q floppy26.fs a:</strong>
</pre>

Ejemplo del uso de <i>ntrw</i>:
<pre>
C:\&gt; <strong>ntrw floppy26.fs a:</strong>
3.5", 1.44MB, 512 bytes/sector
bufsize is 9216
1474560 bytes written
</pre>
</ul>

<p>
<a name="1.3"></a>
<h2>Del Arranque al ``fdisk''</h2>

<p>
Ahora que tiene su disco de arranque creado, ya puede arrancar el
sistema de instalaci&oacute;n.  Cuando arranque con este disquete, el
n&uacute;cleo del sistema y todos los programas que usa OpenBSD para
instalarse se cargar&aacute;n en la memoria.  Si surge alg&uacute;n
problema y su disco de arranque no inicia, es probable que se deba a un
disquete en malas condiciones.  &iexcl;Este problema es muy
com&uacute;n!  Si su disco de arranque falla al iniciar,
int&eacute;ntelo una segunda vez, y si &eacute;sta fallara, tire el
disquete y obtenga uno nuevo.  Recuerde que, aunque ese disquete le
funcionara correctamente con anterioridad, OpenBSD usa
pr&aacute;cticamente todos y cada uno de los bits disponibles en el
disquete, y la causa puede estar en que alguno de ellos se encuentre en
una mala condici&oacute;n.  Cualquier error en el disquete
impedir&aacute; que OpenBSD arranque normalmente.

<p>
Si inici&oacute; sin problemas ver&aacute; un mont&oacute;n de texto
blanco sobre fondo azul;  ese texto son mensajes del n&uacute;cleo del
sistema que le indica los dispositivos que ha encontrado, y
d&oacute;nde los ha encontrado.  A continuaci&oacute;n ver&aacute; lo
siguiente:

<ul>
<pre>
sh: /etc/rc: No such file or directory
Enter pathname of shell or RETURN for sh: <b>&lt;Intro&gt;</b>
erase ^?, werase ^W, kill ^U, intr ^C
</pre>
</ul>

L&oacute;gicamente su respuesta ser&aacute; I, para <i>Instalar</i>

<ul>
<pre>
(I)nstall, (U)pgrade or (S)hell? <b>I</b>
</pre>
</ul>

A continuaci&oacute;n ver&aacute; una descripci&oacute;n de la
instalaci&oacute;n, y le preguntar&aacute; por su tipo de terminal...
pulse intro para aceptar la opci&oacute;n predefinida, pcvt es el tipo
de terminal correcto.

<ul>
<pre>
You can run a shell command at any prompt via '!foo'
or escape to a shell by simply typing '!'.

Specify terminal type [pcvt25]: <b>&lt;Intro&gt;</b>
</pre>
</ul>

El siguiente paso es seleccionar el disco duro en el que va a instalar
OpenBSD.  Si tiene datos en este disco y quiere hacer una copia de
seguridad de &eacute;stos, aseg&uacute;rese de hacerlo antes de
comenzar este proceso.

<ul>
<pre>
Available disks are:

wd0

Which disk is the root disk? [wd0]
</pre>
</ul>

Si va a usar un disco primario IDE, la respuesta correcta ser&aacute;
<code>wd0</code>.  Si va a usar un disco primario SCSI, la respuesta
correcta ser&aacute; <code>sd0</code>.  Si va a instalar OpenBSD en
otro disco, como pueda ser el secundario, seleccione la respuesta
apropiada (<code>wd1</code>, <code>sd1</code>, etc...) para
&eacute;ste.  Si la respuesta entre corchetes (en el ejemplo anterior,
<code>[wd0]</code>) es la apropiada, puede pulsar intro.

A continuaci&oacute;n le preguntar&aacute;:

<ul>
<pre>
Do you want to use the *entire* disk for OpenBSD? [no]
</pre>
</ul>

Si no quiere usar el disco entero para OpenBSD, pulse intro.
Pasar&aacute; al juego de las particiones con fdisk.  En la 
<a href="faq14.html#14.2">secci&oacute;n 14.2</a> de las preguntas
frecuentes encontrar&aacute; las instrucciones sobre c&oacute;mo jugar
a este juego.  Recuerde que estas particiones <b>no</b> son sus
particiones Unix.  S&oacute;lo necesita <b>una</b> partici&oacute;n en
esta tabla para OpenBSD (cualquier otra partici&oacute;n ser&aacute;
para otros sistemas operativos, como Windows).

<p>
Si contest&oacute; &quot;yes&quot; a esta secci&oacute;n, OpenBSD se
encargar&aacute; de hacer el proceso de fdisk por Vd, y le
colocar&aacute; en el disco correcto.

<p>
<a name="1.4"></a>
<h2>Configurar el Disco de OpenBSD con ``disklabel''</h2>

<p>
Para una explicaci&oacute;n m&aacute;s detallada sobre c&oacute;mo usar
disklabel, lea la <a href="faq14.html#14.1">secci&oacute;n 14.1</a> de
las preguntas frecuentes.  Para obtener una idea aproximada de los
tama&ntilde;os necesarios para sus sistemas de archivo en el disco, lea
la <a href="faq4.html#4.3">secci&oacute;n 4.3</a> de las preguntas
frecuentes. 

<p>
En una m&aacute;quina multiusuario es conveniente crear, como
m&iacute;nimo, cinco sistemas de archivo diferentes:  uno para /;  otro
para swap;  otro para /var;  otro para /tmp;  y otro para /usr.  Si sus
usuarios van a almacenar ficheros de gran tama&ntilde;o, entonces
deber&iacute;a crear tambi&eacute;n un sistema de archivo diferente
para /home.

<p>
Existen cuatro razones principales para usar sistemas de archivo
separados en lugar de tenerlo todo en uno o dos sistemas de archivo:

<ul>
<li><b>Seguridad</b>: Puede marcar algunos sistemas como 'nosuid',
    'nodev', 'noexec', 'readonly', etc...
<li><b>Estabilidad</b>: Un usuario o un programa con un funcionamiento
    incorrecto, puede llenar un sistema de archivo con basura si tiene
    permiso de escritura sobre &eacute;ste.  Sus programas m&aacute;s
    cr&iacute;ticos, que por supuesto funcionar&aacute;n sobre un
    sistema de archivo diferente, no se ver&aacute;n interrumpidos.
<li><b>Velocidad</b>: Un sistema de archivo sobre el que se escribe con
    frecuencia puede sufrir algo de fragmentaci&oacute;n (por suerte,
    el sistema de archivo ffs, que es el que usa OpenBSD, no es
    propenso a la fragmentaci&oacute;n).
<li><b>Integridad</b>: Si un sistema de archivo se corrompe por
    cualquier motivo, sus otros sistemas de archivo se
    mantendr&aacute;n en buen estado.
</ul>

<p>
<a name="1.5"></a>
<h2>Configurar los Puntos de Montaje y Formatear los Sistemas de Archivos</h2>

<p>
Configurar los puntos de montaje es mucho m&aacute;s f&aacute;cil de lo
que pueda parecer.  Despu&eacute;s de configurar los sistemas de
archivo con disklabel, ver&aacute; algo como lo siguiente:
</p>

<ul>
<pre>
The following filesystems will be used for the root filesystem and swap:
        wd0a    /
        wd0b    swap

Mount point for wd0d (size=65520k) [/tmp, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for wd0e (size=65520k) [/var, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for wd0g (size=307440k) [/usr, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
Mount point for wd0h (size=1926256k) [/home, RET, none, or done]? <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
Aqu&iacute; se puede ver que wd0a se ha configurado como root, y wd0b
como swap.  As&iacute; ser&aacute; en todos los casos a menos que
<code>wd0</code> cambie por cualquier otro dispositivo que est&eacute;
usando.  En el ejemplo anterior nuestros puntos de montaje ya han sido
definidos por disklabel(8), pero aun as&iacute; deber&iacute;an ser
revisados para poder estar seguros de que toda la informaci&oacute;n es
correcta, ¡es su &uacute;ltima oportunidad para cambiarla!  Para
aquellos usuarios con m&aacute;s de un disco duro, &eacute;sta
tambi&eacute;n ser&aacute; su oportunidad para configurar sus otros
discos.  H&aacute;galo con calma y no intente meter todos sus puntos de
montaje en un s&oacute;lo disco.  A continuaci&oacute;n
aparecer&aacute; una lista como la siguiente:
</p>

<ul>
<pre>
Now you can select another disk to initialize.  (Do not re-select a
disk you have already entered information for).  Available disks are:

wd0
wd1

Which one? [done] <strong>&lt;Intro&gt;</strong>

You have configured the following devices and mount points:

wd0a /
wd0d /tmp
wd0e /var
wd0g /usr
wd0h /home

Filesystems will now be created on these devices.
If you made any mistakes, you may edit this now.
Edit using ed? [n] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
Como puede ver, en el ejemplo se decidi&oacute; no usar wd1 en este
momento.  Si se hubiera escogido la opci&oacute;n de configurar otro
disco, se habr&iacute;an seguido exactamente los mismos pasos que se
siguieron para la configuraci&oacute;n del primero.  Tambi&eacute;n
tiene una &uacute;ltima oportunidad para hacer correcciones con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ed&sektion=1&format=html">ed(1)</a>,
pero es mucho m&aacute;s facil verificar la informaci&oacute;n con
anterioridad.  Una vez que los sistemas de archivo han sido
configurados, es el momento de formatear los discos.  Aparecer&aacute;
un aviso diciendo que toda la informaci&oacute;n ser&aacute; borrada.
Por esta raz&oacute;n, si est&aacute; en un sistema de arranque
m&uacute;ltiple, es muy importante haber hecho copias de seguridad.  He
aqu&iacute; un ejemplo del aviso:
</p>

<ul>
<pre>
============================================================
The next step will overwrite any existing data on:
        wd0a wd0d wd0e wd0g wd0h

Are you really sure that you're ready to proceed? [n] <strong>y</strong>
</pre>
</ul>

<p>
N&oacute;tese que la respuesta a esta pregunta es <strong>no</strong>
por definici&oacute;n;  as&iacute; pues, tendr&aacute; que indicarle
expl&iacute;citamente que contin&uacute;e con el formateo.  En caso
contrario pasar&iacute;a a la &quot;shell&quot; desde donde
podr&iacute;a empezar a instalar de nuevo escribiendo la orden
<strong>install</strong>, o simplemente reiniciando otra vez con su
disco de arranque.  Si ha respondido <strong>yes</strong>,
comenzar&aacute; a dar formato a todos los sistemas de archivo;  esto
puede tardar un tiempo, dependiendo del tama&ntilde;o de su disco.
</p>

<p>
<a name="1.6"></a>
<h2>Configurar la Red</h2>

<p>
Ahora llega el momento de configurar su instalaci&oacute;n de red.
Esto es muy importante si va a hacer alguna instalaci&oacute;n por red,
ya que &eacute;sta se basar&aacute; en la informaci&oacute;n que
introduzca a partir de ahora.  Aqu&iacute; puede ver una gu&iacute;a
por pasos de la secci&oacute;n del proceso de instalaci&oacute;n sobre
la configuraci&oacute;n de la red.
</p>

<ul>
<pre>
You will now be given the opportunity to configure the network.  This will be
useful if you need to transfer the installation sets via FTP, HTTP, or NFS.
Even if you choose not to transfer installation sets that way, this information
will be preserved and copied into the new root filesystem.

Configure the network [y] <strong>&lt;Intro&gt;</strong>
Enter system hostname (short form): [] <strong>mybox</strong>
Enter DNS domain name: [] <strong>someisp.com</strong>

If you have any devices being configured by a DHCP server
it is recommended that you do not enter a default route or
any name servers.

You may configure the following network interfaces (the interfaces marked
with [X] have been successfully configured):

        [ ] xl0
        [ ] fxp0

Configure which interface? (or, enter 'done') [xl0] <strong>&lt;Intro&gt;</strong>
IP address (or 'dhcp')? [] <strong>199.185.137.55</strong>
Symbolic (host) name? [mybox] <strong>&lt;Intro&gt;</strong>
Netmask ? [255.255.255.0] <strong>&lt;Intro&gt;</strong>
Your network interface might require non-default
media directives.  The default media is:
        media: Ethernet 100baseTX half-duplex
This is a list of supported media:
        media autoselect
        media 100baseTX mediaopt full-duplex
        media 100baseTX mediaopt half-duplex
        media 100baseTX
        media 10baseT mediaopt full-duplex
        media 10baseT
        media 10baseT mediaopt half-duplex
If the default is not satisfactory, and you wish to use another
media, copy that line from above (ie. "media 100baseTX")
Media directives? [] <strong>&lt;Intro&gt;</strong>

You may configure the following network interfaces (the interfaces marked
with [X] have been successfully configured):

        [X] xl0
        [ ] fxp0

Configure which interface? (or, enter 'done') [done] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
En este ejemplo tenemos dos interfaces de red, pero s&oacute;lo
configuraremos una de ellas.  Se pueden configurar ambas interfaces
durante la instalaci&oacute;n, pero para simplificarlo s&oacute;lo lo
haremos con una.  Para empezar, si no usa DHCP necesitar&aacute; saber
algo de informaci&oacute;n sobre la configuraci&oacute;n de su entorno
de red.  Esta informaci&oacute;n incluye su IP, Netmask, y gateway.  Si
usa DHCP bastar&aacute; con que ponga DHCP como su IP y el resto de la
informaci&oacute;n se resolver&aacute; por s&iacute; misma.
Tambi&eacute;n se le ofrecer&aacute; la posibilidad de especificar
directivas de medios si su NIC tiene soporte para alguno.  A
continuaci&oacute;n tendr&aacute; la oportunidad de especificar la ruta
y el nombre de servidor que usar&aacute; por definici&oacute;n.  Esto
ser&aacute; necesario si va a hacer una instalaci&oacute;n por red.
</p>

<ul>
<pre>
Configure which interface? (or, enter 'done') [done] <strong>&lt;Intro&gt;</strong>
Enter IP address of default route: [none] <strong>199.185.137.128</strong>
Enter IP address of primary nameserver: [none] <strong>199.185.137.1</strong>
Would you like to use the nameserver now? [y] <strong>&lt;Intro&gt;</strong>

You will now be given the opportunity to escape to the command shell to do
any additional network configuration you may need.  This may include adding
additional routes, if needed.  In addition, you might take this opportunity
to redo the default route in the event that it failed above.
Escape to shell? [n] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
En este punto puede &laquo;escapar&raquo; a un &laquo;int&eacute;rprete
de &oacute;rdenes&raquo; (&quot;shell&quot;) que le permita llevar a
cabo cualquier correcci&oacute;n a su configuraci&oacute;n de red, o
hacer cualquier cambio espec&iacute;fico que no entre dentro de las
posibilidades del gui&oacute;n de instalaci&oacute;n.  Para la
mayor&iacute;a esto no ser&aacute; necesario.
</p>

<p>
<a name="1.7"></a>
<h2>Escoger el Medio de Instalaci&oacute;n</h2>

<p>
Despu&eacute;s de haber configurado su red, el gui&oacute;n de
instalaci&oacute;n le ofrecer&aacute; la oportunidad de realizar
cambios a su configuraci&oacute;n de red (principalmente a posibles
errores).  A partir de ah&iacute; se montar&aacute; el sistema de
archivo que haya creado y se activar&aacute; una contrase&ntilde;a para
el usuario &quot;root&quot; (el administrador del sistema).  Con esto
estar&aacute;n listos sus discos para la instalaci&oacute;n de paquetes
de OpenBSD en ellos.  Despu&eacute;s de que sus discos est&eacute;n
preparados, tendr&aacute; la oportunidad de escoger su medio para la
instalaci&oacute;n.  Al final puede ver una lista de opciones.
</p>

<ul>
<pre>
You will now be given the opportunity to escape to the command shell to do
any additional network configuration you may need.  This may include adding
additional routes, if needed.  In addition, you might take this opportunity
to redo the default route in the event that it failed above.
Escape to shell? [n] <strong>&lt;Intro&gt;</strong>
/dev/wd0a on /mnt type ffs (rw, asynchronous, local)
/dev/wd0d on /mnt/tmp type ffs (rw, asynchronous, local)
/dev/wd0e on /mnt/var type ffs (rw, asynchronous, local)
/dev/wd0g on /mnt/usr type ffs (rw, asynchronous, local)
/dev/wd0h on /mnt/home type ffs (rw, asynchronous, local)

Please enter the initial password that the root account will have.
Password (will not echo): _
Password (again): _

It is now time to extract the installation sets onto the hard disk.  Make sure
the sets are either on a local device (i.e. tape, CD-ROM) or on a network
server.  You will have the chance to repeat this step or to extract sets from
several places, so you don't have to try to load all the sets in one try and
can recover from some errors.

Install from (f)tp, (h)ttp, (t)ape, (C)D-ROM, (N)FS or local (d)isk? <strong>&lt;Introduzca Aqu&iacute; Su Opci&oacute;n&gt;</strong>
</pre>
</ul>

<p>
<a name="1.8"></a>
<h2>Instalar desde un CDROM</h2>

<p>
Para instalar desde un CD-ROM debe usar la opci&oacute;n 'C' cuando
escoja su medio de instalaci&oacute;n.  De este modo aparecer&aacute;
una lista de los dispositivos que sean identificados como CD-ROM en su
m&aacute;quina.  La mayor parte de los usuarios s&oacute;lo
dispondr&aacute;n de un dispositivo de CDROM, pero si no es su caso
entonces tendr&aacute; que asegurarse de que elije bien el dispositivo
desde el que va a instalar OpenBSD.  Despu&eacute;s de escoger el
dispositivo correcto le preguntar&aacute; por el sistema de archivo en
el que se instalar&aacute;n los ficheros.  Si est&aacute; usando el
CDROM de OpenBSD tendr&aacute; que escoger 'c', ya que 'c' aqu&iacute;
representa todo el CDROM.  Siguiendo con los ejemplos:
</p>

<ul>
<pre>
Install from (f)tp, (h)ttp, (t)ape, (C)D-ROM, (N)FS or local (d)isk? <strong>c</strong>

The following CD-ROM devices are installed on your system; please select
the CD-ROM device containing the partition with the installation sets:

cd0

Which is the CD-ROM with the installation media? [abort] <strong>cd0</strong>
Partition? [c] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
A continuaci&oacute;n le preguntar&aacute; por el tipo de sistema de
archivo que usar&aacute; para leer el CDROM, y por el directorio en el
que se encuentran los ficheros de instalaci&oacute;n.  Si est&aacute;
utilizando el CDROM oficial de OpenBSD, responder&aacute; 'cd9660' como
tipo de sistema de archivo (es el tipo por definici&oacute;n).  Lo
siguiente ser&aacute; indicar '/2.6/i386/' como el directorio en donde
se encuentran los ficheros (tambi&eacute;n por definici&oacute;n).
Despu&eacute;s de esto le mostrar&aacute; una lista de paquetes para
instalar.  Puede ver una descripci&oacute;n de estos ficheros en la
<a href="faq4.html#4.2">secci&oacute;n 4.2</a> de las preguntas
frecuentes.  Lo que ver&aacute; es lo siguiente:
</p>

<ul>
<pre>
There are two CD-ROM filesystem types currently supported by this program:
cd9660          ISO-9660
ffs             Berkeley Fast Filesystem

Which filesystem type? [cd9660] <strong>&lt;Intro&gt;</strong>
Enter the directory relative to the mount point that
contains the file. [/2.6/i386] <strong>&lt;Intro&gt;</strong>

You will now be asked for files to extract.  In addition to the
files listed in the selector you may enter any file located in
/mnt2/2.6/i386.  You can also enter 'all' to install all the standard
sets, or 'list' to list the files avilable in /mnt2/2.6/i386.
When you are done selecting files, enter 'done'.
Some of these sets are required for your install and some are optional --
You will want at least the base and bsd sets.
Consult the intallation notes if you are not sure which sets are required!
</pre>
</ul>

<p>
A continuaci&oacute;n pase a la secci&oacute;n <a href="#1.12">Elegir
Paquetes de Instalaci&oacute;n y Finalizar la Instalaci&oacute;n</a>
para conocer los detalles finales de la instalaci&oacute;n.
</p>

<p>
<a name="1.9"></a>
<h2>Instalar desde un Sistema de Archivos Local</h2>

<p>
<a name="1.10"></a>
<h2>Instalar desde FTP or DHCP</h2>

<p>
<a name="1.11"></a>
<h2>Instalar desde NFS</h2>

<p>
<a name="1.12"></a>
<h2>Elegir los Paquetes de Instalaci&oacute;n y Finalizar la Instalaci&oacute;n</h2>

<p>
Ahora es el momento de escoger qu&eacute; paquetes va a instalar.
Puede obtener una descripci&oacute;n de estos ficheros en la 
<a href="faq4.html#4.2">secci&oacute;n 4.2</a> de las preguntas
frecuentes.  Los ficheros que el disco de instalaci&oacute;n encuentre
tambi&eacute;n aparecer&aacute;n en su pantalla.  Lo &uacute;nico que
debe hacer es especificar qu&eacute; ficheros desea que se instalen.
Por definici&oacute;n, s&oacute;lo cuatro paquetes aparecen
preseleccionados.  Estos son 'base26.tar.gz', 'etc26.tar.gz',
'man26.tar.gz' y 'bsd', ya que los tres primeros deben estar instalados
para que el sistema tenga alg&uacute;n tipo de funcionalidad, y el
&uacute;ltimo, 'bsd', es el n&uacute;cleo del sistema.  En el siguiente
ejemplo se muestra una instalaci&oacute;n completa exceptuando el
paquete <code>games</code>.
</p>

<ul>
<pre>
The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base26.tar.gz
        [X] etc26.tar.gz
        [ ] misc26.tar.gz
        [ ] comp26.tar.gz
        [X] man26.tar.gz
        [ ] game26.tar.gz
        [ ] xbase26.tar.gz
        [ ] xshare26.tar.gz
        [ ] xfont26.tar.gz
        [ ] xserv26.tar.gz
        [X] bsd

File name []? <strong>*</strong>

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base26.tar.gz
        [X] etc26.tar.gz
        [X] misc26.tar.gz
        [X] comp26.tar.gz
        [X] text26.tar.gz
        [X] man26.tar.gz
        [X] game26.tar.gz
        [X] xbase26.tar.gz
        [X] xshare26.tar.gz
        [X] xfont26.tar.gz
        [X] xserv26.tar.gz
        [X] bsd
File name []? <strong>-game*</strong>

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] base26.tar.gz
        [X] etc26.tar.gz
        [X] misc26.tar.gz
        [X] comp26.tar.gz
        [X] text26.tar.gz
        [X] man26.tar.gz
        [ ] game26.tar.gz
        [X] xbase26.tar.gz
        [X] xshare26.tar.gz
        [X] xfont26.tar.gz
        [X] xserv26.tar.gz
        [X] bsd
File name []? <strong>done</strong>
</pre>
</ul>

<p>
Una vez que haya escogido los paquetes que desee instalar, le
preguntar&aacute; si est&aacute; seguro de que quiere extraer estos
paquetes y acto seguido los instalar&aacute;.  El programa de
instalaci&oacute;n mostrar&aacute; una barra de progreso que le
mantendr&aacute; informado del tiempo que tardar&aacute; la
instalaci&oacute;n.  El tiempo depender&aacute; en gran medida del
sistema en el que est&eacute; instalando OpenBSD.  Despu&eacute;s de
esto, el programa copiar&aacute; sus ficheros de configuraci&oacute;n
(de la red y del sistema de archivo) a sus discos desde el disco de
instalaci&oacute;n.
</p>

<ul>
<pre>
Ready to extract selected file sets? [y] <strong>&lt;Intro&gt;</strong>

/mnt2/2.6/i386/base26.tar.gz:
100% |***************************************************| 17774 KB   00:00 ETA
/mnt2/2.6/i386/etc26.tar.gz:
100% |***************************************************|   161 KB   00:00 ETA
/mnt2/2.6/i386/bsd:
100% |***************************************************|  2281 KB   00:00 ETA
/mnt2/2.6/i386/misc26.tar.gz:
100% |***************************************************|  1637 KB   00:00 ETA
/mnt2/2.6/i386/comp26.tar.gz:
100% |***************************************************| 11481 KB   00:00 ETA
/mnt2/2.6/i386/man26.tar.gz:
100% |***************************************************|  3543 KB   00:00 ETA
/mnt2/2.6/i386/xbase26.tar.gz:
100% |***************************************************|  5376 KB   00:00 ETA
/mnt2/2.6/i386/xshare26.tar.gz:
100% |***************************************************|  1482 KB   00:00 ETA
/mnt2/2.6/i386/xfont26.tar.gz:
100% |***************************************************|  6017 KB   00:00 ETA
/mnt2/2.6/i386/xserv26.tar.gz:
100% |***************************************************| 15188 KB   00:00 ETA

Extract more sets? [n] <strong>&lt;Intro&gt;</strong>
</pre>
</ul>

<p>
La elecci&oacute;n de paquetes no est&aacute; completa todav&iacute;a,
falta una biblioteca que no se encuentra en el CD y que deber&aacute;
bajarse Vd.  mismo.  Como se explica durante la instalaci&oacute;n, si
todav&iacute;a no dispone de una conexi&oacute;n de red, esta
biblioteca se puede a&ntilde;adir m&aacute;s tarde.  En este ejemplo
del proceso de instalaci&oacute;n se asume que existe la disponibilidad
de una red, y que &eacute;sta se encuentra ya preparada durante el
proceso de instalaci&oacute;n.  Lo primero que ver&aacute; es una
explicaci&oacute;n, y luego le ofrecer&aacute; la elecci&oacute;n del
paquete que desee seleccionar.  Despu&eacute;s de seleccionar el
paquete, tendr&aacute; que configurar su red.
</p>

<ul>
<pre>
Two OpenBSD libraries (libssl and libcrypto, based on OpenSSL) implement many
cryptographic functions which are used by OpenBSD programs like ssh, httpd, and
isakmpd.  Due to patent licensing reasons, those libraries may not be included
on the CD -- instead the base distribution contains libraries which have had
the troublesome code removed -- the programs listed above will not be fully
functional as a result.  Libraries which _include_ the troublesome routines
are available and can be FTP installed, as long as you meet the follow (legal)
criteria:
  (1) Outside the USA, no restrictions apply. Use ssl26.tar.gz.
  (2) Inside the USA, non-commercial entities may install sslUSA26.tar.gz.
  (3) Commercial entities in the USA are left in the cold, due to how the
      licences work.  (This is how the USA crypto export policy feels to the
      rest of the world.)

If you do not install the ssl package now, it is easily installed at
a later time (see the afterboot(8) and ssl(8) manual pages).
Install (U)SA, (I)nternational, or (N)one? [none] <strong>i</strong>
Install SSL+RSA libraries via (f)tp, (h)ttp, or (c)ancel? [ftp] <strong>f</strong>
[SNIP]
</pre>
</ul>

<p>
Es a partir de aqu&iacute; donde deber&aacute; configurar su red;  si
necesita ayuda para esta parte, lea la secci&oacute;n sobre c&oacute;mo
<a href="#1.6">Configurar la Red</a>.
Despu&eacute;s de que sus interfaces de red hayan sido correctamente
configuradas, le mostrar&aacute; una lista de servidores de ftp y sus
ubicaciones.  Debe escoger uno de ellos.
</p>

<ul>
<pre>
HTTP/FTP proxy URL? (ie. &quot;http://proxy:8080&quot;, or &quot;none&quot;) [none] <strong>&lt;Intro&gt;</strong>

By default, ftp will attempt a passive connection and fall back to a normal
(active) connection if that doesn't work.  However, there are some very
old ftp servers that claim to support passive mode, but really do not.
In this case, you should explicitly request an active session.
Do you want to use active ftp? [n] <strong>n</strong>
Do you want a list of potential ftp servers? [y] <strong>y</strong>

     1  ftp://ftp.openbsd.org/pub/OpenBSD                       Alberta, Canada
     2  ftp://ftp1.usa.openbsd.org/pub/OpenBSD                  Michigan, USA
     3  ftp://ftp.op.net/pub/OpenBSD                            Pennsylvania, USA
     4  ftp://ftp.de.openbsd.org/pub/unix/OpenBSD               Germany
     5  ftp://ftp.jp.openbsd.org/OpenBSD                        Japan
     6  ftp://ftp.dti.ad.jp/pub/OpenBSD                         Japan
     7  ftp://ftp.lip6.fr/pub/OpenBSD                           France
     8  ftp://ftp.univ-evry.fr/pub/OpenBSD                      France
[SNIP]
Server IP address, hostname, or list#? [] <strong>1</strong>
Using   ftp://ftp.openbsd.org/pub/OpenBSD                       Alberta, Canada
Server IP address, hostname, or list#? [ftp.openbsd.org] <strong>&lt;Intro&gt;</strong>
Server directory? [pub/OpenBSD/2.6/i386] <strong>&lt;Intro&gt;</strong>
Login? [anonymous] <strong>&lt;Intro&gt;</strong>

You will now be asked for files to extract. In addition to the files listed,
you may select any file located at ftp.openbsd.org:pub/OpenBSD/2.6/i386
You can also enter 'all' to install all the standard sets, or 'list' to list
the files available. When you are done selecting files, enter 'done'. Some of
these sets are required for your install and some are optional -- you will want
at least the base and bsd sets. Consult the installation notes if you are not
sure which sets are required!

The following sets are available for extraction.
Enter filename, `list', `all', or `done'.
You may de-select a set by prepending a '-' to its name.

        [X] ssl26.tar.gz
File name? [] <strong>done</strong>

Fetching files via ftp may take a long time, especially over a slow network
connection.  Ready to download files? [y] <strong>y</strong>

Getting ssl26.tar.gz ...
100% |**************************************************|  1522 KB    00:00 ETA

Copying hostname.xl0, hosts, myname, mygate, resolv.conf,  ...done.
</pre>
</ul>

<p>
Una vez haya terminado con esto, todo lo que le resta por hacer es
configurar su franja horaria e instalar los bloques de arranque.  La
configuraci&oacute;n de la franja horaria es muy f&aacute;cil.
S&oacute;lo tiene que escoger la zona en que vive e introducir el
nombre.  ¡Eso es todo!  S&oacute;lo le falta decidir si va a instalar
X.  Si cree que en alg&uacute;n momento puede necesitar X, escoja
<strong>yes</strong>; en caso contrario es posible que deba cambiar
<strong>machdep.allowaperture=0</strong> por
<strong>machdep.allowaperture=1</strong> en su fichero de
configuraci&oacute;n <i>/etc/sysctl.conf</i>.  Despu&eacute;s de haber
hecho esto, escriba 'reboot' en el punto de pedido de la shell, y su
m&aacute;quina se iniciar&aacute; con OpenBSD.
</p>

<ul>
<pre>
Select a time zone for your location. Timezones are represented on the
system by a directory structure rooted in &quot;/usr/share/timezone&quot;. Most
timezones can be selected by entering a token like &quot;MET&quot; or &quot;GMT-6&quot;.
Other zones are grouped by continent, with detailed zone information
separated by a slash (&quot;/&quot;), e.g. &quot;US/Pacific&quot; or &quot;Canada/Mountain&quot;.

To get a listing of what's available in /usr/share/zoneinfo, enter &quot;?&quot;
at the prompts below.

What timezone are you in [`?' for list] [GMT]? <strong>?</strong>
Africa/      Chile/       GMT          Jamaica      Navajo       UCT
America/     Cuba         GMT+0        Japan        PRC          US/
Antarctica/  EET          GMT-0        Kwajalein    PST8PDT      UTC
Arctic/      EST          GMT0         Libya        Pacific/     Universal
Asia/        EST5EDT      Greenwich    MET          Poland       W-SU
Atlantic/    Egypt        HST          MST          Portugal     WET
Australia/   Eire         Hongkong     MST7MDT      ROC          Zulu
Brazil/      Etc/         Iceland      Mexico/      ROK          posixrules
CET          Europe/      Indian/      Mideast/     Singapore
CST6CDT      Factory      Iran         NZ           SystemV/
Canada/      GB           Israel       NZ-CHAT      Turkey
What timezone are you in [`?' for list] [GMT]? <strong>Canada</strong>
There are several timezones available within zone 'Canada'
Select a sub-timezone [`?' for list]: <strong>?</strong>
Atlantic            Eastern             Pacific
Central             Mountain            Saskatchewan
East-Saskatchewan   Newfoundland        Yukon
Select a sub-timezone [`?' for list]: <strong>Mountain</strong>
You have selected timezone &quot;Canada/Mountain&quot;.
Installing timezone link...done.
Installing boot block...
boot: /mnt/boot
proto: /usr/mdec/biosboot
device: /dev/rwd0c
/usr/mdec/biosboot: entry point 0
proto bootblock size 512
room for 12 filesystem blocks at 0x16f
Will load 6 blocks of size 8192 each.
Using disk geometry of 63 sectors and 128 heads.
 0: 19 @(0 93 45) (5903-5921)
 1: 63 @(0 94 1) (5922-5984)
 2: 14 @(0 95 1) (5985-5998)
/mnt/boot: 3 entries total
using MBR partition 3: type 166 (0xa6) offset 63 (0x3f)

Do you expect to run X windows on this machine? [y or n] <strong>y</strong>
Enabling machdep.allowaperture. Read xf86(4) for more information.

Making all device nodes (by running /dev/MAKEDEV) ...... done.
Unmounting filesystems... /mnt/usr /mnt/var /mnt/tmp /mnt ... Done.
Done.

CONGRATULATIONS!  You have successfully installed OpenBSD!  To boot the
installed system, enter halt at the command prompt. Once the system has
halted, reset the machine and boot from the disk.

# <strong>reboot</strong>
</pre>
</ul>

<p>
<a name="1.13"></a>
<h2>Notas Post-Inicio</h2>

<p>
Esperamos que esta secci&oacute;n le gu&iacute;e por pistas sobre lo
que debe hacer al principio justo despu&eacute;s de haber instalado su
sistema OpenBSD.  Esta parte est&aacute; basada principalmente en la
p&aacute;gina de manual
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&sektion=8&format=html">afterboot(8)</a>,
que sin lugar a dudas marca los primeros pasos a seguir despu&eacute;s
de haber instalado e iniciado OpenBSD.  La tabla que sigue a
continuaci&oacute;n le muestra las secciones relevantes en las
preguntas frecuentes.
</p>

<ul>
<li><a href="faq10.html#10.8">A&ntilde;adir Usuarios en OpenBSD</a> 
<li><a href="faq6.html#6.1">Configuraci&oacute;n Inicial de la Red</a>
<li><a href="faq2.html#2.3">P&aacute;ginas de Manual para
     &oacute;rdenes importantes o &uacute;tiles</a>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi">P&aacute;ginas de
    Manual de OpenBSD en la &quot;Web&quot;</a>
<li><a href="faq8.html#8.7">Paquetes de OpenBSD</a> - Paquetes de
    Binarios Precompilados.
</ul>

<p>
Queremos recordar a los usuarios que es importante para los
desarrolladores de OpenBSD el poder llevar un seguimiento del hardware
que funcione, as&iacute; como del hardware que no funcione bien...
</p>

<p>
Una traducci&oacute;n de una cita en el fichero
/usr/src/etc/root/root.mail

<pre>
Si desean asegurarse de que OpenBSD funcione mejor en sus m&aacute;quinas, 
por favor (¡despu&eacute;s de haber configurado su sistema de correo 
electr&oacute;nico!) de ejecutar desde la l&iacute;nea de &oacute;rdenes
	dmesg | mail dmesg@openbsd.org
para que podamos ver los tipos de configuraciones que tienen los usuarios.
Usaremos esta informaci&oacute;n para mejorar el soporte de los dispositivos de
control en versiones venideras (esta informaci&oacute;n nos servir&aacute; si 
nos la proveen con el n&uacute;cleo GENERIC que viene en la instalaci&oacute;n, 
no con un n&uacute;cleo compilado a medida).  La informaci&oacute;n sobre 
dispositivos de control que obtengamos de aqu&iacute; nos ayudar&aacute; a 
arreglar los dispositivos ya existentes.
</pre>

Revise tambi&eacute;n la <a href="faq14.html#14.7">secci&oacute;n
14.7</a> de las preguntas frecuentes.
</p>

<p>
Aseg&uacute;rese de que nos env&iacute;a el mensaje desde una cuenta en
la que tambi&eacute;n pueda recibir correo, para que los
desarrolladores puedan contactar con Vd si hubiera algo que quisieran
comprobar o cambiar con el fin de afinar su configuraci&oacute;n.  No
es importante que env&iacute;e el mensaje desde la misma m&aacute;quina
en la que est&eacute; instalado OpenBSD;  si desde esa m&aacute;quina
no puede recibir correo, puede hacer lo siguiente

<pre>
 dmesg | mail su-cuenta@sucorreo.dom
</pre>

y reenviar el mensaje a

<pre>
 dmesg@openbsd.org
</pre>

en donde <kbd>su-cuenta@sucorreo.dom</kbd> es su cuenta de correo
normal (o puede transferir la salida de dmesg usando ftp, scp,
disquete, paloma mensajera, etc... )
</p>

<p>
<strong>NOTA</strong> - Por favor, env&iacute;e s&oacute;lo el dmesg
correspondiente a un n&uacute;cleo GENERIC.  Los n&uacute;cleos a
medida en los que se han eliminado dispositivos de control no son de
ninguna ayuda.
</p>

<p>
<a name="1.14"></a>
<h2>Otros Recursos de Informaci&oacute;n y Preguntas Comunes</h2>

<ul>
Para aquellos usuarios que tengan m&aacute;quinas con arquitecturas
diferentes, existen otros documentos.  Puede obtenerlos desde
cualquiera de las r&eacute;plicas del servidor de ftp, en el directorio
<code>ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/</code>.

<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.i386">INSTALL.i386</a> - Extenso documento de instalaci&oacute;n.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.linux">INSTALL.linux</a> - Instalaci&oacute;n de OpenBSD junto con Linux.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.mbr">INSTALL.mbr</a> - Explicaci&oacute;n del Master Boot Record.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.pt">INSTALL.pt</a> - Explicaci&oacute;n de las Tablas de Partici&oacute;n.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.dbr">INSTALL.dbr</a> - Sector de Arranque de Disquetes en DOS.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.chs">INSTALL.chs</a> - Explicaci&oacute;n de la Traducci&oacute;n CHS.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.ata">INSTALL.ata</a> - Preguntas Frecuentes sobre ATA, ATA-1, ATA-2, IDE. EIDE, etc.
<li><a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.6/i386/INSTALL.os2br">INSTALL.os2br</a> - Sector de Arranque de os/2.
</ul>

<p>
<strong>Pregunta:</strong> - &iquest;Es posible obtener una imagen ISO
de OpenBSD?
</p>

<p>
<strong>Respuesta:</strong> - No.
Los derechos de autor de la composici&oacute;n del CDROM oficial de
OpenBSD pertenecen a Theo de Raadt, a modo de incentivo para que
compren los CDs.  N&oacute;tese que estos derechos s&oacute;lo son
aplicables a la composici&oacute;n del CDROM, y que OpenBSD en
s&iacute; mismo es libre.  No hay nada que pueda impedir que alguien
coja OpenBSD y haga su propio CD.
</p>

<a name="8meg"></a>
<p>
<strong>Pregunta:</strong> - Tengo problemas de instalaci&oacute;n con
8MB de RAM.  &iquest;Qu&eacute; puedo hacer?
</p>

<p>
<strong>Respuesta:</strong> - Muchos usuarios tienen problemas al final
de la instalaci&oacute;n porque el sistema se les cuelga en <i>MAKEDEV
all ...</i>.  Existe una soluci&oacute;n a este problema.  Debe activar
el sistema de archivo de swap durante la instalaci&oacute;n.  Para
ello, siga los pasos que vienen a continuaci&oacute;n:
</p>

<ul>
<li>Comience la instalaci&oacute;n normalmente.
<li>Configure sus discos con
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&sektion=8">fdisk(8)</a>
    y
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&sektion=8">disklabel(8)</a>
    como se ha descrito anteriormente.
<li>Una vez que sus discos est&eacute;n configurados, y DESPU&Eacute;S
    de que hayan sido formateados, pulse <kbd>&lt;CNTRL&gt;-C</kbd>
    para salir a la shell.
<li>Reinicie el sistema con <kbd>reboot</kbd>.
<li>Esta vez, evite las secciones
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&sektion=8">fdisk(8)</a>
    y
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&sektion=8">disklabel(8)</a>.
    Esto lo puede hacer desde fdisk(8) escribiendo <i>exit</i>, y desde
    disklabel(8) escribiendo <i>q</i>.

<li>Proceda con la instalaci&oacute;n hasta que haya completado la
    <b>Secci&oacute;n sobre Redes</b> de la instalaci&oacute;n.
    <b>NOTA:</b>  Esto es despu&eacute;s de que todos los paquetes
    hayan sido instalados.  Cuando llegue a este punto, escriba
    <i>&lt;CNTRL&gt;-z</i>, y saldr&aacute; al &laquo;int&eacute;rprete
    de &oacute;rdenes&raquo; (&quot;shell&quot;). 

<li>Es desde aqu&iacute; desde donde tendr&aacute; que activar swap.
    Para ello escriba <kbd>/mnt/sbin/swapon wd0b</kbd>, o sd0b, o 
    cualquiera que sea su dispositivo de swap.
<ul>
<li>Si no lo encuentra, monte su disco ra&iacute;z en <i>/mnt</i>.
</ul>
<li>Para proceder con el resto de la instalaci&oacute;n escriba 
    <kbd>fg</kbd>.
</ul>

<p>
Si ha seguido estas instrucciones y a&uacute;n tiene problemas,
env&iacute;e un mensaje a 
<a href="mailto:ericj@openbsd.org">Eric Jackson &lt;ericj@openbsd.org&gt;</a>.
</p>

<p>
<hr>

<font color="#0000e0">
<a href="index.html">[Volver al &Iacute;ndice Principal]</a>
<a href="faq4.html">[Secci&oacute;n 4.0 - Gu&iacute;a de Instalaci&oacute;n]</a>
<a href="faq6.html">[Secci&oacute;n 6.0 - Redes]</a>
</font>
</p>

<a href="index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="[&iacute;ndice]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: install-i386.html,v 1.25 2000/06/03 04:59:56 chris Exp ]<br>
$Translation: install-i386.html,v 1.16 2000/06/04 23:33:34 horacio Exp $<br>
$OpenBSD: install-i386.html,v 1.9 2000/06/11 15:53:43 wvdputte Exp $
</small>
</p>


</body>
</html>
