<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
 <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <meta http-equiv="Content-Language" content="es">

 <title>Gu&iacute;a de actualizaci&oacute;n de OpenBSD</title>
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<h1>Gu&iacute;a de actualizaci&oacute;n de OpenBSD</h1>

<h2>&Uacute;ltima versi&oacute;n de OpenBSD: 3.2</h2>

<address>
<p>
Kjell Wooding 
&lt;<a href="mailto:kjell@openbsd.com">kjell@openbsd.org</a>&gt; <br>
Updated:
$OpenBSD: upgrade-minifaq.html,v 1.63 2003/04/17 19:34:12 jufi Exp $</p>
</p>
</address>

<br>

<blockquote>
<p>
Con esta gu&iacute;a minimalista se pretende aclarar los problemas
m&aacute;s comunes que aparecen cuando se lleva a cabo una
actualizaci&oacute;n entre versiones finales de OpenBSD
(<em>-release</em>), o desde una versi&oacute;n final a una
versi&oacute;n en desarrollo (<em>-current</em>).  Aunque ya no sea un
&laquo;mini-documento&raquo;, todav&iacute;a mantiene el nombre de
<em>Mini-FAQ</em> por varios motivos.  La informaci&oacute;n que trata
sobre versiones m&aacute;s antiguas a las que aqu&iacute; aparecen se
puede encontrar en <a href="upgrade-old.html">un documento separado</a>.
</p>
</blockquote>

<p>
Esta gu&iacute;a de actualizaci&oacute;n es para <strong>Usuarios
Avanzados</strong>.  Si se es un principiante <strong>o todav&iacute;a
no se tiene mucha experiencia</strong> en el manejo del compilador y las
herramientas, no recomendamos la actualizaci&oacute;n mediante el
c&oacute;digo fuente.  Es mejor intentar instalar una versi&oacute;n
binaria final o preliminar, y despu&eacute;s aplicar las instrucciones
que se dan para la actualizaci&oacute;n de <tt>/etc</tt>.
</p>

<h2>Instrucciones generales para la actualizaci&oacute;n del
sistema</h2>

<p>
<a href="#1.1">
1.1: Terminolog&iacute;a.  &iquest;Qu&eacute; es <em>-current</em>?
&iquest;Qu&eacute; son los <em>snapshots</em>?  &iquest;Qu&eacute; es
<em>-stable</em>?
</a><br>

<a href="#1.2">
1.2: &iquest;Cu&aacute;l es la forma m&aacute;s sencilla de actualizar a
<em>-current</em>?
</a><br>

<a href="#1.3">
1.3: No puedo encontrar ning&uacute;n <em>snapshot</em> en el servidor
de FTP.  &iquest;D&oacute;nde est&aacute;n?
</a><br>

<a href="#1.4">
1.4: &iquest;C&oacute;mo puedo obtenet el c&oacute;digo fuente
m&aacute;s reciente?
</a><br>

<a href="#1.5">
1.5: Ya tengo el &aacute;rbol de fuentes, &iquest;c&oacute;mo lo
compilo?
</a><br>

<a href="#1.6">
1.6: 'make build' par&oacute; en la mitad del proceso, &iquest;tengo que
compilarlo todo de nuevo?
</a><br>

<a href="#1.7">
1.7: El proceso de compilaci&oacute;n produce errores,
&iquest;qu&eacute; debo hacer?
</a><br>

<a href="#1.8">
1.8: &iquest;Hay alg&uacute;n procedimiento preestablecido para
actualizar el compilador <em>gcc</em>?  versi&oacute;n m&aacute;s nueva.
</a><br>

<a href="#1.9">
1.9: &iquest;Cu&aacute;l es la mejor forma de actualizar <em>/etc</em>,
<em>/var</em>, y <em>/dev</em>?
</a><br>

<a href="#1.10">
1.10: &iquest;C&oacute;mo hago para eliminar todo lo sobrante de la
compilar desde el &aacute;rbol de fuentes?
</a><br>

<a href="#1.11">
1.11: &iquest;Es necesario ser el superusuario (<em>root</em>) para
ejecutar 'make build'?
</a><br>

<a href="#1.12">
1.12: &iquest;Por qu&eacute; no veo ning&uacute;n dispositivo nuevo?
</a><br>

<a href="#1.13">
1.13: &iquest;Hay alguna manera sencilla de llevar a cabo todos los
cambios en la jerarqu&iacute;a de archivos?
</a><br>

<a href="#1.14">
1.14: Despu&eacute;s de actualizar, <em>ps</em> produce el siguiente
error: &quot;proc size mismatch&quot;.
</a><br>

<a href="#1.15">
1.15: &iquest;C&oacute;mo puedo actualizar el sistema con la
&uacute;ltima versi&oacute;n preliminar (<em>snapshot</em>)?</a><br>
</p>

<h2>C&oacute;mo actualizar desde la versi&oacute;n 3.2</h2>

<p>
<a href="#3.2.1">3.2.1: Nuevo Perl</a><br>
<a href="#3.2.2">3.2.2: Nuevos grupos _radius, _token y _shadow</a><br>
<a href="#3.2.3">3.2.3: Cambios importantes en el compilador</a><br>
<a href="#3.2.4">3.2.4: Nuevo usuario y grupo _spamd</a><br>
<a href="#3.2.5">3.2.5: Alias para ipv6-icmp</a><br>
<a href="#3.2.6">3.2.6: Nuevo grupo _lkm</a><br>
<a href="#3.2.7">3.2.7: Nuevo libpthread</a><br>
<a href="#3.2.8">3.2.8: Cambios en el enlazador para las arquitecturas
ELF</a><br>
<a href="#3.2.9">3.2.9: Fusionados los cambios de /var/at y
crontab</a><br>
</p>

<h2>C&oacute;mo actualizar desde la versi&oacute;n 3.1</h2>

<p>
<a href="#3.1.1">3.1.1: Nuevos usuarios/grupos</a><br>
<a href="#3.1.2">3.1.2: Nuevo grupo para crontab(1) y at(1)</a><br>
<a href="#3.1.3">3.1.3: Nuevo Binutils</a><br>
<a href="#3.1.4">3.1.4: Nueva configuraci&oacute;n para S/Key</a><br>
<a href="#3.1.5">3.1.5: Nuevos permisos para lp*</a><br>
<a href="#3.1.6">3.1.6: atrun(8) ya no es necesario</a><br>
<a href="#3.1.7">3.1.7: nat.conf fusionado con pf.conf</a><br>
<a href="#3.1.8">3.1.8: Nueva entrada en fbtab necesaria para
xdm</a><br>
<a href="#3.1.9">3.1.9: Uso de __attribute__((sentinel)) en ciertas
funciones</a><br>
</p>

<h2>Actualizaci&oacute;n desde la versi&oacute;n 3.0</h2>

<p>
<a href="#3.0.1">
3.0.1: Soporte de nueva clave por mtree(8)
</a><br>

<a href="#3.0.2">
3.0.1: Eliminaci&oacute;n de <em>libdl</em> en plataformas ELF
</a><br>

<a href="#3.0.3">
3.0.2: Nuevo marco de regresi&oacute;n
</a><br>

<a href="#3.0.4">
3.0.3: ficheros de configuraci&oacute;n de ssh traspasados a
<em>/etc/ssh/</em>
</a><br>
</p>


<h2>C&oacute;mo actualizar desde la versi&oacute;n 2.9</h2>

<p>
<a href="#2.9.1">
2.9.1: Nuevos usuarios/grupos - <em>proxy</em>, <em>smmsp</em> y
<em>popa3d</em>
</a> <br>

<a href="#2.9.2">
2.9.2: Nuevo filtro de paquetes IP
</a> <br>

<a href="#2.9.3">
2.9.3: Cambios en <em>make</em>
</a> <br>

<a href="#2.9.4">
2.9.4: Fallo de compilaci&oacute;n a causa de KerberosV
</a> <br>

<a href="#2.9.5">
2.9.5: La nueva versi&oacute;n de sendmail
</a> <br>

<a href="#2.9.6">
2.9.6: Cambio en <em>/etc/primes</em>
</a>
</p>


<h2>C&oacute;mo actualizar desde versiones anteriores</h2>

<p>
La informaci&oacute;n sobre la actualizaci&oacute;n para las versiones
2.3 hasta la 2.8 de OpenBSD se encuentra en un
<a href="upgrade-old.html">documento separado</a>.
</p>


&nbsp;<hr width="30%">

<a name="1.0"></a>
<h2>Preguntas generales sobre la actualizaci&oacute;n</h2>


<a name="1.1"></a>
<h3>
1.1: Terminolog&iacute;a. &iquest;Qu&eacute; es <em>-current</em>?
&iquest;Qu&eacute; son los <em>snapshots</em>?  &iquest;Qu&eacute; es
<em>-stable</em>?
</h3>

<p>
Con anterioridad a OpenBSD 2.7, el desarrollo de OpenBSD ten&iacute;a
lugar desde un s&oacute;lo &aacute;rbol de fuentes sin ramificaciones.
A partir de la versi&oacute;n 2.7 se introdujo una ramificaci&oacute;n
de parches.
</p>

<p>
Las <strong>versiones finales</strong> (<em>-release</em>) de OpenBSD se
producen con intervalos aproximados de seis meses.  &Eacute;stas se
enumeran en un modo convencional (2.x, 3.x).  La versi&oacute;n final
actual de OpenBSD se indica al principio de este documento.
</p>

<p>
<em>-current</em> es la forma de abreviada de <em>openbsd-current</em>,
la <strong>versi&oacute;nd de desarrollo</strong>, se refiere a la
versi&oacute;n de &uacute;ltima hora en el &aacute;rbol de fuentes del
repositorio de CVS.  &Eacute;ste es el &aacute;rbol que usan con
m&aacute;s asiduidad los desarrolladores de OpenBSD.  El &aacute;rbol de
<em>-current</em> contiene todo el c&oacute;digo que est&aacute;
planeado para el lanzamiento de la siguiente versi&oacute;n final.  De
vez en cuando, algunos valientes abandonan las versiones oficiales y
utilizan la versi&oacute;n de desarrollo, <em>-current</em>,
generalmente para aprovechar funcionalidades que todav&iacute;a no se
han implementado en las versiones finales.  Sin embargo, debido a su
naturaleza de incertidumbre, la actualizaci&oacute;n a <em>-current</em>
no es recomendable para usuarios no t&eacute;cnicos.
</p>

<p>
Entre una versi&oacute;n final y otra, creamos unas <strong>versiones
preliminares</strong>
(<em><a href="ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/">
snapshots</a></em>).  &Eacute;stas son <em>revisiones
instant&aacute;neas</em> del &aacute;rbol de fuentes de
<em>-current</em>.  Debido a que son un reflejo del estado actual de
desarrollo, no se puede garantizar que estas versiones preliminares
funcionen correctamente... ni siquiera que funcionen.  Las versiones
preliminares son bastante &uacute;tiles cuando se est&aacute;
actualizando desde una versi&oacute;n final (o una versi&oacute;n de
desarrollo m&aacute;s antigua) a la del &aacute;rbol de desarrollo.  Si
el sistema del que se dispone es el de la versi&oacute;n de desarrollo,
es muy recomendable seguir la <a href="../../es/mail.html">lista de
correo</a> <em>source-changes</em>.  Los mensajes de los cambios en el
c&oacute;digo suelen contener informaci&oacute;n valiosa sobre las
&uacute;ltimas funcionalidades a&ntilde;adidas.
</p>

<p>
A partir de OpenBSD 2.7 se introdujo una 
<a href="../../es/stable.html"><strong>versi&oacute;n
estable</strong></a> (<em>-stable</em>).  &Eacute;sta es una
ramificaci&oacute;n de la versi&oacute;n final (<em>-release</em>) base
y cualquier otro parche o modificaci&oacute;n importante (se consideran
importantes los parches publicados en la p&aacute;gina de
<a href="../../es/errata.html">erratas</a>, adem&aacute;s de otros que
son obvios y simples pero que no merecen ser mencionados en dicha
p&aacute;gina).
</p>

<p>
El <a href="../../es/ports.html">&aacute;rbol de portes</a> es una parte
integral del sistema.  Cada vez que se actualice el sistema,
tambi&eacute;n hay que actualizar los portes, siguiendo las mismas
reglas que existen para la actualizaci&oacute;n del resto de las partes;
o sea, si el sistema es <em>-stable</em> los portes tambi&eacute;n deben
ser <em>-stable</em>, y si el sistema es <em>-current</em> los portes
s&oacute;lo deben ser <em>-current</em>.
</p>

<a name="1.2"></a>
<h3>
1.2: &iquest;Cu&aacute;l es la forma m&aacute;s sencilla de actualizar a
<em>-current</em>?
</h3>

<p>
Debido a cambios en las bibliotecas de base, actualizar de una
versi&oacute;n final (<em>-release</em>) a otra de desarrollo
(<em>-current</em>) no siempre es f&aacute;cil.  La forma m&aacute;s
dif&iacute;cil de actualizar a <em>-current</em> es
<a href="#1.15">actualizar primero a la revisi&oacute;n preliminar
(<em>snapshot</em>) m&aacute;s reciente</a>.  Una vez el
<em>snapshot</em> ha sido instalado, se pueden
<a href="#1.4">obtener</a> los fuentes m&aacute;s recientes y
<a href="#1.5">compilarlos</a>.  Este procedimiento deber&iacute;a
eliminar la mayor&iacute;a de problemas con las bibliotecas y las
herramientas necesarias.
</p>

<a name="1.3"></a>
<h3>
1.3: No puedo encontrar ning&uacute;n <em>snapshot</em> en el servidor
de FTP.  &iquest;D&oacute;nde est&aacute;n?
</h3>

<p>
Los <em>snapshot</em> se pueden retirar seg&uacute;n se vayan quedando
anticuados (o seg&uacute;n dejen de ser relevantes).  Si no hay
ning&uacute;n <em>snapshot</em> disponible, entonces se debe actualizar
a la versi&oacute;n m&aacute;s reciente y compilar lo restante desde el
c&oacute;digo fuente.
</p>

<a name="1.4"></a>
<h3>
1.4: &iquest;C&oacute;mo obtengo el c&oacute;digo fuente m&aacute;s
reciente?
</h3>

<p>
Respuesta corta:
<a href="../../es/anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a>
</p>

<p>
Por ejemplo, para obtener el &aacute;rbol completo mediante CVS (usando
la shell ksh;  para otras hay que sustituir <em>export</em> por
<em>setenv</em>):
</p>

<pre>
# export CVSROOT=anoncvs@anoncvs.ca.openbsd.org:/cvs
# export CVS_RSH=/usr/bin/ssh
# cd /usr
# cvs -q get -P src
</pre>

<p>
N&oacute;tese que con esto se obtendr&aacute; la versi&oacute;n de
desarrollo (<em>-current</em>).  Para obtener otra versi&oacute;n, por
</p>

<pre>
  # cvs -q get -rOPENBSD_3_2 -P src
</pre>

<a name="1.5"></a>
<h3>
1.5: Ya tengo el &aacute;rbol de fuentes, &iquest;c&oacute;mo lo
compilo?
</h3>

<p>
Hay unas instrucciones b&aacute;sicas en
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/Makefile">
<tt>/usr/src/Makefile</tt></a>.
&Eacute;sta es una versi&oacute;n ligeramente extendida.
</p>

<ol>
<li>
<p>Limpiar los ficheros objeto (<em>/usr/obj/</em>) antiguos.</p>

<p>Si se hab&iacute;a creado un directorio <em>/usr/obj</em> separado,
hay que limpiarlo y reconstruir los enlaces simb&oacute;licos:</p>

<pre>
# rm -rf /usr/obj/*
# cd /usr/src
# make obj
</pre>

<p>
Si hay que realizar este paso muchas veces, puede ser mucho m&aacute;s
r&aacute;pido poner <em>/usr/obj</em> en la partici&oacute;n y usar
<kbd>newfs</kbd> en lugar de <kbd>rm</kbd>.  Por ejemplo, lo que yo hago
es:
</p>

<pre>
# umount /usr/obj
# newfs wd0h
# mount /usr/obj
# make obj
</pre>

<p>
Si se est&aacute; preocupado porque pueda haber ficheros objeto en el
&aacute;rbol de fuentes, se puede hacer lo siguiente:
</p>

<pre>
# cd /usr/src
# find . -type l -name obj | xargs rm
# make cleandir
# rm -rf /usr/obj/*
# make obj
</pre>
</li>

<li>
<p>Hay que llevar a cabo cualquier cambio de configuraci&oacute;n
espec&iacute;fico para la versi&oacute;n.  Por ejemplo, los usuarios de
la versi&oacute;n 2.3 deben a&ntilde;adir el usuario y el grupo
<strong>named</strong> antes de actualizar a la versi&oacute;n 2.4 o
posterior.  Es recomendable leer la secci&oacute;n espec&iacute;fica
para la versi&oacute;n concreta que se encuentra en este documento.</p>
</li>

<li>
<p>Es preciso asegurarse de que todos los directorios apropiados hayan
sido creados.  Esto es muy importante cuando se actualiza desde
versiones m&aacute;s antiguas, pero a veces necesario en otros casos.
La forma m&aacute;s f&aacute;cil de hacerlo es:</p>

<pre>
# cd /usr/src/etc &amp;&amp; make DESTDIR=/ distrib-dirs
</pre>
</li>

<li>
<p>A continuaci&oacute;n se compilar&aacute; un nuevo n&uacute;cleo
(<em>kernel</em>):</p>

<pre>
  # cd /usr/src/sys/arch/`machine`/conf
</pre>

La mayor&iacute;a de usuarios utilizar&aacute;n GENERIC:

<pre>
  # config GENERIC
  # cd ../compile/GENERIC
</pre>

<p><strong>NOTA:</strong> los usuarios a quienes les guste sufrir pueden
compilar un n&uacute;cleo personalizado en lugar de usar el
n&uacute;cleo GENERIC.  En este caso es mejor empezar con GENERIC e ir
modific&aacute;ndolo.  Para ello hay que hacer lo siguiente:</p>

<pre>
# cp GENERIC MYKERNEL
# vi MYKERNEL
(edite MYKERNEL seg&uacute;n le convenga)
# config MYKERNEL
# cd ../compile/MYKERNEL
</pre>

<p>Finalmente, para todos:</p>

<pre>
# make clean &amp;&amp; make depend &amp;&amp; make
(s&oacute;lo en la arquitectura arc) copie bsd.ecoff en su partici&oacute;n FAT
# cp /bsd /bsd.old &amp;&amp; cp bsd /bsd
# chown root:wheel /bsd (si lo ha compilado como otro usuario)
(reinicie)
</pre>
</li>

<li>
<p>A continuaci&oacute;n se compilar&aacute; el sistema:</p>

<pre>
# cd /usr/src
# make build
</pre>
</li>

<li>
<p><em>/etc</em> y <em>/dev</em> se actualizan a mano.  Estos ficheros
no se actualizan de forma autom&aacute;tica.  Hay que escoger un
directorio con espacio suficiente para <em>/</em>, <em>/dev</em>,
<em>/var</em>, y <em>/etc</em>.  En este ejemplo usar&eacute;
<em>/home/newroot</em>:</p>

<pre>
# mkdir /home/newroot          
# export DESTDIR=/home/newroot
# cd /usr/src/etc &amp;&amp; make distribution-etc-root-var
</pre>

<p>Ahora comparemos los ficheros en <em>/home/newroot</em> con sus
correspondientes ya instalados, y reemplazaremos o actualizaremos los
ficheros seg&uacute;n sea necesario.</p>

<pre>
# rm -rf /home/newroot   (cuando haya acabado)
</pre>
</li>

<li>
<p>Finalemente reiniciaremos el sistema para asegurarnos de que los
nuevos ficheros en <em>/etc</em> sean los correctos.</p>
</li>
</ol>

<a name="1.6"></a>
<h3>
1.6: 'make build' se par&oacute; en la mitad del proceso, &iquest;tengo
que hacerlo todo de nuevo?
</h3>

<p>
Yo lo har&iacute;a, pero si realmente quiere retomarlo desde el punto en
que se qued&oacute;, haga lo siguiente:
</p>

<pre>
# cd /usr/src
# make -n build
</pre>

<p>
De este modo le mostrar&aacute; lo que 'make build' est&eacute;
haciendo.  Por ejemplo, el m&iacute;o dice:
</p>

<pre>
  (cd /usr/src/share/mk &amp;&amp;  make install)
  (cd /usr/src/include; make prereq;  make includes)
  make cleandir
  (cd /usr/src/lib &amp;&amp; make depend &amp;&amp; make &amp;&amp;   make install)
  (cd /usr/src/gnu/lib &amp;&amp; make depend &amp;&amp; make &amp;&amp;   make install)
  (cd /usr/src/kerberosIV/lib &amp;&amp; make depend &amp;&amp; make &amp;&amp;   make install)
  (cd /usr/src/gnu/usr.bin/perl &amp;&amp; make -f Makefile.bsd-wrapper config.sh &amp;&amp;
  make -f Makefile.bsd-wrapper depend &amp;&amp;
  make -f Makefile.bsd-wrapper perl.lib &amp;&amp;
  make -f Makefile.bsd-wrapper install.lib)
  make depend &amp;&amp; make &amp;&amp;  make install
</pre>

<p>
Para empezar desde donde se qued&oacute;, vuelva a invocar las
&oacute;rdenes desde el punto en donde se cort&oacute; la
compilaci&oacute;n.
</p>

<p>
Si tiene que realizar este procedimiento muchas veces, es posible que le
convenga crear un nuevo objetivo en su fichero makefile.  S&oacute;lo
tiene que copiar la entrada para <em>build</em> (a
<em>build-noclean</em>, por ejemplo), y eliminar la referencia <em>make
cleandir</em>.
</p>

<a name="1.7"></a>
<h3>
1.7: El proceso de compilaci&oacute;n produce errores,
&iquest;qu&eacute; puedo hacer?
</h3>

<p>
Si <em>make build</em> finaliza con un error, es muy posible que se deba
a que no elimin&oacute; sus ficheros objeto antiguos antes de
recompilar.  Lea la <a href="#1.5">secci&oacute;n 1.5</a> para
m&aacute;s detalles sobre c&oacute;mo limpiar esos ficheros.
</p>

<p>
Si est&aacute; seguro de que su &aacute;rbol est&aacute; limpio de
viejos restos, y a&uacute;n as&iacute; recibe un error de
compilaci&oacute;n, es que ha ocurrido una de las siguientes tres cosas:
</p>

<ol>
<li>
Se ha encontrado con un problema de actualizaci&oacute;n conocido.
Aseg&uacute;rese de haber leido la secci&oacute;n apropiada de este
documento, y de haber seguido las instrucciones con cuidado.
</li>

<li>
Se ha encontrado con un problema de actualizaci&oacute;n nuevo.  Esto es
lo que pasa cuando se vive peligrosamente.  Busque entre los mensajes
m&aacute;s recientes a las listas <a href="../../es/mail.html">misc@ y
tech@</a> una posible soluci&oacute;n.
</li>

<li>
Alguien ha &laquo;roto&raquo; temporalmente el &aacute;rbol de fuentes.
Esto es muy poco com&uacute;n, y por lo general se soluciona
inmediatamente.  Espere unas pocas horas y vuelva a obtener el
&aacute;rbol de fuentes.  Si no puede esperar, intente bajarse un
&aacute;rbol con uno o dos d&iacute;as de antelaci&oacute;n.
</li>
</ol>

<p>
Si ya ha probado todas las alternativas anteriores y su problema
persiste durante m&aacute;s de un par de d&iacute;as, env&iacute;e un
informe sobre su problema a misc@openbsd.org.  Aseg&uacute;rese de
incluir los mensajes de error relevantes, as&iacute; como cualquier
peculiaridad de su configuraci&oacute;n.
</p>

<a name="1.8"></a>
<h3>
1.8: Estoy actualizando el compilador (<em>gcc</em>) a una
versi&oacute;n m&aacute;s nueva.  &iquest;Hay alg&uacute;n procedimiento
para el sistema de arranque?
</h3>

<p>
Debido a que la actualizaci&oacute;n de un compilador es como &laquo;el
problema del huevo y la gallina&raquo;, los cambios al compilador
original del &aacute;rbol requieren que se les preste algo m&aacute;s de
atenci&oacute;n.  Por regla general se seguir&aacute; este
procedimiento:
</p>

<p>
(... y s&iacute;, se compilar&aacute; dos veces)
</p>

<pre>
  # rm -r /usr/obj/gnu/egcs/gcc/*
  # cd /usr/src/gnu/egcs/gcc
  # make -f Makefile.bsd-wrapper clean
  # make -f Makefile.bsd-wrapper obj
  # make -f Makefile.bsd-wrapper depend
  # make -f Makefile.bsd-wrapper 
  # make -f Makefile.bsd-wrapper install
  # make -f Makefile.bsd-wrapper clean
  # make -f Makefile.bsd-wrapper depend
  # make -f Makefile.bsd-wrapper 
  # make -f Makefile.bsd-wrapper install
</pre>

<p>
y a continuaci&oacute;n ejecute un <kbd>make build</kbd> normal.
</p>

<p>
Puede acelerar este proceso usando el procedimiento de rutinas de
arranque (<em>bootstrap</em>):
</p>

<pre>
  # cd /usr/src/gnu/egcs/gcc
  # make -f Makefile.bsd-wrapper clean
  # make -f Makefile.bsd-wrapper obj
  # make -f Makefile.bsd-wrapper -DBOOTSTRAP
  # make -f Makefile.bsd-wrapper -DBOOTSTRAP install
  # make -f Makefile.bsd-wrapper clean
  # make -f Makefile.bsd-wrapper
  # make -f Makefile.bsd-wrapper install
</pre>

<a name="1.9"></a>
<h3>
1.9: &iquest;Cu&aacute;l es la mejor forma de actualizar <em>/etc</em>,
<em>/var</em>, y <em>/dev</em>?
</h3>

<p>
<strong>Respuesta corta</strong>: A mano.
</p>

<p>
<strong>Respuesta larga</strong>:
</p>

<p>
Como parte de la pol&iacute;tica de OpenBSD, el <em>software</em> en el
&aacute;rbol de cvs no modifica los ficheros en <em>/etc</em> de forma
autom&aacute;tica.  Esto quiere decir que es <strong>siempre</strong> el
administrador quien debe llevar a cabo las modificaciones necesarias a
los ficheros de configuraci&oacute;n.  Las actualizaciones no
constituyen una excepci&oacute;n.  Para actualizar los ficheros en estos
directorios, primero determine qu&eacute; cambios ha sufrido los
ficheros b&aacute;sicos de la distribuci&oacute;n, y a
continuaci&oacute;n vuelva a aplicar esos cambios manualmente.
</p>

<p>
Por ejemplo, para ver los ficheros que han cambiado m&aacute;s
recientemente en el &aacute;rbol, haga:
</p>

<pre>
  # cd /usr/src/etc
  # ls -lt |more
</pre>

<p>
Para ver todos los cambios en <em>/etc</em> entre versiones de OpenBSD
arbitrarias, puede usar <a href="../../es/anoncvs.html">CVS</a>.  Por
ejemplo, para ver los cambios acontecidos entre 3.1 y 3.2, haga:
</p>

<pre>
  # cd /usr/src/etc
  # cvs diff -u -rOPENBSD_3_1 -rOPENBSD_3_2
</pre>

<p>
Una vez que haya identificado los cambios, vuelva a aplicarlos a su
&aacute;rbol local, conservando cualquier configuraci&oacute;n a nivel
local que haya hecho Vd.  anteriormente.
</p>

<p>
Algunos cambios que suelen ocurrir en <em>/etc</em> entre el paso de
versiones, y que debe comprobar son:
</p>

<ul>
<li>A&ntilde;adidos en los ficheros <em>/etc/protocols</em> y
<em>/etc/services</em>.</li>
<li>Nuevas opciones en <em>sysctl</em> (v&eacute;ase
<em>/etc/sysctl.conf</em>).</li>
<li>Cambios en las tareas predeterminadas de <em>cron</em> (v&eacute;ase
<em>/etc/daily</em>, <em>/etc/weekly</em>, <em>/etc/monthly</em>, y
<em>/etc/security</em>).</li>
<li>Todos los guiones (<em>scripts</em>)de inicio <em>rc</em>, incluido
<em>/etc/netstart</em>.</li>
<li>Cambios en los dispositivos.  V&eacute;ase la
<a href="#1.12">secci&oacute;n 1.12</a>.</li>
<li>Cambios en la jerarqu&iacute;a de archivos en <em>/etc/mtree</em>.
V&eacute;se <a href="#1.13">secci&oacute;n 1.13</a>.</li>
<li>Nuevos usuarios (<em>/etc/passwd</em>) y grupos
(<em>/etc/group</em>).</li>
</ul>

<a name="1.10"></a>
<h3>
1.10: &iquest;C&oacute;mo hago para eliminar todo lo sobrante de la
compilaci&oacute;n del &aacute;rbol de fuentes?
</h3>

<p>
Lo m&aacute;s importante que puede hacer es eliminar sus directorios
<em>obj</em>.  Una forma de actualizar el c&oacute;digo fuente y
eliminar cualquier resto de obj es:
</p>

<pre>
  # cd /usr/src
  # cvs -q -d anoncvs@some.anon.server:/cvs up -Pd
  # find . -type l -name obj | xargs rm
  # make -k cleandir
  # rm -rf /usr/obj/*
  # make obj
</pre>

<p>
Si todav&iacute;a tiene alg&uacute;n problema, puede a&ntilde;adir las
opciones <tt>-I ! -I CVS -I obj</tt> a sus actualizaciones por CVS.  De
este modo identificar&aacute; cualquier resto adicional en su
&aacute;rbol de fuentes.
</p>

<a name="1.11"></a>
<h3>
1.11: &iquest;Es necesario ser el superusuario para hacer un <em>make
build</em>?
</h3>

<p>
Aunque algunos pasos del proceso <em>make build</em> requieren los
privilegios del superusuario (<em>root</em>), el proceso <em>build</em>
incluye enlaces a la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sudo&amp;apropos=0&amp;sektion=8&amp;manpath=OpenBSD+Current&amp;arch=i386&amp;format=html">sudo(8)</a>
que hacen que este proceso sea relativamente sencillo.
</p>

<p>
Si su fichero <em>/etc/sudoers</em> est&aacute; correctamente
configurado, puede usar los enlaces de sudo de la siguiente forma:
</p>

<ul>
<li>Ponga <tt>SUDO=/usr/bin/sudo</tt> en su fichero de entorno antes de
iniciar el proceso <em>build</em>, o</li>
<li>A&ntilde;ada la l&iacute;nea &quot;SUDO=/usr/bin/sudo&quot; a su
fichero <em>/etc/mk.conf</em>.</li>
</ul>

<a name="1.12"></a>
<h3>
1.12: &iquest;Por qu&eacute; no veo ning&uacute;n dispositivo nuevo?
</h3>

<p>
El gui&oacute;n <em>/dev/MAKEDEV</em> no se actualiza de forma
autom&aacute;tica como parte del proceso <kbd>make build</kbd>.  Como
regla general, es recomendable copiar este gui&oacute;n desde su
&aacute;rbol de fuentes cuando lleve a cabo una actualizaci&oacute;n, y
ejecutarlo a mano.
</p>

<pre>
  # cd /dev
  # cp /usr/src/etc/etc.`machine`/MAKEDEV ./
  # ./MAKEDEV all
</pre>

<a name="1.13"></a>
<h3>
1.13: &iquest;Hay alguna manera sencilla de llevar a cabo todos los
cambios en la jerarqu&iacute;a de archivos?
</h3>

<p>
De vez en cuando se a&ntilde;aden directorios y ficheros a, o se
eliminan de, la jerarqu&iacute;a de archivos.  Adem&aacute;s
tambi&eacute;n puede cambiar la informaci&oacute;n sobre permisos.  Una
forma f&aacute;cil de asegurarse de que la jerarqu&iacute;a de archivos
est&eacute; actualizada es usar la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mtree&amp;sektion=8">mtree(8)</a>.
</p>

<p>
Primero obtenga el c&oacute;digo fuente m&aacute;s reciente, y luego
haga lo siguiente:
</p>

<pre>
  # cd /usr/src/etc/mtree
  # install -c -o root -g wheel -m 600 special /etc/mtree
  # install -c -o root -g wheel -m 444 4.4BSD.dist /etc/mtree
  # mtree -qdef /etc/mtree/4.4BSD.dist -p / -u
</pre>

<p>
Ahora su jerarqu&iacute;a de archivos estar&aacute; actualizada.
</p>

<a name="1.14"></a> 
<h3>
1.14: Despu&eacute;s de actualizar, <em>ps</em> produce el siguiente
error: &quot;proc size mismatch&quot;.
</h3>

<p>
El modo de usuario y el n&uacute;cleo del sistema est&aacute;n
desincronizados.  Los dos deben compilarse desde el mismo c&oacute;digo
fuente, ya que existen ciertas interdependencias entre ambos.  Recompile
el n&uacute;cleo y el sistema con el mismo c&oacute;digo para corregir
este problema.
</p>

<p>
Y ya que ha cometido un error, ahora es el momento ideal para volver a
leer todo este documento, y enterarse sobre otras cosas que pueda haber
olvidado.
</p>

<a name="1.15"></a>
<h3>
1.15: &iquest;C&oacute;mo puedo actualizar el sistema con la
&uacute;ltima versi&oacute;n preliminar?</h3>

<p>
La instalaci&oacute;n de una versi&oacute;n preliminar es una buena
forma para estar al d&iacute;a.  Queremos que se prueben las versiones
preliminares, especialmente en su estado beta, para poder estar seguros
de que la pr&oacute;xima versi&oacute;n final sea de una calidad
superior.  Y adem&aacute;s es mucho menos dif&iacute;cil que recompilar
todo el &aacute;rbol de fuentes.
</p>

<p>
La forma m&aacute;s f&aacute;cil de obtener la versi&oacute;n de
desarrollo, <em>-current</em>, es con una imagen de arranque y
prepararlo como se describe en el <a href="faq4.html">cap&iacute;tulo
4</a> de las preguntas frecuentes.  Una vez que haya arrancado, hay que
escoger la opci&oacute;n &quot;(U)pgrade&quot; para actualizar y seguir
las instrucciones.
</p>

<p>
Hay varios modos de iniciar el programa de actualizaci&oacute;n.
Generalmente, los m&eacute;todos m&aacute;s f&aacute;ciles son los de
arranque desde disquete o desde CDROM, o copiar un fichero
<a href="faq4.html#bsd.rd">bsd.rd</a> de la versi&oacute;n de desarrollo
en el directorio ra&iacute;z (<b>/</b>) y arrancar con ese n&uacute;cleo
en lugar de <tt>/bsd</tt>.  Otras opciones incluyen arrancar a
trav&eacute;s de la red y arrancar desde una cinta.  No todos estos
m&eacute;todos se encuentran disponibles para todas las arquitecturas;
para m&aacute;s informaci&oacute;n v&eacute;ase las instrucciones de
instalaci&oacute;n correspondientes.
</p>

<p>
N&oacute;tese que el &uacute;nico medio de actualizaci&oacute;n seguro
es el arranque desde un medio de instalaci&oacute;n/actualizaci&oacute;n
de los arriba descritos.
</p>

<p>
En todos los casos ser&aacute; necesario actualizar <a href="#1.9">/etc,
/var y /dev</a> a mano.
</p>


<a name="3.2"></a>
<h2>
C&oacute;mo actualizar desde la versi&oacute;n 3.2
</h2>

<a name="3.2.1"></a>
<h3>
3.2.1: Nuevo Perl (05/11/2002)
</h3>

<p>
Perl ha sido actualizado con la versi&oacute;n 5.8.0.<br>
En Perl 5.8.0, el m&oacute;dulo API de XS ha cambiado debido a una
cambio de <code>stdio</code> a <code>PerlIO</code> (v&eacute;ase la
p&aacute;gina del manual de perldelta para m&aacute;s
informaci&oacute;n).  Esto quiere decir que cualquier m&oacute;dulo XS
(ficheros .so de perl) que haya instalado tendr&aacute; que ser
recompilado.  Si aparece un error como <em>Undefined symbol
&quot;perl_get_sv&quot;</em>, &eacute;ste es el problema.  Si los
&uacute;nicos m&oacute;dulos que se han instalado son los que vienen
como paquetes precompilados o como portes del sistema, se pueden buscar
lo m&oacute;dulos XS en el sistema ejecutarndo:
</p>

<pre>
  # grep '\.so' /var/db/pkg/p5-*/+CONTENTS | cut -d: -f1 | sort -u
</pre>

<p>
Y eliminar los m&oacute;dulos que producen el error con la orden
<em>pkg_delete -f</em> y recompilarlos o reinstalarlos desde el
&aacute;rbol de portes.
</p>

<a name="3.2.2"></a>
<h3>
3.2.2: Nuevos grupos _radius, _token y _shadow (21/11/2002)
</h3>

<p>
Se han a&ntilde;adido varios grupos nuevos:

<ul>
<li>El grupo <em>_radius</em> controla el acceso de s&oacute;lo lectura
al fichero <tt>/etc/raddb/servers</tt>.
<li>El grupo <em>_token</em> controla el acceso de s&oacute;lo lectura a
las bases de datos de token usadas por
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=tokeninit&amp;sektion=8">tokeninit(8)</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=tokenadm&amp;sektion=8">tokenadm(8)</a>, y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=login_token&amp;sektion=8">login_token(8)</a>.
<li>El grupo <em>_shadow</em> controla el acceso de s&oacute;lo lectura
a la base de datos oculta de contrase&ntilde;as.
</ul>

<p>
Antes de ejecutar <kbd>make build</kbd> hay que a&ntilde;adir estos
grupos y ajustar los permisos en algunos ficheros.  Las siguientes
&oacute;rdenes, ejecutadas como superusuario <em>root</em>, se
encargar&aacute;n de todo esto:

<pre>
  # groupadd -g 63 _radius
  # chgrp _radius /etc/raddb /etc/raddb/servers
  # chmod g+x /etc/raddb
  # chmod g+r /etc/raddb/servers

  # groupadd -g 64 _token
  # chgrp _token /etc/activ.db /etc/crypto.db /etc/snk.db
  # chmod 0640 /etc/activ.db /etc/crypto.db /etc/snk.db

  # groupadd -g 65 _shadow
  # chgrp _shadow /etc/spwd.db
  # chmod 0640 /etc/spwd.db
</pre>

<p>
Los mensajes de error que puedan aparecer indicando que no se ha
encontrado alg&uacute;n fichero no son importantes, simplemente son
debidos a que no se ha configurado la autenticaci&oacute;n de
<em>token</em> o <em>radius</em>.
</p>

<a name="3.2.3"></a>
<h3>
3.2.3: Cambios importantes en el compilador (02/12/2002)
</h3>

<p>
Se ha integrado la extensi&oacute;n para la protecci&oacute;n de la pila
<a href="http://www.trl.ibm.com/projects/security/ssp">propolice</a> en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gcc-local&amp;sektion=1">gcc</a>.
Esto requiere de un escenario algo distinto:

<ul>
<li><b>No</b> compile un nuevo n&uacute;cleo todav&iacute;a.
<li><b>No</b> recompile gcc todav&iacute;a.
<li>Si su sistema tiene bibliotecas compartidas, compile e instale un
nuevo cardagor din&aacute;mico ld.so.

<pre>
	# cd /usr/src
	# make obj

	Para las plataformas ELF (alpha, macppc, sparc, sparc64):
	# cd /usr/src/libexec/ld.so
	# make depend &amp;&amp; make &amp;&amp; make install

	Para las plataformas a.out (amiga, hp300, i386, mac68k, mvme68k):
	# cd /usr/src/gnu/usr.bin/ld/rtld
	# make depend &amp;&amp; make &amp;&amp; make install
</pre>

<li>Recompile e instale un nuevo libc, siguiendo las primeras
&oacute;rdenes de <i>make build</i>.

<pre>
  # cd /usr/src/include
  # make prereq &amp;&amp; make includes
  # cd /usr/src/lib/libc
  # make depend &amp;&amp; make NOMAN=1 &amp;&amp; make NOMAN=1 install
</pre>

N&oacute;tese que si el compilador es demasiado viejo, no podr&aacute;
compilar libc.  En ese caso ser&aacute; necesaria una
actualizaci&oacute;n binaria con una versi&oacute;n preliminar.

<li>Recompile e instale gcc, tal y como se indica en la
<a href="#1.8">secci&oacute;n 1.8</a>.

<li>Ahora ya puede recompilar un n&uacute;cleo.  Aseg&uacute;rese de
ejecutar otra vez
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config</a>
para regenerar el fichero Makefile del n&uacute;cleo.

<li>Reinicie con el nuevo n&uacute;cleo e invoque <i>make build</i> para
beneficiarse de la protecci&oacute;n de la pila de ejecuci&oacute;n.
</ul>
</p>

<a name="3.2.4"></a>
<h3>
3.2.4: Nuevo usuario y grupo _spamd (24/12/2002)
</h3>

<p>
Se ha a&ntilde;adido un nuevo usuario y un nuevo grupo _spamd para el
d&aelig;mon
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=spamd&amp;sektion=8">spamd(8)</a>.
Hay que a&ntilde;adir la entrada correspondiente al nuevo grupo con la
orden <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=groupadd&amp;sektion=8">groupadd(8)</a>:

<pre>
  # groupadd -g 62 _spamd
</pre>

como superusuario <i>root</i>, y la correspondiente al usuario editando
el fichero de contrase&ntilde;as con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw(8)</a>:
</p>

<pre>
  _spamd:*:62:62::0:0:Spam daemon:/var/empty:/sbin/nologin
</pre>

<a name="3.2.5"></a>
<h3>
3.2.5: Alias para ipv6-icmp (30/12/2002)
</h3>

<p>
Se ha a&ntilde;adido un nuevo alias para ipv6-icmp, <em>icmp6</em>, a
<tt>/etc/protocols</tt>.  Si se desea usar el alias <em>icmp6</em>
(usado en las pruebas de regresi&oacute;n de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8">pfctl(8)</a>),
hay que modificar antes la l&iacute;nea <em>ipv6-icmp</em> en
<tt>/etc/protocols</tt>, a&ntilde;adiendo la clave <em>icmp6</em> antes
del signo #.  La l&iacute;nea debe quedar como sigue:
</p>

<pre>
  ipv6-icmp 58    IPv6-ICMP icmp6 # ICMP for IPv6
</pre>

<a name="3.2.6"></a>
<h3>
3.2.6: Nuevo grupo _lkm (05/01/2003)
</h3>

<p>El grupo <em>_lkm</em> controla el acceso a <tt>/dev/lkm</tt>.
Ahora, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=modstat&amp;sektion=8">modstat(8)</a>
es setgid _lkm.

<p>
Se debe a&ntilde;adir este grupo y adaptar los permisos en
<tt>/dev/lkm</tt> antes de invocar un <tt>make build</tt>.  Para ello
hay que usar las siguientes &oacute;rdenes como superusuario
<i>root</i>:

<pre>
  # groupadd -g 61 _lkm
  # chgrp _lkm /dev/lkm
</pre>

<a name="3.2.7"></a>
<h3>
3.2.7: Nuevo libpthread (14/01/2003)
</h3>

<p>
<em>libc_r</em> y <em>libnpthread</em> han sido eliminados y sustituidos
por <em>libpthread</em>.  Los programas que dependan de esto
todav&iacute;a se deben compilar usando la opci&oacute;n
<em>-pthread</em>;  el compilador har&aacute; lo correcto.

<p>
Antes de eliminar <em>libc_r</em> y <em>libnpthread</em>, hay que
recompilar las aplicaciones que dependan de &eacute;stos, usando
<em>libpthread</em>.  La secuencia que se recomienda es:

<ol>
  <li>
  <p>compilar gcc de acuerdo con la secci&oacute;n
  <a href="#1.8">1.8</a>.
  <li>
  <p>recompilar el sistema de acuerdo con la secci&oacute;n
  <a href="#1.5">1.5</a>.
  <li>
  <p>recompilar todos los portes que usen pthreads.
  <li>
  <p>eliminar las bibliotecas que ya no se utilicen:
<pre>
  # rm /usr/lib/libc_r* /usr/lib/libnpthread*
</pre>
</ol>

<a name="3.2.8"></a>
<h3>
3.2.8: Cambios en el enlazador para arquitecturas ELF (17/01/2003)
</h3>

<p>
Binutils/ld han cambiado para introducir una nueva funcionalidad de
seguridad en los ejecutables ELF.  En lugar de permitir que el enlazador
marque la secci&oacute;n de datos de los ejecutables y las bibliotecas
compartidas como ejecutables, se ha cambiado la composici&oacute;n para
marcar s&oacute;lo las secciones apropiadas de la imagen del programa
como ejecutables.  Este cambio s&oacute;lo afecta a las arquitecturas
basadas en ELF:  alpha, sparc, sparc64, macppc.

<p>
Se recomienda recompilar binutils antes que el resto del sistema.

<p>
<pre>
  # cd /usr/src/gnu/usr.bin/binutils
  # make -f Makefile.bsd-wrapper cleandir
  # make -f Makefile.bsd-wrapper obj
  # make -f Makefile.bsd-wrapper depend
  # make -f Makefile.bsd-wrapper
  # make -f Makefile.bsd-wrapper install
</pre>

<p>
Y luego recompilar el sistema de acuerdo con la secci&oacute;n
<a href="#1.5">1.5</a>.


<a name="3.2.9"></a>
<h3>
3.2.9: Fusionados los cambios de /var/at y crontab (19/02/2003)
</h3>

<p>
Ahora que <em>at</em> se ha integrado en <em>cron</em>, el contenido de
<tt>/var/at</tt> se ha fusionado en <tt>/var/cron</tt>.  Adem&aacute;s,
ha cambiado el nombre de los ficheros <tt>allow</tt> y <tt>deny</tt> de
<em>cron</em> por <tt>cron.allow</tt> y <tt>cron.deny</tt> para el
cumplimiento de las normativas de POSIX y para su consistencia con los
ficheros <tt>at.allow</tt> y <tt>at.deny</tt>.

<p>
Primero hay que recomponer el sistema de acuerdo con la secci&oacute;n
<a href="#1.5">1.5</a>, y luego pasar todos los ficheros y reiniciar
cron como sigue:

<pre>
  # mv /var/at/* /var/cron
  # mv /var/cron/jobs /var/cron/atjobs
  # mv /var/cron/allow /var/cron/cron.allow
  # mv /var/cron/deny /var/cron/cron.deny
  # rm -rf /var/at 
  # kill `cat /var/run/cron.pid`
  # /usr/sbin/cron
</pre>

<p>
No hay que hacer caso de los avisos sobre ficheros <tt>allow</tt> o
<tt>deny</tt> que falten, ya que no todos son parte de la
instalaci&oacute;n predeterminada.

<p>
Si todav&iacute;a no se dispone de un fichero <tt>cron.deny</tt> (no se
inclu&iacute;a en la instalaci&oacute;n de versiones de OpenBSD
anteriores a la 3.3), es necesario tener uno para poder ejecutar
<em>crontab</em> con un usuario que no sea el superusuario.

<pre>
  # install -c -o root -g crontab -m 660 /dev/null /var/cron/cron.deny
</pre>

<a name="3.1"></a>
<h2>
C&oacute;mo actualizar desde la versi&oacute;n 3.1
</h2>

<a name="3.1.1"></a>
<h3>
3.1.1: Nuevos usuarios y grupos
</h3>

<p>
Para el soporte de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=authpf&amp;sektion=8">authpf(8)</a>
se requiere un nuevo grupo.  Adem&aacute;s, para el soporte de la nueva
funcionalidad de separaci&oacute;n de privilegios de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sshd&amp;sektion=8">sshd(8)</a>,
se ha a&ntilde;adido al sistema un nuevo usuario y grupo con el nombre
de <em>sshd</em>.  Se han a&ntilde;adido m&aacute;s usuarios nuevos para
servicios del sistema;  &eacute;stos llevan el prefijo &quot;_&quot;.
Para a&ntilde;adirlos use
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw(8)</a>:
</p>

<pre>
  sshd:*:27:27::0:0:sshd privsep:/var/empty:/sbin/nologin
  _portmap:*:28:28::0:0:portmap:/var/empty:/sbin/nologin
  _identd:*:29:29::0:0:identd:/var/empty:/sbin/nologin
  _rstatd:*:30:30::0:0:rpc.rstatd:/var/empty:/sbin/nologin
  _rusersd:*:32:32::0:0:rpc.rusersd:/var/empty:/sbin/nologin
  _fingerd:*:33:33::0:0:fingerd:/var/empty:/sbin/nologin
  _x11:*:35:35::0:0:X server:/var/empty:/sbin/nologin
</pre>

<p>
Y a&ntilde;ada lo siguiente al fichero <tt>/etc/group</tt>:
</p>

<pre>
  sshd:*:27:
  _portmap:*:28:
  _identd:*:29:
  _rstatd:*:30:
  _rusersd:*:32:
  _fingerd:*:33:
  _sshagnt:*:34:
  _x11:*:35:
  authpf:*:72:
</pre>

<a name="3.1.2"></a>
<h3>
3.1.2: Nuevo grupo para crontab(1) y at(1)
</h3>

<p>
La &oacute;rdenes
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crontab&amp;sektion=1">crontab(1)</a> y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=at&amp;sektion=1">at(1)</a>
ya no son <em>setuid root</em>, ahora son <em>setgid crontab</em>.
</p>

<p>
Antes de llevar a cabo la ejecuci&oacute;n de <kbd>make build</kbd> para
compilar el sistema, tiene que a&ntilde;adir el grupo <em>crontab</em>.
Añada una l&iacute;nea como la siguiente en el fichero
<tt>/etc/group</tt>:
</p>

<pre>
  crontab:*:66:
</pre>

<p>
La ejecuci&oacute;n de <kbd>make build</kbd> actualizar&aacute; algunos
permisos, pero no todos.  Despu&eacute;s de que acabe <kbd>make
build</kbd>, debe ejecutar lo siguiente a mano (se asume que el
int&eacute;rprete es <tt>/bin/csh</tt>):
</p>

<pre>
  # chgrp crontab /var/at/at.{allow,deny} /var/cron/{allow,deny}
  # chmod 0640 /var/at/at.{allow,deny} /var/cron/{allow,deny}
  # foreach f ( /var/cron/tabs/* )
	  set u=`basename $f`
          chown $u:crontab $f
    end
</pre>

<p>
N&oacute;tese que probablemente no estar&aacute;n todos los ficheros
<tt>allow/deny</tt>;  esto no es un problema.
</p>

<a name="3.1.3"></a>
<h3>
3.1.3: Nuevo <tt>binutils</tt>
</h3>

<p>
Un nuevo <tt>binutils</tt> (2.11.2) ha sido a&ntilde;adido al
&aacute;rbol de fuentes, y requiere una biblioteca <em>libiberty</em>
actualizada.  Para compilar esta biblioteca siga los siguientes pasos:
</p>

<pre>
  # cd /usr/src/gnu/egcs/libiberty
  # make -f Makefile.bsd-wrapper cleandir
  # make -f Makefile.bsd-wrapper obj
  # make -f Makefile.bsd-wrapper depend
  # make -f Makefile.bsd-wrapper
  # make -f Makefile.bsd-wrapper install
</pre>

<a name="3.1.4"></a>
<h3>
3.1.4: Nueva configuraci&oacute;n de S/Key
</h3>

<p>
La vieja base de datos de S/Key, <tt>/etc/skeykeys</tt>, ha sido
sustituida por un directorio, <tt>/etc/skey</tt>, en el que cada entrada
es un fichero individual propiedad del usuario al que describe.  Puede
convertir <tt>/etc/skeykeys</tt> al nuevo formato ejecutando (como
superusuario):
</p>

<pre>
  # skeyinit -C
  # mv /etc/skeykeys /etc/skeykeys.OLD
</pre>

<p>
N&oacute;tese que cualquier programa que utilice S/Key directamente
tendr&aacute; que ser recompilado.
</p>

<a name="3.1.5"></a>
<h3>
3.1.5: Nuevos permisos para lp*
</h3>

<p>
Ahora, los directorios de cola que usa lpd deben tener permiso de
escritura para el grupo daemon, para que lpr pueda poner ficheros en la
cola.  Adem&aacute;s, los propietarios de los ficheros de los
directorios de cola deben ser el usuario y grupo daemon.  Esto se puede
aplicar del modo siguiente:
</p>

<pre>
 # find /var/spool/output /var/spool/lpd -type d \
	-execdir chgrp daemon {} \; -execdir chmod g+rwx {} \;
 # find /var/spool/output /var/spool/lpd -type f \
	-execdir chown daemon:daemon {} \;
</pre>

<a name="3.1.6"></a>
<h3>
3.1.6: atrun(8) ya no es necesario
</h3>

<p>
La orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=atrun&amp;sektion=8">atrun(8)</a>
ya no es necesaria.  Esta funcionalidad ha sido incorporada en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cron&amp;sektion=8">cron(8)</a>.
Hay que eliminar el gui&oacute;n <tt>/usr/libexec/atrun</tt> del
<em>crontab</em> del usuario <em>root</em>, ejecutando la siguiente
orden como superusuario:
</p>

<pre>
  # crontab -e
</pre>

<p>
Tambi&eacute;n pueden eliminarse <tt>/usr/libexec/atrun</tt>,
<tt>/usr/share/man/cat8/atrun.0</tt> y el directorio
<tt>/var/at/spool</tt>.
</p>

<a name="3.1.7"></a>
<h3>
3.1.7: nat.conf fusionado con pf.conf
</h3>

<p>
<tt>/etc/nat.conf</tt> se ha fusionado con <tt>/etc/pf.conf</tt>.  Hay
que introducir la reglas de NAT en el fichero <tt>pf.conf</tt>
despu&eacute;s de las reglas de limpieza y antes de las reglas de
filtrado.
</p>

<p>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8">pfctl(8)</a>
tiene una nueva opci&oacute;n para cargar los juegos de reglas,
<i>-f</i>, y las opciones <i>-R</i> y <i>-N</i> ahora tienen nuevos
significados.  Es necesario leer la p&aacute;gina del manual y
actualizar el fichero de configuraci&oacute;n <tt>/etc/rc</tt>.
</p>

<a name="3.1.8"></a>
<h3>
3.1.8: Nueva entrada en fbtab necesaria para xdm
</h3>

<p>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=login&amp;sektion=1">login(1)</a> 
necesita cambiar el propietario de <tt>/dev/wsmouse</tt> al nuevo
usuario <i>_x11</i> que es utilizado por xdm para la revocaci&oacute;n
de privilegios en muchas arquitecturas.  El cambio necesario en
<tt>/etc/fbtab</tt> es dependiente de la arquitectura.  El fichero se
genera mediante el siguiente proceso (se asume que el c&oacute;digo
fuente se encuentraa en <tt>/usr/src</tt>):
</p>

<pre>
  # cat /usr/src/etc/fbtab.head &gt; /etc/fbtab
  # cat /usr/src/etc/etc.`uname -m`/fbtab &gt;&gt; /etc/fbtab
  # cat /usr/src/etc/fbtab.tail &gt;&gt; /etc/fbtab
</pre>

<p>
Si se han hecho cambios personalizados en <tt>/etc/fbtab</tt>, hay que
volverlos a incluir a mano en el nuevo fichero.
</p>

<a name="3.1.9"></a>
<h3>
3.1.9: Uso de __attribute__((sentinel)) en ciertas funciones
</h3>

<p>
Ahora, __attribute__((sentinel)) se utiliza para avisar cuando se usen
sin un puntero NULL de terminaci&oacute;n ciertas funciones de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=exec&amp;sektion=3">exec(3)</a>.
<br><br>Es necesario recomponer <i>gcc</i> de acuerdo con la
secci&oacute;n <a href="#1.8">1.8</a> de este documento antes de
proceder con <tt>make build</tt>.
</p>


<a name="3.0"></a>
<h2>
Actualizaci&oacute;n desde la versi&oacute;n 3.0
</h2>

<a name="3.0.1"></a>
<h3>
3.0.1: Soporte de nueva clave por mtree(8)
</h3>

<p>
Debe instalar una nueva versi&oacute;n de la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mtree&amp;sektion=8">mtree(8)</a>
antes de que funcione <kbd>make build</kbd>.
</p>

<pre>
  # cd /usr/src/usr.sbin/mtree
  # make cleandir
  # make obj
  # make depend
  # make
  # make install
</pre>

<a name="3.0.2"></a>
<h3>
3.0.2: Eliminaci&oacute;n de <em>libdl</em> en plataformas ELF
</h3>

<p>
Las plataformas basadas en ELF (alpha, macppc y sparc64) ya no usan
<em>libdl</em>.  La actualizaci&oacute;n desde un sistema libdl a otro
no libdl se har&aacute; mejor siguiendo estos pasos:<br>
</p>

<ul>
<li>
<p>Recompile su sistema:</p>
<pre>
   # cd /usr/src
   # make build
</pre>
</li>

<li>
<p>Si <kbd>make build</kbd> se complet&oacute; con &eacute;xito, puede
continuar y eliminar <em>libdl</em>.  N&oacute;tese que los paquetes que
se hayan enlazado contra <em>libdl</em> deber&iacute;an ser reinstalados
depu&eacute;s de eliminarlo.  Si no est&aacute; preparado para hacerlo,
puede saltarse este paso de momento.  Las versiones preliminares
(<em>snapshots</em>) traer&aacute;n paquetes correctos.</p>
<pre>
# rm -f /usr/lib/libdl.* /usr/lib/libdl_pic.a
</pre>
</li>

<li>
<p>Una vez eliminado <em>libdl</em>, regenere el cach&eacute; de sus
bibliotecas compartidas:</p>
<pre>
# ldconfig -R
</pre>
</li>
</ul>

<a name="3.0.3"></a>
<h3>
3.0.3: Nuevo marco de regresi&oacute;n
</h3>

<p>
Se ha introducido una nueva infraestructura para pruebas de
regresi&oacute;n, y se ha a&ntilde;adido <em>bsd.regress.mk</em>.
Tendr&aacute; que instalarlo antes de ejecutar <kbd>make obj</kbd>.
</p>

<pre>
  # cd /usr/src/share/mk
  # make install
</pre>

<a name="3.0.4"></a>
<h3>
3.0.4: ficheros de configuraci&oacute;n de ssh traspasados a
<em>/etc/ssh/</em>
</h3>

<p>
Primero debe crear el directorio <em>/etc/ssh/</em> (v&eacute;ase la
secci&oacute;n <a href="#1.13">1.13</a>).
</p>

<p>
A continuaci&oacute;n recompile el sistema:
</p>

<pre>
  # cd /usr/src
  # make build
</pre>

<p>
Pase los ficheros <em>/etc/ssh*_*</em> al nuevo directorio
<em>/etc/ssh/</em>:
</p>

<pre>
  # cd /etc
  # mv ssh*_* ssh/
</pre>

<p>
Tendr&aacute; que
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/etc/rc.diff?r1=1.188&amp;r2=1.189">cambiar sus guiones de ejecuci&oacute;n (<em>scripts</em>) de <tt>rc</tt></a>
para que reflejen tambi&eacute;n estos cambios.
</p>

<p>
Y actualizar cualquier l&iacute;nea con HostKey en el fichero
<em>sshd_config</em> para que reflejen la nueva ubicaci&oacute;n.  Por
ejemplo,
</p>

<pre>
  HostKey /etc/ssh_host_key
</pre>

<p>
debe cambiarse a
</p>

<pre>
  HostKey /etc/ssh/ssh_host_key
</pre>

<p>
Reinicie el d&aelig;mon <em>sshd</em>.
</p>

<a name="2.9"></a>
<h2>
Actualizaci&oacute;n desde 2.9
</h2>

<a name="2.9.1"></a>
<h3>
2.9.1: Nuevos usuarios/grupos - <em>proxy</em>, <em>smmsp</em> y
<em>popa3d</em>.
</h3>

<p>
Con la adici&oacute;n del nuevo paquete de filtros de IP
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&amp;sektion=4">pf(4)</a>
y su suite
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp-proxy&amp;sektion=8">ftp-proxy(8)</a>,
se a&ntilde;adieron un nuevo usuario y grupo <em>proxy</em> al sistema.
Para el soporte de &eacute;ste debe a&ntilde;adir la siguiente entrada
de usuario usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw(8)</a>:
</p>

<pre>
proxy:*:71:71::0:0:Proxy Services:/nonexistent:/sbin/nologin
</pre>

<p>
Tambi&eacute;n a&ntilde;ada tambi&eacute;n el grupo <em>proxy</em> a
<em>/etc/group</em>:
</p>

<pre>
proxy:*:71:
</pre>

<p>
Adem&aacute;s, como parte de la actualizaci&oacute;n a Sendmail 8.12,
sendmail ya no tiene el <em>bit setuid root</em>.  Un nuevo usuario y
grupo, <em>smmsp</em>, han sido a&ntilde;adidos al sistema.
A&ntilde;ada una l&iacute;nea como la siguiente a <em>/etc/group</em>:
</p>

<pre>
smmsp:*:25:
</pre>

<p>
A continuaci&oacute;n ejecute
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw(8)</a>
y a&ntilde;ada la siguiente l&iacute;nea para el usuario <em>smmsp</em>:
</p>

<pre>
smmsp:*:25:25::0:0:Sendmail Message Submission Program:/nonexistent:/sbin/nologin
</pre>

<p>
Aseg&uacute;rese de que esta l&iacute;nea aparezca antes de cualquier
otra l&iacute;nea de la configuraci&oacute;n sobre
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=yp&amp;sektion=8">yp(8)</a>.
</p>

<p>
Para finalizar, tambi&eacute;n se a&ntilde;adieron un nuevo usuario y
grupo para el servidor popa3d de <em>Solar Designer</em>, que ahora
forma parte integral del sistema.  A&ntilde;adia la siguiente
l&iacute;nea a <em>/etc/group</em>:
</p>
 
<pre>
popa3d:*:26:
</pre> 
 
<p>
y usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8" >vipw(8)</a>,
a&ntilde;ada
</p>

<pre>
popa3d:*:26:26::0:0:POP3 server:/var/empty:/sbin/nologin
</pre>

<a name="2.9.2"></a>
<h3>
2.9.2: Nuevo paquete de filtros: <em>pf</em>
</h3>

<p>
El paquete de cortafuegos IPF que hab&iacute;a formado parte de las
versiones anteriores de OpenBSD ha sido reemplazado por una suite de
cortafuegos completamente nueva, llamada
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&amp;sektion=4">pf(4)</a>.
Como resultado, es necesario llevar a cabo unos cuantos cambios.
</p>

<p>
Primero, <em>pf</em> depende de un nuevo fichero de dispositivo.  Para
asegurarse de que se crea este dispositivo especial haga la siguiente:
</p>

<pre>
  # cd /dev
  # cp /usr/src/etc/etc.`machine`/MAKEDEV ./
  # ./MAKEDEV all
</pre>

<p>
Segundo, han acontecido algunos cambios en el sistema de archivos.  Los
siguientes binarios han sido reemplazados:
</p>

<pre>
ANTIGUOS (IPF):
/sbin/ipf /sbin/ipfstat /sbin/ipnat /usr/sbin/ipfs
/usr/sbin/ipftest /usr/sbin/ipmon /usr/sbin/ipresend
/usr/sbin/ipsend /usr/sbin/iptest
NUEVOS (PF):
/sbin/pfctl
/usr/libexec/ftp-proxy
</pre>

<p>
De igual modo, para los dispositivos (</em>/dev</em>):
</p>

<pre>
ANTIGUOS (IPF): /dev/ipl /dev/ipnat /dev/ipstate /dev/ipauth
NUEVOS (PF): /dev/pf
</pre>

<p>
Y finalmente los ficheros de configuraci&oacute;n del filtro:
</p>

<pre>
ANTIGUOS (IPF): /etc/ipf.rules /etc/ipnat.rules
NUEVOS (PF): /etc/pf.conf /etc/nat.conf
</pre>

<p>
Puede borrar los ficheros de configuraci&oacute;n antiguos de ipfilter:
</p>

<pre>
  # rm -rf /usr/share/ipf
</pre>

<p>
Se ha a&ntilde;adido un mecanismo para activar <em>pf</em> de forma
segura a los ficheros <em>/etc/rc</em> y <em>/etc/rc.conf</em>.  Es
necesario actualizar estos ficheros para que incluyan el nuevo mecanismo
de enganche.  Si desea activar <em>pf</em>, configure PF=YES en
<em>/etc/rc.conf</em>.
</p>


<a name="2.9.3"></a>
<h3>
2.9.3: Cambios en <em>make</em>
</h3>

<p>
Se han producido algunos cambios en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&amp;sektion=1">make(1)</a>
y en sus ficheros de datos, que pueden originar dificultades en el
proceso de compilaci&oacute;n e instalaci&oacute;n.  Estos cambios
suelen manifestarse con errores de <em>bsd.own.mk</em> durante la
compilaci&oacute;n e instalaci&oacute;n.  Para evitarlo, actualice antes
los ficheros de datos: Antes que nada actualice los ficheros de datos:
</p>

<pre>
  # cd /usr/src/share/mk
  # make install
</pre>

<p>
y entonces compile e installe el nuevo <em>make</em>:
</p>

<pre>
  # cd /usr/src/usr.bin/make
  # make clean &amp;&amp; make obj &amp;&amp; make depend &amp;&amp; make
  # make install
</pre>

<p>
Ahora siga actualizando.
</p>


<a name="2.9.4"></a>
<h3>
2.9.4: La compilaci&oacute;n falla debido a errores de KerberosV
</h3>

<p>
Antes de intentar compilar todo el sistema, debe compilar KerberosV:
</p>

<p>
Primero, hay un nuevo directorio de configuraci&oacute;n de KerberosV en
<em>/etc</em>.  Si todav&iacute;a no lo ha hecho, use el procedimiento
de <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mtree&amp;sektion=8">mtree(8)</a>
descrito en <a href="#1.13">section 1.13</a> para crearlo.
</p>
 
<p>
Ahora, compile KerberosV:
</p>

<pre>
  # cd /usr/src/kerberosV
  # make obj
  # cd lib/roken
  # make 
  # cd ../../usr.bin/asn1_compile
  # make
  # make install
</pre>

<p>
Tambi&eacute;n puede ser necesario actualizar <em>/etc/login.conf</em>
para indicar que el nombre del fichero
<em>/usr/libexec/auth/login_krb-or-pwd</em> ahora es
<strong>login_krb</strong>4<strong>-or-pwd</strong>.
</p>

<a name="2.9.5"></a>
<h3>
2.9.5: Nueva versi&oacute;n de sendmail
</h3>

<p>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendmail&amp;sektion=8">sendmail(8)</a>
ha sido actualizado a la versi&oacute;n 8.12.  Como a partir de esta
versi&oacute;n, sendmail ya no ejecuta <em>setuid root</em>, existen
algunos cambios muy significativos.
</p>

<ol>
<li>Un usuario y grupo nuevos, <em>smmsp</em>, han sido a&ntilde;adidos.
Si todav&iacute;a no lo ha hecho, siga el procedimiento que se describe
en la <a href="#8.1">secci&oacute;n 8.1</a> para crearlos.</li>

<li>Han tendio lugar varios cambios en la jerarqu&iacute;a de archivos,
incluido un nuevo directorio <em>/var/spool/clienmqueue</em> y nuevos
permisos para <em>/var/spool/mqueue</em>.  Estos cambios se pueden
efectuar usando el procedimiento de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mtree&amp;sektion=8">mtree(8)</a>
que se describe en <a href="#1.13">la secci&oacute;n 1.13</a>.</li>

<li>
<p>A&ntilde;ada lo siguiente al fichero
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crontab&amp;sektion=1">crontab(1)</a>
de root.  Esto es necesario dado que <em>sendmail</em> ya no ejecuta
<em>setuid root</em>, y necesitar&aacute; esta entrada para hacer parte
de su funci&oacute;n:</p>
<pre>
# sendmail clientmqueue runner
*/30    *       *       *       *       /usr/sbin/sendmail -L sm-msp-queue -Ac -q
</pre>
</li>

<li>
<p>Actualice sendmail:</p>
<pre>
  # cd /usr/src/gnu/usr.sbin/sendmail
  # make clean &amp;&amp; make obj &amp;&amp; make depend &amp;&amp; make &amp;&amp; make install
</pre>
<p>
<strong>Nota:</strong> los ficheros <em>submit.cf</em> y
<em>localhost.cf</em> se han instalado en su directorio
<em>/etc/mail</em>.  El primero de &eacute;stos, <em>submit.cf</em> (al
que la documentaci&oacute;n actual de sendmail llama el fichero de
configuraci&oacute;n del &laquo;cliente&raquo;), lo utilizan los agentes
de usuario de correo que quieren enviar correo de forma local para su
reparto por medio de sendmail.  Debido a los cambios en los permisos que
se han descrito anteriormente, para esto no es necesario disponer de
privilegios de superusuario:  el identificador de grupo del binario
ejecutable de sendmail se configura con <em>smmsp</em>.  El segundo
fichero, <em>localhost.cf</em>, es una particularidad de OpenBSD que
ejecuta sendmail s&oacute;lo para escuchar en la interfaz del
anfitri&oacute;n local para aceptar el correo que provenga del
anfitri&oacute;n sin aceptar conexiones provenientes de la red (si
utiliza, por ejemplo,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=smtpd&amp;sektion=8">smtpd(8)</a>
para escuchar por el puerto SMTP de su interfaz externa, es casi seguro
que le interesar&aacute; usar esta opci&oacute;n).  Puede conocer
m&aacute;s detalles al respecto leyendo en fichero <em>SECURITY</em> que
encontrar&aacute; en <em>/usr/src/gnu/usr.sbin/sendmail/sendmail</em>.
</p>
<p>
Es muy recomendable que regenere y actualice sus ficheros de
configuraci&oacute;n de sendmail en <em>/etc/mail</em>.  Puede encontrar
algunos ficheros de configuraci&oacute;n funcionales en
<em>/usr/share/sendmail/cf</em>.  N&oacute;tese que el fichero
<em>localhost.cf</em> se genera desde <em>openbsd-localhost.mc</em>.
</p>
</li>

<li>
<p>Si utiliza sendmail sin la opci&oacute;n <kbd>-bd</kbd> en
<em>/etc/rc.conf</em>, que es como se usa en la configuraci&oacute;n de
la instalaci&oacute;n predeterminada, tendr&aacute; que usar
<em>localhost.cf</em>.  Edite el fichero <em>rc.conf</em> para
a&ntilde;adir lo siguiente:</p>
<pre>
# For normal use: &quot;-L sm-mta -bd -q30m&quot;
sendmail_flags=&quot;-L sm-mta -C/etc/mail/localhost.cf -bd -q30m&quot;
</pre>
</li>

<li>
<p>En cuanto est&eacute; preparado su fichero de configuraci&oacute;n,
use <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kill&amp;sektion=1">kill(1)</a>
para acabar con el proceso existente de sendmail:</p>
<pre>
  kill `sed 1q /var/run/sendmail.pid`
</pre>
<p>y reinicie el nuevo sendmail con las opciones apropiadas, como por
ejemplo:</p>
<pre>
  /usr/sbin/sendmail -L sm-mta -bd -q30m
</pre>
<p>para una configuraci&oacute;n que acepte correo desde el exterior,
o:</p>
<pre>
  /usr/sbin/sendmail -L sm-mta -C/etc/mail/localhost.cf -bd -q30m
</pre>
<p>para una configuraci&oacute;n que s&oacute;lo acepte correo
interno.</p>
<p><strong>Nota:</strong> el indicador <kbd>-bd</kbd> es ahora necesario
en ambos casos.</p>
</li>
</ol>

<p>
El nuevo <em>sendmail</em> deber&iacute;a funcionar a partir de este
momento.
</p>

<a name="2.9.6"></a>
<h3>
2.9.6: Cambio en <em>/etc/primes</em>.
</h3>

<p>
El nombre del fichero <em>/etc/primes</em> es ahora
<em>/etc/moduli</em>.  S&oacute;lo tiene que copiarlo desde su antigua
ubicaci&oacute;n o desde <em>/usr/src/etc/</em>.
</p>


<hr width="30%">

<address>
<p>
Originally [OpenBSD: upgrade-minifaq.html,v 1.159 2003/04/14 21:54:43 wilfried Exp ]<br>
$Translation: upgrade-minifaq.html,v 1.69 2003/04/15 20:29:15 horacio Exp $<br>
$OpenBSD: upgrade-minifaq.html,v 1.63 2003/04/17 19:34:12 jufi Exp $<br>
Copyright &copy; 1998-2003, Kjell Wooding.<br>
Env&iacute;e cualquier comentario, pregunta o sugerencia
(s&oacute;lo en ingl&eacute;s, por favor) a
<a href="mailto:kjell@openbsd.org">kjell@openbsd.org</a>
</p>
</address>

</body>
</html>
