<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD 2.6 utg&aring;van</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the main OpenBSD page">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2001 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#24248E">

<img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif">
<hr>

<p>
<a href="../images/fishbowl_sm.jpg"><img align="left" src="../images/fishbowl_sm.jpg"></a>
<h2><font color="#0000e0">OpenBSD 2.6 utg&aring;van:</font></h2>
<p>

Sl&auml;ppt 1 december, 1999.<br>
Upphovsr&auml;ttsskyddat 1997-1999, Theo de Raadt.
<p>

<a href="#new">Vad som &auml;r nytt</a>
<p>

<a href="../orders.html">F&ouml;r att best&auml;lla en 2.6 CDROM, klicka h&auml;r.</a>

<h3><font color="#0000e0">
F&ouml;r att f&aring; tag p&aring; filerna till denna utg&aring;va:
<ul>
<li><strong>K&ouml;p en CDROM fr&aring;n v&aring;rt best&auml;llningssystem.</strong>
	Om du vill f&aring; en lokal bokhandel att ta in den,
	be dem best&auml;lla
	<font color="#e00000">ISBN 0-9683637-4-1</font>.
<li>Kolla information p&aring; <a href="ftp.html">FTP-sidan</a> f&ouml;r
	en lista av spegelservrar.
<li>G&aring; till <font color="#e00000">pub/OpenBSD/2.6/</font> katalogen
	p&aring; en av speglarna.
<li>Skumma l&auml;tt igenom resten av detta dokument.
<li>Ta en titt p&aring; <a href="../errata26.html">The 2.6 Errata page</a>
	f&ouml;r en lista p&aring; buggar och fixar.
</ul>
</font></h3>
<br clear="all">
<br>
<p>

Alla upphovsr&auml;ttsskyddsnotiser och erk&auml;nnanden
kan hittas irespektive filk&auml;llkod i filerna src.tar.gz och srcsys.tar.gz.
<p>
H&auml;r f&ouml;ljer instruktionerna som du skulle ha p&aring; en bit papper
om du hade k&ouml;pt ett CDROM-set fr&aring;n <a href="../orders.html">http://www.OpenBSD.org/orders.html</a>,
ist&auml;llet f&ouml;r att g&ouml;ra en alternativ form av installation.
Instruktionerna f&ouml;r att g&ouml;ra en ftp (eller annan) installation
&auml;r v&auml;ldigt lika; CDROM instruktionerna l&auml;mnas or&ouml;rda s&aring;
att du kan se hur mycket enklare det skulle ha varit om du hade k&ouml;pt en CDROM 
ist&auml;llet.
<p>
<hr>
Var god v&auml;nd dig till f&ouml;ljande filer p&aring; de tv&aring; CD-skivorna
f&ouml;r detaljerade beskrivningar p&aring; hur man installerar OpenBSD 2.6 p&aring din
maskin:
<p>
<dl>
<li>	CD1:2.6/i386/INSTALL.i386
<li>	CD1:2.6/sparc/INSTALL.sparc
<p>
<li>	CD2:2.6/alpha/INSTALL.alpha
<li>	CD2:2.6/amiga/INSTALL.amiga
<li>	CD2:2.6/mac68k/INSTALL.mac68k
<li>	CD2:2.6/hp300/INSTALL.hp300
<p>
<li>En pmax utg&aring;va &auml;r tillg&auml;nglig p&aring; ftp-siterna, men inte p&aring CD-skivorna.
</dl>
<hr>

<p>
Snabb installationsinformation f&ouml;r folk bekanta med OpenBSD,
och anv&auml;ndandet av det nya "disklabel -E" kommandot: Om du 
blir konfunderad n&auml;r du installerar OpenBSD, l&auml;s den relevanta
INSTALL.* filen som listas ovan!

<p>
<h3><font color="#e00000">i386:</font></h3>

<p>
Lek lite med dina BIOS inst&auml;llningar, och se om du kan f&aring; den 
att boota ifr&aring;n en CD; testa CD1. Om det inte funkar, skriv
CD1:2.6/i386/floppy26.fs till en diskett och boota p&aring; den.
Om du mixar OpenBSD med n&aring;got annat operativsystem, se d&aring; till 
att du har l&auml;st INSTALL.i386.

<p>
F&ouml;r att g&ouml;ra en diskett under MS-DOS, anv&auml;nd /2.6/tools/rawrite.exe.
I Unix, anv&auml;nd "dd if=&lt;file&gt; of=/dev/&lt;device&gt; bs=32k"
(d&auml;r device skulle kunna vara "floppy", "rfd0c" eller "rfd0a").
Anv&auml;nd noggrant formatterade disketter UTAN D&Aring;LIGA BLOCK, annars
kommer du f&ouml;rlora.

<p>
<h3><font color="#e00000">sparc:</font></h3>

<p>
F&ouml;r att boota fr&aring;n CD1, skriv "boot cdrom 2.6/sparc/bsd.rd" eller
"b sd(0,6,0)2.6/sparc/bsd.rd", beroende p&aring; vilken ROM version du har.
Alternativt, skriv CD1:2.6/sparc/floppy26.fs till en diskett och boota ifr&aring;n
den med "boot fd()" eller "boot floppy" (&auml;ven h&auml;r beroende p&aring; din ROM
version). Tillsist, ett tredje alternativ &auml;r att skriva CD1:2.6/sparc/kc.fs
och CD1:2.6/sparc/inst.fs till tv&aring; separata disketter. S&auml;tt sedan
in "kc.fs" och boota som beskrivet. S&aring; fort diskettstationen spottar ut
disketten, s&auml;tt in "inst.fs". Svara p&aring; ett par fr&aring;gor. Reboota
fr&aring;n "kc.fs" disketten. Den h&auml;r g&aring;ngen, n&auml;r disketten spottas
ut, s&auml;tt helt enkelt bara tillbaka den ("kc.fs") igen och svara p&aring; 
ett par andra fr&aring;gor.

<p>
<h3><font color="#e00000">amiga:</font></h3>

<p>
Skapa BSD partitioner enligt INSTALL.amiga:s f&ouml;rberednings-sektion.
Montera CD2 under AmigaOS som device CD0: Sedan, k&ouml;r f&ouml;ljande
CLI kommando: "CD0:2.6/amiga/utils/loadbsd CD0:2.6/amiga/bsd.rd".

<p>
<h3><font color="#e00000">hp300:</font></h3>

<p>
Du kan boota &ouml;ver n&auml;tverket genom att f&ouml;lja instruktionerna i
INSTALL.hp300.

<p>
<h3><font color="#e00000">alpha:</font></h3>

<p>
Din alpha m&aring;ste anv&auml;nda SRM firmware (inte ARC).
Om du har en CDROM, kan du testa "boot -fi 2.6/alpha/bsd.rd dkaX"
(anv&auml;nd "show device" till att hitta din CDROM-enhets identifierare).
Annars, skriv CD2:2.6/alpha/floppy.fs till en diskett och boota den 
genom att skriva "boot dva0". Om detta misslyckas, kan du placera
bsd.rd p&aring; n&aring;gon annan device och boota den, eller anv&auml;nda
den tillhandah&aring;llna simpleroot.

<p>
<h3><font color="#e00000">mac68k:</font></h3>

<p>
Boota MacOS som normalt och partitionera din disk med de passande
A/UX konfigurationerna. Packa sedan upp Macside tillbeh&ouml;ren fr&aring;n
CD1:2.6/mac68k/utils till din h&aring;rddisk. K&ouml;r Mkfs till att skapa
dina filsystem p&aring; de A/UX partitioner du just gjorde. Anv&auml;nd sedan
BSD/Mac86k Installer till att kopiera alla set i CD1:2.6/mac86k/ till 
dina partitioner. Till sist &auml;r du redo att konfiguera BSD/Mac68k Booter
med l&auml;get p&aring; din k&auml;rna och boota systemet.

<p>
<h3><font color="#e00000">Anm&auml;rkningar ang&aring;ende k&auml;llkoden:</font></h3>

<p>
src.tar.gz inneh&aring;ller ett k&auml;llkodsarkiv som ligger i /usr/src.
Denna fil inneh&aring;ller allt du beh&ouml;ver f&ouml;rutom koden till k&auml;rnan,
som ligger i ett separat arkiv. F&ouml;r att packa upp:
<p>
<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>
<p>
srcsys.tar.gz inneh&aring;ller ett k&auml;llkodsarkiv som ligger i
/usr/src/sys. Denna fil inn&aring;ller all k&auml;llkod till k&auml;rnan, som 
du beh&ouml;ver f&ouml;r att bygga om din k&auml;rna.
F&ouml;r att packa upp:
<p>
<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>
<p>
B&aring;da dessa tr&auml;d &auml;r vanliga CVS checkout:er. Genom att
anv&auml;nda dessa tr&auml;d s&aring; &auml;r det m&ouml;jligt att
f&aring; en snabb start i anv&auml;ndandet av de anoncvs-servrarna som
beskrivs p&aring; <a href="anoncvs.html">http://www.OpenBSD.org/se/anoncvs.html</a>.
Genom att anv&auml;nda dessa filer resulterar det i en mycket snabbare f&ouml;rsta
CVS update, &auml;n vad man skulle kunna f&ouml;rv&auml;nta sig vid en fr&auml;sch checkout av
hela OpenBSD k&auml;llkodstr&auml;det.
<p>
<hr>
<p>
<h3><font color="#e00000">PORTS TR&Auml;DET</font></h3>
<p>
Ett portsarkiv medf&ouml;ljer ocks&aring;. F&ouml;r att packa upp:
<p>
<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>

<p>
Underkatalogen ports/ &auml;r en checkout fr&aring;n OpenBSD:s ports-tr&auml;d.
G&aring; och l&auml;s <a href="../ports.html">http://www.OpenBSD.org/ports.html</a>
om du inte &auml;r bekant med ports vid denna tidpunkt.
Denna text &auml;r inte menad att vara en manual p&aring; hur man kan
anv&auml;nda sig av ports. Det &auml;r snarare en del noteringar och
anm&auml;rkningar menade att kickstarta anv&auml;ndaren av 
OpenBSD:s ports system.

<p>
OpenBSD:s ports system &auml;r inte f&auml;rdigt. Det &auml;r p&aring;
grund av att fullst&auml;nd&auml;ndig integration av ports i OpenBSD milj&ouml;n
&auml;r ett ungt projekt vid denna tidpunkt. Vi tror att de ports som 
&auml;r tillg&auml;ngliga h&auml;r &auml;r stabila, men det &auml;r 
mycket viktigt att f&ouml;rst&aring; att ports kommer att forts&auml;tta att
&ouml;ka en hel del i funktionalitet i framtiden.

<p>
Som vi sa, ports kommer att v&auml;xa en hel del i framtiden. 
ports/ katalogen representerar en CVS (se man-sidan f&ouml;r cvs(1) om du inte
&auml;r bevandrad med CVS) checkout av v&aring;ra ports. Precis som med
v&aring;rt fullst&auml;ndiga k&auml;llkodstr&auml;d &auml;r v&aring;rt portstr&auml;d
tillg&auml;ngligt via anoncvs. S&aring; f&ouml;r att kunna h&auml;nga
med, och h&aring;lla det akuellt, beh&ouml;ver du g&ouml;ra ports/ tr&auml;det
tillg&auml;ngligt p&aring; ett l&auml;s- och skrivbart medium och uppdatera
tr&auml;det med ett kommando s&aring; som:

<p>
<pre>
# cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -PAd
</pre>
<p>
[Sj&auml;lvklart m&aring;ste du byta ut den lokala katalogen och servernamnet h&auml;r 
mot den faktiska platsen f&ouml;r din ports-samling och en n&auml;rliggande
anoncvs server.]
<p>
&Auml;n en g&aring;ng; det &auml;r viktigt att kolla webbsidan f&ouml;r specifika
instruktioner eftersom detta &auml;r en ny tj&auml;nst vilken inte har blivit
helt testat &auml;nnu.
<p>
Slutligen, trots ports ungdom &auml;r inte hj&auml;lpen l&aring;ngt borta. 
Om du &auml;r intresserad av att se en port adderad, vill du hj&auml;lpa till, 
eller om du bara vill veta mer - s&aring; &auml;r mailinglistan ports@openbsd.org
en bra address att k&auml;nna till.

<hr>
<a name="new"></a>
<p>
<h3><font color="#e00000">VAD &Auml;R NYTT</font></h3>
<p>
Detta &auml;r en ofullst&auml;ndig lista av nya funktioner och system inkluderade
i OpenBSD 2.6. F&ouml;r en omfattande lista, se <a href="../plus26.html">h&auml;ndelseloggen</a>
som ledde till 2.6.
<p>

<ul>
<li>Det mest intressanta tillskottet &auml;r OpenSSH (http://www.OpenSSH.com/).
Det &auml;r en fri och &aring;teranv&auml;ndbar SSH-upps&auml;ttning baserad
p&aring; en tidig version av Tatu Ylonen (1.2.12). Den versionen var den sista
med en fri licens. OpenSSH togs upp till nuvarande standarder och anv&auml;nder
OpenSSL biblioteket. Det &auml;r gratis och fritt f&ouml;r alla f&ouml;rutom 
kommersiella USA-anv&auml;ndare (RSA patent i USA). OpenSSH utvecklades 
av OpenBSD och har blivit portat till bl.a FreeBSD och Linux.

<li>Ett smart trick till&aring;ter oss att distribuera samma CDROM-skiva 
(USA och resten av v&auml;rlden) och uppeh&aring;lla fullt stark krypto
utan att bryta mot RSA patenten i USA.

<li>Omfattande &auml;ndringar i dokumentationen, i synnerhet man-sidorna
och Webb FAQ:en. Manualsidorna inkluderar nu anv&auml;ndbara exempel 
f&ouml;r att supplementera f&ouml;rklaringarna. Genom att h&aring;lla 
dokumentationen koncis och p&aring; tv&aring; v&auml;lk&auml;nda st&auml;llen,
hoppas vi att undvika explosionen av "How-To" dokument som tvingar
anv&auml;ndaren till &auml;ndl&ouml;st letande efter information.

<li>En mer fullst&auml;ndig samlig av "ports". Ports &auml;r en metod
f&ouml;r att importera och bygga freewareapplikationer &ouml;ver n&auml;tverket
(applikationer, mailprogram, webbl&auml;sare, etc). Anv&auml;ndaren beh&ouml;ver
bara g&aring; till den relevanta katalogen och skriva "make install" f&ouml;r
att starta en process som h&auml;mtar k&auml;llkoden, patchar den f&ouml;r 
OpenBSD, kompilerar och installerar paketet. De flesta ports &auml;r
ocks&aring; tillg&auml;ngliga som f&auml;rdigbyggda paket.

<li>Inkluderar: 
<ul>
<li>XFree86 3.3.5
<li>gcc 2.95
<li>Apache 1.3.9 + Mod_ssl 2.4.5 + OpenSSL 0.9.4, och DSO st&ouml;d
</ul>

<li>M&aring;nga f&ouml;rb&auml;ttringar av s&auml;kerheten och &ouml;kad tillf&ouml;rlitlighet
(titta efter den r&ouml;da texten i den kompletta listan).

<li>Nya h&aring;rdvarudevice:ar st&ouml;dda, s&auml;rskilt p&aring; PC (i386)
arkitekturen.
<ul>
<li>PCI IDE och DMA st&ouml;d
<li>USB (universal serial bus)
<li>ATAPISCSI device:ar, inklusive CD-R och CD-RWs
</ul>
</ul>
<p>

<hr>
<br>
<small>
Originally [OpenBSD: 26.html,v 1.6 2000/05/23 22:46:48 deraadt Exp ]
<br>
$Translation: 26.html,v 1.5 2000/06/14 16:13:33 javax Exp $
<br>
$OpenBSD: 26.html,v 1.6 2001/02/16 03:11:10 smart Exp $
</small>

</body>
</html>

