<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict Level 2//EN//2.0">
<html>
<head>
<title>Kryptografi i OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD cryptography">
<meta name="keywords" content="openbsd,cryptography,openssh,openssl,kerberos">
<meta name="keywords" content="ipsec,photuris,isakmp,ike,blowfish,des,rsa,dsa">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997-2000 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">
<img align=left alt="[OpenBSD]" height="166" width="197" SRC="../images/blowfish-notext.jpg">
<br>
<br>
<br>
"Mantran f&ouml;r en bra s&auml;kerhetstekniker &auml;r: "S&auml;kerhet &auml;r
inte en produkt, utan en process." Det &auml;r mer &auml;n att bara designa in stark
kryptografi i ett system; det &auml;r att designa hela systemet p&aring; s&aring; 
vis att alla s&auml;kerhetsm&aring;tt, inkluderat kryptografi, fungerar tillsammans."
<br>
<br>
-- Bruce Schneier, f&ouml;rfattare av "Applied Cryptography".
<br clear="all">
<h2><font color="#e00000">Kryptografi</font><hr></h2>

<strong>Index</strong><br>
<a href="#why">Varf&ouml;r skeppar vi kryptografi?</a><br> 
<a href="#ssh">OpenSSH</a><br> 
<a href="#prng">Pseudoslumptalsgeneratorer</a> (PRNG): ARC4, ...<br>
<a href="#hash">Kryptrografiska hashfunktioner</a>: MD5, SHA1, ...<br>
<a href="#trans">Kryptrografiska omvandlare</a>: DES, Blowfish, ...<br>
<a href="#hardware">Kryptrografiskt h&aring;dvarust&ouml;d</a><br>
<a href="#people">Internationella kryptografer s&ouml;kes</a><br>
<a href="#papers">Fortsatt l&auml;sning</a><br>
<p>
<hr>

<a name="why"></a>
<h3><font color="#e00000">Varf&ouml;r skeppar vi kryptografi?</font></h3><p>

I fyra ord: <strong>f&ouml;r att vi kan</strong>.<p>

OpenBSD-projektet &auml;r baserat i Kanada.<p>

<a href="../ECL.html">Export Control List of Canada</a> st&auml;ller inga
markanta restriktioner p&aring; export av kryptografisk mjukvara, och
&auml;r till och med &auml;nnu klarare ang&aring;ende fri export av
fritt tillg&auml;nglig kryptografisk mjukvara. Marc Plumb har 
gjort <a href="http://insight.mcmaster.ca/org/efc/pages/doc/crypto-export.html">
en del unders&ouml;kningar f&ouml;r att testa de kryptografiska lagarna</a>.
<p>

D&auml;rf&ouml;r har OpenBSD projektet b&auml;ddat in kryptografi i ett flertal 
st&auml;llen i operativsystemet. Vi kr&auml;ver att den kryptografiska mjukvaran
som vi anv&auml;nder &auml;r <a href="../policy.html">fritt tillg&auml;nglig och 
med bra licens</a>. Vi anv&auml;nder inte direkt kryptografi med besv&auml;rliga och
ot&auml;cka patent. Vi kr&auml;ver ocks&aring; att s&aring;dan mjukvara &auml;r 
ifr&aring;n l&auml;nder med skapliga export licenser, eftersom vi inte vill bryta
mot lagen i n&aring;got land. De kryptografiska mjukvarukomponenterna som vi f&ouml;r
tillf&auml;llet anv&auml;nder skrevs i Argentina, Australien, Grekland, Kanada, Norge,
Sverige och Tyskland.
<p>

N&auml;r vi skapar OpenBSD-utg&aring;vor eller snapshotar, bygger vi v&aring;ra release-bin&auml;rer
i fria l&auml;nder f&ouml;r att f&ouml;rs&auml;kra oss om att att k&auml;llkoden och 
bin&auml;rerna som vi tillhandah&aring;ller &auml;r fria fr&aring;n fl&auml;ckar. P&aring; senaste
tiden har v&aring;ra release-bin&auml;rer byggts i Kanada, Sverige och Tyskland.
<p>

OpenBSD skeppar med Kerberos IV inkluderat. Kodbasen som vi anv&auml;nder &auml;r
den exportbara KTH-baserade utg&aring;van ifr&aring;n Sverige. V&aring;r X11-k&auml;llkod
har blivit ut&ouml;kad f&ouml;r att kunna anv&auml;ndas tillsammans med Kerberos IV.
Kerberos V st&ouml;d kommer kanske att komma 1999, men i nuvarande stund existerar
inte n&aring;gon fritt exportbar version av Kerberos V.<p>

Idag &auml;r kryptografi en viktig del f&ouml;r att ut&ouml;ka <a href="security.html">s&auml;kerheten</a>
i ett operativsystem. Kryptografin som anv&auml;nds i OpenBSD kan klassifieras i &aring;tskilliga aspekter, 
beskrivna h&auml;rn&auml;st.<p>

<a name="ssh"></a>
<h3><font color="#e00000">OpenSSH</font></h3><p>

Vad &auml;r den f&ouml;rsta sak som de flesta m&auml;niskor g&ouml;r
efter att ha installerat OpenBSD? De installerar Secure Shell 
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh">ssh</a>) 
ifr&aring;n port-tr&auml;det eller paketen p&aring; FTP-siterna.
Till och med nu, vill s&auml;ga.<p>

Fr&aring;n och med 2.6 utg&aring;van, inneh&aring;ller OpenBSD
<a href="http://www.openssh.com/">OpenSSH</a>, en absolut fri och 
patent-obesv&auml;rad version av ssh.
<a href="http://www.openssh.com/">OpenSSH</a> fungerar med ssh version 1
och har m&aring;nga nya funktioner.
<ul>
<li>
alla komponenter med en restrektiv natur (till exempel patenter, se
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl">ssl</a>)
har blivit direkt borttagna ifr&aring;n k&auml;llkoden; licensierade 
eller patenterade komponenter v&auml;ljs ifr&aring;n externa bibliotek.
</li>
<li>
har blivit uppdaterad till att st&ouml;dja ssh protokoll 1.5.
</li>
<li>
inneh&aring;ller st&ouml;d f&ouml;r 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kerberos">kerberos</a>verifiering och passing av tickets.
</li>
<li>
st&ouml;der one-time l&ouml;senordverifiering med
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey">skey</a>.
</li>
</ul>
<p>

Vi tog en fri version av ssh och OpenBSD-fierade den. Vi gick runt
den USA-baserade RSA patenten genom att tillhandah&aring;lla ett enkelt s&auml;tt
att automatiskt ladda ned och installera ett RSA-aktiverad paket inneh&aring;llandes
delade bibliotekversioner av libcrypto och libssl. Dessa paket &auml;r baserade
p&aring; OpenSSL. Folk som lever utanf&ouml;r USA kan fritt anv&auml;nda den RSA
patenterade koden, medans m&auml;nniskor i USA kan anv&auml;nda den fritt till 
icke-komersiella syften. Det verkar som om f&ouml;retag innuti USA ocks&aring; kan 
anv&auml;nda RSA-biblioteken, s&aring; l&auml;nge RSA inte anv&auml;nds i en vinstgivande
roll.

P&aring; det h&auml;r s&auml;ttet kommer n&auml;stan alla f&aring; ssh inbyggt.<p>

<a name="prng"></a>
<h3><font color=#e00000>Pseudoslumptalsgeneratorer</font></h3><p>

En pseudoslumptalsgenerator (PRNG - Pseudo Random Number Generator) erbjuder applikationer en str&ouml;m med
tal som har vissa viktiga egenskaper f&ouml;r systems&auml;kerhet:<p>

<ul>
<li>Det ska vara om&ouml;jligt f&ouml;r en utomst&aring;ende att f&ouml;ruts&auml;ga
utg&aring;ngen av slumptalsgeneratorn, &auml;ven med vetenskap om tidigare utg&aring;ngar.
<li>De genererade talen ska inte ha &aring;terupprepade m&ouml;nster, vilket betyder
att PRNG:en ska ha en mycket l&aring;ng omloppstid.
</ul>
<p>

En PRNG &auml;r normalt bara en algoritm d&auml;r samma begynnelsev&auml;rden 
kommer redovisa samma utdata. P&aring; ett fler&auml;nv&auml;ndarsystem 
finns det flera k&auml;llor vilka till&aring;ter PRNG:en att s&aring;s med slumpad
data. OpenBSD k&auml;rnan anv&auml;nder interrupttajmningen f&ouml;r musen, 
n&auml;tverksdatans interruptlatens, tajmingen mellan tangentknapps-nedtryckningar och disk I/O
information till att fylla en entropipool. Slumptal finns tillg&auml;ngliga 
f&ouml;r rutiner i k&auml;rnan och exporteras via device:er till anv&auml;ndar-program.
Hittills anv&auml;nds slumptal p&aring; f&ouml;ljande st&auml;llen:<p>

<ul>
<li>Dynamisk allokering av sin_port i bind(2).
<li>PID:ar f&ouml;r processer.
<li>IP datagram ID:en.
<li>RPC transaktions ID:en (XID).
<li>NFS RPC transaktions ID:en (XID).
<li>DNS Fr&aring;go-ID:en.
<li>Generering av Inode nummer (se getfh(2) och fsirand(8)).
<li>Tajming av oredan i traceroute(8).
<li>Starkare tempor&auml;rara namn f&ouml;r mktemp(3) och mkstemp(3).
<li>Slumpm&auml;ssighet inf&ouml;rt i TCP ISS v&auml;rdet f&ouml;r
skydd mot spoofing attacker.
<li>Slumpad stoppning i IPsec esp_old paketet.
<li>Till att generera salt f&ouml;r de olika l&ouml;senordsalgoritmerna.
<li>Till att generera falska S/Key utmaningar.
<li>I <a href="http://www.physnet.uni-hamburg.de/provos/photuris/">photurisd</a> 
        och <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd">isakmpd</a>
	f&ouml;r att erbjuda riktiga bevis p&aring; nyckel-utv&auml;xlingar.
</ul>

<p>
<a name="hash"></a>
<h3><font color=#e00000>Kryptografiska hashfunktioner</font></h3><p>

En hashfunktion komprimerar dens indata till en str&auml;ng med konstant storlek.
F&ouml;r en kryptografisk hashfunktion s&aring; &auml;r det om&ouml;jligt att finna:

<ul>
<li>tv&aring; indata som har samma utdata (resistant mot kollisioner),
<li>en annan indata f&ouml;r en given indata med samma utdata (eng "2nd preimage resistant").
</ul>
<p>

I OpenBSD anv&auml;nds MD5, SHA1 och RIPEMD-160 som kryptrografiska hashfunktioner,
till exempel: <p>
<ul> 
<li>I <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey">S/Key</a>
    f&ouml;r att erbjuda eng&aring;ngsl&ouml;senord.
<li>I <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec">IPsec</a>,
    <a href="http://www.physnet.uni-hamburg.de/provos/photuris/">photurisd</a>
    och
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd">isakmpd(8)</a>
    f&ouml;r att verifiera datans h&auml;rkomst och f&ouml;rs&auml;kra
    sig om paketens intigritet.
<li>F&ouml;r FreeBSD-stil MD5 l&ouml;senord (inte aktiverade som standard), se
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd.conf&sektion=5">
    passwd.conf(5)</a>.
<li>F&ouml;r TCP SYN cookie st&ouml;d (inte aktiverat som standard), se
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&sektion=4">
    options(4)</a>.
<li>I libssl f&ouml;r digital signering av meddelanden.
</ul>
<p>

<p>
<a name="trans"></a>
<h3><font color="#e00000">Kryptografisk omvandling</font></h3><p>


Kryptografisk omvandling anv&auml;nds till att kryptera och dekryptera data.
Dessa anv&auml;nds vanligen med en krypteringsnyckel f&ouml;r kryptering av data
och med en dekrypteringsnyckel vid dekryptering av data. S&auml;kerheten vid
en kryptografisk omvandling ska bara lita p&aring; det material som
registrerat sig.<p>

OpenBSD erbjuder omvandlare som DES, 3DES, Blowfish och Cast f&ouml;r
k&auml;rnan och anv&auml;ndar-program, vilka anv&auml;nds i m&aring;nga 
st&auml;llen s&aring; som:<p>
<ul>
<li>I libc till att skapa
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=blf_key">Blowfish</a>
    l&ouml;senord. Se ocks&aring; <a href="../papers/bcrypt-paper.ps">USENIX dokumentet</a>
    ang&aring;ende det h&auml;r &auml;mnet.
<li>I
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec">IPsec</a>
    f&ouml;r att erbjuda trygghet till n&auml;tverkslagret.
<li>I Kerberos och en handfull kerberoriserade applikationer, s&aring; som
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=telnet">telnet</a>,
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs">cvs</a>,
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rsh">rsh</a>,
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rcp">rcp</a>,
    och
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rlogin">rlogin</a>.
<li>I <a href="http://www.physnet.uni-hamburg.de/provos/photuris/">
    photurisd</a> och
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd">isakmpd</a>
    f&ouml;r att skydda utbytena d&auml;r IPsec nyckel-material f&ouml;rhandlas.
<li>I AFS f&ouml;r att skydda meddelandena skickade &ouml;ver n&auml;tverket, erbjuder
    trygga &aring;tkomster av fj&auml;rrfilsystem.
<li>I libssl f&ouml;r att till&aring;ta applikationer kommunicera &ouml;ver SSL,
    det kryptografiska de-facto standardprotokollet.
</ul>

<p>
<a name="hardware"></a>
<h3><font color="#e00000">Kryptografiskt h&aring;rdvarust&ouml;d</font></h3><p>

I och med version 2.7 st&ouml;djer OpenBSD ett begr&auml;nsat antal 
kryptografisk h&aring;rdvara.

<ul>
<li><b>IPsec crypto dequeue</b><br>
    V&aring;r IPsec stack har blivit modifierad s&aring; att kryptografiska funktioner
    blir gjorda "utom-synh&aring;ll" (eng. "out-of-line). De flesta simpla mjukvaruIPsec
    stackarna beh&ouml;ver g&ouml;ra kryptografi n&auml;r den bearbetar varje
    paket. Det resulterar i synkront utf&ouml;rande (eng "synchronous performance").
    F&ouml;r att anv&auml;nda h&aring;rdvara ordentligt och snabbt, beh&ouml;ver man 
    skilja p&aring; dessa tv&aring; komponenter - som vi nu har gjort. Faktum &auml;r att
    genom att ha gjort det h&auml;r, vinner man &auml;ven lite prestanda i mjukvarufallen.
<p>
<li><b>HiFn 7751</b><br>
    Kort som anv&auml;nder <a href="http://www.hifn.com/products/7751.htm">HiFn 7751</a>
    kan anv&auml;ndas som kryptografiska acceleratorer (till exempel,
    <a href="http://www.powercrypt.com">PowerCrypt</a>).
    Nuvarande prestanda med en enda HiFn 7751 p&aring; b&aring;da sidor om tunneln
    &auml;r 63 Mbit/sec f&ouml;r 3DES/SHA1 ESP, n&auml;stan en f&ouml;rb&auml;ttring
    p&aring; 600% &ouml;ver att anv&auml;nda en P3/550 processor. Fortsatta
    f&ouml;rb&auml;ttringar &auml;r p&aring; v&auml;g att l&ouml;sa ett par
    problem, men fr&aring;n och med den 13 april &aring;r 2000 betraktas koden
    som stabil. Vi skrev v&aring;r egen drivrutin f&ouml;r att st&ouml;dja detta chip,
    ist&auml;llet f&ouml;r att anv&auml;nda den (USA-gjorda) drivrutinen
    <a href="http://www.powercrypt.com">powercrypt</a>, likas&aring; l&auml;nkar v&aring;r
    drivrutin ordentligt med IPsec stacken.
    <p>
    7751:an &auml;r ansedd som l&aring;ngsam enligt industristandarder och m&aring;nga
    f&ouml;rs&auml;ljare har snabbare chip (&auml;ven HiFn har nu snabbare men dyrare chip).
    Vi jobbar mot att st&ouml;dja andra chips, s&aring; som:
    <p>
    <ul>
    <li><a href="http://www.ire.com/OEM/OEMTechnologyDefault.htm">IRE 2141</a>
    <li><a href="http://www.bluesteelnet.com/product.html">Bluesteelnet 5501</a>
    <li><a href="http://www.pcc.pijnenburg.nl/pcc-ises.htm">Pijnenburg PCC-ISES</a>
    <li>kanske
    <a href="http://www.3com.com/promotions/3c990promo/index.html">3com 3c990</a>
    <li>och andra.
    </ul>
    <p>
    IRE och Bluesteelnet har varit mycket v&auml;nliga, och givit oss
    all information som vi beh&ouml;ver f&ouml;r att st&ouml;dja deras h&aring;rdvara.
    Andra s&auml;ljare st&aring;r p&aring; v&aring;r lista, men vi fokuserar oss p&aring;
    de snabba+billiga l&ouml;sningarna f&ouml;rst.
    Intel (och 3Com till en mindre grad) f&ouml;rst&aring;r &auml;nnu inte riktigt 
    hur de skulle kunna dra nytta av att ge oss dokumentation p&aring; deras
    kryptografiska kort, s&aring; kontakta dem g&auml;rna och uppmuntra dem.
    <p>
    Om folk vill hj&auml;lpa till med att skriva drivrutiner, 
    <a href="#people">kom och hj&auml;lp oss</a>.
<p>
<li><b>Intel 82802AB/82802AC Firmware Hub RNG</b><br>
    82802 FWH chipet (hittas i i810, i820 och i840 moderkort) inneh&aring;ller
    en slumptalsgenerator (RNG). H&ouml;gpresterande IPsec kr&auml;ver mer
    slumptals entropi. 

    Fr&aring;n och med den 10 april &aring;r 2000 st&ouml;djer vi 
    RNG:en. Vi kommer att l&auml;gga till st&ouml;d f&ouml;r andra RNG:er funna 
    p&aring; andra kryptochips.
<p>
<li><b>OpenSSL</b><br>
    Vi har stora planer p&aring; att st&ouml;dja kryptokort som kan g&ouml;ra 
    RSA eller DSA, och exportera funktionerna f&ouml;r alla kryptokorten till OpenSSL
    s&aring; att anv&auml;ndar-program (till exempel <a href="http://www.openssh.com">ssh</a>,
    <a href="http://www.modssl.org/">apache https</a>, etc)
    kan dra f&ouml;rdel av dem.
</ul>

<p>
<a name="people"></a>
<h3><font color="#e00000">Internationella kryptrografer s&ouml;kes</font></h3><p>

Sj&auml;lvklart beh&ouml;ver v&aring;rt projekt folk som kan jobba p&aring; dessa system.
Om n&aring;gon icke-amerikansk kryptograf "who meets the constraints listed" tidigare
&auml;r intresserad i att hj&auml;lpa oss med inb&auml;ddad kryptografi i OpenBSD,
var god kontakta oss.<p>

<p>
<a name="papers"></a>
<h3><font color="#e00000">Fortsatt l&auml;sning</font></h3><p>

Ett antal av dokument har skrivits av OpenBSD team-medlemmar, om
kryptografiska &auml;ndringar som har gjorts i OpenBSD.
Postscriptversioner av dessa dokument finns tillg&auml;ngliga, h&auml;r:
<p>

<ul>
<li>A Future-Adaptable Password Scheme.<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    av <a href="mailto:provos@openbsd.org">Niels Provos<a/>,
    <a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
    <a href="../papers/bcrypt-paper.ps">dokument</a> och
    <a href="../papers/bcrypt-slides.ps">diabilder</a>.
<p>
<li>Cryptography in OpenBSD: An Overview.<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    av <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
    <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
    <a href="mailto:art@openbsd.org">Artur Grabowski</a>,
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/crypt-paper.ps">dokument</a> och
    <a href="../papers/crypt-slides.ps">diabilder</a>.
</ul>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>Originally [OpenBSD: crypto.html,v 1.53 2000/04/13 13:10:58 deraadt Exp ]<br>
$Translation: crypto.html,v 1.3 2000/04/28 13:28:49 jj Exp $<br>
$OpenBSD: crypto.html,v 1.3 2000/04/28 23:26:06 wvdputte Exp $
</small>

</body>
</html>
