
<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD: Projektm&aring;l</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2000 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<img alt="[OpenBSD]" height="30" width="141" SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Projektm&aring;l</font><hr></h2>

<p>
Sj&auml;lvfallet har varje utvecklare som jobbar p&aring; OpenBSD
sina egna m&aring;l och prioriteringar, men det &auml;r m&ouml;jligt att
sammanfatta de m&aring;l vi alla delar:

<ul>
<li>Erbjuda den b&auml;sta m&ouml;jliga utvecklingsplatformen.
	<a href="anoncvs.html">Erbjuda full tillg&aring;ng till k&auml;llkoden 
	f&ouml;r utvecklare och anv&auml;ndare, inklusive m&ouml;jligheten att
	titta p&aring; CVS-tr&auml;d-&auml;ndringar direkt</a>.
	Anv&auml;ndare kan till och med titta p&aring; v&aring;rt k&auml;llkodstr&auml;d
	och se &auml;ndringar <a href="http://www.openbsd.org/cgi-bin/cvsweb">direkt p&aring; webben!</a>
<p>
<li>Integrera bra kod fr&aring;n vilken k&auml;lla som helst med <a href="../policy.html">acceptabelt upphovsr&auml;ttsskydd
	(Berkeley-stil f&ouml;redras, GPL accepteras, NDA accepteras inte)</a>.
	Vi vill g&ouml;ra k&auml;llkod tillg&auml;nglig som alla kan anv&auml;nda till VILKET &Auml;NDAM&Aring;L
	SOM HELST, utan restriktioner.
	<strong>Vi str&auml;var efter att g&ouml;ra v&aring;r mjukvara robust och s&auml;ker, och uppmuntra f&ouml;retag
	att anv&auml;nda vilken del som helst.</strong> Det finns <a href="../products.html">kommersiella avknoppningar</a>
	av OpenBSD.
<p>
<li>Uppm&auml;rksamma <a href="security.html">s&auml;kerhetsproblem och fixa dem, innan n&aring;gon annan g&ouml;r det</a>.
	(F&ouml;rs&ouml;ka att vara det s&auml;kraste operativsystemet).
<p>
<li><a href="crypto.html">B&auml;ttre integration av kryptografisk mjukvara</a>.
	Det betyder IPsec, IPv6, nyckel-hanterare, Kerberos, fri-AFS, 
	och andra former av starkt krypto eller krypto-anv&auml;ndande system.
	OpenBSD &auml;r utvecklat och sl&auml;ppt ifr&aring;n Kanada och enligt
	kanadensisk lag &auml;r det helt legalt att exportera krypto till resten av
	v&auml;rlden. (Vilket <a href="http://insight.mcmaster.ca/org/efc/pages/doc/crypto-export.html">
	en kanadensisk individ har unders&ouml;kt</a> och som &auml;ven &auml;r <a href="http://axion.physics.ubc.ca/ECL.html">
	dokumenterat i ECL, Export Control List of Canada</a>).
	OpenBSD-utvecklare arbetar aktivt med och forskar om IPsec och 
	<a href="http://www.physnet.uni-hamburg.de/provos/photuris/">Photurisnyckelhanteraren</a>.
<p>
<li>F&ouml;lja och implementera standarder (ANSI, POSIX, delar av X/Open osv).
<p>
<li>Arbeta mot en maskinoberoende k&auml;llkod.
	<a href="plat.html">St&ouml;dja s&aring; m&aring;nga system
	och s&aring mycket h&aring;rdvara som m&ouml;jligt</a>.
<p>
<li>Vara s&aring; opolitisk som m&ouml;jligt; l&ouml;sningar b&ouml;r best&auml;mmas med basis
	p&aring; dess tekniska meriter.
<p>
<li>Inte l&aring;ta allvarliga problem vara ol&ouml;sta.
<p>
<li>Erbjuda en god korskompilerings- och utvecklingsmilj&ouml; f&ouml;r flera plattformar.
<p>
<li>Importera externa paket med minimal modifikation - g&ouml;ra uppgraderingar
	mycket enklare. &Auml;ven skicka tillbaka alla eventuella &auml;ndringar
	gjorda i koden, till dess utvecklare.
<p>
<li>G&ouml;ra en CDROM-baserad utg&aring;va ungef&auml;r var sj&auml;tte m&aring;nad, 
	s&auml;rskilt f&ouml;r att finansiera projektet...
<p>
</ul>

<a name="funding">
<h2><font color=#e00000>Finansiering av projektet</font></h2>

Naturligtvis kr&auml;ver OpenBSD-projektet pengar f&ouml;r att kunna operera, 
dels p&aring; grund av internetkostnader och samma h&aring;rdvaruuppgraderingar
som alla andra ocks&aring; upplever. D&auml;rf&ouml;r s&auml;ljer projektet CDROM-skivor
av v&aring;ra nyaste utg&aring;vor. Projektet b&ouml;rjade ocks&aring; g&ouml;ra T-shirts f&ouml;r
driva projektet. N&auml;r du k&ouml;per en OpenBSD CD eller T-shirt, antingen p&aring; 
en konferens, fr&aring;n en av dina lokala aff&auml;rer, eller fr&aring;n v&aring;r <a href="../orders.html">
best&auml;llningssida</a>, s&aring; hj&auml;lper du till att &ouml;ka chanserna att OpenBSD kommer att ge
ut &auml;nnu fler utg&aring;vor.

<p>
Det &auml;r ocks&aring; m&ouml;jligt att donera pengar eller <a href="../want.html">h&aring;rdvara</a>,
i vilket fall ditt namn hamnar p&aring; v&aring;r <a href="../donations.html">donationssida</a>.
F&ouml;r mer information ang&aring;ende det h&auml;r kontakta <a href="mailto:deraadt@openbsd.org">
Theo de Raadt</a>, eller skicka helt enkelt bara en donationscheck i kanadensiska- eller USA-dollar till:

<p>
OpenBSD<br>
812 23rd Ave SE<br>
Calgary, Alberta<br>
Canada<br>
T2G 1N8<br>
(Var noggrann att st&auml;lla checken till "Theo de Raadt", eftersom han inte kan 
f&aring; ut pengar som &auml;r st&auml;llda till "OpenBSD")
<br>

<p>
Det &auml;r nu dessutom m&ouml;jligt att donera pengar till projektet online, 
genom att skicka pengar till obsdpaypal@openbsd.org via
<a href="https://secure.paypal.x.com/refer/pal=obsdpaypal%40openbsd.org">paypal</a>.

<p>
&Auml;ven om donationer inte &auml;r avdragsgilla i USA som g&aring;vor, s&aring; kan de vara
avdragsgilla som arbetsutgifter, och om n&aring;gon s&aring; &auml;r ben&auml;gen s&aring; 
kan de fr&aring;ga sin revisor om r&aring;d. Detsamma g&auml;ller f&ouml;r andra l&auml;nder,
d&auml;r f&ouml;retag kan dra av donationer som "Good Will".

<p>
I b&ouml;rjan spenderade Theo de Raadt mer &auml;n $30 000 (CDN, kanadensiska dollar)
f&ouml;r att starta OpenBSD; mestadels p&aring; grund av de dyra n&auml;tverkskostnaderna i Kanada
(p&aring; grund av USA:s krypto-policy &auml;r det inte m&ouml;jligt att flytta projektet till USA).
Hittills har ingen seri&ouml;s finansiering eller st&ouml;djande av utgifter av projektet 
kommit ifr&aring;n n&aring;got f&ouml;retag eller institution.
Theo jobbar heltid med att f&ouml;rb&auml;ttra OpenBSD,
och mycket av projektets pengar g&aring;r &aring;t till att k&ouml;pa ny h&aring;rdvara &aring;t utvecklarna 
s&aring; de kan forts&auml;tta att f&ouml;rb&auml;ttra OpenBSD (till exempel, mer &auml;n 20 nya sorters av
Ethernet-kort har dykt upp p&aring; marknaden sedan OpenBSD startades).
F&ouml;ljdaktligen, finansiering beh&ouml;vs hela tiden. Fortsatta donationer fr&aring;n v&aring;r anv&auml;ndarbas &auml;r
vad som f&ouml;rs&auml;krar att OpenBSD kommer att forts&auml;tta att existera. 

<hr>

<h2><font color="#e00000">Vart bor v&aring;ra utvecklare?</font></h2>

Denna karta visar ungef&auml;r var v&aring;ra utvecklare bor. 
Vi kommer sporadiskt att f&ouml;rs&ouml;ka uppdatera den, 
men r&auml;kna inte f&ouml;r mycket p&aring; det. 

<p>
<center>
<img src="../images/map.jpg" height="508" width="950" alt="V&auml;rldskarta">
</center>

<hr>

<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: goals.html,v 1.51 2000/10/20 23:25:40 millert Exp ]
<br>
$Translation: goals.html,v 1.13 2001/02/21 00:31:17 javax Exp $
<br>
$OpenBSD: goals.html,v 1.8 2001/02/21 20:50:31 jufi Exp $
</small>

</body>
</html>
