<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/i386 laptop sidan</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD laptop">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997-2000 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenBSD]" height="30" width="141" SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">i386 laptop status</font><hr></h2>

<p>
Detta &auml;r en lista &ouml;ver laptops som vi vet fungerar
med OpenBSD 2.8.

<p>
Om din laptop inte &auml;r listad nedan, betyder det inte att den inte 
funkar, och du kommer troligtvis hitta en liknande modell listad nedan.
I och med OpenBSD 2.8 f&aring;ngerar mer eller mindre alla laptops
mycket bra, med bara n&aring;gra f&auml; mindre problem kvarst&aring;ende.
Nyare utg&aring;vor av OpenBSD fungerar &auml;nnu b&auml;ttre.

<p>
Bland de som har problem...
<ul>
<li>Vissa uppvisar problem med APM-st&ouml;det. Observera
att <strong>apm -S</strong> misslyckas att s&auml;tta vissa laptops
i vilol&auml;ge, men det &auml;r inte n&aring;gra st&ouml;rre bekymmer.
<li>N&aring;gra saknar ljudst&ouml;d.
<li>N&aring;gra f&aring; har sv&aring;rf&aring;ngade buggar med deras PCMCIA-, och Cardbus-st&ouml;d.
<li>XFree86 funkar inte korrekt med vissa grafikkort/sk&auml;rmar. Ibland l&ouml;ser XFree86 4.x problemen.
<li>Eller att n&aring;gon annan inbyggd enhet inte funkar...
<li>N&aring;gra har problem med interrupts vid uttagning av PCMCIAkort.
</ul>

<p>

Om din laptop fungerar (eller inte fungerar) och den
inte finns listad nedanf&ouml;r, var god maila <a href="mailto:www@openbsd.org">www@openbsd.org</a>
s&aring; att den kan bli listad. Var god och ge s&aring; mycket
information som m&ouml;jligt.

<p>
APM problem ska skickas till v&aring;ra APM-utvecklare,
<a href="mailto:mickey@openbsd.org">Michael Shalayeff</a> och
<a href="mailto:weingart@openbsd.org">Tobias Weingartner</a>.

<p>
<table border="1">
<tr>
	<th>Laptop</th>
	<th>Noteringar</th>
</tr><tr>
    <td>
	Sony VAIO F430
    </td><td>
	Vid OpenBSD 2.6-Current (17 februari/2000)
	
	<p>
	APM: "<strong>zzz</strong>" vilol&auml;ge funkar, likas&aring; g&ouml;r
	vilol&auml;get genom tangentbordet. "<strong>halt -p</strong>" och "<strong>apm -S</strong>"
	funkar inte. (Men jag har fortfarande inte letat efter phdisk
	tillbeh&ouml;ren nedan - ska utreda det snart).

	<p>
	DVD enhet, diskettstation - alla fungerar. Med det kort som jag
	anv&auml;nder (3Com 3C589) s&aring; funkar Ethernet efter en uppvakning.

	<p>
	Kontakta <a href="mailto:beck@openbsd.org">Bob Beck</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO z505r
    </td><td>
	
	APM st&ouml;d: "<strong>zzz</strong>", vilol&auml;ge via tangentbord,
	hibernation via tangentbord och "<strong>halt -p</strong>" funkar.
	"<strong>apm -S</strong>" vaknar upp direkt.

	<p>
	Hibernation anv&auml;nder ett block p&aring; slutet av disken, ungef&auml;r
	3-5MB st&ouml;rre &auml;n minnet i din maskin. F&ouml;r att reparera 
	hibernation:en; anv&auml;nd "<strong>phdisk.exe /create /partition</strong>".
	phdisk programmet finns p&aring; bootdisken p&aring; den f&ouml;rsta 
	&aring;terh&auml;mtnings (eng. "recovery") CD:en.

	<p>
	Det inbyggda n&auml;tverkskortet funkar fint, men kr&auml;ver ibland att det
	&aring;terst&auml;lls efter varje g&aring;ng man g&aring;r ut ur 
	vilol&auml;ge. Det vill s&auml;ga: "<stron>ifconfg fxp0 down; ifconfig fxp0 up</strong>".

	<p>
	Efter att ha varit i vilol&auml;ge funkar inte profilingklockan. Patchar &auml;r p&aring;
	v&auml;g.

	<p>
	Ljud fungerar genom neo(4) drivrutinen. Ibland vid uppstart h&auml;nger sig
	systemet n&auml;r det f&ouml;rs&ouml;ker best&auml;mma AC97 mixertypen.

	<p>
	N&auml;r minnes slotet &auml;r tomt, kan det orsaka felmeddelanden som 
	sv&auml;mmar &ouml;ver dmesg buffern, och genom det f&ouml;rvirrar
	OpenBSD installationsprogrammet. BIOS setup:en (&aring;tkommlig via F2)
	har ett val f&ouml;r att inaktivera minnes slotet.

	<p>
	En XF86Config-fil anpassad f&ouml;r XFree86 3.3.X kan &aring;terfinnas
	<a href="../xf86configs/vaioz505r">h&auml;r</a>.
	<p>

	Kontakta <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO z505s
    </td><td>
	Liknande VAIO z505r, f&ouml;rutom att den medf&ouml;ljande 
	USB diskettstationen har n&aring;gra problem.

	<p>
	Kontakta <a href="mailto:provos@openbsd.org">Niels Provos</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO 747</td>
    </td><td>
	Efter OpenBSD 2.6 fungerar XFree86 och APM.

	<p>
	Skeppas med ett PCMCIA-modemkort (COM One MCC220 Platinium Card), 
	som fungerar fint.

	<p>
	Ljud funkar (endas 8 bitars).

	<p>
	APM upptr&auml;der liknande som f&ouml;r VAIO z505r,
	f&ouml;rutom att hibernation inte har testats.

	<p>
	USB funkar inte.

	<p>
	En XF86Config file kan finnas
	<a href="../xf86configs/vaio747">h&auml;r</a>.<p>

	Kontaka <a href="mailto:markus@openbsd.org">Markus Friedl</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO PCG 505-FX
    </td><td>
	Ok&auml;nt.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 701C
    </td><td>
	Alla funktioner, inklusive hibernation och APM funkar.

	<p>
	Kontakta <a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 770Z
    </td><td>
	I och med OpenBSD 2.8 funkgerar n&auml;stan allting perfekt.

	<p>
	Den h&auml;r laptopen har egentligen inget riktigt BIOS; 
	de flesta utav enhetsinst&auml;llningarna, som IRQ-tilldelning osv,
	m&aring;ste utf&ouml;ras via Windows.

	<p>
	Du kan f&aring; de seriella och infrar&ouml;da portarna att 
	k&auml;nnas igen som com*-enheter genom att leka med IRQ-tilldelningar
	i Windows. Samma sak g&auml;ller f&ouml;r parallellporten (vilken 
	&auml;r lpt2).

	<p>
	Du kommer att beh&ouml;va f&ouml;ljande rad i din kernel-konfiguration
	f&ouml;r att f&aring; APM att fungera:

	<pre>
	option              APM_DISABLE_INTERRUPTS=0
	</pre>

	<p>
	Hibernation (sparning till disk) fungerar fint, s&aring; l&auml;nge
	du har en Windowspartition med tillr&auml;ckligt mycket diskutrymme
	(en aning mer &auml;n systemminnet). Suspendering/&aring;teruppv&auml;ckande/
	avst&auml;ngning fungerar allihopa fint, dock - invokering av hibernation
	medans i X-l&auml;ge (testat med XFree86 3.3.6) korrupterar framebuffern, 
	och det verkar som om enda s&auml;ttet att l&ouml;sa felet &auml;r att 
	st&auml;nga av och starta om X-servern; att bara byta virtuell konsoll
	l&ouml;ser det inte. Det har dock f&ouml;reslagits att byte av olika
	uppl&ouml;sningar skulle fixa det. XFree86 4.0 l&ouml;ser problemet, 
	men senast jag kollade hade jag inte accelererat st&ouml;d f&ouml;r
	drivrutinen. B&auml;sta s&auml;ttet runt alltihopa &auml;r att byta
	till textl&auml;ge precis innan hibernating.

	<p>
	Om du aktiverar den externa sk&auml;rmen (Fn+F7), g&aring;r XFree 3.3.6
	in i n&aring;got skumt regnb&aring;geliknande m&ouml;nster, och 
	tillslut till och med fr&ouml;ser hela systemet (om du nu inte byter till
	textl&auml;ge eller d&ouml;dar servern inom ett par sekunder). Om du 
	byter till textl&auml;ge m&aring;ste du d&ouml;da X-servern (byta tillbaka
	till grafiklauml;ge kommer orsaka en krasch). Aktivering av den externa
	sk&auml;rmen medans i videol&auml;ge orsakar inga sidoeffekter; du kan
	sedan starta X eller byta till det, om det redan k&ouml;rs.

	<p>
	clcs drivrutinen &auml;r lite FLAKEY, det b&auml;sta &auml;r att inaktivera den.
	Det spelar egentligen inte n&aring;gon st&ouml;rre roll, eftersom 
	soundblastern (sb) kommer ladda och fungera fint. Det kan t&auml;nkas att du
	m&aring;ste leka lite med IRQ-tilldelningar f&ouml;r att f&aring; det 
	att fungera.

	<p>
	En XF86Config-fil kan finnas <a href="../xf86configs/thinkpad770z">h&auml;r</a>.

	<p>
	Kontakta <a href="mailto:angelos@openbsd.org">Angelos Keromytis</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad A21p
    </td><td>
        Se noteringarna f&ouml;r T21:an. Allting &auml;r detsamma, f&ouml;rutom
	videokortet, som &auml;r ett ATI Rage 128 Mobility LF. OpenBSD 2.8 efter
	mitten av december tillsammans med XFree86 4.0.2 fungerar utm&auml;rkt i
	1600x1200 24bpp. Du beh&ouml;ver:
	<pre>
	        sysctl -w machdep.allowaparture=2
	</pre>
	och ange det korrekta frekvensomf&aring;nget i Monitor-sektionen i
	XF86Config. H&auml;r &auml;r en fungerande <a href="../xf86configs/thinkpada21p">
	XF86Config</a>.
    </td>
</tr><tr>
     <td>
        IBM Thinkpad T21
     </td><td>
        <p>
	I och med OpenBSD 2.8 fungerar allting fint.

	<p>
	H&auml;r &auml;r fdisk utskriften; enklaste s&auml;ttet att 
	f&aring; till den &auml;r genom att &auml;ndra storleken p&aring;
	Windowspartitionen (jag anv&auml;nder PartitionMagic) och flytta
	den till slutet av disken, och sedan skapa en OpenBSD-partition
	(och strunta i partitionsf&ouml;r&auml;ndringarna fdisk g&ouml;r
	-- bara tuta och k&ouml;ra och skapa alla filsystem du vill ha
	med disklabel.)

	<p>

<pre>
         Starting        Ending
 #: id  cyl  hd sec -   cyl  hd sec [     start -       size]
-------------------------------------------------------------------------
 0: 1C 1023   1   1 -  1023 239  63 [  42003423 -   20502657] <Unknown ID>
*1: A6    0   1   1 -  1021 239  63 [        63 -   15452577] OpenBSD     
 2: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
 3: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
</pre>


        <p>
	F&ouml;r att f&aring; den att k&auml;nna igen de seriella och
	infrar&ouml;da portarna (b&aring;da som com* enheter) m&aring;ste
	du leka lite med IRQ-tilldelningarna i BIOS:et. S&auml;tt dem
	till standardv&auml;rdena som finns i GENERIC konfigfilen. 
	Likadant f&ouml;r den parallella porten (OpenBSD kan uppt&auml;cka
	den som lpt2). Antagligen kan du beh&ouml;va att leka lite 
	Windows tilldelningar f&ouml;r att f&aring; det h&auml;r att 
	funka ocks&aring;.

	<p>
	F&ouml;r tillf&auml;llet finns det &aring;tminstone tv&aring;
	miniPCI-kort tillg&auml;ngliga: det ena &auml;r ett 
	WinModem (som inte st&ouml;ds), och det andra &auml;r ett 
	kombinerat Ethernet/modem-kort. Ethernet-delen fungerar bra
	(hittas som ett fxp/inphy-kort), modemet d&auml;remot, 
	ser ut att vara ett &auml;kta, men st&ouml;ds inte f&ouml;r
	tillf&auml;llet.

	<p>
	Ljudet (CS4614) fungerar bra. F&ouml;r att undvika systemfrysningar
	n&auml;r man anv&auml;nder Cardbus och ljud samtidigt, *kan*
	det beh&ouml;vas att du s&aumL;tter &aring;tminstone tv&aring;
	IRQ:er &aring;t PCI-enheter i BIOS:et - jag anv&auml;nder 9 och 11.
	Det &auml;r ocks&aring; n&ouml;dv&auml;ndigt att st&auml;nga av
	PCI Power Management i BIOS Power-konfigurationen (det &auml;r den
	enda menyn som kan scroll:a, s&aring; se till att du g&aring;r
	till nedersta botten av sidan. :-)

	<p>
	APM fungerar f&ouml;rutom hibernation (kr&auml;ver st&ouml;d i OS:et).
	F&ouml;r att f&aring; "halt -p" att fungera, m&aring;ste du s&auml;tta
	sysctl-variabeln machdep.apmhalt till 1 (du beh&ouml;ver OpenBSD
	2.8-current med k&auml;llkod fr&aring;n mitten av januari, eller senare).
	Du beh&ouml;ver f&ouml;ljande rad i k&auml;rnans konfigurationsfil
	f&ouml;r att APM ska fungera &ouml;ver huvud taget:

<pre>
option         APM_DISABLE_INTERRUPTS=0
</pre>


        <p>
	&Auml;ven om grafikkortet ska fungera under XFree86 3.3.6pl8, s&aring;
	har jag bara f&aring;tt det att fungera med XFree86 4.0.1 tillsammans
	med <a href="http://www.probo.com/timr/savagemx.html">dessa</a> patcher
	(du kan &auml;ven finna bin&auml;rer av drivrutinen f&ouml;r OpenBSD 2.8
	p&aring; samma st&auml;lle). Du be&ouml;ver en k&auml;rna med "option
	INSECURE", och &auml;ven securelevel satt till -1 i /etc/rc.securelevel
	(s&aring; att X-servern kan &ouml;ppna /dev/mem och mmap():a BIOS:et).
	Med denna konfiguration kan den g&ouml;ra 1400x1050, 16bpp (version
	1.1.13 av Savage-drivrutinen fungerar dessutom bra i 24bpp-l&auml;ge).

	<p>
	<strong>UPPDATERING:</strong>
	Ovanst&aring;ende n&auml;nda patchar har blivit inkluderade i XFree86
	4.0.2, och fungerar r&auml;tt ur boxen. Du beh&ouml;ver inte en 
	k&auml;rna med "option INSECURE" satt, s&auml;tt bara sysctl-variabeln
	machdep.allowaparture till 2 (f&ouml;rslagsvis i /etc/sysctl.conf). 
	Detta f&ouml;ruts&auml;tter att du har OpenBSD 2.8 (eller senare)
	byggd efter den 15:e december, 2000. 

	<p>
	Notera att vissa modeller bara klarar 1024x768. De som kan g&ouml;ra
	1400x1050 kan ocks&aring; g&ouml;ra 1600x1200 virtuellt (det vill s&auml;ga;
	hela sk&auml;rmytan scrollar n&auml;r du g&aring;r "utanf&ouml;r
	sk&auml;rmen") - det har jag i och f&ouml;r sig inte testat under OpenBSD, 
	men under Windows fungerar det.

	<p>
	Om du st&auml;nger locket p&aring; laptopen s&auml;tts systemet i vilol&auml;ge.
	Under XFree86 4.0 fungerar &aring;tervuppv&auml;ckning helt okej med
	bilden/sk&auml;rmen i &aring;tanke (XFree86 3.3.6 kanske inte klarar av det,
	s&aring; var fallet p&aring; en ThinkPad 770X i alla fall).

	<p>
	En XF86Config-fil f&ouml;r XFree86 4.0 kan f&aring;s 
	<a href="xf86configs/thinkpadt21">h&auml;r</a>.

	<p>
	En v&auml;ldigt irriterande sak &auml;r n&auml;r du tar ut en av
	UltraBay 2000-enheterna; systemet b&ouml;rjar pipa. Enda s&auml;ttet
	att f&aring; den att sluta &auml;r genom att f&ouml;rs&auml;tta den
	i vilol&auml;ge och sedan stoppa in en enhet i UltraBay:en (inte
	n&ouml;dv&auml;digtvis i samma). Notera att hot swap av UltraBay 2000-enheter
	inte st&ouml;ds i OpenBSD (i och med 2.8), det &auml;r d&auml;rf&ouml;r
	bara s&auml;kert att hot swap:a batterier.

       <p>Kontakta <a href="mailto:angelos@openbsd.org">Angelos Keromytis</a>.</p>
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 760
    </td><td>
	XFree86 och APM funkar inte i OpenBSD 2.6.

	<p>
	Nyare versioner av XFree86 st&ouml;djer X, patchar finns
	att tillg&aring;.

	<p>
	MWave modem/ljud funkar inte.

	<p>
	APM har ocks&aring; blivit fixat efter 2.6, patchar kommer.

	<p>
	Kontakta <a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
     <td>
       IBM Thinkpad T20
    </td><td>
	Att k&ouml;ra aPm I OpenBSD 2.7, och senare, fungerar till 
	stort sett. F&ouml;r att f&aring; "halt -p" att fungera m&aring;ste
	du s&auml;tta sysctl-variabeln machdep.apmhalt till 1 (du beh&ouml;ver
	OpenBSD 2.8-current fr&aring;n mitten av januari, eller senare). 
	Burken g&aring; ned i vilol&auml;ge som den ska, n&auml;r locket
	st&auml;ngs. Vaknar upp fint, n&auml;r locket &ouml;ppnas, g&ouml;r
	den ocks&aring;.

	<p>
	Det inbyggda modemet &auml;r ett Winmodem - ignorera det. 
	Faktum &auml;r att det ligger p&aring; ett "mini-pci" kort,
	s&aring; det borde kunna tas bort.	

	<p>
	Ljudet fungerar, men du m&aring;ste st&auml;nga av PCI sleep mode i 
	BIOS:et.

	<p>
	OpenBS X11 fungerar fint p&aring; den h&auml;r maskinen i och med 
	2.8, men det &auml;r en hel del visuellt skr&auml;p med 32bpp.
	Bilden &auml;r dock fin med 16bpp.

	Kolla p&aring; <a href="http://www.snafu.org/t20/">http://www.snafu.org/t20/</a>
	f&ouml;r information.
 
	Kontakta <a href=mailto:marc@snafu.org>Marco S Hyman</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 50CT
    </td><td>
	APM funkar, men du m&aring;ste se till att vara f&ouml;rsiktig
	till att inte anv&auml;nda de sista 32MB eller s&aring; av disken,
	eftersom det &auml;r d&auml;r BIOS:et dumpar l&aring;ngtids-imagen 
	f&ouml;r hibernation:en. Du kan ta en titt p&aring; BIOSgeometrin
	i disklabel f&ouml;r att se exakt hur m&aring;nga sektorer den vill ha.
	Om du inte g&ouml;r detta kommer det orsaka korruption av 
	filsystemet i och med aktivering av vilol&auml;ge.

	<p>
	Libretton anv&auml;nder en enda IRQ f&ouml;r b&aring;de <strong>sb</strong>
	och <strong>wss</strong>, s&aring; den b&auml;sta saken att g&ouml;ra
	&auml;r att v&auml;lja en av dem och inaktivera den andra i k&auml;rnan.
	Den externa PCMCIA diskettstationen st&ouml;ds inte f&ouml;r tillf&auml;llet
	av OpenBSD, men kan anv&auml;ndas under installation.

	<p>
	Installationen kan vara en aning knepig med bara en
	PCMCIAslot. B&auml;sta s&auml;ttet att g&ouml;ra det p&aring;
	&auml;r en n&auml;tverksinstallation. F&ouml;r att g&ouml;ra
	det, boota med diskett och vid bootprompten skriv <em>boot -c</em>.
	N&auml;r du ser <em>UKC</em> prompten, koppla ur diskettstationen
	och koppla ist&auml;llet in ditt n&auml;tverkskort och skriv sedan
	<em>exit</em>. K&auml;rnan kommer d&aring; unders&ouml;ka n&auml;tverkskortet
	och du ska kunna g&ouml;ra en vanlig installation &ouml;ver n&auml;tverket.
	Du kan kanske finna det n&ouml;dv&auml;ndigt att inaktivera ljudenheten
	i BIOS:et f&ouml;r att kunna boota p&aring; disketten f&ouml;r att 
	kunna finna ditt n&auml;tverkskort ordentligt.


	<p>
	En XF86Config fil anpassad till XFree86 3.3.X kan &aring;terfinnas
	<a href="../xf86configs/libretto50ct">h&auml;r</a>.
	
	<p>
	Kontakta <a href="mailto:millert@openbsd.org">Todd Miller</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 100CT
    </td><td>
	Den mesta informationen f&ouml;r Libretto 50CT g&auml;ller
	&auml;ven f&ouml;r 100CT.

	<p>
	X11 funkar fint i 800x400 l&auml;ge. En XF86Config fil
	anpassad f&ouml;r XFree86 3.3.X kan &aring;terfinnas
	<a href="../xf86configs/libretto100ct">h&auml;r</a>.

	<p>
	Kontakta <a href="mailto:marc@snafu.org">Marc Hyman</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Portege 660CDT
    </td><td>
	APM &auml;r helt trasigt. 

	<p>
	Den mixade <strong>sb</strong> och <strong>wss</strong>
	ljudh&aring;rdvaran kan vara r&auml;tt bedr&ouml;vlig.
	Nyare versioner av flash BIOS:et &auml;r v&auml;rre, eftersom
	de &auml;r mindre flexibla i vilka interrupt som de till&aring;ter.

	<p>
	Kontakta <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr><tr>
    <td>
	Digital HiNote VP735
    </td><td>
	APM funkar helt.

	<p>
	Allt p&aring; maskinen funkar.

	<p>
	En XF86Config fil anpassad f&ouml;r XFree86 3.3.X kan &aring;terfinnas
	<a href="../xf86configs/hinotevp700">h&auml;r</a>.

	<p>
	Kontaka <a href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</tr><tr>
    <td>
	Fujitsu Lifebook C325
    </td><td>
	APM funkar fullst&auml;ndigt.

	<p>
	Ljud funkar n&auml;r BIOS:et blir tillsagt
	att aktivera emuleringsl&auml;ge av SB.
	Allt annat funkar p&aring; den h&auml;r maskinen.

	<p>
	Kontakta <a href="mailto:tom@knienieder.com">Tom Knienieder</a>.
    </td>
</tr><tr>
    <td>
	Fujitsu Stylistic 500
    </td><td>
	APM funkar.

	<p>
	Seriella porten funkar inte.

	<p>
	Lite pyssel beh&ouml;vs f&ouml;r sm&aring; minnesk&auml;rnor (4MB).

	<p>
	X "funkar", skr&auml;par ned som en galning.

	<p>
	Kontakta <a href="mailto:d@openbsd.org">David Leonard</a>.
    </td>
</tr><tr>
    <td>
	Siemens SCENIC Mobile 360
    </td><td>
	APM funkar helt.

	<p>
	Ljud funkar genom OSS.

	<p>
	Kontakta <a href="mailto:b1000@softhome.net">Dan Carlsson</a>.
    </td>
</tr><tr>
    <td>
	Dell Inspiron 3200 D233XT (BIOS utg&aring;va: A10)
    </td><td>
	APM funkar helt.

	<p>
	Nedg&aring;ng i vilol&auml;ge och nedsparning (till RAM eller disk) funkar inte under X
	(X-servern &aring;terst&auml;ller inte sk&auml;rmen efter en &aring;terupptagning),
	men DPMS funkar (sk&auml;rmen st&auml;ngs av efter en viss inaktivitet).
	BIOS APM inst&auml;llningar (f&ouml;r automatisk nedg&aring;ng i vilol&auml;ge)
	krockar med X-servern och b&ouml;r inaktiveras.

	<p>
	Nedsparning till disk beh&ouml;ver en DOS (FAT16) partition
	inneh&aring;llandes en fil vid namn "SAVE2DSK.BIN". 
	Denna fil skapas via Dell tillbeh&ouml;r under Windows '98.
	Storleken p&aring; filen &auml;r storleken p&aring; RAM-minnet + 2 eller
	3MB). D&auml;rf&ouml;r beh&ouml;vs en DOS partition ad hoc
	(den m&aring;ste vara den f&ouml;rsta partitionen p&aring; disken).

	<p>
	PCMCIA funkar, f&ouml;rutom "realtids" kort uttagningar och is&auml;ttningar
	(vilka l&aring;ser maskinen, en h&aring;rd omstart beh&ouml;vs).

	<p>
	USB funkar inte. Om det &auml;r aktiverat s&aring; h&auml;nger sig
	k&auml;rnan under boot vid detekteringen av USB kontrollern.

	<p>
	Kontakta <a href="mailto:b1000@softhome.net">Dan Carlsson</a>.
    </td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CS
	</td><td>
	APM &auml;r trasigt, fast <strong>halt -p</strong> funkar.

	<p>
	Ljud funkar direkt med GENERIC k&auml;rnan, men h&ouml;gtalarna
	&auml;r inte direkt n&aring;got att hurra f&ouml;r. 
	X funkar fint likas&aring;.

	<p>
	Kontakta <a href="mailto:ericj@monkey.org">Eric Jackson</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CDT
	</td><td>
	APM &auml;r helt trasigt (och kan f&ouml;rst&ouml;ra din disk).

	<p>
	XFree86 funkar (800x600 16bpp).

	<p>
	Ljud funkar (21739 Hz, halv duplex stereo).

	<p>
	<!-- Serial IR is said to work, needs verification. -->

	Kontaka <a href="mailto:brad@openbsd.org">Brad Smith</a>,
	eller <a href="mailto:d@openbsd.org">David Leonard</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 550CDT
	</td><td>
	APM djupsovning (<strong>zzz</strong>) funkar, men <strong>-S</strong> vaknar
	upp direkt.

	<p>
	XFree86 funkar helt okej.

	<p>
	Ljud funkar, efter en del pillande med IRQ:er i BIOS:et.

	<p>
	USB fungerar; n&aring;gorlunda, jag pluggade i en digital kamera och
	<strong>ugen</strong>-drivrutinen hittade och konfigurerade den.

	<p>
	Det inbyggda modemet funkar inte eftersom det kr&auml;ver mjukvara som 
	bara finns f&ouml;r Windows, det vill s&auml;ga, den implementerar 
	inte en &auml;kta RS232 kommunikationsport. 
	
	<p>
	pcic &auml;r trasigt i den h&auml;r maskinen, s&aring; jag kan inte 
	direkt kommentera n&aring;got ang&aring;ende PCMCIA.

	<p>
	Kontakta <a href="mailto:aaron@openbsd.org">Aaron Campbell</a>.
	</td>
</tr><tr>
    <td>
	NEC Versa 2000
    </td><td>
	APM funkar helt.

	<p>
	Allt p&aring; den h&auml;r maskinen funkar.

	<p>
	Kontakta <a href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</tr><tr>
    <td>
        Acer TravelMate 345
    </td><td>
        I och med OpenBSD 2.7-current fungerar APM.

	<p>
	XFree86 fungerar (800x600 16bpp).

	<p>
	Ljudet fungerar.

	<p>
	Lucent modemet fungerar dock inte.

	<p>
	Kontakta <a href="mailto:kevlo@openbsd.org">Kevin Lo</a>.
    </td>
</tr><tr>
    <td>
        Compaq Armada M700<p>
    </td><td>
        APM fungerar korrekt, men du kan inte g&aring; ned i vilol&auml;ge
	medans i X-l&auml;ge. Du m&aring;ste invokera vilol&auml;get
	f&aring;n konsollen.

	<p>
	Cardbus fungerar.

	<p>
	Det interna 10/100 Ethernet-kortet,f&ouml;r de modeller som nu har det,
	fungerar perfekt med fxp-drivrutinen.

	<p>
	Inget ljudst&ouml;d finns f&ouml;r tillf&auml;llet. 
	Folk jobbar dock p&aring; det.

	<p>
	Inget st&ouml;d f&ouml;r det interna modemet finsn. (Det &aumL;r
	ett WinModem.) Det finns bin&auml;r drivrutin f&ouml;r Linux, och
	<a href="http://linmodems.org">linmodem projektet</a>, som
	f&ouml;rs&ouml;ker g&ouml;ra en open source drivrutin f&ouml;r
	WinModem.

	<p>
	En XF86Config-fil kan laddas ned
	<a href="xf86configs/armadam700">h&auml;r</a>.

	<p>
	Kontakta <a href="mailto:nate@openbsd.org">Nathan Binkert</a>.
    </td></tr>
</table>

<hr>
<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: i386-laptop.html,v 1.46 2001/02/19 16:02:34 angelos Exp ]
<br>
$Translation: i386-laptop.html,v 1.5 2001/02/25 17:30:55 javax Exp $
<br>
$OpenBSD: i386-laptop.html,v 1.5 2001/02/25 23:15:11 jufi Exp $
</small>

</body>
</html>
