<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD: S&auml;kerhet</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD advisories">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997-2000 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<img alt="[OpenBSD]" height="30" width="141" SRC="../images/smalltitle.gif">
<p>
<h2><font color=#e00000>S&auml;kerhet</font><hr></h2>

<table width="100%">
<tr>
<td colspan="2">
<strong>Index</strong>
</td>
</tr>
<tr>
<td valign="top">
<a href="#goals">Projektets s&auml;kerhetsm&aring;l</a><br> 
<a href="#disclosure">Fullst&auml;ndig avsl&ouml;jandepolicy</a><br> 
<a href="#process">Granskningsprocess av k&auml;llkoden</a><br> 
<a href="#default">"S&auml;kert ifr&aring;n b&ouml;rjan"</a><br> 
<a href="#crypto">Anv&auml;ndning av kryptografi</a><br> 
<p>
<a href="#watching">F&ouml;lja v&aring;ra &auml;ndringar</a><br> 
<a href="#reporting">Rapportera s&auml;kerhetsfr&aring;gor</a><br> 
<a href="#papers">Fortsatt l&auml;sning</a><br>
<p>
</td>

<td valign="top">
<a href="#28">S&auml;kerhetsr&aring;d till 2.8</a><br>
<a href="#27">S&auml;kerhetsr&aring;d till 2.7</a><br>
<a href="#26">S&auml;kerhetsr&aring;d till 2.6</a><br>
<a href="#25">S&auml;kerhetsr&aring;d till 2.5</a><br>
<a href="#24">S&auml;kerhetsr&aring;d till 2.4</a><br>
<a href="#23">S&auml;kerhetsr&aring;d till 2.3</a><br>
<a href="#22">S&auml;kerhetsr&aring;d till 2.2</a><br>
<a href="#21">S&auml;kerhetsr&aring;d till 2.1</a><br>
<a href="#20">S&auml;kerhetsr&aring;d till 2.0</a><br>
</td>
</tr>
</table>
<hr>

<dl>
<li>
<h3>
<a name="goals"><font color="#e00000">M&aring;l</font></a>
</h3>

<p>
OpenBSD tror p&aring; stark s&auml;kerhet. V&aring;r str&auml;van &auml;r
att vara NUMMER ETT inom industrin f&ouml;r s&auml;kerhet (om vi inte redan &auml;r det). 
V&aring;r &ouml;ppna utvecklingsmodell m&ouml;jligg&ouml;r f&ouml;r oss att ha en mer okompromissad syn
p&aring; &ouml;kad s&auml;kerhet &auml;n vad Sun, SGI, IBM, HP eller andra distribut&ouml;rer kan.
Vi kan g&ouml;ra f&ouml;r&auml;ndringar som de andra inte skulle g&ouml;ra.
Eftersom OpenBSD exporteras med <a href="crypto.html">kryptografi</a>, kan vi ocks&aring; anv&auml;nda
kryptografiska metoder f&ouml;r att fixa s&auml;kerhetsproblem.

<p>
<li><h3>
<a name="disclosure"><font color=#e00000>Fullst&auml;ndig avsl&ouml;jandepolicy</font></a>
</h3>

<p>
Som m&aring;nga l&auml;sare av <a href="http://www.securityfocus.com/bugtraq/archive/">BUGTRAQ-mailinglistan</a> vet,
tror vi p&aring; fullst&auml;ndigt avsl&ouml;jande och full &ouml;ppenhet 
ang&aring;ende s&auml;kerhetsproblem. 
I operativsystemsarenan &auml;r vi nog de f&ouml;rsta att anta konceptet fullt ut.
M&aring;nga distribut&ouml;rer, &auml;ven av fri mjukvara, f&ouml;rs&ouml;ker fortfarande
g&ouml;mma saker ifr&aring;n deras anv&auml;ndare.

<p>
S&auml;kerhetsinformation sprids v&auml;ldigt snabbt inom cracker-kretsar. &Aring; andra sidan, 
v&aring;r erfarenhet &auml;r att kodning och utgivning av ordentliga s&auml;kerhetsfixar
brukar kr&auml;va ungef&auml;r en timmes arbete -- v&auml;ldigt snabba l&ouml;sningar &auml;r m&ouml;jliga. 
D&auml;rf&ouml;r anser vi att full &ouml;ppenhet och fullst&auml;ndigt avsl&ouml;jande av s&auml;kerhetsproblem
hj&auml;lper de m&auml;nniskor som verkligen bryr sig om s&auml;kerhet.

<p>
<li>
<h3>
<a name="process"><font color="#e00000">Granskningsprocess</font></a>
</h3>

<p>
V&aring;rt s&auml;kerhetsgranskningsteam har normalt mellan sex och tolv medlemmar som 
forts&auml;tter att leta efter och laga nya s&auml;kerhetsh&aring;l. Vi har 
granskat sedan sommaren 1996. Processen som vi f&ouml;ljer f&ouml;r att &ouml;ka s&auml;kerheten
&auml;r helt enkelt en omfattande fil-f&ouml;r-fil analys av varje kritisk mjukvarukomponent.
Vi letar inte s&aring; mycket efter s&auml;kerhetsh&aring;l, som vi letar efter simpla
mjukvarubuggar, och om n&aring;gon n&aring;gra &aring;r senare uppt&auml;cker ett s&auml;kerhetsh&aring;l,
som vi fixade bara f&ouml;r att det var en bugg, desto b&auml;ttre. Skavanker och brister har hittats i stort sett
varenda del av systemet. Helt nya typer av s&auml;kerhetsproblem har uppt&auml;ckts under v&aring;r granskning,
och ofta beh&ouml;vs redan granskad kod &aring;tergranskas med dessa brister i &aring;tanke.
Kod blir ofta granskad flera g&aring;nger, och av flera m&auml;nniskor med olika granskningskunskaper. 

<p>
N&aring;gra medlemmar av v&aring;rt s&auml;kerhetsgranskningsteam jobbade f&ouml;r Secure Networks, 
f&ouml;retaget som gjorde industrins fr&auml;msta scanner f&ouml;r n&auml;tverkss&auml;kerhet, kallad 
Ballista (Secure Networks blev uppk&ouml;pta av Network Associates, Ballista blev omd&ouml;pt till Cybercop
Scanner, och ja...). Det f&ouml;retaget gjorde en hel del s&auml;kerhetsforskning, och platsar d&auml;rf&ouml;r
bra in i OpenBSD:s laguppst&auml;llning. OpenBSD passerade igenom Ballista:s tester
l&auml;tt som en pl&auml;tt fr&aring;n f&ouml;rsta dagen.

<p>
En annan fasett av v&aring;r s&auml;kerhetsgransknings &auml;r dess proaktivitet.
I de flesta fall har vi funnit att bed&ouml;mningen om huruvida det &auml;r en exploit eller inte,
inte spelar roll. Under v&aring;r p&aring;g&aring;ende granskningsprocess finner vi m&aring;nga buggar, 
och vi f&ouml;rs&ouml;ker laga dem &auml;ven om det inte &auml;r bevisat att den &auml;r exploaterbar.
Vi fixar buggen, och vi forts&auml;tter att leta efter fler buggar att fixa. Vi har lagat m&aring;nga simpla,
sj&auml;lkvklara och slarviga programmeringsfel i kod, och f&ouml;r att bara n&aring;gra m&aring;nader
senare uppt&auml;cka att felen i sj&auml;lva verket var exploaterbara. (Eller mer troligt, n&aring;gon p&aring; 
<a href="http://www.securityfocus.com/bugtraq/archive/">BUGTRAQ</a> rapporterar att andra operativsystem
var s&aring;rbara till ett "nyfunnet problem", och det visar sig att OpenBSD hade det fixad i en tidigare
version). I andra fall har vi blivit r&auml;ddade ifr&aring;n att vara fullt exploaterbara fr&aring;n komplexa
steg-f&ouml;r-steg attacker f&ouml;r att vi hade fixat en av de mellanliggande stegen. Ett exempel p&aring;
n&auml;r vi lyckades med det var n&auml;r Secure Networks gav r&aring;d ang&aring;ende lpd (en "lpd-advisory").

<p>
<li><h3><font color=#e00000>Bel&ouml;ningen</font></h3>

<p>
V&aring;r proaktiva granskningsprocess har verkligen l&ouml;nat sig. Uttalanden som
"Det h&auml;r problemet var fixat i OpenBSD f&ouml;r redan 6 m&aring;nader sedan." har blivit
vanliga i s&auml;kerhetsforum som <a href="http://www.securityfocus.com/bugtraq/archive/">BUGTRAQ</a>.

<p>
Den mest intensiva delen av v&aring;r s&auml;kerhetsgranskning skedde direkt innan OpenBSD 2.0 och
under &ouml;verg&aring;ngen fr&aring;n 2.0 till 2.1, fr&aring;n den senare tredjedelen av 1996 
till och med den andra halvan av 1997. Tusentals (ja, tusentals) s&auml;kerhetsfr&aring;gor 
fixades snabbt och lagades under den h&auml;r &aring;rsl&aring;nga perioden; buggar som den vanliga
buffer&ouml;versv&auml;mningen, svagheter i protokollimplementationer, insamling
av information och filsystemsursp&aring;rningar. F&ouml;ljdaktligen fixades de flesta av de
s&auml;kerhetsproblem som vi st&ouml;tte p&aring; innan v&aring;r lansering av version 2.1, och 
sedan beh&ouml;vdes ett mycket mindre antal fel fixas inf&ouml;r 2.2. 
Nuf&ouml;rtiden finner vi inte lika m&aring;nga fel. Den senaste
tiden tenderar problemen som vi fixar vara mycket obetydliga/skumma eller komplicerade. Fortfarande 
s&aring; envisas vi dock p&aring; grund av ett antal orsaker:

<p>
<ul>
<li>D&aring; och d&aring; uppt&auml;cker vi simpla fel som vi har missat f&ouml;rut. &Aring;h!
<li>S&auml;kerhet &auml;r ungef&auml;r som en kapprustning; de b&auml;sta anfallarna kommer
	forts&auml;tta att leta efter mer komplicerade exploiter, d&auml;rf&ouml;r kommer 
	&auml;ven vi att g&ouml;ra det. 
<li>Finna och laga sv&aring;rfunna skavanker i komplicerad mjukvara &auml;r v&auml;ldigt kul.
</ul>

<p>
Granskningsprocessen &auml;r inte &ouml;ver &auml;nnu, och som du kan se forts&auml;tter vi att
finna och laga nya s&auml;kerhetsbrister hela tiden.

<p>
<li><h3>
<a name="default"><font color="#e00000">"S&auml;kert ifr&aring;n b&ouml;rjan"</font></a>
</h3>

F&ouml;r att f&ouml;rs&auml;kra sig om att nyb&ouml;rjare p&aring; OpenBSD inte beh&ouml;ver bli
s&auml;kerhetsexperter &ouml;ver en natt (ett syns&auml;tt som m&aring;nga andra 
distribut&ouml;rer verkar ha), skeppar vi operativsystemet i ett "S&auml;kert ifr&aring;n
b&ouml;rjan"-l&auml;ge. Alla icke-viktiga tj&auml;nster &auml;r inaktiverade. N&auml;r
anv&auml;ndaren/administrat&ouml;ren blir mer bekant med systemet, kommer han uppt&auml;cka att
han m&aring;ste aktivera daemoner och andra delar av systemet. Under inl&auml;rningsprocessen i att
aktivera en ny tj&auml;nst, kommer nyb&ouml;rjaren troligen l&auml;ra sig att beakta s&auml;kerheten.

<p>
Det &auml;r i stark kontrast mot de antal system som skeppas med NFS, mountd, webbservrar och 
andra dylika tj&auml;nster aktiverade som standard - det skapar &ouml;gonblickligen s&auml;kerhetsproblem
f&ouml;r dess anv&auml;ndare, bara minuter efter deras f&ouml;rsta installation.

<p>
<li><h3>
<a name="crypto"><font color="#e00000">Kryptografi</font></a>
</h3>

<p>
Eftersom OpenBSD-projektet &auml;r baserat i Kanada, &auml;r det m&ouml;jligt f&ouml;r oss att inkludera
kryptografi. F&ouml;r mer information l&auml;s sidorna som sammanfattar <a href="crypto.html">vad vi har gjort
med kryptografi</a>.

<p>
<li><h3><font color="#e00000">R&aring;d</font></h3>

<p>
<dl>

<li>
<a name="28"></a>

<h3><font color="#e00000">OpenBSD 2.8 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.8 r&aring;den -- alla dessa problem har blivit
l&ouml;sta i <a href="anoncvs.html">OpenBSD-current</a>. Sj&auml;vklart &auml;r
alla 2.7 r&aring;den nedan listade, fixade i OpenBSD 2.8.

<p>
<ul>
<li><a href="../errata.html#sudo">22 februari, 2001:
        En buffer &ouml;verflow fixades i sudo(8).</a>
<li><a href="../errata.html#named">29 januari, 2001:
        Sammanfasa named(8) med ISC BIND 4.9.8-REL, vilket
	fixar en del potentiella problem med buffern.</a>
<li><a href="../errata.html#rnd">22 januari, 2001:
        rnd(4) anv&auml;nde inte all dess indata n&auml;r det
	skrevs till den.</a>
<li><a href="../errata.html#xlock">22 december, 2000:
        xlock(1):s verifiering gjordes om till att anv&auml;nda
	en namngiven pipe. 
	(fix inkluderad.)</a>
<li><a href="../errata.html#procfs">18 december, 2000:
        Procfs inneh&aring;ller flera overflows. Procfs
	anv&auml;nds inte som standard i OpenBSD.
	(fix inkluderad.)</a>
<li><a href="../errata.html#kerberos2">10 december, 2000:
        En rad problem existerar i Kerberos IV. 
	(fix inkluderad.)</a>
<li><a href="../errata.html#ftpd">4 december, 2000:
        En single-byte buffer overflow existerade i ftpd.
	(fix inkluderad.)</a>
</ul>

<p>
<li>
<a name="27"></a>

<h3><font color="#e00000">OpenBSD 2.7 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.7 r&aring;den -- alla dessa problem har blivit
l&ouml;sta i <a href="anoncvs.html">OpenBSD-current</a>. Sj&auml;vklart &auml;r
alla 2.6 r&aring;den nedan listade, fixade i OpenBSD 2.7.

<p>
<ul>
<li><a href="../errata27.html#ftpd">14 juli, 2000:
        En single-byte buffer overflow existerar i ftpd.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#sshforwardning">10 november, 2000:
        Fientliga servrar kan tvinga OpenSSH-klienter till att g&ouml;ra
	agent- eller X11-forwarding.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#xtrans">26 oktober, 2000:
        X11-biblioteken har tv&aring; stycken potentiella buffer overflows
	i xtrans-koden.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#httpd">18 oktober, 2000:
        Apache modulerna mod_rewrite och mod_vhost_alias kunde
	blotta filer p&aring; servern om vissa konfigurationer
	anv&auml;ndes.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#telnetd">10 oktober, 2000:
        telnet daemon:en strippar inte milj&ouml;variablarna
	TERMINFO, TERMINFO_DIRS, TERMPATH och TERMCAP som den
	borde.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#format_strings">6 oktober, 2000:
        Det finns printf-liknande &quot;format string&quot;-buggar i ett
 	antal privilegierade program.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#curses">6 oktober, 2000:
        I $HOME/.terminfo och i TERMPCAP-milj&ouml;variabeln
	gav libcurses terminalbeskrivningar f&ouml;r
	setuid- och setgid-applikationer.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#talkd">6 oktober, 2000:
        En &quot;format string&quot;-bugg existerar i talkd(8).
	(fix inkluderad.)</a>
<li><a href="../errata27.html#pw_error">3 oktober, 2000:
        En &quot;format string&quot;-bugg existerar i pw_error()-funktionen
	i libutil-biblioteket, vilket &ouml;ppnar m&ouml;jligheter
	att f&aring; localhost-root via chpass(1).
	(fix inkluderad.)</a>
<li><a href="../errata27.html#ipsec">18 september, 2000:
        D&aring;liga ESP/AH-paket kunde orsaka en systemkrasch
	under vissa f&ouml;ruts&auml;ttningar.
	(fix inkluderad.)</a>
<li><a href="../errata27.html#xlock">16 augusti, 2000:
        En &quot;format string&quot;-bugg (localhost root)
	existerar i xlock(1).
	(fix inkluderad).</a>
<li><a href="../errata27.html#X11_libs">14 juli, 2000:
	Olika buggar funna i X11 biblioteken har flera olika sideffekter,
	n&auml;stan fullst&auml;ndigt denial of service i OpenBSD.
	(fix inkluderad).</a>
<li><a href="../errata27.html#ftpd">5 juli, 2000:
	Ungef&auml;r som mer eller mindre alla andra UNIX FTP daemoner
	p&aring; planeten; ftpd har ett fj&auml;rr-root-h&aring;l i sig.
	Turligt nog s&aring; var ftpd inte aktiverat som standard. 
	Problemet existerar bara om anonym FTP &auml;r p&aring;slaget.
	(fix inkluderad).</a>
<li><a href="../errata27.html#mopd">5 juli, 2000:
	Mopd, v&auml;ldigt s&auml;llan anv&auml;nt, inneh&aring;ller 
	n&aring;gra buffer&ouml;versv&auml;mningar.
	(fix inkluderad).</a>
<li><a href="../errata27.html#libedit">28 juni, 2000:
	libedit letade efter en <strong>.editrc</strong>-fil i den aktuella
	katalogen. Inte k&auml;nt f&ouml;r att vara ett riktigt s&auml;kerhetsproblem,
	men en fix existerar i alla fall.
	(fix inkluderad).</a>
<li><a href="../errata27.html#dhclient">24 juni, 2000:
	En allvarlig bugg i dhclient(8) till&auml;t att	str&auml;ngar
	fr&aring;n en ond dhcp-server utf&ouml;rdes i skalet som root.
	(fix inkluderad).</a>
<li><a href="../errata27.html#isakmpd">9 juni, 2000:
	En allvarlig bugg i isakmpd(8) policy hantering, d&auml;r
	policy hanteringen kunde f&ouml;rbig&aring;s helt och h&aring;llet i
	isakmpd.
	(fix inkluderad).</a>
<li><a href="../errata27.html#uselogin">6 juni, 2000:
	Flaggan UseLogin (som inte &auml;r satt som standard) i
	<strong>/etc/sshd_config</strong> &auml;r trasig, b&ouml;r inte
	anv&auml;ndas, och resulterar i s&auml;kerhetsproblem p&aring;
	andra operativsystem.</a>
<li><a href="../errata27.html#bridge">26 maj, 2000:
	<em>learning</em> flaggan till bridge(8) kan f&ouml;rbig&aring;s.
	(fix inkluderad).</a>
<li><a href="../errata27.html#ipf">25 maj, 2000:
	Icke-korrekt anv&auml;ndande av ipf <em>keep-state</em> regler kan
	resultera i att brandv&auml;ggsreglerna f&ouml;rbig&aring;s.
	(fix inkluderad).</a>
</ul>

<p>

<li>
<a name="26">

<h3><font color=#e00000>OpenBSD 2.6 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.6 r&aring;den -- alla dessa problem har blivit l&ouml;sta i
<a href="anoncvs.html">OpenBSD-current</a>. Sj&auml;lvklart &auml;r alla OpenBSD
2.5 r&aring;d nedan listade, fixade i OpenBSD 2.6.

<p>
<ul>
<li><a href="../errata26.html#semconfig">26 maj, 2000:
	SYSV semaforst&ouml;det innh&ouml;ll ett odokumenterat systemanrop
	vilket kunde hindra semafor-anv&auml;ndande processer fr&aring;n 
	att avslutas.
	(fix inkluderad).</a>
<li><a href="../errata26.html#ipf">25 maj, 2000:
	Icke-korrekt anv&auml;ndande av ipf <em>keep-state</em> regler kan
	resultera i att brandv&auml;ggsreglerna f&ouml;rbig&aring;s.
	(fix inkluderad).</a>
<li><a href="../errata26.html#xlockmore">25 maj, 2000:
	xlockmore har en bugg, som en lokal attackerare kan utnyttja till
	att f&aring; tillg&aring;ng till p&aring; den enkrypterade root
	l&ouml;senordshashen (vilken vanligtvis &auml;r kodad med blowfish
	(se <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crypt&sektion=3">crypt(3)</a>)).
	(fix inkluderad).</a>
<li><a href="../errata26.html#procfs">20 januari, 2000: 
	System som k&ouml;r med procfs aktiverat och monterat &auml;r s&aring;rbara
	f&ouml;r en mycket bedr&auml;glig exploit. 
	procfs &auml;r inte monterat som standard.
	(fix inkluderad).</a>
<li><a href="../errata26.html#ifmedia">9 november, 1999: 
	Vilken anv&auml;ndare som helst kunde &auml;ndra interfacen:s mediakonfiguration,
	vilket resulterade i en lokal denial of service attack.
	(fix inkluderad).</a>
<li><a href="../errata26.html#sslUSA">2 december, 1999:
	En buffer&ouml;versv&auml;mning i RSAREF koden inkluderad i USA-versionen av
	libssl, &auml;r m&ouml;jligen exploitbar i httpd, ssh eller isakmpd - om SSL/RSA
	&auml;r aktiverat. 
	(fix inkluderad).</a><br>
	<strong>Uppdatering:</strong> Det visade sig att detta inte var exploatbart
	i n&aring;gon av mjukvaran inkluderad i OpenBSD 2.6.
<li><a href="../errata26.html#sendmail">4 december, 1999:
	Sendmail till&auml;t vilken anv&auml;ndare som helst att orsaka 
	att en alias-fil wrappade, och genom det exponera systemet 
	f&ouml;r en ursp&aring;rning d&auml;r alias-filen inte existerade.
	(fix inkluderad).</a>
</ul>

<p>
<li>

<a name="25"></a>

<h3><font color=#e00000>OpenBSD 2.5 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.5 r&aring;den -- alla dessa problem har blivit l&ouml;sta i
<a href="anoncvs.html">OpenBSD-current</a>. Sj&auml;lvklart &auml;r alla OpenBSD
2.4 r&aring;d nedan listade, fixade i OpenBSD 2.5.


<p>
<ul>
<li><a href="../errata25.html#cron">30 augusti, 1999: 
	I cron(8), kolla s&aring; att argv[] avslutas med NULL i fake popen(), och
	k&ouml;r sendmail som en anv&auml;ndare, inte som root. 
	(fix inkluderad).</a>
<li><a href="../errata25.html#miscfs">12 augusti, 1999:
	procfs och fdescfs filsystemen hade en &ouml;verskridning i deras hantering
	av uio_offset i deras readdir() rutiner. (Dessa filsystem &auml;r inte
	aktiverade som standard).
	(fix inkluderad).</a>
<li><a href="../errata25.html#profil">9 augusti, 1999:
	Stoppa profilering n&auml;r vi execve():ar en ny process
	(fix inkluderad).</a>
<li><a href="../errata25.html#ipsec_in_use">6 augusti, 1999:
	Paket som borde ha blivit hanterade av IPsec kan ha blivit transporterade 
	i klartext. Expirerande av PF_KEY SA kan l&auml;cka k&auml;rnresurser.
	(fix inkluderad).</a>
<li><a href="../errata25.html#rc">5 augusti, 1999:
	I /etc/rc, anv&auml;nd mktemp(1) till omskrivning av motd och f&aring; 
	find(1) att anv&auml;nda -execdir.
	(fix inkluderad).</a>
<li><a href="../errata25.html#chflags">30 juli, 1999:
	Till&aring;t inte vanliga anv&auml;ndare att g&ouml;ra chflags(2) eller fchflags(2) p&aring; 
	tecken- eller block devices vilka de f&ouml;r n&auml;rvarande kan vara &auml;gare av.
	(fix inkluderad).</a>
<li><a href="../errata25.html#nroff">27 juli, 1999:
	G&ouml;r s&aring; att groff(1) blir anropad med -S flaggan, 
	n&auml;r den blir anropad av nroff(1).
	(fix inkluderad).</a>
</ul>

<p>
<li>
<a name="24"></a>
<h3><font color="#e00000">OpenBSD 2.4 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.4 r&aring;den -- alla dessa problem har blivit l&ouml;sta i
<a href="anoncvs.html">OpenBSD-current</a>. Sj&auml;lvklart &auml;r alla OpenBSD
2.3 r&aring;d nedan listade, fixade i OpenBSD 2.4.


<p>
<ul>
<li><a href="../errata24.html#poll">22 mars, 1999:
	nfds argumentet f&ouml;r poll(2) m&aring;ste begr&auml;nsas, f&ouml;r att 
	undvika att kvm f&aring;r slut p&aring; resurser.
	(fix inkluderad).</a>
<li><a href="../errata24.html#tss">21 mars, 1999
	En &auml;ndring i TSS-hanteringen f&ouml;rhindrar &auml;nnu
	en krasch av k&auml;rnan orsakad av <strong>crashme</strong>
	programmet.
	(fix inkluderad).</a>
<li><a href="../errata24.html#nlink">25 februari, 1999:
	En okontrollerad &ouml;kning av nlink-v&auml;rdet i FFS och EXT2FS filsystemen
	kan orsaka en systemkrasch.
	(fix inkluderad).</a>
<li><a href="../errata24.html#ping">23 februari, 1999:
	&Auml;nnu en buffer&ouml;versv&auml;mning fanns i ping(8).
	(fix inkluderad).</a>
<li><a href="../errata24.html#ipqrace">19 februari, 1999:
	ipintr() hade en ursp&aring;rning i anv&auml;nding av ipq:n,
	vilket kunde till&aring;ta en attackerare att orsaka en krasch.
	(fix inkluderad).</a>
<li><a href="../errata24.html#accept">17 februari, 1999:
	Ett timingproblem i k&auml;rnan mellan anropen accept(2) och
	select(2) kunde till&aring;ta en attackerare att fj&auml;rrh&auml;nga sockets.
	(fix inkluderad).</a>
<li><a href="../errata24.html#maxqueue">17 februari, 1999:
	Ihops&auml;ttnig av IP-fragment kan k&ouml;ra fast maskinen
	och v&aring;lla problem.
	(fix inkluderad).</a>
<li><a href="../errata24.html#trctrap">12 februari, 1999:
	i386 T_TRCTRAP-hanteringen och DDB p&aring;verkade varandra s&aring;pass att 
	en krasch kunde uppst&aring;.
	(fix inkluderad).</a>
<li><a href="../errata24.html#rst">11 februari, 1999:
	TCP/IP RST-hanteringen var slarvig.
	(fix inkluderad).</a>
<li><a href="../errata24.html#bootpd">27 november, 1998:
	Det finns ett fj&auml;rr-exploaterbart problem i bootpd(8).
	(fix inkluderad).</a>
<li><a href="../errata24.html#termcap">19 november, 1998:
	Det &auml;r m&ouml;jligen ett lokalt exploaterbart program
	relaterat till milj&ouml;variabler i termcap och curses.
	(fix inkluderad).</a>
<li><a href="../errata24.html#tcpfix">13 november, 1998:
	Det finns en fj&auml;rr-maskinl&aring;sningsbugg 
	i TCP-avkodningsk&auml;rnan.
	(fix inkluderad).</a>
</ul>

<p>
<li>
<a name="23"></a>
<h3><font color="#e00000">OpenBSD 2.3 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.3 r&aring;den -- alla dessa problem har blivit l&ouml;sta i
<a href="anoncvs.html">OpenBSD-current</a>. Sj&auml;lvklart &auml;r alla OpenBSD
2.2 r&aring;d nedan listade, fixade i OpenBSD 2.3.


<p>
<ul>
<li><a href="../errata23.html#bootpd">27 november, 1998:
	Det existerar ett fj&auml;rr-exploaterbart problem i bootpd(8).
	(fix inkluderad).</a>
<li><a href="../errata23.html#tcpfix">13 november, 1998:
	Det finns en fj&auml;rr-maskinl&aring;sningsbugg i 
	TCP-avkodningsk&auml;rnan.
	(fix inkluderad).</a>
<li><a href="../errata23.html#fdalloc">2 juli, 1998:
	setuid och setgid processer borde inte exekveras med fd sloten 0, 1 eller 2 fria.
	(fix inkluderad).</a>
<li><a href="../errata23.html#resolver">31 augusti, 1998:
	En godartad resolver-buffer&ouml;versv&auml;mningsbugg vart olyckligtvis &aring;terintroducerad.
	(fix inkluderad).</a>
<li><a href="../errata23.html#xlib">6 juli, 1998: 
	Fortsatta problem med X-biblioteken.
	(fix inkluderad).</a>
<li><a href="../errata23.html#pctr">4 juni, 1998:
	P&aring; icke-Intel i386 maskiner; vilken anv&auml;ndare som helst
	kan anv&auml;nda pctr(4) f&ouml;r att krascha maskinen.
	</a>
<li><a href="../errata23.html#kill">17 maj, 1998:
	kill(2) p&aring; setuid/setgid m&aring;lprocesser alltf&ouml;r toleranta.
	(4:e revisionens fix inkluderad).</a>
<li><a href="../errata23.html#immutable">11 maj, 1998:
	mmap() till&aring;ter ofullst&auml;ndigt kring&aring;ende 
	av "of&ouml;r&auml;nderlighets"- och "l&auml;gga-till"-flaggor.
	(fix inkluderad).</a>
<li><a href="../errata23.html#xterm-xaw">1 maj, 1998:
	Buffer&ouml;versv&auml;mning i xterm och Xaw.
	(CERTs utg&aring;va VB-98.04)
	(fix inkluderad).</a>
<li><a href="../errata23.html#ipsec">5 maj, 1998:
	Inkorrekt hantering av IPsecpaket om IPsec &auml;r aktiverat.
	(fix inkluderad).</a>
</ul>

<p>
<li>
<a name="22"></a>
<h3><font color="#e00000">OpenBSD 2.2 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.2 r&aring;den -- alla dessa problem har blivit l&ouml;sta i
<a href="anoncvs.html">OpenBSD-current</a>. Sj&auml;lvklart &auml;r alla OpenBSD
2.1 r&aring;d nedan listade, fixade i OpenBSD 2.2.


<p>
<ul>
<li><a href="../errata22.html#ipsec">5 maj, 1998:
	Inkorrekt hantering av IPsecpaket om IPsec &auml;r aktiverat.
	(fix inkluderad).</a>
<li><a href="../errata22.html#xterm-xaw">1 maj, 1998:
        Buffer &ouml;versv&auml;ming i xterm och Xaw.
        (CERTs utg&aring;va VB-98.04)
        (fix inkluderad).</a>
<li><a href="../errata22.html#uucpd">22 april, 1998:
	Buffer&ouml;versv&auml;mning i uucpd.
	(fix inkluderad).</a>
<li><a href="../errata22.html#rmjob">22 april, 1998:
	Bufferfelhantering i lprm.
	(fix inkluderad).</a>
<li><a href="../errata22.html#ping">31 mars, 1998:
	&Ouml;versv&auml;mning i ping -R.
	(fix inkluderad).</a>
<li><a href="../errata22.html#named">30 mars, 1998:
	&Ouml;versv&auml;mning i nameds fake-iquery.
	(fix inkluderad).</a>
<li><a href="../errata22.html#mountd">2 mars, 1998:
	Olycklig NFS filsystems exportering.
	(fix inkluderad).</a>
<li><a href="../advisories/mmap.txt">26 februari, 1998:
	Brist i mmap() med l&auml;s-skrivr&auml;ttigheter.
	</a>
	Revision 3 av fixen &auml;r tillg&auml;nglig <a href="../errata22.html#mmap">h&auml;r</a>.
<li><a href="../advisories/sourceroute.txt">19 februari, 1998:
	Accepterande av k&auml;llroutat paket.</a>
	En fix &auml;r tillg&auml;nglig <a href="../errata22.html#sourceroute">h&auml;r</a>.
<li><a href="../errata22.html#ruserok">13 februari, 1998:
	Setuid-coredumpar and Ruserok()-brister.
	(fix inkluderad).</a>
<li><a href="../errata22.html#ldso">9 februari, 1998: 
	MIPS ld.so brist.
	(fix inkluderad).</a>
<li><a href="../errata22.html#f00f">10 december, 1997:
	Intel P5 f00f l&aring;sning.
	(fix inkluderad).</a>
</ul>

<p>
<li>
<a name="21"></a>
<h3><font color="#e00000">OpenBSD 2.1 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.1 r&aring;den. Alla dessa problem &auml;r l&ouml;sta i 
<a href="../22.html">OpenBSD 2.2</a>. N&aring;gra av dessa problem existerar fortfarande i 
andra operativsystem. (Om du anv&auml;nder OpenBSD 2.1, rekommenderar vi starkt att du uppgraderar
till den nyaste versionen, eftersom den h&auml;r listan med fixar enbart f&ouml;rs&ouml;ker att fixa 
de viktigaste s&auml;kerhetsproblemen. S&auml;rskilt fixar OpenBSD 2.2 ett antal lokala s&auml;kerhetsproblem.
M&aring;nga av dem blev l&ouml;sta p&aring; s&aring;dana vis att det g&ouml;r
det sv&aring;rt f&ouml;r oss att erbjuda fixar).

<p>
<ul>
<li><a href="../advisories/signals.txt">15 september, 1997:
	Avvikande signaler.
	(fix inkluderad).</a>
<li><a href="../advisories/rfork.txt">2 augusti, 1997:
	Rfork()-systemanropsbrister.
	(fix inkluderad).</a>
<li><a href="../advisories/procfs.txt">24 juni, 1997:
	Procfs-brister.
	(fix inkluderad).</a>
</ul>

<p>
<li>
<a name="20"></a>
<h3><font color="#e00000">OpenBSD 2.0 s&auml;kerhetsr&aring;d</font></h3>
Det h&auml;r &auml;r OpenBSD 2.0 r&aring;den. Alla dessa problem &auml;r 
l&ouml;sta i <a href="../21.html">OpenBSD 2.1</a>. N&aring;gra av dessa
problem existerar fortfarande i andra operativsystem. (Om du k&ouml;r
OpenBSD 2.0, lovordar vi dig f&ouml;r att du var d&auml;r i de gamla 
dagarna!, men du missar massa saker om du inte installerar en ny version!).

<p>
<ul>
<li><a href="../advisories/res_random.txt">22 april, 1997: 
	F&ouml;ruts&auml;gbara ID:n i resolvern. 
	(fix inkluderad).</a>
<li>M&aring;nga andra... om folk kan leta upp dem, var god kontakta mig s&aring; kan vi l&auml;gga upp dem h&auml;r.
</ul>

</dl>
<p>

<a name="watching"></a>
<li><h3><font color=#e00000>F&ouml;lja v&aring;ra &auml;ndringar</font></h3><p>

Eftersom vi tar en proaktiv st&auml;llning mot s&auml;kerhet, hittar och fixar
vi hela tiden nya s&auml;kerhetsproblem. Inte alla av dessa blir vida 
k&auml;nda eftersom (som vi redan sagt) m&aring;nga av dem &auml;r inte 
konfirmerade som exploaterbara; m&aring;nga simpla buggar som vi fixar visar 
sig tillslut ha s&auml;kerhetskonsekvenser som vi inte kunde f&ouml;ruts&auml;ga. 
Vi har inte den tiden det kr&auml;vs till att g&ouml;ra dessa &auml;ndringar i det
ovanst&aring;ende formatet. 

<p>
F&ouml;ljdaktligen &auml;r det vanligtvis sm&aring; s&auml;kerhetsfixar i den 
aktuella k&auml;llkoden j&auml;mf&ouml;rt med den f&ouml;reg&aring;ende stora OpenBSD utg&aring;van. 
Vi l&auml;mnar en begr&auml;nsad garanti f&ouml;r att dessa problem har en liten p&aring;verkan och icke bevisbar
exploaterbarhet. Om vi finner att ett problem definitivt spelar n&aring;gon som helst roll f&ouml;r
s&auml;kerheten, kommer fixar dyka upp h&auml;r <strong>MYCKET</strong> fort.

<p>
Folk som verkligen &auml;r oroade ang&aring;ende s&auml;kerheten kan g&ouml;ra ett antal saker:

<p>
<ul>
<li>Om du f&ouml;rst&aring;r s&auml;kerhetsfr&aring;gor, f&ouml;lj v&aring;r 
	<a href="../mail.html">mailinglista som visar alla k&auml;llkods&auml;ndringar</a>, 
	och h&aring;ll utkik efter saker som verkar s&auml;kerhetsrelaterade. 
	Eftersom exploaterbarhet inte &auml;r bevisat f&ouml;r m&aring;nga av de fixar 
	som vi g&ouml;r, f&ouml;rv&auml;nta dig inte att commit-meddelandet s&auml;ger 
	n&aring;got i stil med "SECURITY FIX!". Om ett problem &auml;r p&aring;visat och allvarligt,
	kommer en fix vara tillg&auml;nglig h&auml;r en mycket kort tid d&auml;refter.
<li>F&ouml;rutom k&auml;llkods&auml;ndringarna kan du f&ouml;lja v&aring;r
        <a href="../mail.html">s&auml;kerhetsannonseringslista</a>, vilken kommer g&ouml;ra
	dig uppm&auml;rksamm &ouml;ver varje s&auml;kerhetsrelaterad sak som OpenBSD-gruppen
	bed&ouml;mmer som ett m&ouml;jligt hot, och instruera dig om hur du ska fixa problemet.
<li>F&ouml;lj v&aring;rt current k&auml;llkodstr&auml;d, och l&auml;r dig sj&auml;lv hur
	man bygger ett komplett system (l&auml;s /usr/src/Makefile noggrannt).
	Anv&auml;ndare kan dra den slutsatsen att current-tr&auml;det alltid har starkare
	s&auml;kerhet &auml;n n&aring;gon tidigare version. Dock, att bygga ditt eget system
	ifr&aring;n k&auml;llkoden &auml;r inte alltf&ouml;r l&auml;tt; det &auml;r n&auml;stan 
	300 MB med k&auml;llkod, och problem uppst&aring;r ibland d&aring; vi &ouml;verg&aring;r
	fr&aring;n en stor utg&aring;va till en annan.
<li>Installera en bin&auml;r snapshot f&ouml;r din arkitektur, vilka tillverkas r&auml;tt ofta. Till exempel, 
	en i386-snapshot &auml;r vanligtvis gjord tillg&auml;nglig varje vecka.
</ul>

<p>
<li>
<h3>
<a name="reporting"><font color="#e00000">Rapportera problem</font></a>
</h3>

<p>
Om du finner ett nytt s&auml;kerhetsproblem, kan du maila det till
<a href="mailto:deraadt@openbsd.org">deraadt@openbsd.org</a>.

<br>
Om du vill PGP-kryptera det (men sn&auml;lla g&ouml;r det bara om hemligh&aring;llande
&auml;r v&auml;ldigt vitalt, eftersom det &auml;r besv&auml;rligt)
anv&auml;nd den h&auml;r <a href="../advisories/pgpkey.txt">pgp-nyckeln</a>.

<p>
<a name="papers"></a>
<li><h3><font color=#e00000>Fortsatt l&auml;sning</font></h3>

<p>
Ett flertal dokument har skrivits av OpenBSDs team-medlemmar,
om s&auml;kerhetsreleterade f&ouml;r&auml;ndringar de har gjort
i OpenBSD. Postscript-versioner av dessa dokument
&auml;r tillg&auml;ngliga h&auml;r:

<p>
<ul>
<li>A Future-Adaptable Password Scheme.<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    av <a href="mailto:provos@openbsd.org">Niels Provos</a>,
    <a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
    <a href="../papers/bcrypt-paper.ps">dokument</a> och
    <a href="../papers/bcrypt-slides.ps">presentationsbilder</a>.
<p>
<li>Cryptography in OpenBSD: An Overview.<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    av <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
    <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
    <a href="mailto:art@openbsd.org">Artur Grabowski</a>,
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/crypt-paper.ps">dokument</a> och
    <a href="../papers/crypt-slides.ps">presentationsbilder</a>.
<p>
<li>strlcpy and strlcat -- consistent, safe, string copy and concatenation.<br>
    <a href="../events.html#usenix99">Usenix 1999</a>,
    av <a href="mailto:millert@openbsd.org">Todd C. Miller</a>,
    <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
    <a href="../papers/strlcpy-paper.ps">dokument</a> och
    <a href="../papers/strlcpy-slides.ps">presentationsbilder</a>.
<p>
<li>Dealing with Public Ethernet Jacks-Switches, Gateways, and Authentication.<br>
    <a href="../events.html#lisa99">LISA 1999</a>,
    av <a href="mailto:beck@openbsd.org">Bob Beck</a>.<br>
    <a href="../papers/authgw-paper.ps">dokument</a> och
    <a href="../papers/authgw-slides.ps">presentationsbilder</a>.
<p>
<li>Encrypting Virtual Memory<br>
    <a href="../events.html#sec2000">Usenix Security 2000</a>,
    av <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/swapencrypt.ps">dokument</a> och
    <a href="../papers/swapencrypt-slides.ps">presentationsbilder</a>.
</ul>

</dl>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: security.html,v 1.166 2001/02/23 03:06:19 ericj Exp ]
<br>
$Translation: security.html,v 1.10 2001/02/25 17:30:55 javax Exp $
<br>
$OpenBSD: security.html,v 1.9 2001/02/25 23:15:11 jufi Exp $
</small>

</body>
</html>
