<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Caracter&iacute;sticas de OpenSSH</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="Características de OpenSSH">
<meta name="keywords" content="OpenSSH,características">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2004 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenSSH]" height="30" width="141" src="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Caracter&iacute;sticas</font></h2>
<hr>

OpenSSH es una implementaci&oacute;n libre del paquete de protocolos
<em>SSH/SecSH</em> que provee cifrado para los servicios de red, como
ingreso remoto (<em>&quot;remote login&quot;</em>) o transferencia de
archivos remota, de un sistema de cifrado.
<p>
La lista siguiente enumera las caracter&iacute;sticas de Openssh:
<p>

<ul>
<li>Proyecto de C&oacute;digo Abierto
<li>Licencia Libre
<li>Cifrado Fuerte (3DES, Blowfish, AES, Arcfour)
<li>Reenv&iacute;o por X11 
    (cifra el tr&aacute;fico de X Window System)
<li>Reenv&iacute;o por Puertos 
    (canales cifrados por protocolos de legado)
<li>Autenticaci&oacute;n Fuerte
    (Clave P&uacute;blica, Contras&ntilde;a de un 
    s&oacute;lo uso y Autenticaci&oacute;n con Kerberos)
<li>Reenv&iacute;o por Agente
    (ingreso &uacute;nico)
<li>Interoperabilidad
    (Conforme con las Regulaciones del Protocolo SSH 1.3, 1.5, y 2.0)
<li>Soporte para cliente y servidor de SFTP en los protocolos SSH1 y
    SSH2.
<li>Pases de Ticket de Kerberos y AFS
<li>Compresi&oacute;n de Datos
</ul>
<p>

<hr>

&nbsp;<strong>Proyecto de C&oacute;digo Abierto</strong>

<p>
El c&oacute;digo fuente de Openssh es de libre disponibilidad para todo 
aquel que desee obtenerlo en Internet.
Se anima a todo el que desee reutilizar el c&oacute;digo o hacer una 
auditor&iacute;a sobre &eacute;ste a que lo lleve a cabo.
La revisi&oacute;n del c&oacute;digo asegura que cualquier persona pueda 
encontrar y corregir errores.
El resultado es un c&oacute;digo seguro.

<p>
&nbsp;<strong>Licencia Libre</strong>

<p>
OpenSSH no se encuentra bajo ninguna licencia restrictiva.  Se puede
usar para cualquier prop&oacute;sito, y esto incluye su uso comercial.
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE?rev=HEAD">La licencia</a>
para OpenSSH se encuentra incluida en la distribuci&oacute;n.
Pensamos que el mundo estar&iacute;a mejor si enrutadores, aparatos
para redes, sistemas operativos, y el resto de dispositivos de red
tuvieran ssh integrado en ellos.

<p>
Todos los componentes de naturaleza restrictiva (o sea, patentes, ver 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl</a>)
han sido eliminados del c&oacute;digo fuente;
los componentes bajo licencia o patentados se obtienen de bibliotecas 
externas (v.g. <a href="http://www.openssl.org/">OpenSSL</a>).

El algoritmo de cifrado sim&eacute;trico <code>IDEA</code> ya no se
encuentra disponible, debido a que est&aacute; patentado en muchos
pa&iacute;ses.  En su lugar, recomendamos que use cualquiera de los
otros algoritmos de cifrado disponibles (no creemos que se pueda
justificar el uso de un algoritmo de cifrado sim&eacute;trico
patentado, cuando existen muchos otros libres).

<p>
&nbsp;<strong>Cifrado Fuerte</strong>        

<p>
OpenSSH soporta 3DES, Blowfish, AES y Arcfour como algoritmos
de cifrado.  Todos ellos est&aacute;n libres de patentes.
<b>Triple DES</b> es un algoritmo de cifrado muy conocido y que ha
pasado la prueba del tiempo, que provee cifrado fuerte.
<b>Blowfish</b> es un algoritmo de cifrado rápido de bloque inventado
por Bruce Schneier, que pueden usarlo aqu&eacute;llos que requieran un
cifrado m&aacute;s r&aacute;pido.
<b><a href="http://www.nist.gov/aes">AES</a></b> es la
Norma Avanzada de Cifrado (AES por sus siglas en inglés) de la
Norma Federal de Procesamiento de Información de los Estados Unidos de
América (FIPS por sus siglas en inglés)
desarrollado para reemplazar a DES.  Es un algoritmo de cifrado rápido de
bloque.<br>
<b>Arcfour</b> es un cifrador rápido de flujo. Se piensa que es compatible
con RC4[TM], un cifrador privativo de RSA Security Inc.

<p>
El cifrado empieza antes de la autenticación, y ninguna 
contrase&ntilde;a ni otro tipo de informaci&oacute;n se transmite sin 
cifrar.
El cifrado tambi&eacute;n se utiliza como protecci&oacute;n contra 
paquetes falsificados.

<p>
&nbsp;<strong>Reenv&iacute;o por X11</strong>

<p>
El env&iacute;o por X11 permite el cifrado del tr&aacute;fico en 
entornos X windows remotos, de tal modo que nadie pueda fisgonear en sus 
xterm remotas o insertar &oacute;rdenes da&ntilde;inas.
El programa activa  DISPLAY autom&aacute;ticamente en el servidor, y 
env&iacute;a cualquier conexi&oacute;n de X11 por un canal seguro.
Informaci&oacute;n falsa sobre Xauthority se genera 
autom&aacute;ticamente y se env&iacute;a a la
m&aacute;quina remota;  el programa cliente en la m&aacute;quina local 
examina las conexiones entrantes de X11 y reemplaza los datos de 
autorizaci&oacute;n falsos con datos reales (pero nunca le pasa a la 
m&aacute;quina remota la informaci&oacute;n real).

<p>
&nbsp;<strong>Reenv&iacute;o por Puertos</strong>

<p>
El env&iacute;o por puertos permite enviar conexiones de TCP/IP a una 
m&aacute;quina remota por un canal cifrado.
Las aplicaciones t&iacute;picas de Internet como POP se pueden asegurar 
de este modo.

<p>
&nbsp;<strong>Autenticaci&oacute;n Fuerte</strong>

<p>
Una fuerte autentificaci&oacute;n protege contra varios problemas de
seguridad, como por ejemplo suplantaci&oacute;n de IP (<em>IP
spoofing</em>), rutas falsas (<em>fake roots</em>), y fisgoneo de DNS
(<em>DNS spoofing</em>).
Los m&eacute;todos de autenticaci&oacute;n son:  <em>.rhosts</em> junto
con hu&eacute;sped de autenticaci&oacute;n basado en <code>RSA</code>,
autenticaci&oacute;n <code>RSA</code> pura, contrase&ntilde;as para uso
de una sola vez, y finalmente autenticaci&oacute;n mediante 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kerberos&amp;sektion=8">Kerberos</a>.

<p>
&nbsp;<strong>Reenv&iacute;o por Agente</strong>

<p>
Un agente de autenticaci&oacute;n que se encuentre en la estaci&oacute;n
de trabajo o el port&aacute;til de un usuario, se puede usar para
contener las claves de autenticaci&oacute;n de RSA o DSA.  OpenSSH
env&iacute;a la conexi&oacute;n autom&aacute;ticamente al agente de
autenticaci&oacute;n por medio de cualquier conexi&oacute;n y de este
modo no existe la necesidad de guardar las claves de
autenticaci&oacute;n de RSA o DSA en ninguna m&aacute;quina de la red
(exceptuando la m&aacute;quina del usuario).  Los protocolos de
autenticaci&oacute;n nunca revelan las claves; s&oacute;lo se pueden
usar para verificar que el agente del usuario tenga cierta clave.  El
agente podr&iacute;a hacer uso de una tarjeta inteligente para llevar a
cabo todas las computaciones de autenticaci&oacute;n.

<p>
&nbsp;<strong>Interoperabilidad</strong>

<p>
Las versiones de OpenSSH anteriores a la 2.0 contienen soporte para los
protocolos SSH 1.3 y SSH 1.5, permitiendo de este modo la
comunicaci&oacute;n con la mayor&iacute;a de implementaciones
comerciales de SSH en Unix y Windows.

<p>
A partir de la versi&oacute;n 2.0 de OpenSSH, adem&aacute;s del soporte
para el protocolo SSH 1.3 y protocolo SSH 1.5, OpenSSH tambi&eacute;n
dispone de soporte para el protocolo SSH 2.0.  Este protocolo evita el
uso del algoritmo <code>RSA</code> -- ya que cuando se invent&oacute;
el protocolo 2.0, la patente sobre <code>RSA</code> todav&iacute;a
exist&iacute;a -- y en su lugar usa los algoritmos libres
<code>DH</code> y <code>DSA</code>.

<p>
Por lo tanto, OpenSSH le ofrece lo mejor de los dos mundos.
&iexcl;Puede interoperar con <strong>ambos</strong> tipos de clientes y
servidores de SSH!

<p>
&nbsp;<strong>Soporte para cliente y servidor en los protocolos SSH1 y
SSH2</strong>

<p>
A partir de la versi&oacute;n 2.5.0, OpenSSH incluye soporte completo
para SFTP;  la orden que se usa para el cliente es
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sftp&amp;sektion=1">sftp(1)</a>.
El subsistema
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sftp-server&amp;sektion=8">sftp-server(8)</a>
funciona de forma autom&aacute;tica en los protocolos SSH1 y SSH2.

<p>
&nbsp;<strong>Pases de Tickets de Kerberos y AFS</strong>

<p>
OpenSSH tambi&eacute;n pasa tickets para Kerberos y AFS en la 
m&aacute;quina remota.
Un usuario puede por tanto acceder a todos sus servicios de Kerberos y 
AFS sin la necesidad de introducir una contrase&ntilde;a de nuevo.

<p>
&nbsp;<strong>Compresi&oacute;n de Datos</strong>

<p>
La compresi&oacute;n de datos antes del cifrado mejora los resultados en 
los enlaces con redes lentas.

<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenSSH"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: features.html,v 1.21 ]<br>
$Translation: features.html,v 1.17 2004/09/05 14:29:34 santana Exp $<br>
$OpenBSD: features.html,v 1.14 2004/09/05 16:50:50 jufi Exp $
</small>

</body>
</html>
