<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Objetivos del Proyecto OpenSSH</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de objetivos de OpenSSH">
<meta name="keywords" content="openbsd,objetivos">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2004 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenSSH]" height="30" width="141" src="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Objetivos del Proyecto</font></h2>
<hr>

<p>
Nuestro objetivo es simple:  como telnet y rlogin no son
seguros, todos los sistemas operativos deber&iacute;an incluir
el soporte para el protocolo SSH (v&eacute;ase la imagen al
final del texto).

<p>
Existen dos variedades del protocolo SSH que son
incompatibles:  SSH 1 y SSH 2.

<p>
La m&aacute;s antigua, el protocolo SSH 1, se encuentra en dos
subvariedades:  el protocolo 1.3 y el protocolo 1.5.  OpenSSH
tiene soporte para ambas.  Las dos usan el algoritmo de
criptograf&iacute;a asim&eacute;trica
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rsa">RSA</a>
(cuya patente en los EE.UU. ha caducado, permitiendo
as&iacute; su libre utilizaci&oacute;n) para la
negociaci&oacute;n de claves, y luego usan una peque&ntilde;a
lista de algoritmos sim&eacute;tricos para esconder datos:
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=des_crypt">3DES</a>
y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=blowfish">Blowfish</a>.
(sol&iacute;a haber otros cuantos algoritmos como RC4, pero
sus implementaciones ten&iacute;n problemas de seguridad).
Algunas implementaciones del protocolo SSH 1 tambi&eacute;n
incluyen soporte para el algoritmo sim&eacute;trico
<code>IDEA</code>, pero debido a que est&aacute; patentado en
algunos pa&iacute;ses, y a que los otros dos algoritmos ya
incluidos son suficientes, el soporte para <code>IDEA</code>
no est&aacute; incluido en OpenSSH.

<p>
El protocolo SSH 1 usa un simple CRC para la integridad de los
datos que contiene un error de dise&ntilde;o;  se sabe que es
posible un ataque de inserci&oacute;n, sin embargo, debido a
una cantidad de ayudas de banda que han sido aplicadas a SSH
durante todos estos a&ntilde;os, los ataques contra
&eacute;ste son muy dif&iacute;ciles de llevar a cabo.  Cuando
se usa el algoritmo de cifrado <code>3DES</code>, la
posibilidad de un ataque de inserci&oacute;n es
significativamente menor (esto lo podemos solucionar en
breve).

<p>
La segunda variedad principal de SSH es el protocolo SSH 2.
SSH 2 se invent&oacute; para evitar los problemas de patentes
relacionados con <code>RSA</code> (problemas que ya no existen
puesto que la patente ya ha caducado), y para solucionar el
problema de integridad de datos de CRC que tiene SSH1,
adem&aacute;s de otras varias razones de naturaleza
t&eacute;cnica.  Usando los algoritmos asim&eacute;tricos
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dsa">DSA</a> y
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dh">DH</a>, el
protocolo 2 evita todas las patentes.  El problema con CRC
tambi&eacute;n se ha solucionado usando un algoritmo real
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=HMAC">HMAC</a>.
El protocolo SSH 2 tiene soporte para muchos otros cifrados
sim&eacute;tricos, as&iacute; como muchas otras nuevas
funcionalidades.

<p>
El c&oacute;digo de OpenSSH que contiene soporte completo para
los protocolos SSH 1.3 y SSH 1.5 fue lanzado el 1 de
septiembre de 1.999.

<p>
Para muchas de sus funcionalidades criptogr&aacute;ficas,
OpenSSH depende de la biblioteca
<a href="http://www.openssl.org">OpenSSL</a>, la cual se
encuentra bajo una licencia no GPL.

<p>
Casi inmediatamente despu&eacute;s del lanzamiento de nuestra
implementaci&oacute;n del protocolo SSH 1, varios grupos
ajenos a OpenBSD empezaron a mostrar un gran inter&eacute;s.
Damien Miller, Philip Hands, y unos cuantos m&aacute;s,
comenzaron a portar OpenSSH a Linux y a otros sistemas
operativos Unix.  Desde el momento en que empezamos con esta
tarea pensamos que el c&oacute;digo original de SSH era
demasiado complejo;  ten&iacute;a demasiadas dependencias de
sistemas operativos como para tratar con &eacute;l.  El modo
en que lo abordamos para escribir un c&oacute;digo
completamente seguro y s&oacute;lido como una roca, evita
tener que tratar con diferencias excesivas como las que se
presentaban.  As&iacute; pues, para facilitarnos el proceso
completo de desarrollo a todos, decidimos separar nuestro
esfuerzo de desarrollo central del de desarrollo de
portabilidad.  Esto nos ha funcionado muy bien (como prueba,
compare el n&uacute;mero de l&iacute;neas de c&oacute;digo
entre la versi&oacute;n base y la portable).

<p>
Continuando con esa tendencia, los miembros del proyecto
OpenBSD que trabajaron en OpenSSH hicieron un esfuerzo para
implementar tambi&eacute;n el soporte del protocolo SSH 2.
Este trabajo fue llevado a cabo principalmente por Markus
Friedl.  Alrededor del 4 de mayo de 2.000, el soporte para el
protocolo SSH 2 se implement&oacute; lo suficiente como para
que ya se pudiera utilizar.


<p>
<hr>
<h2><font color="#e00000">&iquest;Todav&iacute;a est&aacute;
usando programas &laquo;no cifrados&raquo; para el ingreso por
la red?</font></h2>

<img width="500" height="500" src="../images/shherrif.jpg" alt="sheriff">

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenSSH"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: goals.html,v 1.18 ]<br>
$Translation: goals.html,v 1.15 2004/09/04 19:53:10 santana Exp $<br>
$OpenBSD: goals.html,v 1.14 2004/09/05 16:50:50 jufi Exp $
</small>

</body>
</html>
