<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Cronolog&iacute;a del Proyecto OpenSSH y Cr&eacute;ditos</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenSSH]" height="30" width="141" src="../images/smalltitle.gif">
<p>
<h2><strong><font color="#e00000">Cronolog&iacute;a del proyecto y
cr&eacute;ditos</font></strong></h2>
<hr>

OpenSSH deriva de la versi&oacute;n original libre 1.2.12 de ssh, de
Tatu Yl&ouml;nen.  Esta versi&oacute;n fue la &uacute;ltima que se
distribuy&oacute; bajo una licencia lo suficientemente libre como para
que la pudi&eacute;ramos reutilizar en el proyecto.  Partes de OpenSSH
todav&iacute;a conservan la licencia de Tatu, que estaba incluida en
aquella versi&oacute;n.  Aquella versi&oacute;n, y otras anteriores,
hac&iacute;an uso de funciones matem&aacute;ticas de la biblioteca
<em>libgmp</em>.  Dicha biblioteca tambi&eacute;n se inclu&iacute;a con
esas versiones anteriores.  La biblioteca <em>libgmp</em> se distribuye
bajo la licencia LGPL (<em>&quot;Lesser GNU Public Licence&quot;</em>),
aunque algunas versiones de aquella &eacute;poca se distribu&iacute;an
bajo la licencia regular GPL (<em>&quot;GNU Public Licence&quot;</em>).

<p>
Existe una licencia combinada para todas las piezas en
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE?rev=HEAD">http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/ssh/LICENCE</a>.

<p>
A partir de la versi&oacute;n 1.2.12, las nuevas revisiones comenzaron
r&aacute;pidamente a incluir licencias m&aacute;s restrictivas, a pesar
de que todav&iacute;a inclu&iacute;an <em>libgmp</em>, ya que era
necesaria para el uso del sistema.  Las licencias antiguas m&aacute;s
restrictivas prohib&iacute;an que alguien pudiera hacer una
versi&oacute;n para Windows o DOS.  M&aacute;s tarde, las licencias
prohib&iacute;an el uso de ssh en entornos comerciales, de modo que las
compa&ntilde;&iacute;as tuvieran que comprar una versi&oacute;n de alto
precio a Datafellows.

<p>
A principios de 1.999, Bj&ouml;rn Gr&ouml;nvall redescubri&oacute; esta
particular versi&oacute;n y comenz&oacute; a corregir errores.  Su
versi&oacute;n de ssh se llama 
<a href="ftp://ftp.pdc.kth.se/pub/krypto/ossh/">OSSH</a>, y s&oacute;lo
tiene soporte para el protocolo SSH 1.3.  Se sospecha que OSSH ha sido
integrado en algunos productos comerciales en Suecia.  Hasta la fecha,
OSSH no dispone de soporte para el protocolo SSH 2.

<p>
Los miembros del Proyecto OpenBSD nos enteramos de la existencia del
trabajo de Bj&ouml;rn algo menos de dos meses antes del lanzamiento de
la <a href="http://www.openbsd.org/es/26.html">versi&oacute;n 2.6 de
OpenBSD</a>.  Quer&iacute;amos incluir soporte para el protocolo ssh en
la versi&oacute;n 2.6, pero antes deb&iacute;amos asegurarnos de que era
perfecta.  Por lo tanto decidimos empezar desde la versi&oacute;n de
OSSH, y llevar a cabo un r&aacute;pido desarrollo del mismo modo en que
ocurri&oacute; con el proceso original de auditor&iacute;a de seguridad
de OpenBSD.  El resultado de esto fue que, en el momento de lanzar la
nueva versi&oacute;n, muchos de los ficheros del c&oacute;digo fuente ya
se encontraban en la revisi&oacute;n 1.34 de RCS, y algunos incluso en
revisiones tan avanzadas como la 1.66.  El desarrollo fue
fren&eacute;tico, ya que ten&iacute;amos un plazo que cumplir.

<p>
Participaron los siguientes miembros del equipo:

<p>
<ul>
<li>Theo de Raadt (CANAD&Aacute;) comenz&oacute; eliminando las partes
que no eran portables y que hac&iacute;an que el c&oacute;digo fuera
m&aacute;s dif&iacute;cil de entender;  el objetivo fue obtener un
c&oacute;digo fuente m&aacute;s simple, de modo que los agujeros de
seguridad y otros fallos se pudieran ver con m&aacute;s facilidad.
<li>Niels Provos (ALEMANIA, residente en EE.UU.) elimin&oacute; con
rapidez los restantes componentes criptogr&aacute;ficos y componentes
bajo la licencia GPL, teniendo que hacer viajes por carretera a
Canad&aacute; para que pudi&eacute;ramos acabar teniendo una base de
c&oacute;digo fuente reutilizable y totalmente libre.
<li>Markus Friedl (ALEMANIA) se uni&oacute; y consigui&oacute; con
rapidez reemplazar el c&oacute;digo del protocolo SSH 1.3 desde la
versi&oacute;n 1.2.12, con una implementaci&oacute;n del protocolo SSH
1.5 compatible con las series modernas de &quot;ssh 1.3.37&quot; (este
cambio fue necesario para poder operar con muchos programas clientes de
Windows compatibles con SSH, y que carec&iacute;an de soporte para el
protocolo SSH 1.3).  Su implementaci&oacute;n est&aacute; siendo usada
ahora en OSSH.  Markus a&ntilde;adi&oacute; soporte para el protocolo
SSH 1.5 de un modo tal que el soporte para el protocolo SSH 1.3 se
mantuvo operativo.  M&aacute;s tarde tambi&eacute;n a&ntilde;adi&oacute;
soporte para el protocolo SSH 2 y para SFTP.
<li>Bob Beck (CANAD&Aacute;) ayud&oacute; con el
<em>&quot;magic&quot;</em> del <em>Makefile</em> para asegurarnos de que
pod&iacute;amos compilar OpenSSL sin algoritmos patentados;  debido a
que OpenBSD 2.6 se lanz&oacute; antes de la fecha de caducidad de la
patente de RSA, nuestro CD tuvo que salir con las bibliotecas
compartidas libssl y libcrypto sin RSA.  En el momento de la
instalaci&oacute;n el usuario pod&iacute;a substituir estas bibliotecas
por medio de FTP o HTTP por Internet.  Por fortuna este tipo de trucos
ya no son necesarios.
<li>Aaron Campbell (CANAD&Aacute;) mejor&oacute; muchos vac&iacute;os en
la documentaci&oacute;n y algunos otros problemas en el c&oacute;digo.
En su mayor parte, el que las p&aacute;ginas de manual sean tan
completas es algo que le debemos a &eacute;l.
<li>Dug Song (EE.UU.) ayud&oacute; con algunos temas de
autenticaci&oacute;n en el caso de KerberosIV (sus cambios fueron
verificados con mucho cuidado para asegurarse de que se manten&iacute;a
alejado de algunos problemas criptogr&aacute;ficos y que s&oacute;lo se
tocaran en casos de autenticaci&oacute;n).
</ul>

<p>
Por tanto, la versi&oacute;n de OpenSSH se bas&oacute; en estas
versiones m&aacute;s antiguas de ssh 1.2.12, pero con m&aacute;s errores
de programaci&oacute;n eliminados y nuevas funcionalidades que se han
vuelto a a&ntilde;adir:
<p>

<ul>
<li>tiene todos los componentes de naturaleza restrictiva (o sea,
patentes;  v&eacute;ase
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">
ssl</a>) eliminados del c&oacute;digo fuente;  cualquier componente bajo
licencia o patentado se saca de bibliotecas externas (v.g.
<a href="http://www.openssl.org/">OpenSSL</a>).
<li>contiene soporte a&ntilde;adido para autenticaci&oacute;n y pase de
tickets con
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kerberos&amp;sektion=8">KerberosIV</a>
<li>tiene soporte para la autenticaci&oacute;n con contrase&ntilde;as de
uso de una sola vez con 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&amp;sektion=1">
skey(1)</a>.
<li>y cientos de cambios m&aacute;s que los usuarios pueden ver en las
nuevas p&aacute;ginas del manual y en los cambios en el c&oacute;digo
fuente.
</ul>

<p>
Eso marc&oacute; el lanzamiento de OpenSSH 1.2.2, que sali&oacute; a la
luz incluido en OpenBSD 2.6 el 1 de diciembre de 1.999.  En esa
&eacute;poca, todo el desarrollo fue llevado a cabo por Aaron Campbell,
Bob Beck, Markus Friedl, Niels Provos, Theo de Raadt, y Dug Song.
Queremos agradecer a todos aquellos que han encontrado errores y nos han
informado sobre ellos.

<p>
<a name="portable"></a>
<h3>Portar OpenSSH</h3>

<p>
Casi inmediatamente despu&eacute;s de haber lanzado nuestra
implementaci&oacute;n del protocolo 1, varios grupos ajenos a OpenBSD se
mostraron muy interesados.  Damien Miller, Philip Hands y otros cuantos
comenzaron a portar OpenSSH a Linux y otros sistemas operativos Unix.
Desde que empezamos este esfuerzo pensamos que el c&oacute;digo original
de ssh era demasiado complejo, ten&iacute;a demasiadas dependencias de
sistemas operativos como para tratar con &eacute;l.  El modo en que lo
abordamos para escribir un c&oacute;digo completamente seguro y
s&oacute;lido como una roca, evita tener que tratar con diferencias
excesivas como &eacute;sas.  As&iacute; pues, para facilitarnos el
proceso completo de desarrollo a todos, decidimos separar nuestro
esfuerzo de desarrollo central del de desarrollo de portabilidad.  Esto
nos ha funcionado muy bien (como prueba, compare el n&uacute;mero de
l&iacute;neas de c&oacute;digo entre la versi&oacute;n base y la
portable).

<p>
<h3>Soporte para el Protocolo SSH 2</h3>

<p>
Con la versi&oacute;n 2.6 de OpenBSD ya acabada, Markus Friedl
decidi&oacute; ir a por el soporte para el 
<a href="goals.html">protocolo SSH 2</a>.  Trabajando como un esclavo
durante meses, consigui&oacute; mantener OpenSSH en forma, mientras que
al mismo tiempo lo convert&iacute;a en una pieza &uacute;nica de
<em>software</em> que pod&iacute;a gestionar tanto el protocolo SSH 1
como el SSH 2.  Esta versi&oacute;n, llamada OpenSSH 2.0, fue incluida
en el lanzamiento de OpenBSD 2.7, el 15 de junio de 2.000.  La mayor
parte de las comprobaciones sobre los cambios de Markus han sido
llevadas a cabo por Niels Provos y Theo de Raadt.  Debemos dar las
gracias a Bob Beck por actualizar OpenSSL con una versi&oacute;n
m&aacute;s reciente.

<p>
<h3>Soporte para SFTP</h3>

<p>
El soporte para el programa servidor del subprotocolo SFTP fue escrito
por Markus Friedl, e incluido en el lanzamiento de la versi&oacute;n
2.3.0 de OpenSSH, en noviembre de 2.000.  Inmediatamente despu&eacute;s,
Damien Miller comenz&oacute; a trabajar sobre un programa cliente de
sftp, que vio la luz por primera vez con la versi&oacute;n 2.5.0 de
OpenSSH.

<p>
<h3>Monitorizaci&oacute;n de servidores de SSH</h3>

<p>
A fin de facilitar la monitorizaci&oacute;n de servidores SSH en
funcionamiento, v.g. para la red de una empresa, Niels Provos
desarroll&oacute; la herramienta
<a href="http://www.monkey.org/~provos/scanssh/">scanssh</a>; scanssh
lleva a cabo un barrido (<em>scan</em>) sobre una lista de direcciones y
redes, buscando servidores SSH y sus n&uacute;meros de versi&oacute;n.
Tiene soporte para la selecci&oacute;n aleatoria de direcciones IP en
redes grandes, y es muy &uacute;til para la recolecci&oacute;n de
estad&iacute;sticas sobre la utilizaci&oacute;n de servidores SSH en una
empresa o en toda Internet.  Las estad&iacute;sticas incluyen la
versi&oacute;n del protocolo SSH y las versiones del programa que se
est&eacute;n usando.

<p>
scanssh se est&aacute; utilizando para recopilar
<a href="../usage/es/index.html">estad&iacute;sticas</a> sobre la
utilizaci&oacute;n de protocolos SSH en Internet.  Estos datos permiten
profundizar en la distribuci&oacute;n de los varios protocolos de SSH y
en la penetraci&oacute;n a nivel de mercado de versiones particulares
del servidor.

<hr>

<h2><font color="#e00000">SSH: Por fin totalmente libre.</font></h2>

<img width="764" height="500" src="../images/quiet.jpg" alt="SSH... Don't Tell Anyone It's Free">

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenSSH"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: history.html,v 1.31 2003/06/22 19:26:11 david Exp ]<br>
$Translation: history.html,v 1.20 2003/06/22 21:32:17 horacio Exp $<br>
$OpenBSD: history.html,v 1.18 2003/06/27 20:48:58 jufi Exp $
</small>

</body>
</html>
