<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Alternativas para OpenSSH en Java</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="clientes/servidores en Java para SSH">
<meta name="keywords" content="openbsd,openssh,ssh,java">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2004 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenSSH]" height="30" width="141" src="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Java</font></h2>
<hr>

<p>
Los siguientes clientes &laquo;libres&raquo; se recomiendan para la
interoperabilidad con OpenSSH desde clientes Java:

<p>
<ul>
<li><a href="http://www.isnetworks.com/ssh/">MindTerm 1</a> es una
implementaci&oacute;n s&oacute;lo para SSH1 bajo licencia GPL.
<p>
&laquo;Mindterm es un programa cliente del protocolo 1 de SSH
completamente LIBRE(*), escrito en puro Java al 100% (no certificado).
Se distribuye con el c&oacute;digo fuente, ya que creemos que el
software relacionado con la seguridad no ser&iacute;a serio de otro
modo.  MindTerm puede funcionar como un programa por s&iacute; solo, o
como una aplicaci&oacute;n de java (&quot;applet&quot;) en una
p&aacute;gina web.  Se puede usar con o sin interfaz gr&aacute;fica de
usuario (GUI).  Dispone de dos funcionalidades caracter&iacute;sticas
que lo distingue de otros clientes, transferencia de ficheros scp
integrada y un t&uacute;nel ftp especial que funciona con <tt>ftpd</tt>s
ordinarios &quot;detr&aacute;s&quot; de <tt>sshd</tt>.&raquo;
<p>
Nota: MindTerm 2 no es libre.
<p>

<li><a href="http://www.cl.cam.ac.uk/~fapp2/software/java-ssh/">Java-SSH</a> es una implementaci&oacute;n s&oacute;lo para SSH1, de C&eacute;dric
Gourio.  Viene con una confusa mezcla de licencia no comercial y GPL.
<p>
&laquo;Esta aplicaci&oacute;n de java implementa el protocolo de SSH
1.5.  La emulaci&oacute;n del terminal es cuasi-conforme con VT100.
Provee comunicaciones seguras por redes inseguras.  Todas las
comunicaciones se cifran de forma transparente y autom&aacute;tica.
Tambi&eacute;n se usa el cifrado para proteger la integridad.&raquo;
<p>

<li><a href="http://www.mud.de/se/jta/doc/plugins/SSH.html">SSH
Plugin</a> es una implementaci&oacute;n s&oacute;lo para SSH1, de
Matthias L.  Jugel y Marcus Mei&szlig;ner.  Licencia GPL.
<p>
&laquo;Esta implementaci&oacute;n de SSH provee cifrado con IDEA y
RSA/PKCS#1, y fue escrita originalmente en 1.998 por C&eacute;dric
Gourio.  Us&oacute; parte del viejo &quot;Java Telnet Applet&quot; para
escribir su cliente Java SSH, por lo que el c&oacute;digo era muy
parecido a nuestro viejo applet.&raquo;
<p>

<li><a href="http://www.sshtools.com/">SSH Toolkits for Java</a>.
Licencia LGPL/GPL.
<p>
&laquo;En la actualidad tenemos tres proyectos bajo licencia LGPL/GPL:
J2SSH, una biblioteca de SSH2, SSHTerm, una aplicaci&oacute;n cliente de
terminal, y un servidor de SSH para Windows.&raquo;
<p>

</ul>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenSSH"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: java.html,v 1.14 2003/02/25 17:34:53 tedu Exp ]<br>
$Translation: java.html,v 1.11 2004/09/03 19:21:55 santana Exp $<br>
$OpenBSD: java.html,v 1.12 2004/09/04 09:23:58 jufi Exp $
</small>

</body>
</html>
