<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Alternativas a OpenSSH para Windows y Mac</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página del proyecto OpenSSH">
<meta name="keywords" content="openssh,windows">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<img alt="[OpenSSH]" height="30" width="141" src="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Windows y Mac</font></h2>
<hr>

<p>
Se recomiendan los siguientes clientes &laquo;libres&raquo; para la
interoperaci&oacute;n con OpenSSH desde sistemas Windows:

<p>
<ul>
<li><a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/">
PuTTY</a> es una implementaci&oacute;n para el protocolo SSH1+SSH2.

<p>
Tambi&eacute;n existe PSCP, un programa para Windows al estilo
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>.

<p>
PuTTY se encuentra disponible bajo la licencencia MIT (del estilo BSD).

<p>
&laquo;PuTTY es una implementaci&oacute;n libre de Telnet y SSH para
plataformas Win32, dise&ntilde;ado y mantenido principalmente por Simon
Tatham desde Gran Breta&ntilde;a.&raquo;

<p>
<li><a href="http://www.zip.com.au/~roca/ttssh.html">TTSSH (SSH1)</a> es
una implementaci&oacute;n s&oacute;lo para el protocolo SSH1 de Robert
O'Callahan.

<p>
&laquo;TTSSH es un cliente libre para Windows.  Est&aacute; implementado
como una extensi&oacute;n DLL para Teraterm Pro.  Teraterm Pro es un
fant&aacute;stico cliente emulador de terminal y cliente de telnet libre
para Windows, y su c&oacute;digo fuente se encuentra disponible al
p&uacute;blico.  TTSSH a&ntilde;ade funcionalidades de SSH a Teraterm
Pro sin sacrificar ninguna de las funcionalidades ya existentes de
Teraterm.  TTSSH est&aacute; disponible bajo una licencia abierta.  Es
m&aacute;s, TTSSH ha sido desarrollado completamente en Australia
[...].&raquo;

<p>
<li><a href="http://www.cygwin.com/">Cygwin (software POSIX sobre
Windows)</a>

<p>
OpenSSH (protocolos SSH1 y SSH2) funciona en Windows con Cygwin usando
la <a href="portable.html">versi&oacute;n portable de OpenSSH</a>.

<p>
<li><a href="http://cs.mscd.edu/MSSH/index.html">MSSH</a>
<p>
MSSH, del Metropolitan State College of Denver, contiene soporte para el
protocolo SSH1 en Windows 95 y Windows 98.

<p>
<li><a href="http://www.i-tree.org/gpl/ixplorer.htm">Secure iXplorer
GPL</a>
<p>
Secure iXplorer GPL es una interfaz gr&aacute;fica para pscp.exe de
<a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/">PuTTY</a>

<p>
<li><a href="http://winscp.vse.cz/eng">WinSCP</a>
<p>
WinSCP es un programa scp(1) para Windows con PuTTY integrado.

</ul>

<p>
Mac OS X incluye OpenSSH en la instalaci&oacute;n predefinida.  Se
recomiendan los siguientes clientes para la interoperaci&oacute;n con
OpenSSH desde sistemas Mac OS 9:

<p>
<ul>
<li><a href="http://www.lysator.liu.se/~jonasw/freeware/niftyssh/">
NiftyTelnet 1.1 SSH</a> es una implementaci&oacute;n s&oacute;lo para el
protocolo SSH1 que viene con un programa del estilo de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>.
Est&aacute; escrito por Jonas Wallden.

<p>
&laquo;NiftyTelnet 1.1 SSH r3 es una versi&oacute;n mejorada de la
aplicaci&oacute;n NiftyTelnet 1.1 de Chris Newman, con soporte para
sesiones de terminal cifradas usando el protocolo SSH (&quot;Secure
Shell&quot;).  Por favor, lea el fichero <em>Readme</em> que incluye
antes de distribuir esta versi&oacute;n.&raquo;

<p>
<li><a href="http://www.macssh.com/">MacSSH</a> es una
implementaci&oacute;n s&oacute;lo para SSH2.

<p>
&laquo;MacSSH es una versi&oacute;n modificada de BetterTelnet con
soporte para SSH2.  (...)  El &uacute;nico cliente de SSH2 para MacOS
que he podido encontrar es un producto comercial que cuesta m&aacute;s
de $100, y que cuelga mi Mac al cerrar la sesi&oacute;n...  Ya que lo
mejor es hacer las cosas por uno mismo, aqu&iacute; est&aacute;
MacSSH.&raquo;

<p>
<li><a href="http://www.apple.com/downloads/macosx/internet_utilities/fugu.html">Fugu</a>
es una implementaci&oacute;n de SFTP y SCP.

<p>
&laquo;Fugu SSH es una interfaz gr&aacute;fica en Mac OS X de la
aplicaci&oacute;n SFTP de OpenSSH.  Fugu permite aprovechar la seguridad
de SFTP sin sacrificar la facilidad de uso de una interfaz
gr&aacute;fica de usuario.  Fugu tambi&eacute;n incluye soporte para
transferencias de archivos mediante SCP, y la posibilidad de crear
t&uacute;neles seguros a trav&eacute;s de SSH.&raquo;
</ul>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenSSH"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: windows.html,v 1.28 ]<br>
$Translation: windows.html,v 1.19 2003/11/24 15:10:27 horacio Exp $<br>
$OpenBSD: windows.html,v 1.18 2003/11/24 15:24:03 horacio Exp $
</small>

</body>
</html>
