<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>Alternativas a OpenSSH para Windows y Mac</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenSSH project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2001 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenSSH]" height="30" width="141" src="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Windows y Mac</font><hr></h2>

<p>
Se recomiendan los siguientes clientes &laquo;libres&raquo; para
interoperar con OpenSSH desde sistemas Windows:

<p>
<ul>
<li><a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/">PuTTY</a>
es una implementaci&oacute;n para el protocolo SSH1+SSH2.

<p>
Tambi&eacute;n existe PSCP, un programa para Windows al estilo
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>.<br>
PuTTY se encuentra disponible bajo la licencencia MIT (del estilo BSD).
El modo SSH2 de Putty
<a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/wishlist.html#dsa">no contiene soporte para la identificaci&oacute;n de usuario con DSA</a>.

<p>
&laquo;PuTTY es una implementaci&oacute;n libre de Telnet y SSH para
plataformas Win32, dise&ntilde;ado y mantenido principalmente por Simon
Tatham desde Gran Breta&ntilde;a.&raquo;

<p>
<li><a href="http://www.zip.com.au/~roca/ttssh.html">TTSSH (SSH1)</a>
es una implementaci&oacute;n s&oacute;lo para el protocolo SSH1 de
Rober O'Callahan.

<p>
&laquo;TTSSH es un cliente libre para Windows.  Est&aacute;
implementado como una extensi&oacute;n DLL para Teraterm Pro.  Teraterm
Pro es un fant&aacute;astico cliente emulador de terminal y cliente de
telnet libre para Windows, y su c&oacute;digo fuente se encuentra
disponible.  TTSSH a&ntilde;ade funcionalidades de SSH a Teraterm Pro
sin sacrificar ninguna de las ya existente funcionalidades de Teraterm.
TTSSH est&aacute; disponible bajo una licencia abierta.  Es m&aacute;s,
TTSSH ha sido desarrollado completamente en Australia [...].&raquo;

<p>
<li><a href="http://telneat.lipetsk.ru/">Telneat (SSH1)</a>
es un cliente de telnet/SSH para Window creado por Kosta Schegloff.

<p>
Ofrece las siguientes funcionalidades:

<ul>
   <li>soporte completo para telnet
   <li>soporte completo para SSH (compresi&oacute;n con <code>IDEA,
       DES, 3DES, ArcFour y BlowFish)
   <li>soporte completo para termcap
   <li>soporte para Win95, OSR2, Win98, WinNT y Win2000
   <li>soporte externo para <em>plugins</em> de cifrado SSH
   <li>hasta 10 consolas
   <li>funcionalidad de &laquo;cortar y pegar&raquo; con el
       rat&oacute;n
   <li>memoria de pasado de p&aacute;ginas
   <li>autoingreso
   <li>tablas de recodificado configurables
   <li>configuraci&oacute;n independiente para cada hu&eacute;sped
</ul>
<p>
</ul>

<p>
Se recomiendan los siguientes clientes para interoperar con OpenSSH
desde sistemas Mac:

<p>
<ul>
<li><a href="http://www.lysator.liu.se/~jonasw/freeware/niftyssh/">NiftyTelnet 1.1 SSH</a>
es una implementaci&oacute;n s&oacute;lo para el protocolo SSH1 que
viene con un programa del estilo de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=scp">scp</a>.
Est&aacute; escrito por Jonas Wallden.

<p>
&laquo;NiftyTelnet 1.1 SSH r3 es una versi&oacute;n mejorada de la
aplicaci&oacute;n NiftyTelnet 1.1 de Chris Newman, con soporte para
sesiones de terminal cifradas usando el protocolo SSH (&quot;Secure
Shell&quot;).  Por favor, lea el fichero <em>Readme</em> que incluye
antes de distribuir esta versi&oacute;n.&raquo;

<p>
<li><a href="http://www.macssh.com/">MacSSH</a>
es una implementaci&oacute;n s&oacute;lo para SSH2.

<p>
&laquo;MacSSH es una versi&oacute;n modificada de BetterTelnet con
soporte para SSH2.  (...)  El &uacute;nico cliente de SSH2 para MacOS
que he podido encontrar es un producto comercial que cuesta m&aacute;s
de $100, y que cuelga mi Mac al cerrar la sesi&oacute;n...  Ya que lo
mejor es hacer las cosas por uno mismo, aqu&iacute; est&aacute;
MacSSH.&raquo;
</ul>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenSSH"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: windows.html,v 1.8 2000/11/16 17:56:00 markus Exp ]<br>
$Translation: windows.html,v 1.5 2000/11/20 23:29:09 horacio Exp $<br>
$OpenBSD: windows.html,v 1.5 2001/02/01 15:54:02 todd Exp $
</small>

</body>
</html>
