<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenBSD Project Goals</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-2">
<meta name="description" content="the OpenBSD project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2004 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Obiectivele Proiectului</font></h2>
<hr>

<p>
Evident, fiecare dezvoltator care lucreaz&#259; la proiectul OpenBSD are
propriile obiective &#351;i  priorit&#259;&#355;i, dar putem clasifica
obiectivele comune pe care le &#238;mp&#259;rt&#259;&#351;esc cu to&#355;ii 
astfel:

<p>
<ul>
<li>S&#259; ofere cea mai bun&#259; platform&#259; de dezvoltare posibil&#259;.<a href="../anoncvs.html">
        S&#259; ofere acces ne&#238;ngr&#259;dit dezvoltatorilor &#351;i 
        utilizatorilor, inclusiv posibilitatea de a urm&#259;ri &#238;n mod direct
        modific&#259;rile din arborele CVS</a>.
        Utilizatorii ot urm&#259;ri arborele surs&#259;  &#351;i modific&#259;rile
	<a href="http://www.openbsd.org/cgi-bin/cvsweb">direct pe web!</a><p>

<li>S&#259; integreze cod surs&#259; de bun&#259; calitate din orice surs&#259; 
        care are <a href="../policy.html">un copyright acceptabil (de preferin&#355;&#259;
	de tip Berkeley sau ISC, GPL este acceptabil numai &#238;n ultim&#259; 
	instan&#355;&#259; dar nu &#238;n kernel, NDA complet inacceptabil)</a>.
	Dorim s&#259; punem codul surs&#259; la dispozi&#355;ia tuturor pentru a 
	putea fi folosit &#238;n ORICE SCOP, f&#259;r&#259; restric&#355;ii.
	
	<strong>Ne str&#259;duim s&#259; facem software-ul nostru robust &#351;i
	sigur, &#351;i &#238;ncuraj&#259;m companiile s&#259; utilizeze orice 
	component pe care &#238;l doresc.</strong>  Exist&#259;
	<a href="../products.html">produse comerciale</a> derivate din OpenBSD.<p>
	
<li>S&#259; dea aten&#355;ie <a href="../security.html">problemelor de securitate 
        &#351;i s&#259; le rezolve &#238;nainte ca altcineva s&#259; o fac&#259;</a>.
	(&#206;ncerc&#259;m s&#259; fim num&#259;rul 1 pe lista celor mai sigure sisteme
	de operare).<p>
<li><a href="../crypto.html">S&#259; oferim o mai larg&#259; integrare a software-ului
        criptografic.</a> Aceasta &#238;nseamn&#259; IPsec, "key engines", Kerberos, 
	"free-AFS", &#351;i alte forme de criptografie puternic&#259; sau de sisteme 
	care utilizeaz&#259; criptografia.
	OpenBSD este dezvoltat &#351;i distribuit din Canada &#351;i, sub prescrierile
	legii canadiene, este legal exportul de criptografie &#238;n &#238;ntreaga lume. 
	(Precum a fost 
	<a href="http://www.efc.ca/pages/doc/crypto-export.html">
	documentat de o persoan&#259; fizic&#259; canadian&#259;</a> &#351;i dup&#259; cum
	<a href="http://axion.physics.ubc.ca/ECL.html">
	este documentat &#238;n Lista de Control a Exporturilor din Canada</a>).
	Dezvoltatorii OpenBSD &#238;ntreprind cercetare &#351;i dezvoltare activ&#259;
	a IPsec.<p>
<li>S&#259; urm&#259;reasc&#259; &#351;i s&#259; implementeze standardele (ANSI, POSIX, 
	p&#259;r&#355;i din X/Open, etc.)<p>
<li>Urm&#259;resc un arbore surs&#259; c&#226;t mai independent de arhitectura ma&#351;inii.
	<a href="../plat.html">Suportul a c&#226;t mai multor sisteme &#351;i platforme hardware
	diferite pe c&#226;t este fezabil.</a><p>
<li>S&#259; fim c&#226;t mai independen&#355;i din punct de vedere politic pe c&#226;t
	posibil; solu&#355;iile ar trebui decise pe baza meritului tehnic.<p>
<li>S&#259; nu l&#259;s&#259;m problemele serioase s&#259; r&#259;m&#226;n&#259;
	nerezolvate.<p>
<li>S&#259; oferim o platform&#259; bun&#259; de compilare/dezvoltare &#238;ncruci&#351;at&#259;.<p>
<li>S&#259; importe aplica&#355;iile externe cu minime modific&#259;ri - f&#259;c&#226;nd actualizarea
	mult mai u&#351;oar&#259;. S&#259; aduc&#259; modific&#259;rile f&#259;cute la
	cuno&#351;tin&#355;a dezvoltatorilor acestora.<p>
<li>S&#259; distribuie o versiune pe CD-ROM la aproximativ fiecare &#351;ase luni,
	&#238;n mod particular pentru finan&#355;area proiectului...<p>
</ul>

<a name=funding></a>
<h2><font color="#e00000">Finan&#355;area Proiectului</font></h2>

&#206;n mod natural, proiectul OpenBSD necesit&#259; fonduri pentru a opera, datorit&#259;
costurilor legate de prezen&#355;a pe Internet &#351;i upgrade-urilor hardware, a&#351;a cum 
prea bine cunoa&#351;tem fiecare dintre noi. Din aceste motive, proiectul vinde discuri CDROM
ale cele mai recente distribu&#355;ii. De asemenea, proiectul pune la dispozi&#355;ia 
celor doritori tricouri a caror v&#226;nzare sus&#355;ine finan&#355;area sa. Astfel,
atunci c&#226;nd cump&#259;ra&#355;i un CD sau tricou OpenBSD, fie la o conferin&#355;&#259; sau la
una dintre celelalte loca&#355;ii, fie de la <a href="../orders.html"> pagina noastr&#259; 
de comand&#259; a CDROM-urilor</a>, ajuta&#355;i la cre&#351;terea &#351;anselor ca
urm&#259;toarea distribu&#355;ie s&#259; devin&#259; realitate.
<p>
Este deasemenea posibil donarea de fonduri sau <a href="../want.html">hardware</a>,
&#238;n care caz numele donatorilor va apare pe pagina noastr&#259; de 
<a href="../donations.html">dona&#355;ii</a>.
Pentru mai multe informa&#355;ii despre aceasta, contacta&#355;i-l pe
<a href="mailto:deraadt@openbsd.org">Theo de Raadt</a> sau pur &#351;i simplu
trimite&#355;i un cec &#238;n moned&#259; canadian&#259; sau american&#259; pe adresa:<p>

OpenBSD<br>
812 23rd Ave SE<br>
Calgary, Alberta<br>
Canada<br>
T2G 1N8<br>
(Cecul trebuie adresat pe numele lui "Theo de Raadt", &#238;ntruc&#226;t cecurile
scrise pentru "OpenBSD" nu pot fi &#238;ncasate.)<br>

<p>
&#206;n plus, este posibil acum s&#259; dona&#355;i bani proiectului online prin
<a href="https://https.openbsd.org/cgi-bin/order">credit card</a> sau
<a href="https://www.paypal.com/xclick/business=paypal%40openbsd.org&amp;item_name=OpenBSD+Donation&amp;no_shipping=1">PayPal</a>.
<p>
Chiar dac&#259; dona&#355;iile nu sunt deductibile &#238;n SUA ca &#351;i contribu&#355;ii
caritabile, ele pot fi deduse ca &#351;i cheltuieli opera&#355;ionale, motiv pentru care v&#259; 
sf&#259;tuim s&#259; consulta&#355;i un contabil.
Acelea&#351;i reguli se aplic&#259; &#351;i &#238;n alte &#355;&#259;ri, unde companiile
pot deduce astfel de dona&#355;ii sub diferi&#355;i termeni.

<p>
La &#238;nceputurile proiectului, Theo de Raadt a cheltuit mai mult de $30,000 (CDN)
pentru a porni OpenBSD, majoritatea datorit&#259; costurilor ridicate legate de 
conectare &#351;i re&#355;ele din Canada (datorit&#259; politicilor SUA &#238;n ce
prive&#351;te criptografia, nu este posibil&#259; mutarea proiectului &#238;n SUA). 
P&#226;n&#259; acum, nici o companie sau institu&#355;ie educa&#355;ional&#259;
nu au oferit finan&#355;are.
Theo lucreaz&#259; full-time la &#238;mbun&#259;t&#259;&#355;irea proiectului, 
&#351;i mare parte din fonduri sunt cheltuite pentru a oferi dezvoltatorilor 
proiectului hardware nou pentru a putea continua &#238;mbun&#259;t&#259;&#355;irea
OpenBSD (de exemplu, mai mult de 20 noi pl&#259;ci de re&#355;ea au ap&#259;rut pe 
pia&#355;&#259; de c&#226;nd a fost lansat OpenBSD.).
De aceea, fonduri sunt necesare tot timpul. Dona&#355;iile continue provenind de la
utilizatori asigur&#259; continuarea existen&#355;ei proiectului OpenBSD.
<hr>

<h2><font color="#e00000">Unde tr&#259;iesc dezvoltatorii no&#351;tri?</font></h2>

Aceast&#259; hart&#259; arat&#259; aproximativ unde tr&#259;iesc dezvoltatorii 
proiectului. Vom &#238;ncerca s&#259; o actualiz&#259;m ocazional, dar nu promitem.

<p>
<center>
<img src="../images/map.jpg" height=508 width=950 alt= "World map">
</center>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
<!--
Originally [OpenBSD: goals.html,v 1.68 ]
$Translation: goals.html,v 1.2 2006/04/19 03:07:12 saad Exp $<br>
-->
$OpenBSD: goals.html,v 1.1 2006/04/19 04:04:01 saad Exp $
</small>
</body>
</html>
