<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Gestion du Protocole FTP</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq,pf">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 2002-2004 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../../images/smalltitle.gif">
<p>
[<a href="perf.html">Pr&eacute;c&eacute;dent : Performances</a>]
[<a href="index.html">Index</a>]
[<a href="authpf.html">Suivant : Authpf : Shell Utilisateur pour les
Passerelles d'Authentification</a>]

<p>
<h1><font color="#e00000">PF: Gestion du Protocole FTP</font></h1>
<hr>

<h3>Table des Mati&egrave;res</h3>
<ul>
<li><a href="#modes">Modes FTP</a>
<li><a href="#client">Client FTP derri&egrave;re un pare-feu</a>
<li><a href="#server">Serveur FTP prot&eacute;g&eacute; par un pare-feu
    PF local</a>
<li><a href="#natserver">Serveur FTP prot&eacute;g&eacute; par un
    pare-feu PF externe avec NAT</a>
<li><a href="#info">Plus d'Informations sur FTP</a>
</ul>

<hr>

<a name="modes"></a>
<h2>Modes FTP</h2>
FTP est un protocole qui date d'une &eacute;poque o&ugrave; Internet
&eacute;tait un petit ensemble de machines avec des relations de
confiance mutuelle et o&ugrave; tout le monde connaissait tout le monde.
A cette &eacute;poque le besoin de filtrer ou d'assurer une
s&eacute;curit&eacute; stricte &eacute;tait inexistant. FTP
n'&eacute;tait pas con&ccedil;u pour filtrer, pour faire transiter du
trafic &agrave; travers les pare-feux, ou pour fonctionner avec la NAT.

<p>
FTP peut fonctionner dans deux modes : passif et actif. De
mani&egrave;re g&eacute;n&eacute;rale, le choix du mode actif ou passif
consiste &agrave; d&eacute;terminer l'extr&ecirc;mit&eacute; de
communication FTP qui a un probl&egrave;me avec le filtrage pare-feu.
Dans le meilleur des mondes, il faudrait supporter les deux modes pour
rendre vos utilisateurs heureux.

<p>
Dans le mode FTP actif, quand un utilisateur se connecte &agrave; un
serveur FTP distant et demande une information ou un fichier, le serveur
FTP effectue une connexion vers le client pour transf&eacute;rer les
donn&eacute;es demand&eacute;es. Cette connexion est appel&eacute;e la
<i>connexion de donn&eacute;es</i>. Pour commencer, le client FTP
choisit un port al&eacute;atoire qui lui servira pour recevoir les
donn&eacute;es. Le client envoie le num&eacute;ro de port qu'il a choisi
au serveur FTP puis se met &agrave; l'&eacute;coute des connexions
entrantes &agrave; destination de ce port. Le serveur FTP initie ensuite
une connexion vers l'adresse du client sur le port choisi et
transf&egrave;re les donn&eacute;es. Ce mode de fonctionnement est
probl&eacute;matique pour les utilisateurs essayant d'acc&eacute;der
&agrave; des serveurs FTP lorsqu'ils sont derri&egrave;re une passerelle
NAT. Vu la mani&egrave;re dont fonctionne la NAT, le serveur FTP initie
la connexion de donn&eacute;es en se connectant &agrave; l'adresse
externe de la passerelle NAT sur le port choisi. La passerelle NAT n'a
pas de correspondance pour le paquet re&ccedil;u dans sa table
d'&eacute;tat. Le paquet sera ignor&eacute; et ne sera pas
d&eacute;livr&eacute; au client.

<p>
Dans le mode FTP passif (le mode par d&eacute;faut utilis&eacute; par le
client
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp&amp;sektion=1&amp;manpath=OpenBSD+3.4">ftp(1)</a> 
d'OpenBSD), le client demande au serveur de choisir un port
al&eacute;atoire sur lequel ce dernier se mettra &agrave;
l'&eacute;coute en attente de la connexion de donn&eacute;es. Le serveur
communique au client le port qu'il a choisi pour le transfert des
donn&eacute;es. Malheureusement, ce n'est pas toujours possible ou
souhaitable &agrave; cause de la possibilit&eacute; d'existence d'un
pare-feu devant le serveur FTP qui bloquerait les connexions de
donn&eacute;es en entr&eacute;e. Le client ftp(1) d'OpenBSD utilise le
mode passif par d&eacute;faut; pour forcer le mode FTP actif, utilisez
le drapeau -A du client ftp(1). Il est aussi possible de
d&eacute;sactiver le mode passif (et donc d'activer par cette action le
mode actif) en utilisant la commande "<tt>passive off</tt>" &agrave;
l'invite de commandes "<tt>ftp&gt;</tt>".


<a name="client"></a>
<h2>Client FTP derri&egrave;re un pare-feu</h2>
Comme pr&eacute;c&eacute;demment indiqu&eacute;, FTP ne fonctionne pas
tr&egrave;s bien &agrave; travers des m&eacute;canismes de NAT et des
pare-feux.


<p>
Packet Filter fournit une solution &agrave; ce cas en redirigeant le
trafic FTP &agrave; travers un serveur mandataire FTP (proxy). Ce
processus agit de telle fa&ccedil;on &agrave; "guider" votre trafic FTP
&agrave; travers la passerelle NAT/pare-feu. Le mandataire FTP
utilis&eacute; par OpenBSD et PF est
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp-proxy&amp;sektion=8&amp;manpath=OpenBSD+3.4">ftp-proxy(8)</a>.  
Pour l'activer, ajustez la ligne suivante selon vos besoins et ajoutez
la &agrave; la section NAT de <tt>pf.conf</tt> :

<blockquote>
<tt>
rdr on $int_if proto tcp from any to any port 21 -&gt; 127.0.0.1 \<br>
&nbsp;&nbsp;&nbsp;port 8021
</tt>
</blockquote>

<p>
Voici l'explication de cette ligne : "Le trafic entrant sur l'interface
interne est redirig&eacute; vers le serveur mandataire sur cette machine
et &eacute;coutant sur le port 8021".

<p>
Il est &eacute;vident que le serveur mandataire doit &ecirc;tre
d&eacute;marr&eacute; et ex&eacute;cut&eacute; sur la machine OpenBSD.
Ceci peut &ecirc;tre effectu&eacute; en ins&eacute;rant la ligne
suivante dans <tt>/etc/inetd.conf</tt> :

<blockquote>
<tt>
127.0.0.1:8021 stream tcp nowait root /usr/libexec/ftp-proxy \<br>
&nbsp;&nbsp;&nbsp;ftp-proxy
</tt>
</blockquote>

<p>
Il faut ensuite red&eacute;marrer le syst&egrave;me ou envoyer le signal
'HUP' &agrave;
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=inetd&amp;sektion=8&amp;manpath=OpenBSD+3.4">inetd(8)</a>.  
Une mani&egrave;re d'envoyer le signal 'HUP' consiste &agrave; utiliser
la commande suivante :

<blockquote>
<tt>
kill -HUP `cat /var/run/inetd.pid`
</tt>
</blockquote>

<p>
Notez que ftp-proxy &eacute;coute sur le serveur 8031, le m&ecirc;me
port qui est utilis&eacute; dans la ligne <tt>rdr</tt>. Le choix du port
8021 est arbitraire, bien que 8021 est un bon choix vu qu'il n'est
utilis&eacute; par aucune autre application.

<p>
Veuillez noter que ftp-proxy(8) est utilis&eacute; pour aider les
<b>clients FTP</b> derri&egrave;re un pare-feu PF; il n'est pas
utilis&eacute; pour prendre en charge un <b>serveur FTP</b>
derri&egrave;re un tel pare-feu.


<a name="server"></a>
<h2>Serveur FTP prot&eacute;g&eacute; par un pare-feu PF local</h2>
Dans ce cas, PF est activ&eacute; sur le serveur FTP lui-m&ecirc;me
plut&ocirc;t que sur un pare-feu d&eacute;di&eacute;. Pour les besoins
d'une connexion FTP passive, FTP utilisera un haut port TCP choisi de
mani&egrave;re al&eacute;atoire pour les donn&eacute;es entrantes. Par
d&eacute;faut, le serveur FTP natif d'OpenBSD
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8&amp;manpath=OpenBSD+3.4">ftpd(8)</a> 
utilise la plage 49152 &agrave; 65535. Ces ports doivent &ecirc;tre
autoris&eacute;s en entr&eacute;e ainsi que le port 21 (le port de
contr&ocirc;le FTP) :

<blockquote>
<tt>
pass in on $ext_if proto tcp from any to any port 21 keep state<br>
pass in on $ext_if proto tcp from any to any port &gt; 49151 \<br>
&nbsp;&nbsp;&nbsp;keep state
</tt>
</blockquote>

<p>
Si vous le souhaitez, vous pouvez restreindre cette plage
consid&eacute;rablement. Dans le cas du programme
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8&amp;manpath=OpenBSD+3.4">ftpd(8)</a> 
d'OpenBSD, ceci peut &ecirc;tre effectu&eacute; en utilisant les
variables
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8&amp;manpath=OpenBSD+3.4">sysctl(8)</a> 
<tt>net.inet.ip.porthifirst</tt> et
<tt>net.inet.ip.porthilast</tt>.

<a name="natserver"></a>
<h2>Serveur FTP prot&eacute;g&eacute; par un pare-feu PF externe avec
    NAT</h2>
Dans ce cas, le pare-feu doit rediriger tout le trafic vers le serveur
FTP. De plus, il ne doit bloquer aucun des ports requis. Pour fournir un
exemple concret, on supposera encore une fois que le serveur FTP est le
serveur standard sous OpenBSD :
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8&amp;manpath=OpenBSD+3.4">ftpd(8)</a>, 
utilisant la plage de ports par d&eacute;faut.

<p>
Voici un exemple de r&egrave;gles qui pourraient &ecirc;tre
utilis&eacute;es dans ce cas de figure :
<blockquote>
<tt>
ftp_server = "10.0.3.21"<br>
<br>
rdr on $ext_if proto tcp from any to any port 21 -&gt; $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port 21<br>
rdr on $ext_if proto tcp from any to any port 49152:65535 -&gt; \<br>
&nbsp;&nbsp;&nbsp;$ftp_server port 49152:65535<br>
<br>
# in on $ext_if<br>
pass in quick on $ext_if proto tcp from any to $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port 21 keep state<br>
pass in quick on $ext_if proto tcp from any to $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port &gt; 49151 keep state<br>
<br>
# out on $int_if<br>
pass out quick on $int_if proto tcp from any to $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port 21 keep state<br>
pass out quick on $int_if proto tcp from any to $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port &gt; 49151 keep state
</tt>
</blockquote>


<a name="info"></a>
<h2>Plus d'Informations sur FTP</h2>
Vous pouvez obtenir plus d'informations concernant le filtrage et le
fonctionnement de FTP de mani&egrave;re g&eacute;n&eacute;rale dans le
livre blanc suivant :
<ul>
<li><a href="http://www.pintday.org/whitepapers/ftp-review.shtml">FTP
Reviewed</a>
</ul>

<p>
[<a href="perf.html">Pr&eacute;c&eacute;dent : Performances</a>]
[<a href="index.html">Index</a>]
[<a href="authpf.html">Suivant : Authpf : Shell Utilisateur pour les
Passerelles d'Authentification</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[back]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ftp.html,v 1.12 ]<br>
$Translation: ftp.html,v 1.4 2004/02/19 20:31:29 saad Exp $<br>
$OpenBSD: ftp.html,v 1.4 2004/02/20 06:33:11 jufi Exp $
</small>

</body>
</html> 
