<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Traduction des Adresses IP ("NAT")</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq,pf">
<meta name="distribution"  content="global">
</head>

<!--
Copyright (c) 2003, Nick Holland <nick@openbsd.org>
Copyright (c) 2003, 2004, Joel Knight <enabled@myrealbox.com>

Permission to use, copy, modify, and distribute this documentation for
any purpose with or without fee is hereby granted, provided that the
above copyright notice and this permission notice appear in all copies.

THE DOCUMENTATION IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL
WARRANTIES WITH REGARD TO THIS DOCUMENTATION INCLUDING ALL IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE
AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
PERFORMANCE OF THIS DOCUMENTATION
-->

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../../images/smalltitle.gif">
<p>
[<a href="filter.html">Pr&eacute;c&eacute;dent : Filtrage de Paquets</a>]
[<a href="index.html">Index</a>]
[<a href="rdr.html">Suivant : Redirection du Trafic</a>]

<p>
<h1><font color="#e00000">PF : Traduction des Adresses IP ("NAT")</font></h1>

<hr>

<h3>Table des Mati&egrave;res</h3>
<ul>
<li><a href="#intro">Introduction</a>
<li><a href="#works">Comment Fonctionne la NAT</a>
<li><a href="#filter">NAT et Filtrage de Paquets</a>
<li><a href="#ipfwd">Routage IP</a>
<li><a href="#config">Configurer la NAT</a>
<li><a href="#binat">Mise en Correspondance Bidirectionnelle (mise en
correspondance 1:1)</a>
<li><a href="#except">Exceptions aux R&egrave;gles de Traduction</a>
<li><a href="#status">V&eacute;rification de l'&eacute;tat de la NAT</a>
</ul>

<hr>

<a name="intro"></a>
<h2>Introduction</h2>
La traduction d'adresses IP (NAT) est un m&eacute;canisme destin&eacute;
&agrave; faire correspondre un r&eacute;seau entier (ou des
r&eacute;seaux) &agrave; une seule adresse IP. Un tel m&eacute;canisme
est n&eacute;cessaire lorsque le nombre des adresses IP qui vous sont
attribu&eacute;es par votre Fournisseur d'Acc&egrave;s Internet est plus
petit que le nombre de machines qui doivent pouvoir
b&eacute;n&eacute;ficier d'une connexion Internet. La NAT est
d&eacute;crite dans la
<a href="http://www.geektools.com/rfc/rfc1631.txt">RFC 1631</a>.

<p>
La NAT vous permet de b&eacute;n&eacute;ficier des blocs d'adressage
priv&eacute;s d&eacute;crits dans la
<a href="http://www.geektools.com/rfc/rfc1918.txt">RFC 1918</a>.
Typiquement, votre r&eacute;seau interne sera param&eacute;tr&eacute; de
telle fa&ccedil;on &agrave; utiliser un ou plusieurs blocs r&eacute;seau
parmi les blocs suivants :
<pre>
        10.0.0.0/8       (10.0.0.0 - 10.255.255.255)
        172.16.0.0/12    (172.16.0.0 - 172.31.255.255)
        192.168.0.0/16   (192.168.0.0 - 192.168.255.255)
</pre>

<p>
Un syst&egrave;me OpenBSD mettant en oeuvre la NAT aura au moins deux
cartes r&eacute;seau dont une est connect&eacute;e &agrave; Internet;
l'autre &eacute;tant connect&eacute;e &agrave; votre r&eacute;seau
interne. La NAT traduit les requ&ecirc;tes en provenance de votre
r&eacute;seau interne de telle fa&ccedil;on &agrave; les faire
appara&icirc;tre comme si elles &eacute;taient
g&eacute;n&eacute;r&eacute;es par votre syst&egrave;me de NAT OpenBSD.

<a name="works"></a>
<h2>Comment Fonctionne la NAT</h2>
<p>
Lorsqu'un client du r&eacute;seau interne entre en communication avec
une machine sur Internet, il envoie des paquets IP &agrave; destination
de cette machine. Ces paquets contiennent toutes les informations sur
leur &eacute;metteur et leur destinaitaire n&eacute;cessaires &agrave;
leur bon acheminement. La NAT prend en compte les informations suivantes
:
<ul>
<li>L'adresse IP source (192.168.1.35 par exemple)
<li>Port TCP ou UDP source (2132 par exemple)
</ul>

<p>
Lorsque les paquets passent &agrave; travers la passerelle NAT, ils
seront modifi&eacute;s de telle fa&ccedil;on &agrave; ce qu'ils semblent
provenir de la passerelle NAT. Cette passerelle enregistrera les
modifications effectu&eacute;es dans sa table d'&eacute;tats afin de a)
inverser les modifications pour les paquets de retour et b) s'assurer
que les paquets de retour sont autoris&eacute;s &agrave; travers le pare-
feu et ne sont pas bloqu&eacute;s. Par exemple, les modifications
suivantes peuvent &ecirc;tre effectu&eacute;es :
<ul>
<li>Adresse IP source : remplac&eacute;e par l'adresse externe de la
    passerelle (24.5.0.5 par exemple)
<li>Port source : remplac&eacute; par un port non utilis&eacute; sur la
    passerelle et choisi de mani&egrave;re al&eacute;atoire (53136 par
    exemple)
</ul>

<p>
Aucune des deux extr&ecirc;mit&eacute;s de la communication ne se rend
compte de ces modifications. Pour la machine interne, le syst&egrave;me
qui effectue la NAT est simplement une passerelle Internet. Pour le
h&ocirc;te Internet, les paquets semblent provenir directement du
syst&egrave;me de NAT; il ne sait m&ecirc;me pas que la machine interne
existe.

<p>
Lorsque le h&ocirc;te Internet r&eacute;pond aux paquets de la machine
interne, ils seront envoy&eacute;s &agrave; l'adresse IP externe de la
passerelle NAT (24.5.0.5) sur le port de traduction (53136). D&egrave;s
r&eacute;ception de ces paquets, la passerelle NAT cherchera dans sa
table d'&eacute;tats si ces paquets de retour correspondent &agrave; une
connexion d&eacute;j&agrave; &eacute;tablie. Une correspondance unique
sera trouv&eacute;e, bas&eacute;e sur la combinaison IP/port qui permet
&agrave; PF de voir que les paquets appartiennent &agrave; une connexion
initi&eacute;e par la machine interne 192.168.1.35. PF effectuera les
modifications inverses &agrave; celles effectu&eacute;es sur les paquets
sortants puis enverra ces paquets &agrave; la machine interne.

<p>
La traduction de paquets ICMP s'effectue de mani&egrave;re similaire
mais sans la modification du port source.

<a name="filter"></a>
<h2>NAT et Filtrage de Paquets</h2>
<p>
<font color="#ff0000">REMARQUE :</font>
Les paquets traduits doivent, comme n'importe quel autre paquet,
&ecirc;tre &eacute;valu&eacute;s par le m&eacute;canisme pare-feu
suivant les r&egrave;gles de filtrage d&eacute;finies.
La <i>seule</i> exception &agrave; cette r&egrave;gle est lorsque le mot-
cl&eacute; <tt>pass</tt> est utilis&eacute; dans la r&egrave;gle de
<tt>nat</tt>. Ce mot-cl&eacute; permettra aux paquets traduits
d'&ecirc;tre autoris&eacute;s imm&eacute;diatement par le pare- feu.

<p>
Il est &agrave; noter que la traduction a lieu <i>avant</i> le filtrage.
Ce qui veut dire que le pare-feu verra le paquet <i>traduit</i> avec
l'adresse IP et le port traduits tel que c'est expliqu&eacute; dans
<a href="#works">Comment Fonctionne la NAT</a>.

<!-- legacy anchor; can eventually be removed -->
<a name="enable"></a>
<a name="ipfwd"></a>
<h2>Routage IP</h2>
<p>
Vu que la NAT est utilis&eacute;e la plupart du temps sur des routeurs
et des passerelles r&eacute;seau, il sera probablement n&eacute;cessaire
d'activer le routage IP pour permettre aux paquets de traverser les
interfaces r&eacute;seau du syst&egrave;me OpenBSD. Le routage IP peut
&ecirc;tre activ&eacute; &agrave; l'aide du m&eacute;canisme
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=3&amp;manpath=OpenBSD+3.5"
>sysctl(3)</a> :
<blockquote>
<tt>
# sysctl net.inet.ip.forwarding=1<br>
# sysctl net.inet6.ip6.forwarding=1 <i>(si Ipv6 est utilis&eacute;)</i>
</tt>
</blockquote>

<p>
Pour rendre cette modification permanente, les lignes suivantes doivent
&ecirc;tre ajout&eacute;es au fichier
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl.conf&amp;sektion=5&amp;manpath=OpenBSD+3.5"><tt>/etc/sysctl.conf</tt></a> :
<blockquote>
<tt>
net.inet.ip.forwarding=1<br>
net.inet6.ip6.forwarding=1
</tt>
</blockquote>

<p>
Ces lignes sont d&eacute;j&agrave; pr&eacute;sentes dans l'installation
par d&eacute;faut mais sont comment&eacute;es (pr&eacute;fix&eacute;es
avec un caract&egrave;re <tt>#</tt>). Supprimez le <tt>#</tt> et
sauvegardez le fichier. Le routage IP sera d&eacute;sormais
activ&eacute; automatiquement &agrave; chaque red&eacute;marrage.

<a name="config"></a>
<h2>Configurer la NAT</h2>
Le format g&eacute;n&eacute;ral des r&egrave;gles de NAT dans
<tt>pf.conf</tt> est le suivant :
<blockquote>
<tt>
nat [pass] on <i>interface</i> [<i>af</i>] from <i>src_addr</i> 
[port <i>src_port</i>] to \<br>
&nbsp;&nbsp;&nbsp;<i>dst_addr</i> [port <i>dst_port</i>] -&gt; 
<i>ext_addr</i> [<i>pool_type</i>] [static-port]
</tt>
</blockquote>

<dl>
<dt><tt>nat</tt>
<dd>Le mot-cl&eacute; qui permet de cr&eacute;er une r&egrave;gle de
    NAT.

<dt><tt>pass</tt>
<dd>Permet aux paquets traduits de contourner compl&egrave;tement les
    r&egrave;gles de filtrage et d'&ecirc;tre autoris&eacute;s
    syst&egrave;matiquement par le pare-feu.

<dt><tt><i>interface</i></tt>
<dd>Le nom de l'interface r&eacute;seau sur laquelle les paquets seront
    traduits.

<dt><tt><i>af</i></tt>
<dd>La famille d'adresses : <tt>inet</tt> pour IPv4 ou <tt>inet6</tt>
    pour IPv6. PF est normalement capable de d&eacute;terminer ce
    param&egrave;tre &agrave; partir des adresses source/destination.

<dt><tt><i>src_addr</i></tt>
<dd>L'adresse source (interne) des paquets qui seront traduits.
    L'adresse source peut &ecirc;tre sp&eacute;cifi&eacute;e de
    plusieurs mani&egrave;res :
<ul>
<li>Une seule adresse IPv4 ou IPv6.
<li>Un bloc r&eacute;seau en notation 
<a href="http://public.pacbell.net/dedicated/cidr.html">CIDR</a>.
<li>Un nom de domaine au format FQDN qui sera r&eacute;solu via DNS
    lorsque les r&egrave;gles seront charg&eacute;es. Ce nom de domaine
    sera remplac&eacute; par toutes les adresses IP r&eacute;sultant de
    la r&eacute;solution.
<li>Un nom d'interface r&eacute;seau. Ce nom sera remplac&eacute; par
    toutes les adresses IP attribu&eacute;es &agrave; cette interface au
    moment du chargement des r&egrave;gles.
<li>Un nom d'interface r&eacute;seau suivi d'un <tt>/<i>netmask</i></tt>
    (<tt>/24</tt> par exemple). Chaque adresse IP attribu&eacute;e
    &agrave; l'interface sera combin&eacute;e avec le netmask pour
    former un bloc r&eacute;seau en notation CIDR. Le r&eacute;sultat
    remplacera la sp&eacute;cification initiale dans la r&egrave;gle.
<li>Le nom d'une interface r&eacute;seau suivie par un modificateur
    parmi les modificateurs suivants :
  <ul>
  <li><tt>:network</tt> - remplace le bloc r&eacute;seau en notation
      CIDR (192.168.0.0/24 par exemple)
  <li><tt>:broadcast</tt> - remplace l'adresse de broadcast
      r&eacute;seau (192.168.0.255 par exemple)
  <li><tt>:peer</tt> - remplace l'adresse IP du pair dans une
      communication point-&agrave;-point
  </ul>
  <dl>
  <dd>De plus, le modificateur <tt>:0</tt> peut &ecirc;tre ajout&eacute;
      au nom de l'interface ou &agrave; l'un des modificateurs
      pr&eacute;cit&eacute;s pour indiquer &agrave; PF que les alias IP
      ne doivent pas &ecirc;tre inclus dans la substitution. Ces
      modificateurs peuvent aussi &ecirc;tre utilis&eacute;s lorsque le
      nom de l'interface est entre parenth&egrave;ses. Exemple :
      <tt>fxp0:network:0</tt>
  </dl>

<li>Une <a href="tables.html">table</a>.
<li>N'importe quelle sp&eacute;cification pr&eacute;cit&eacute;e
    pr&eacute;fix&eacute;e du modificateur <tt>!</tt> ("not") pour
    indiquer la n&eacute;gation.
<li>Un ensemble d'adresses en utilisant une
<a href="macros.html#lists">liste</a>
<li>Le mot-cl&eacute; <tt>any</tt> signifiant toutes les adresses
</ul>

<dt><tt><i>src_port</i></tt>
<dd>Le port source dans l'en-t&ecirc;te du paquet (couche 4). Les ports
    peuvent sp&eacute;cifi&eacute;s de la mani&egrave;re suivante :
<ul>
<li>Un nombre entre 1 et 65535
<li>Un nom de service valide figurant dans le fichier
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=services&amp;sektion=5&amp;manpath=OpenBSD+3.5"
><tt>/etc/services</tt></a>
<li>Un ensemble de ports sous forme de <a href="macros.html#lists">liste</a>
<li>Un intervalle :
        <ul>
        <li><tt>!=</tt> (diff&eacute;rent de)
        <li><tt>&lt;</tt> (inf&eacute;rieur &agrave;)
        <li><tt>&gt;</tt> (sup&eacute;rieur &agrave;)
        <li><tt>&lt;=</tt> (inf&eacute;rieur ou &eacute;gal &agrave;)
        <li><tt>&gt;=</tt> (sup&eacute;rieur ou &eacute;gal &agrave;)
        <li><tt>&gt;&lt;</tt> (intervalle)
        <li><tt>&lt;&gt;</tt> (intervalle inverse)
        <dl>
        <dd>Les deux derniers op&eacute;rateurs sont des
            op&eacute;rateurs binaires (ils prennent deux arguments) et
            n'incluent pas les arguments dans l'intervalle.
        </dl>
        <li><tt>:</tt> (intervalle avec inclusion)
        <dl>
        <dd>L'op&eacute;rateur d'intervalle avec inclusion est aussi un
            op&eacute;rateur binaire mais contrairement aux deux
            op&eacute;rateurs pr&eacute;c&eacute;dents, il inclut les
            arguments dans l'intervalle.
        </dl>
        </ul>
</ul>
L'option <tt>port</tt> n'est pas habituellement utilis&eacute;e dans les
r&egrave;gles <tt>nat</tt> vu que le but est souvent de traduire tout le
trafic peu importe le(s) port(s) utilis&eacute;(s).

<dt><tt><i>dst_addr</i></tt>
<dd>L'adresse destination des paquets &agrave; traduire. L'adresse de
    destination est sp&eacute;cifi&eacute;e de la m&ecirc;me
    mani&egrave;re que l'adresse source.

<dt><tt><i>dst_port</i></tt>
<dd>Le port destination dans l'en-t&ecirc;te du paquet (couche 4). Ce
    port est sp&eacute;cifi&eacute; de la m&ecirc;me mani&egrave;re que
    le port source.

<dt><tt><i>ext_addr</i></tt>
<dd>L'adresse externe (de traduction) sur la passerelle NAT. C'est
    l'adresse qui figurera dans les paquets une fois ceux-ci traduits.
    L'adresse externe peut &ecirc;tre sp&eacute;cifi&eacute;e comme suit :
<ul>
<li>Une seule adresse IPv4 ou IPv6.
<li>Un bloc r&eacute;seau en notation 
<a href="http://public.pacbell.net/dedicated/cidr.html">CIDR</a>.
<li>Un nom de domaine au format FQDN qui sera r&eacute;solu via DNS
    lorsque les r&egrave;gles seront charg&eacute;es. Ce nom de domaine
    sera remplac&eacute; par toutes les adresses IP r&eacute;sultant de
    la r&eacute;solution.
<li>Le nom de l'interface r&eacute;seau externe. Ce nom sera
    remplac&eacute; par toutes les adresses IP attribu&eacute;es
    &agrave; cette interface au moment du chargement des r&egrave;gles.
<li>Le nom de l'interface r&eacute;seau externe entour&eacute; de
    parenth&egrave;ses <tt>( )</tt>. Ceci permet &agrave; PF de mettre
    &agrave; jour la r&egrave;gle si l'adresse ou les adresses IP de
    cette interface change(nt). C'est tr&egrave;s utile lorsque
    l'interface obtient son adresse IP via DHCP ou un syst&egrave;me dial-
    up. Dans ce cas, les r&egrave;gles n'ont pas &agrave; &ecirc;tre
    recharg&eacute;es chaque fois que l'adresse change.
<li>Le nom d'une interface r&eacute;seau suivie par un modificateur
    parmi les modificateurs suivants :
  <ul>
  <li><tt>:network</tt> - remplace le bloc r&eacute;seau en notation
      CIDR (192.168.0.0/24 par exemple)
  <li><tt>:peer</tt> - remplace l'adresse IP du pair dans une
      communication point-&agrave;-point
  </ul>
  <dl>
  <dd>
  <dd>De plus, le modificateur <tt>:0</tt> peut &ecirc;tre ajout&eacute;
      au nom de l'interface ou &agrave; l'un des modificateurs
      pr&eacute;cit&eacute;s pour indiquer &agrave; PF que les alias IP
      ne doivent pas &ecirc;tre inclus dans la substitution Ces
      modificateurs peuvent aussi &ecirc;tre utilis&eacute;s lorsque le
      nom de l'interface est entre parenth&egrave;ses. Exemple :
      <tt>fxp0:network:0</tt>
  </dl>
<li>Un ensemble d'adresses en utilisant une
<a href="macros.html#lists">liste</a>
</ul>

<dt><tt><i>pool_type</i></tt>
<dd>Sp&eacute;cifie le type de <a href="pools.html">pool d'adresses</a>
    &agrave; utiliser pour la traduction.

<dt><tt>static-port</tt>
<dd>Si cette option est utilis&eacute;e, PF ne traduira pas le port
    source des paquets TCP et UDP.

</dl>

<p>
Ceci nous donne une ligne de la forme basique suivante :
<blockquote>
<tt>
nat on tl0 from 192.168.1.0/24 to any -&gt; 24.5.0.5
</tt>
</blockquote>

<p>
Cette r&egrave;gle permet d'effectuer la NAT sur l'interface
<tt>tl0</tt> sur tout paquet provenant de 192.168.1.0/24 et remplace
l'adresse IP source par 24.5.0.5.

<p>
Bien que cette r&egrave;gle soit correcte, ce n'est pas la forme
recommand&eacute;e. La maintenance peut s'av&eacute;rer difficile vu que
toute modification des adresses r&eacute;seau externe ou interne
n&eacute;cessitera une modification de la r&egrave;gle. La forme
suivante est plus facile &agrave; maintenir (<tt>tl0</tt> est
l'interface externe, <tt>dc0</tt> est l'interface interne) :
<blockquote>
<tt>
nat on tl0 from dc0:network to any -&gt; tl0
</tt>
</blockquote>

<p>
L'avantage de cette forme doit &ecirc;tre clair maintenant : vous pouvez
changer les adresses IP des deux interfaces sans changer la
r&egrave;gle.

<p>
Lorsque vous sp&eacute;cifiez un nom d'interface comme adresse de
traduction tel que c'est fait dans la r&egrave;gle ci-dessus, l'adresse
IP est d&eacute;termin&eacute;e lors du <i>chargement</i> de pf.conf.
Elle n'est pas d&eacute;termin&eacute;e &agrave; la vol&eacute;e. Si
vous utilisez DHCP pour configurer votre interface externe, ceci peut
poser probl&egrave;me. Par exemple, si l'adresse qui vous est
attribu&eacute;e change, le syst&egrave;me de NAT continuera &agrave;
traduire les paquets sortants en utilisant l'ancienne adresse IP. Les
connexions sortantes ne fonctionneront donc plus. Pour &eacute;viter ce
probl&egrave;me, vous pouvez dire &agrave; PF de mettre &agrave; jour
automatiquement l'adresse de traduction en mettant des
parenth&egrave;ses autour du nom de l'interface :
<blockquote>
<tt>
nat on tl0 from dc0:network to any -&gt; (tl0)
</tt>
</blockquote>

<p>
Cette m&eacute;thode fonctionne aussi bien pour la traduction d'adresses
IPv6 que pour la traduction d'adresses IPv4.

<a name="binat"></a>
<h2>Mise en Correspondance Bidirectionnelle (mise en correspondance
    1:1)</h2>
Une mise en correspondance bidirectionnelle (traduction 1 &agrave; 1)
peut &ecirc;tre &eacute;tablie en utilisant une r&egrave;gle
<tt>binat</tt>. Une r&egrave;gle <tt>binat</tt> &eacute;tablit une
correspondance 1 &agrave; 1 entre une adresse IP interne et une adresse
externe. Ceci peut &ecirc;tre pratique par exemple pour permettre
&agrave; un serveur web interne d'avoir sa propre adresse de traduction
externe. Les connexions en provenance d'Internet &agrave; destination de
cette adresse externe seront achemin&eacute;es vers l'adresse interne du
serveur web. Quant aux requ&ecirc;tes &eacute;manant du serveur web
(telles que les requ&ecirc;tes DNS), elles seront traduites de telle
fa&ccedil;on &agrave; remplacer l'adresse interne par l'adresse externe
de traduction attribu&eacute;e au serveur web. Contrairement aux
r&egrave;gles <tt>nat</tt>, les r&egrave;gles <tt>binat</tt> ne
modifient jamais les ports TCP.

<p>
Exemple :
<blockquote>
<tt>
web_serv_int = "192.168.1.100"<br>
web_serv_ext = "24.5.0.6"<br>
<br>
binat on tl0 from $web_serv_int to any -&gt; $web_serv_ext<br>
</tt>
</blockquote>

<a name="except"></a>
<h2>Exceptions aux R&egrave;gles de Traduction</h2>
Des exceptions aux r&egrave;gles de traduction peuvent &ecirc;tre faites
en utilisant le mot-cl&eacute; <tt>no</tt>. Par exemple, si la
r&egrave;gle de NAT pr&eacute;c&eacute;dente &eacute;tait
modifi&eacute;e de la mani&egrave;re suivante :
<blockquote>
<tt>
no nat on tl0 from 192.168.1.10 to any<br>
nat on tl0 from 192.168.1.0/24 to any -&gt; 24.2.74.79
</tt>
</blockquote>

<p>
Alors tous les paquets du r&eacute;seau 192.168.1.0/24 seront traduits
avec l'adresse externe 24.2.74.79 except&eacute; pour la machine
192.168.1.10.

<p>
Il est &agrave; noter que la premi&egrave;re r&egrave;gle &agrave;
laquelle un paquet correspond est appliqu&eacute;e et aucune
&eacute;valuation suppl&eacute;mentaire n'est effectu&eacute;e. S'il y a
une r&egrave;gle <tt>no</tt>, alors le paquet n'est pas traduit. Le mot-
cl&eacute; <tt>no</tt> peut &ecirc;tre utilis&eacute; avec les
r&egrave;gles <tt>binat</tt> et <a href="rdr.html"><tt>rdr</tt></a>.

<a name="status"></a>
<h2>V&eacute;rification de l'&eacute;tat de la NAT</h2>
Pour voir les traductions actives, il faut utiliser
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.5">pfctl(8)</a>
avec l'option <tt>-s state</tt>. Cette option affichera une liste de
toutes les sessions NAT en cours :

<pre>
   # pfctl -s state
   fxp0 TCP 192.168.1.35:2132 -&gt; 24.5.0.5:53136 -&gt; 65.42.33.245:22 TIME_WAIT:TIME_WAIT
   fxp0 UDP 192.168.1.35:2491 -&gt; 24.5.0.5:60527 -&gt; 24.2.68.33:53   MULTIPLE:SINGLE
</pre>

<p>
Explications (premi&egrave;re ligne uniquement) :

<dl>
<dt>fxp0
<dd>Indique l'interface &agrave; laquelle est rattach&eacute;e la session. Le mot-cl&eacute;
<tt>self</tt> appara&icirc;tra si la session est de type
<a href="options.html#state-policy"><tt>floating</tt></a>.
</dl>

<dl>
<dt>TCP
<dd>Le protocole utilis&eacute; par la connexion.
</dl>

<dl>
<dt>192.168.1.35:2132
<dd>L'adresse IP (192.168.1.35) de la machine sur le r&eacute;seau
    interne. Le port source (2132) est affich&eacute; apr&egrave;s
    l'adresse. C'est aussi l'adresse qui sera remplac&eacute;e au niveau
    de l'en-t&ecirc;te IP.
</dl>

<dl>
<dt>24.5.0.5:53136
<dd>L'adresse IP (24.5.0.5) et le port (53136) sur la passerelle
utilis&eacute;s pour la traduction.
</dl>

<dl>
<dt>65.42.33.245:22
<dd>L'adresse IP (65.42.33.245) et le port (22) auxquels la machine
interne est connect&eacute;e.
</dl>

<dl>

<dt>TIME_WAIT:TIME_WAIT
<dd>Indique l'&eacute;tat de la connexion TCP, vu par PF.
</dl>

<p>
[<a href="filter.html">Pr&eacute;c&eacute;dent : Filtrage de Paquets</a>]
[<a href="index.html">Index</a>]
[<a href="rdr.html">Suivant : Redirection du Trafic</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[back]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: nat.html,v 1.16 ]<br>
$Translation: nat.html,v 1.3 2004/10/06 17:17:44 saad Exp $<br>
$OpenBSD: nat.html,v 1.3 2004/10/07 10:24:20 jufi Exp $
</small>

</body>
</html> 
