<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF : Performance</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq,pf">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 2002-2003 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../../images/smalltitle.gif">
<p>
[<a href="../logging.html">Pr&eacute;c&eacute;dent : Journal des
Ev&eacute;nements</a>]
[<a href="index.html">Index</a>]
[<a href="../ftp.html">Suivant : Probl&egrave;mes avec FTP</a>]

<p>
<h1><font color="#e00000">PF : Performance</font></h1>
<hr>

<h3>
"Combien de bande passante PF peut-il g&eacute;rer ?"<br>
"Quelle puissance machine est suffisante pour g&eacute;rer mon
acc&egrave;s Internet ?" "How much computer do I need to handle my
Internet connection?" </h3>

<p>
Il n'y a pas de r&eacute;ponse facile &agrave; ces questions. Pour
certaines applications, un 486/66 avec une paire de bonnes cartes
r&eacute;seau ISA pourrait filtrer et faire de la NAT &agrave; quelques
5Mbps, mais d'autres applications une machine beaucoup plus puissante
avec des cartes r&eacute;seau PCI plus efficaces pourrait &ecirc;tre
insuffisante. La vraie question n'est pas le nombre de bits par seconde
mais plut&ocirc;t le nombre de paquets par seconde et la
complexit&eacute; des jeux de r&egrave;gles.

<p>
Les performance de PF sont d&eacute;termin&eacute;es par plusieurs
variables :
<ul>
<li>Nombre de paquets par seconde. Pratiquement le m&ecirc;me traitement
    doit &ecirc;tre effectu&eacute; sur une paquet avec une charge utile
    de 1400 octets que sur un paquet avec une charge utile d'un octet.
    Le nombre de paquets par seconde d&eacute;termine le nombre de fois
    que la table d'&eacute;tat et, au cas o&ugrave; il n'y a pas de
    correspondance, les r&egrave;gles de filtrage doivent &ecirc;tre
    &eacute;valu&eacute;es chaque seconde, d&eacute;terminant ainsi
    &agrave; quel point on sollicite le syst&egrave;me.

<li>Performance du bus syst&egrave;me. Le bus ISA a une bande passante
    maximale de 8Mbps, et lorsque le processeur y acc&egrave;de, il doit
    diminuer sa vitesse &agrave; la vitesse effective d'un 80286
    cadenc&eacute; &agrave; 8Mhz, peu importe la vitesse r&eacute;elle
    du processeur. Le bus PCI a une bande passante effective beaucoup
    plus grande et a moins d'impact sur le processeur.

<li>Efficacit&eacute; de la carte r&eacute;seau. Certaines cartes
    r&eacute;seau sont plus efficaces que d'autres. Les cartes
    bas&eacute;es sur le Realtek 8139
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rl&amp;sektion=4&amp;manpath=OpenBSD+3.4">rl(4)</a>)
    ont tendance a avoir de faibles performances alors que les cartes
    bas&eacute;es sur l'Intel 21143
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dc&amp;sektion=4&amp;manpath=OpenBSD+3.4">dc(4)</a>)
    ont tendance &agrave; avoir d'excellentes performances. Pour des
    performances maximales, utilisez des cartes Ethernet gigabit
    m&ecirc;me si vous ne vous connectez pas &agrave; des r&eacute;seaux
    gigabit. Ces cartes ont une gestion de la m&eacute;moire tampon
    beaucoup plus avanc&eacute;e que les autres cartes.

<li>Complexit&eacute; et conception de votre jeu de r&egrave;gles. Plus
    le jeu de r&egrave;gles est complexe, plus lent le pare-feu sera.
    Plus vous utiliserez des r&egrave;gles <tt>keep state</tt> et
    <tt>quick</tt> pour filtrer les paquets, meilleures les performances
    seront. Plus le nombre de lignes devant &ecirc;tre
    &eacute;valu&eacute;es pour chaque paquet, plus faibles seront les
    performances.

<li>Mentionnons quand m&ecirc;me deux &eacute;l&eacute;ments : le CPU et
    la RAM. Vu que PF est un processus noyau, il n'utilisera pas
    d'espace de pagination (swap). Donc si vous avez suffisamment de
    RAM, il fonctionne sinon il se met en mode panique &agrave; cause de
    l'&eacute;puisement de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pool&amp;sektion=9&amp;manpath=OpenBSD+3.4">pool(9)</a>
    exhaustion. Des quantit&eacute;s &eacute;normes de RAM ne sont
    gu&egrave;re n&eacute;cessaires. 32MB devraient permettre de
    contenir 30 000 &eacute;tats ce qui un nombre &eacute;norme pour des
    applications SoHo. La plupart des utilisateurs trouveront qu'une
    machine "recycl&eacute;e" est plus que suffisante pour un
    syst&egrave;me PF. Un syst&egrave;me cadend&eacute; &agrave; 300Mhz
    pourra g&eacute;rer un tr&egrave;s grand nombre de paquets
    rapidement, dans la mesure o&ugrave; il a des bonnes cartes
    r&eacute;seau et un bon jeu de r&egrave;gles.
</ul>

<p>
Les utilisateurs demandent souvent des benchmarks PF. Le seul benchmark
qui compte vraiment est la performance de <i>votre</i> syst&egrave;me
dans <i>votre</i> environnement. Un benchmark qui ne r&eacute;plique pas
votre environnement ne vous aidera pas &agrave; planifier correctement
votre syst&egrave;me pare-feu. La meilleure action possible est de
tester PF vous-m&ecirc;me dans les m&ecirc;mes conditions r&eacute;seau
ou du moins dans les conditions les plus proches possibles que votre
pare-feu actuel sur le m&ecirc;me mat&eacute;riel.

<p>
PF est utilis&eacute; dans certaines applications tr&egrave;s
cons&eacute;quentes et &agrave; haut trafic, et les d&eacute;veloppeurs
sont des "power users" de PF. Il y a donc beaucoup de chance pour que PF
fonctionne dans votre environnement avec des performances correctes.

<p>
[<a href="../logging.html">Pr&eacute;c&eacute;dent : Journal des
Ev&eacute;nements</a>]
[<a href="index.html">Index</a>]
[<a href="../ftp.html">Suivant : Probl&egrave;mes avec FTP</a>]

<p>
<hr>
<a href="index.html"><img alt="[back]" border="0" height="24"
src="../../../images/back.gif" width="24"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: perf.html,v 1.10 2003/11/27 ]<br>
$Translation: perf.html,v 1.1 2003/12/18 06:25:28 saad Exp $<br>
$OpenBSD: perf.html,v 1.1 2003/12/24 09:12:36 horacio Exp $
</small>

</body>
</html> 
