<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF : Ensembles d'adresses (&quot:Pools&quot;) et Partage de Charge</title>

<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq,pf">
<meta name="distribution"  content="global">
</head>

<!--
Copyright (c) 2003, 2004 Joel Knight <enabled@myrealbox.com>

Permission to use, copy, modify, and distribute this documentation for
any purpose with or without fee is hereby granted, provided that the
above copyright notice and this permission notice appear in all copies.

THE DOCUMENTATION IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL
WARRANTIES WITH REGARD TO THIS DOCUMENTATION INCLUDING ALL IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE
AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
PERFORMANCE OF THIS DOCUMENTATION
-->

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../../images/smalltitle.gif">
<p>
[<a href="queueing.html">Pr&eacute;c&eacute;dent : Gestion de La Bande Passante</a>]
[<a href="index.html">Index</a>]
[<a href="tagging.html">Suivant : Balisage de Paquets</a>]

<p>
<h1>
<font color="#e00000">Pools d'Adresses et Partage de Charge</font>
</h1>

<hr>

<h3>Table des Mati&egrave;res</h3>
<ul>
<li><a href="#intro">Introduction</a>
<li><a href="#nat">Pools d'Adresses NAT</a>
<li><a href="#incoming">Partage de Charge Des Connexions Entrantes</a>
<li><a href="#outgoing">Partage de Charge Des Connexions Sortantes</a>
        <ul>
        <li><a href="#outexample">Exemple de Base de R&egrave;gles</a>
        </ul>
</ul>

<hr>

<a name="intro"></a>
<h2>Introduction</h2>
Un pool d'adresses, constitu&eacute; de deux adresses ou plus, permet
&agrave; un groupe d'utilisateurs une utilisation partag&eacute;e de ces
adresses. Un tel ensemble peut &ecirc;tre utilis&eacute; comme adresse
de redirection dans les r&egrave;gles
<a href="rdr.html"><tt>rdr</tt></a>, comme adresse de traduction dans
les r&egrave;gles <a href="nat.html"><tt>nat</tt></a>, et comme
adresse destination dans les options
<a href="filter.html">filter</a>.

<p>
Il existe quatre m&eacute;thodes pour utiliser un pool d'adresses :
<ul>
<li><tt>bitmask</tt> - supprime la partie r&eacute;seau d'une adresse IP
    (adresse utilis&eacute;e comme adresse source dans des r&egrave;gles
    <tt>nat</tt> ou adresse destination dans des r&egrave;gles
    <tt>rdr</tt>) et la remplace avec la partie r&eacute;seau de
    l'adresse correspondante du pool d'adresses.

Exemple : si l'adresse du pool est 192.0.2.1/24 et l'adresse &agrave;
modifier est la 10.0.0.50, l'adresse correspondante au niveau du pool
est la 192.0.2.50. Si le pool d'adresses est le bloc 192.0.2.1/25 et
l'adresse &agrave; modifier est la 10.0.0.130, alors l'adresse
correspondante au niveau du pool est la 192.0.2.2.

<li><tt>random</tt> - s&eacute;lectionne al&eacute;atoirement une
    adresse du pool.
<li><tt>source-hash</tt> - utilise un hash de l'adresse source pour
    choisir l'adresse du pool &agrave; utiliser. Cette m&eacute;thode
    permet de guarantir qu'une adresse source donn&eacute;e sera
    toujours associ&eacute;e avec la m&ecirc;me adresse du pool. La
    cl&eacute; avec laquelle est aliment&eacute;e l'algorithme de
    hachage peut &ecirc;tre sp&eacute;cifi&eacute;e en option
    apr&egrave;s le mot-cl&eacute; <tt>source-hash</tt> au format hex
    ou cha&icirc;ne de caract&egrave;res. Par d&eacute;faut,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.5">pfctl(8)</a>
va g&eacute;n&eacute;rer une cl&eacute; al&eacute;atoire &agrave; chaque
fois que la base de r&egrave;gles est charg&eacute;e.
<li><tt>round-robin</tt> - attribue les adresses du pool
    s&eacute;quentiellement. C'est la m&eacute;thode par d&eacute;faut
    et c'est aussi la seule m&eacute;thode autoris&eacute;e lorsque le
    pool d'adresses est sp&eacute;cifi&eacute; en utilisant une
    <a href="tables.html">table</a>.
</ul>

<p>
Dans tous les cas, &agrave; l'exception notable de la m&eacute;thode
<tt>round-robin</tt>, le pool d'adresses doit &ecirc;tre
sp&eacute;cifi&eacute; sous forme d'un bloc r&eacute;seau en notation
<a href="http://public.pacbell.net/dedicated/cidr.html">CIDR</a>
(Classless Inter-Domain Routing). La m&eacute;thode <tt>round-robin</tt>
accepte des adresses individuelles &agrave; partir d'une
<a href="macros.html#lists">liste</a> ou d'une <a href="tables.html">table</a>.

<p>
L'option <tt>sticky-address</tt> peut &ecirc;tre utilis&eacute;e
conjointement avec les types de pool <tt>random</tt> et <tt>round-
robin</tt> afin de s'assure qu'&agrave; une adresse source donn&eacute;e
corresponde toujours la m&ecirc;me adresse de redirection.

<a name="nat"></a>
<h2>Pools d'Adresses NAT</h2>
Un pool d'adresses peut &ecirc;tre utilis&eacute; comme adresse de
traduction dans les r&egrave;gles
<a href="nat.html"><tt>nat</tt></a>. Les adresses source dans chaque
paquet de connexion sont traduites avec une adresse du pool selon la
m&eacute;thode choisie. Ceci peut &ecirc;tre utile dans des situations
o&ugrave; PF doit faire des op&eacute;rations de NAT pour un
r&eacute;seau tr&egrave;s grand. Etant donn&eacute; que le nombre de
connexions traduites par adresse de traduction est limit&eacute;,
l'ajout d'adresses de traduction permettra &agrave; la passerelle NAT
d'&ecirc;tre scalable afin d'assurer le service pour un grand nombre
d'utilisateurs.

<p>
Dans l'exemple suivant, un pool de deux adresses est utilis&eacute; pour
traduire les paquets sortants. Pour chaque connexion sortante, PF fera
une attribution s&eacute;quentielle avec rotation selon la
m&eacute;thode round-robin.
<blockquote>
<tt>
nat on $ext_if inet from any to any -&gt; { 192.0.2.5, 192.0.2.10 }
</tt>
</blockquote>

<p>
Cependant, cette m&eacute;thode a un inconv&eacute;nient. En effet, des
connexions successives &agrave; partir de la m&ecirc;me adresse interne
ne seront pas toujours traduites avec la m&ecirc;me adresse de
traduction. Ceci peut causer des interf&eacute;rences lors, par exemple,
de la navigation sur des sites web qui utilisent les adresses IP comme
&eacute;l&eacute;ments d'identification des utilisateurs. Une approche
alternative consiste &agrave; utiliser la m&eacute;thode <tt>source-
hash</tt>. Ainsi, chaque adresse interne est toujours traduite avec la
m&ecirc;me adresse de traduction. Dans ce cas, le pool d'adresses doit
&ecirc;tre obligatoirement un bloc r&eacute;seau en notation
<a href="http://public.pacbell.net/dedicated/cidr.html">CIDR</a>.
<blockquote>
<tt>
nat on $ext_if inet from any to any -&gt; 192.0.2.4/31 source-hash
</tt>
</blockquote>

<p>
Cette r&egrave;gle de <tt>nat</tt> utilise le pool d'adresses
192..2.4/31 (192.0.2.4 - 192.0.2.5) comme adresse de traduction de
paquets sortants. Chaque adresse interne sera toujours traduite avec la
m&ecirc;me adresse de traduction gr&acirc;ce au mot-cl&eacute;
<tt>source-hash</tt>.

<a name="incoming"></a>
<h2>Partage de Charge Des Connexions
Entrantes</h2>
Des pools d'adresses peuvent aussi &ecirc;tre utilis&eacute;s pour
partager la charge sur les connexions entrantes. Par exemple, des
connexions web entrantes peuvent &ecirc;tre partag&eacute;es entre
serveurs web d'une m&ecirc;me ferme :
<blockquote>
<tt>
web_servers = "{ 10.0.0.10, 10.0.0.11, 10.0.0.13 }"<br>
<br>
rdr on $ext_if proto tcp from any to any port 80 -&gt; $web_servers \<br>
&nbsp;&nbsp;&nbsp;&nbsp;round-robin sticky-address
</tt>
</blockquote>

<p>
Les connexions successives seront redirig&eacute;es vers les serveurs
web selon la m&eacute;thode round-robin : les connexions &agrave; partir
de la m&ecirc;me adresse source seront toujours envoy&eacute;s au
m&ecirc;me serveur web. Cette connexion "collante" ("sticky") existera
aussi longtemps qu'il y aura des &eacute;tats faisant
r&eacute;f&eacute;rence &agrave; cette connexion. Une fois les
&eacute;tats expir&eacute;s, la connexion collante expirera aussi. Les
futures connexions &agrave; partir de ce h&ocirc;te seront
redirig&eacute;s vers le prochain serveur dans le round robin.

<a name="outgoing"></a>
<h2>Partage de Charge Des Connexions Sortantes</h2>
Les pools d'adresses peuvent &ecirc;tre utilis&eacute;s en combinaison
de l'option de filtrage <tt>route-to</tt> pour faire du partage de
charge entre deux ou plusieurs connexions Internet lorsqu'un protocole
de routage multi-lien
(tel que <a href="http://www.rfc-editor.org/rfc/rfc1771.txt">BGP4</a>)
n'est pas disponible. En utilisant <tt>route-to</tt> avec un pool
d'adresses et la m&eacute;thode <tt>round-robin</tt>, les connexions
sortantes peuvent &ecirc;tre distribu&eacute;es entre plusieurs liens.
Address pools can be used in combination with the <tt>route-to</tt> En
utilisant <tt>route-to</tt> avec un pool d'adresses et la m&eacute;thode
<tt>round-robin</tt>, les connexions sortantes peuvent &ecirc;tre
distribu&eacute;es entre plusieurs liens. En utilisant <tt>route-to</tt>
avec un pool d'adresses et la m&eacute;thode <tt>round-robin</tt>, les
connexions sortantes peuvent &ecirc;tre distribu&eacute;es entre
plusieurs liens. En utilisant <tt>route-to</tt> avec un pool d'adresses
et la m&eacute;thode <tt>round-robin</tt>, les connexions sortantes
peuvent &ecirc;tre distribu&eacute;es entre plusieurs liens.

<p>
Pour que le partage de charge fonctionne, il faut aussi conna&icirc;tre
l'adresse IP du routeur adjacent sur chaque connexion Internet. Ces
informations sont donn&eacute;es &agrave; l'option <tt>route-to</tt>
afin de contr&ocirc;ler la destination des paquets sortants.

<p>
L'exemple suivant partage le trafic sortant entre deux connexions
Internet :
<blockquote>
<tt>
lan_net = "192.168.0.0/24"<br>
int_if &nbsp;= "dc0"<br>
ext_if1 = "fxp0"<br>
ext_if2 = "fxp1"<br>
ext_gw1 = "68.146.224.1"<br>
ext_gw2 = "142.59.76.1"<br>
<br>
pass in on $int_if route-to \<br>
&nbsp;&nbsp;&nbsp;{ ($ext_if1 $ext_gw1), ($ext_if2 $ext_gw2) } round-robin \<br>
&nbsp;&nbsp;&nbsp;from $lan_net to any keep state
</tt>
</blockquote>

<p>
L'option <tt>route-to</tt> est utilis&eacute;e pour le trafic entrant
sur l'interface <i>internal</i> afin de sp&eacute;cifier les interfaces
r&eacute;seau sur lesquelles le trafic sortant doit &ecirc;tre
partag&eacute; ainsi que les passerelles respectives de chaque interface
r&eacute;seau. Il est &agrave; noter que l'option <tt>route-to</tt> doit
&ecirc;tre pr&eacute;sente dans chaque r&egrave;gle de filtrage pour
laquelle le trafic doit &ecirc;tre &eacute;quilibr&eacute;. Les paquets
de retour seront achemin&eacute;s vers la m&ecirc;me interface externe
&agrave; partir de laquelle les paquets d'origine ont ressortis (c'est
ce qui est effectu&eacute; par les FAIs). Ces paquets de retour seront
ensuite achemin&eacute;s vers l'interface du r&eacute;seau interne
normalement.

<p>
Pour s'assurer que les paquets avec une adresse source appartenant
&agrave; <tt>$ext_if1</tt> sont toujours achemin&eacute;s vers
<tt>$ext_gw1</tt> (et, de m&ecirc;me, pour <tt>$ext_if2</tt> et
<tt>$ext_gw2</tt>), les deux lignes suivantes doivent &ecirc;tre
incluses dans le jeu de r&egrave;gles :
<blockquote>
<tt>
pass out on $ext_if1 route-to ($ext_if2 $ext_gw2) from $ext_if2 \<br>
&nbsp;&nbsp;&nbsp;to any<br>
pass out on $ext_if2 route-to ($ext_if1 $ext_gw1) from $ext_if1 \<br>
&nbsp;&nbsp;&nbsp;to any 
</tt>
</blockquote>

<p>
Enfin, la NAT peut aussi &ecirc;tre utilis&eacute;e sur chaque interface
de sortie :
<blockquote>
<tt>
nat on $ext_if1 from $lan_net to any -&gt; ($ext_if1)<br>
nat on $ext_if2 from $lan_net to any -&gt; ($ext_if2)
</tt>
</blockquote>

<a name="outexample"></a>
<p>
Voici un exemple complet d'&eacute;quilibrage de charge du trafic
sortant :

<p>
<table border=0 width="650">
<tr><td nowrap bgcolor="#EEEEEE">
<pre>
lan_net = "192.168.0.0/24"
int_if  = "dc0"
ext_if1 = "fxp0"
ext_if2 = "fxp1"
ext_gw1 = "68.146.224.1"
ext_gw2 = "142.59.76.1"

#  nat outgoing connections on each internet interface
nat on $ext_if1 from $lan_net to any -&gt; ($ext_if1)
nat on $ext_if2 from $lan_net to any -&gt; ($ext_if2)

#  default deny
block in  from any to any
block out from any to any

#  pass all outgoing packets on internal interface
pass out on $int_if from any to $lan_net
#  pass in quick any packets destined for the gateway itself
pass in quick on $int_if from $lan_net to $int_if
#  load balance outgoing tcp traffic from internal network. 
pass in on $int_if route-to \
    { ($ext_if1 $ext_gw1), ($ext_if2 $ext_gw2) } round-robin \
    proto tcp from $lan_net to any flags S/SA modulate state
#  load balance outgoing udp and icmp traffic from internal network
pass in on $int_if route-to \
    { ($ext_if1 $ext_gw1), ($ext_if2 $ext_gw2) } round-robin \
    proto { udp, icmp } from $lan_net to any keep state

#  general "pass out" rules for external interfaces
pass out on $ext_if1 proto tcp from any to any flags S/SA modulate state
pass out on $ext_if1 proto { udp, icmp } from any to any keep state
pass out on $ext_if2 proto tcp from any to any flags S/SA modulate state
pass out on $ext_if2 proto { udp, icmp } from any to any keep state

#  route packets from any IPs on $ext_if1 to $ext_gw1 and the same for
#  $ext_if2 and $ext_gw2
pass out on $ext_if1 route-to ($ext_if2 $ext_gw2) from $ext_if2 to any 
pass out on $ext_if2 route-to ($ext_if1 $ext_gw1) from $ext_if1 to any 
</pre>
</td></tr>
</table>

<p>
[<a href="../queueing.html">Pr&eacute;c&eacute;dent : Mise en Queue des
Paquets et Gestion des Priorit&eacute;s</a>]
[<a href="index.html">Index</a>]
[<a href="tagging.html">Suivant : Balisage de Paquets</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[back]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: pools.html,v 1.12 ]<br>
$Translation: pools.html,v 1.5 2004/10/11 09:49:33 saad Exp $<br>
$OpenBSD: pools.html,v 1.5 2004/10/11 10:15:58 jufi Exp $
<small>

</body>
</html> 
