<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF : Redirection de Trafic ("Forwarding"
            de Ports)</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content="document">
<meta name="description"   content="the OpenBSD FAQ page">
<meta name="keywords"      content="openbsd,faq,pf">
<meta name="distribution"  content="global">
</head>

<!--
Copyright (c) 2003, 2004, Nick Holland <nick@openbsd.org>

Permission to use, copy, modify, and distribute this documentation for
any purpose with or without fee is hereby granted, provided that the
above copyright notice and this permission notice appear in all copies.

THE DOCUMENTATION IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL
WARRANTIES WITH REGARD TO THIS DOCUMENTATION INCLUDING ALL IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE
AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
PERFORMANCE OF THIS DOCUMENTATION
-->

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../../images/smalltitle.gif">
<p>
[<a href="../nat.html">Pr&eacute;c&eacute;dent : Traduction d'Adresses
R&eacute;seau</a>]
[<a href="index.html">Index</a>]
[<a href="shortcuts.html">Suivant : Raccourcis pour la Cr&eacute;ation
de Jeux de R&egrave;gles</a>]

<h1><font color="#e00000">PF : Redirection de Trafic ("Forwarding" de
    Ports)</font></h1>

<hr>

<h3>Table des Mati&egrave;res</h3>
<ul>
<li><a href="#intro">Introduction</a>
<li><a href="#filter">Redirection et Filtrage de Paquets</a>
<li><a href="#security">Implications au niveau de la
    S&eacute;curit&eacute;</a>
<li><a href="#reflect">Redirection et R&eacute;flexion</a>
        <ul>
        <li><a href="#splitdns">DNS en "Split-Horizon"</a>
        <li><a href="#sepnet">D&eacute;placer le Serveur Vers un
            R&eacute;seau Local S&eacute;par&eacute;</a>
        <li><a href="#tcpproxy">Mandater les Connexions TCP ("TCP
            Proxying")</a>
        <li><a href="#rdrnat">Combinaison RDR et NAT</a>
        </ul>
</ul>

<hr>

<a name="intro"></a>
<h2>Introduction</h2>
Quand vous utilisez la NAT, les machines sur votre r&eacute;seau peuvent
acc&eacute;der &agrave; la totalit&eacute; des ressources Internet.
Qu'en est-il lorsqu'une de vos machines derri&egrave;re la passerelle
NAT a besoin d'&ecirc;tre acc&eacute;d&eacute;e depuis Internet ? la
redirection est utilis&eacute;e pour r&eacute;soudre ce genre de
probl&egrave;mes. Elle permet au trafic entrant d'&ecirc;tre
achemin&eacute; vers une machine derri&egrave;re la passerelle NAT.

<p>
Prenons un exemple :
<blockquote>
<tt>
rdr on tl0 proto tcp from any to any port 80 -&gt; 192.168.1.20
</tt>
</blockquote>

<p>
La ligne ci-dessus redirige le trafic &agrave; destination du port TCP
80 (serveur web) vers une machine sur le r&eacute;seau d'adresse IP
192.168.1.20. Ainsi, m&ecirc;me si cette machine est derri&egrave;re
votre passerelle, le monde externe peut y avoir acc&egrave;s.

<p>
La partie <tt>from any to any</tt> de la ligne <tt>rdr</tt>
pr&eacute;cit&eacute;e peut &ecirc;tre assez utile. Si vous voulez
restreindre les adresses ou les sous-r&eacute;seaux autoris&eacute;s
&agrave; avoir acc&egrave;s au serveur web sur le port 80, vous pouvez
le faire de la fa&ccedil;on suivante :
<blockquote>
<tt>
rdr on tl0 proto tcp from 27.146.49.0/24 to any port 80 -&gt; \<br>
&nbsp;&nbsp;&nbsp;192.168.1.20
</tt>
</blockquote>

<p>
Ceci aura pour effet de rediriger uniquement le trafic en provenance du
sous-r&eacute;seau sp&eacute;cifi&eacute;. Notez que cela implique la
possibilit&eacute; de rediriger diff&eacute;rentes machines en
entr&eacute;e vers des machines derri&egrave;re la passerelle. Une telle
fonctionnalit&eacute; est utile. Par exemple, vous pouvez autoriser des
utilisateurs sur des sites distants &agrave; acc&egrave;der &agrave;
leur propre machine dans la mesure o&ugrave; vous connaissez leur
adresse IP :
<blockquote>
<tt>
rdr on tl0 proto tcp from 27.146.49.14 to any port 80 -&gt; \<br>
&nbsp;&nbsp;&nbsp;192.168.1.20<br>
rdr on tl0 proto tcp from 16.114.4.89 to any port 80 -&gt; \<br>
&nbsp;&nbsp;&nbsp;192.168.1.22<br>
rdr on tl0 proto tcp from 24.2.74.178 to any port 80 -&gt; \<br>
&nbsp;&nbsp;&nbsp;192.168.1.23
</tt>
</blockquote>

<a name="filter"></a>
<h2>Redirection et Filtrage de Paquets</h2>
<font color="#ff0000">REMARQUE :</font> Les paquets redirig&eacute;s
doivent encore &ecirc;tre autoris&eacute;s par le moteur de filtrage.
Ils seront bloqu&eacute;s ou autoris&eacute;s selon les r&egrave;gles de
filtrage qui ont &eacute;t&eacute; d&eacute;finies. La <i>seule</i>
exception &agrave; cette r&egrave;gle est lorsque le mot-cl&eacute;
<tt>pass</tt> est utilis&eacute; dans la r&egrave;gle <tt>rdr</tt>; dans
ce cas, les paquets redirig&eacute;s seront automatiquement
autoris&eacute;s par le moteur de filtrage.

<p>
Notez aussi que la traduction est effectu&eacute;e <i>avant</i> le
filtrage. Le moteur de filtrage verra le paquet <i>traduit</i>,
&ccedil;.&agrave;.d. apr&egrave;s que son adresse IP destination et/ou
port de destination soient modifi&eacute;s pour correspondre &agrave;
l'adresse/au port de redirection sp&eacute;cifi&eacute;(e) dans la
r&egrave;gle <tt>rdr</tt>. Consid&eacute;rons le cas suivant :
<ul>
<li>192.0.2.1 - h&ocirc;te sur Internet
<li>24.65.1.13 - adresse IP externe du routeur OpenBSD
<li>192.168.1.5 - adresse IP interne du serveur web
</ul>

<p>
R&egrave;gle de redirection :
<blockquote>
<tt>
rdr on tl0 proto tcp from 192.0.2.1 to 24.65.1.13 port 80 \<br>
&nbsp;&nbsp;&nbsp;-&gt; 192.168.1.5 port 8000
</tt>
</blockquote>

<p>
Avant que la r&egrave;gle de redirection ne soit utilis&eacute;e, le
paquet est trait&eacute; :
<ul>
<li>Adresse source : 192.0.2.1
<li>Port source : 4028 (choisi de mani&egrave;re arbitraire par le
    syst&egrave;me d'exploitation)
<li>Adresse de destination : 24.65.1.13
<li>Port de destination : 80
</ul>

<p>
Puis la r&egrave;gle de redirection est &eacute;valu&eacute;e :
<ul>
<li>Adresse source : 192.0.2.1
<li>Port source : 4028
<li>Adresse de destination : 192.168.1.5
<li>Port de destination : 8000
</ul>

<p>
Le moteur de filtrage verra le paquet IP tel qu'il appara&icirc;t
apr&egrave;s la traduction effectu&eacute;e par le m&eacute;canisme de
redirection.

<a name="security"></a>
<h2>Implications au niveau de la S&eacute;curit&eacute;</h2>
La redirection a des implications au niveau de la
s&eacute;curit&eacute;. La cr&eacute;ation d'une ouverture pour
autoriser le trafic &agrave; destination du r&eacute;seau interne
prot&eacute;g&eacute; peut causer la compromission d'une machine sur ce
dernier. Par exemple, si le trafic est redirig&eacute; vers un serveur
web interne et par malheur, une vuln&eacute;rabilit&eacute; est
d&eacute;couverte dans le service web ou dans un script CGI
execut&eacute; par le serveur, alors la machine peut &ecirc;tre
compromise par un intrus provenant d'Internet. Une fois cette
compromission r&eacute;alis&eacute;e, l'intrus peut rebondir &agrave;
partir de cette machine vers le r&eacute;seau interne ce qui est bien
entendu permis par le pare-feu.

<p>
Ces risques peuvent &ecirc;tre minimis&eacute;s en confinant de
mani&egrave;re stricte le syst&egrave;me acc&eacute;d&eacute; depuis
l'ext&eacute;rieur &agrave; un r&eacute;seau s&eacute;par&eacute;. Ce
r&eacute;seau est souvent appel&eacute; zone d&eacute;militaris&eacute;e
(DMZ) ou r&eacute;seau de service priv&eacute; (Private Service Network,
PSN). De cette fa&ccedil;on, si le serveur web est compromis, les effets
peuvent &ecirc;tre limit&eacute;s au r&eacute;seau DMZ/PSN en filtrant
soigneusement le trafic autoris&eacute; entre DMZ/PSN et vos autres
r&eacute;seaux.

<a name="reflect"></a>
<h2>Redirection et R&eacute;flexion</h2>
Souvent, les r&egrave;gles de redirection sont utilis&eacute;es pour
faire suivre des connexions Internet entrantes &agrave; un serveur local
disposant d'une adresse priv&eacute;e sur le r&eacute;seau interne comme
le montre l'exemple suivant :
<blockquote>
<tt>
server = 192.168.1.40<br>
<br>
rdr on $ext_if proto tcp from any to $ext_if port 80 -&gt; $server \<br>
&nbsp;&nbsp;&nbsp;port 80
</tt>
</blockquote>

<p>
Mais lorsque la r&egrave;gle de redirection est test&eacute;e par un
client du LAN, elle ne fonctionne pas. C'est normal car les
r&egrave;gles de redirection ne s'appliquent qu'aux paquets qui passent
&agrave; travers l'interface sp&eacute;cifi&eacute;e dans chacune
d'elles (dans l'exemple pr&eacute;cit&eacute;, c'est l'interface externe
<tt>$ext_if</tt>). Cependant, une connexion &eacute;manant d'un client
interne et &agrave; destination de l'adresse externe du pare-feu
n'implique pas que les paquets vont passer &agrave; travers l'interface
externe du pare-feu. La pile TCP/IP sur le pare- feu compare l'adresse
de destination des paquets entrants avec ses propres adresses et aliases
et d&eacute;tecte les connexions qui lui sont destin&eacute;es lorsque
les paquets constituant celles-ci passent son interface interne. De tels
paquets ne passent pas physiquement &agrave; travers l'interface
externe, et de toute fa&ccedil;on la pile ne simule pas ce passage.
Ainsi, PF ne voit jamais ces paquets sur l'interface externe. Du coup,
la r&egrave;gle de redirection sur l'interface externe n'est jamais
appliqu&eacute;e.

<p>
Que doit-on faire alors ? ajouter une seconde r&egrave;gle de
redirection sur l'interface interne ? non, &ccedil;a ne fonctionnera pas
mieux. Lorsque le client local se connecte &agrave; l'interface externe
du pare-feu, le paquet initial de l'&eacute;change TCP atteint le 
pare-feu via son interface interne. La nouvelle r&egrave;gle de
redirection s'applique et l'adresse de destination est remplac&eacute;e
par celle du serveur interne. Le paquet et alors redirig&eacute; par
l'interface interne du pare-feu vers le serveur interne. Mais l'adresse
source n'a pas &eacute;t&eacute; modifi&eacute;e. Elle contient
l'adresse du client local. Le serveur envoie alors directement les
r&eacute;ponses au client. Le pare-feu ne voit jamais le retour et n'a
aucune chance de traduire correctement les paquets de retour. Le client
re&ccedil;oit une r&eacute;ponse &agrave; partir d'une source
inattendue. Il met alors fin &agrave; cette connexion.

<p>
Cependant, il est souvent souhaitable que les clients sur le LAN se
connectent au m&ecirc;me serveur interne que les clients externes et de
mani&egrave;re aussi transparente. Il existe plusieurs solutions
&agrave; ce probl&egrave;me :

<a name="splitdns"></a>
<h3>DNS en "Split-Horizon"</h3>

<p>
Il est possible de configurer les serveurs DNS pour fournir une
r&eacute;ponse diff&eacute;rente selon la provenance de la requ&ecirc;te
: clients internes ou externes. Ainsi les clients internes recevront
l'adresse interne du serveur en r&eacute;ponse &agrave; leur demande de
r&eacute;solution de nom. Ils pourront alors se connecter directement au
serveur local sans impliquer le pare-feu. Ce dernier sera alors moins
sollicit&eacute;.

<a name="sepnet"></a>
<h3>D&eacute;placer le Serveur Vers un R&eacute;seau Local
    S&eacute;par&eacute;</h3>

<p>
Une autre solution consiste &agrave; ajouter une carte r&eacute;seau au
pare-feu et &agrave; d&eacute;placer le serveur local vers un
r&eacute;seau d&eacute;di&eacute; de type DMZ. Les connexions des
clients locaux seront alors redirig&eacute;es de la m&ecirc;me
mani&egrave;re que les connexions en provenance d'Internet.
L'utilisation de r&eacute;seaux s&eacute;par&eacute;s a plusieurs
avantages. Entre autres, une am&eacute;lioration du niveau de
s&eacute;curit&eacute; en isolant le serveur des machines internes. Si
le serveur (qui, nous le rappelons, est joignable d'Internet) est
compromis, il ne peut se connecter &agrave; des machines internes
directement vu que toutes ces connexions doivent passer &agrave; travers
le pare-feu.

<a name="tcpproxy"></a>
<h3>Mandater les Connexions TCP ("TCP Proxying")</h3>

<p>
Un proxy TCP g&eacute;n&eacute;rique peut &ecirc;tre mis en place sur le
pare-feu. Ce proxy devra &eacute;couter sur le port de redirection ou
accepter les connexions sur l'interface interne et redirig&eacute;es sur
le port sur lequel il &eacute;coute. Lorsqu'un client se connecte sur le
pare-feu, le proxy accepte la connexion, &eacute;tablit une seconde
connexion au serveur interne, et v&eacute;hicule les donn&eacute;es
entre les deux connexions.

<p>
Des proxies simples peuvent &ecirc;tre cr&eacute;es avec 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=inetd&amp;sektion=8&amp;manpath=OpenBSD+3.5"
>inetd(8)</a> et
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=nc&amp;sektion=1&amp;manpath=OpenBSD+3.5"
>nc(1)</a>.
L'entr&eacute;e suivante dans le fichier <tt>/etc/inetd.conf</tt>
cr&eacute;e une socket d'&eacute;coute rattach&eacute;e &agrave;
l'adresse de loopback (127.0.0.1) et le port 5000. Les connexions sont
redirig&eacute;es sur le port 80 du serveur 192.168.1.10.
<blockquote>
<tt>
127.0.0.1:5000 stream tcp nowait nobody /usr/bin/nc nc -w \<br>
&nbsp;&nbsp;&nbsp;20 192.168.1.10 80
</tt>
</blockquote>

<p>
La r&egrave;gle de redirection suivante redirige le port 80 sur
l'interface interne du proxy :
<blockquote>
<tt>
rdr on $int_if proto tcp from $int_net to $ext_if port 80 -&gt; \<br>
&nbsp;&nbsp;&nbsp;127.0.0.1 port 5000
</tt>
</blockquote>

<a name="rdrnat"></a>
<h3>Combinaison RDR et NAT</h3>

<p>
A l'aide d'une r&egrave;gle NAT suppl&eacute;mentaire sur l'interface
interne, la traduction manquante d'adresse source d&eacute;crite plus
haut peut &ecirc;tre r&eacute;alis&eacute;e.
<blockquote>
<tt>
rdr on $int_if proto tcp from $int_net to $ext_if port 80 -&gt; \<br>
&nbsp;&nbsp;&nbsp;$server
<br>
no nat on $int_if proto tcp from $int_if to $int_net<br>
nat on $int_if proto tcp from $int_net to $server port 80 -&gt; \<br>
&nbsp;&nbsp;&nbsp;$int_if
</tt>
</blockquote>

<p>
Ceci aura pour effet d'effectuer une autre traduction d'adresse du
paquet initial envoy&eacute; par le client lorsque celui-ci est
redirig&eacute; &agrave; travers l'interface interne. Cette seconde
op&eacute;ration de traduction remplacera l'adresse source du client par
l'adresse interne du pare-feu. Le serveur interne r&eacute;pondra alors
&agrave; l'adresse interne du pare-feu, qui effectuera les
op&eacute;rations de NAT et de RDR inverses avant de faire suivre le
paquet au client. Cette m&eacute;thode est relativement complexe. Elle
cr&eacute;e deux &eacute;tats s&eacute;par&eacute;s pour chaque
connexion redirig&eacute;e. Il faut prendre des pr&eacute;cautions pour
&eacute;viter que la r&egrave;gle de NAT s'applique au reste du trafic
tel que les connexions en provenance de h&ocirc;tes externes (via
d'autres redirections) ou en provenance du pare-feu lui-m&ecirc;me. Il
est &agrave; noter que la r&egrave;gle <tt>rdr</tt>
pr&eacute;cit&eacute;e fera appara&icirc;tre &agrave; la pile TCP/IP des
paquets en provenance du r&eacute;seau interne et &agrave; destination
de ce dernier.

<p>
Cependant, nous recommandons de privil&eacute;gier plut&ocirc;t les
solutions pr&eacute;c&eacute;demment mentionn&eacute;es.

<p>
[<a href="../nat.html">Pr&eacute;c&eacute;dent : Traduction d'Adresses
R&eacute;seau</a>]
[<a href="index.html">Index</a>]
[<a href="shortcuts.html">Suivant : Raccourcis pour la Cr&eacute;ation
de Jeux de R&egrave;gles</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[back]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: rdr.html,v 1.16 ]<br>
$Translation: rdr.html,v 1.7 2004/05/12 20:21:45 saad Exp $<br>
$OpenBSD: rdr.html,v 1.6 2004/05/12 20:51:36 saad Exp $
</small>

</body>
</html> 
