<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n 2.5 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="document">
<meta name="description" content="página de OpenBSD 2.5">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2001 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" src="../images/logo25.gif" border="0" width="201" height="44"></a>
<hr>

<p>
<a href="../images/openbsd25_cover.gif"><img src="../images/cd25-s.gif" height="90" width="90"></a>
<h2><font color="#0000e0">Versi&oacute;n 2.5 de OpenBSD:</font></h2>
<p>

Lanzada el 19 de mayo de 1.999.<br>
Copyright 1997-1999, Theo de Raadt.
<p>

<a href="orders.html">Para realizar un pedido del CDROM 2.5, pulse
aqu&iacute;.</a>

<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li><strong>Puede adquirir un CDROM mediante nuestro sistema de
pedidos.</strong> Puede intentar que se lo consiga una librer&iacute;a
cercana a Vd., proporcion&aacute;ndoles la siguiente referencia<br>
<font color="#e00000">ISBN 0-9683637-3-3</font>.
<li>Lea la informaci&oacute;n en la <a href="ftp.html">p&aacute;gina de
FTP</a> para ver una lista de r&eacute;plicas del servidor de FTP de
OpenBSD.
<li>Vaya al directorio <font color="#e00000">pub/OpenBSD/2.5/</font> de
cualquiera de estas r&eacute;plicas.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata25.html">p&aacute;gina de
erratas para 2.5</a>, a fin de obtener una lista de errores y sus
soluciones.
</ul>
</font></h3>

<p>
Todos los derechos de autor y cr&eacute;ditos se pueden encontrar en los
fichero de fuentes src.tar.gz y srcsys.tar.gz.

<p>
A continuaci&oacute;n vienen las mismas instrucciones que aparecen en el
folleto que acompa&ntilde;a a los CDROM que se pueden adquirir en
<a href="orders.html">http://www.OpenBSD.org/es/orders.html</a>, y cuya
instalaci&oacute;n es m&aacute;s f&aacute;cil que cualquier otra
alternativa.  Las instrucciones para instalar mediante ftp (u otros
sistemas) son muy parecidas;  las instrucciones del CDROM se mantienen
intactas para que pueda comparar cu&aacute;nto m&aacute;s f&aacute;cil
le habr&iacute;a resultado si hubiera adquirido los CDROM.

<p>
<hr>
Por favor, lea los siguientes ficheros que encontrar&aacute; en los dos
CDROM para obtener una amplia y detallada informaci&oacute;n sobre
c&oacute;mo instalar OpenBSD 2.5 en su m&aacute;quina:

<p>
<dl>
<li>	CD1:2.5/i386/INSTALL.i386
<li>	CD1:2.5/sparc/INSTALL.sparc
<li>	CD1:2.5/powerpc/INSTALL.powerpc
<p>
<li>	CD2:2.5/alpha/INSTALL.alpha
<li>	CD2:2.5/amiga/INSTALL.amiga
<li>	CD2:2.5/mac68k/INSTALL.mac68k
<li>	CD2:2.5/hp300/INSTALL.hp300
<p>
<li>Una versi&oacute;n para pmax se encuentra disponible desde los
servidores de ftp, pero no en los CD.
</dl>
<hr>
<p>
Esta informaci&oacute;n es para una r&aacute;pida instalaci&oacute;n
para aqu&eacute;llos que est&eacute;n familiarizados con el uso de la
nueva orden 'disklabel -E'.  Si al instalar OpenBSD lo encuentra
confuso, lea el fichero INSTALL.* correspondiente a su plataforma.

<p>
<h3><font color="#e00000">i386:</font></h3>
<p>
Juegue con las opciones de su BIOS e intente activar el arranque con un
CD;  int&eacute;ntelo con el CD1.  Si no funcionara, copie la imagen
floppy25.fs que encontrar&aacute; en el directorio 2.5/i386/ en el CD1 a
un disquete, y arranque con &eacute;ste.  Si est&aacute; instalando
OpenBSD junto con otro sistema operativo, seguramente necesite leer las
instrucciones en INSTALL.i386.

<p>
Para crear un disquete de arranque desde MS-DOS, necesitar&aacute; el
programa rawrite.exe, que encontrar&aacute; en el directorio
/2.5/tools/.  Para crear un disquete de arranque desde Unix, use la
l&iacute;nea de &oacute;rdenes
'dd if=&lt;fichero&gt; of=/dev/&lt;dispositivo&gt; bs=32k' (en donde
&lt;fichero&gt; es el camino completo hasta el fichero floppy25.fs, y
&lt;dispositivo&gt; es el dispositivo de disquetes [la disquetera], que
podr&iacute;a ser ``floppy'', o ``fd0'', o ``rfd0c'', o ``rfd0a'', ...).
Utilice disquetes correctamente formateados y en buen estado SIN BLOQUES
ERR&Oacute;NEOS, o no funcionar&aacute;.

<p>
<h3><font color="#e00000">sparc:</font></h3>

<p>
Para arrancar desde el CD1, escriba 'boot cdrom 2.5/sparc/bsd.rd' o 'b
sd(0,6,0)2.5/sparc/bsd.rd', seg&uacute;n cu&aacute;l sea la
versi&oacute;n la versi&oacute;n de su ROM.  De forma alternativa, puede
copiar la imagen del fichero floppy25.fs, que se encuentra en el
directorio 2.5/sparc/ del CD1 a un disquete y arrancar desde &eacute;ste
usando 'boot fd()' o 'boot floppy', dependiendo de la versi&oacute;n de
su ROM.  Existe una tercera alternativa que consiste en copiar los
ficheros kc.fs e inst.fs, que puede encontrar en el directorio
2.5/sparc/ del CD1, a dos disquetes distintos.  A continuaci&oacute;n
escriba 'kc.fs' y arranque como se ha descrito anteriormente.  En cuanto
la disquetera expulse el disquete, escriba 'inst.fs'.  Tendr&aacute; que
responder a una serie de preguntas.  Despu&eacute;s deber&aacute;
reiniciar con el disquete &quot;kc.fs&quot;.  Esta vez, cuando el
disquete sea expulsado, vuelva a escribir 'kc.fs' y responda a otra
serie de preguntas distintas.

<p>
<h3><font color="#e00000">amiga:</font></h3>

<p>
Debe crear las particiones BSD de acuerdo on la secci&oacute;n sobre
preparaci&oacute;n del fichero INSTALL.amiga.  Monte el CD2 como
dispositivo CD0 de AmigaOS.  A continuaci&oacute;n ejecute la siguiente
orden CLI: 'CD0:2.5/amiga/utils/loadbsd CD0:2.5/amiga/bsd.rd'.

<p>
<h3><font color="#e00000">hp300:</font></h3>

<p>
Puede arrancar desde la red siguiendo las instrucciones en
INSTALL.hp300.

<p>
<h3><font color="#e00000">alpha:</font></h3>

<p>
Su alpha debe usar SRM firmware (no ARC).  Si tiene un CDROM puede
intentar 'boot -fi 2.5/alpha/bsd.rd dkaX' (use 'show device' para
averiguar su identificador de dispositivo del CDROM).  De modo
alternativo copie el fichero floppy.fs, que encontrar&aacute; en el
directorio 2.5/alpha/ del CD2, a un disquete y arranque con &eacute;ste
escribiendo 'boot dva0'.  Si esto fallara puede poner bsd.rd en
cualquier otro dispositivo y arrancarlo, o usar el simpleroot provisto.

<p>
<h3><font color="#e00000">mac68k:</font></h3>

<p>
Arranque MacOS como de costumbre, y particione su disco con las
configuraciones A/UX apropiadas.  Extraiga las utilidades Macside a su
disco desde el directorio 2.5/mac68k/utils/ del CD1.  Finalmente
estar&aacute; preparado para configurar el BSD/Mac68k Booter con la
ubicaci&oacute;n de su n&uacute;cleo y para iniciar el sistema.

<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>

<p>
src.tar.gz contiene un archivo con el c&oacute;digo fuente para comenzar
con /usr/src.  Este archivo contiene todo lo que necesita excepto el
c&oacute;digo fuente del n&uacute;cleo, que se encuentra en un archivo
aparte.  Para extraerlo:

<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>

<p>
srcsys.tar.gz contiene un archivo con el c&oacute;digo fuente para
comenzar con /usr/src/sys.  Este archivo contiene todo el c&oacute;digo
fuente del n&uacute;cleo, necesario para recompilar n&uacute;cleos.
Para extraerlo:

<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del CVS.  Usando estos
&aacute;rboles se puede tener una base inicial para usar los servidores
de anoncvs tal y como se describe en
<a href="anoncvs.html">http://www.OpenBSD.org/es/anoncvs.html</a>.  Si
se usan estos ficheros, la actualizaci&oacute;n inicial por CVS es mucho
m&aacute;s r&aacute;pida de lo que ser&iacute;a si tuviera que bajar el
&aacute;rbol completo de fuentes de OpenBSD.

<hr>
<p>
<h3><font color="#e00000">El &aacute;rbol de portes</font></h3>
<p>
Tambi&eacute;n se incluye un &aacute;rbol de portes.  Para extraerlo:

<p>
<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>

<p>
El subdirectorio ports/ est&aacute; sacado del &aacute;rbol de portes de
OpenBSD.  Si todav&iacute;a no sabe qu&eacute; son los portes, lea
<a href="ports.html">http://www.OpenBSD.org/es/ports.html</a> ahora.
Este texto no es un manual sobre c&oacute;mo usar los portes, sino que
m&aacute;s bien es una recolecci&oacute;n de notas de ayuda al usuario
para comenzar a construir el sistema de portes.

<p>
En realidad el sistema de portes de OpenBSD no est&aacute; completo.
Esto se debe a que la completa integraci&oacute;n de los portes en el
entorno de OpenBSD todav&iacute;a es un proyecto nuevo en esta
versi&oacute;n.  Creemos que los portes que se incluyen son estables,
pero es muy importante que entienda que los portes continuar&aacute;n
creciendo en el futuro.

<p>
Como acabamos de decir, los portes experimentar&aacute;n un considerable
crecimiento en el futuro.  El directorio ports/ es una r&eacute;plica de
nuestros &aacute;rbol de portes del CVS (lea la p&aacute;gina de manual
de cvs(1) si no sabe lo que es CVS).  Del mismo modo que con nuestro
&aacute;rbol completo de fuentes, nuestro &aacute;rbol de portes
est&aacute; disponible a trav&eacute;s de cvs an&oacute;nimo.  Para
mantenerlos actualizados debe crear el &aacute;rbol en ports/, en un
medio con permiso de lectura y escritura, con una orden como la
siguiente:

<pre>
# cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd
</pre>

<p>
(L&oacute;gicamente debe substituir el nombre del servidor y el del
directorio local de acuerdo con la ubicaci&oacute;n de un servidor cvs
an&oacute;nimo cercano a Vd. y de su colecci&oacute;n de portes)

<p>
Insistimos en que es importante que lea la p&aacute;gina con las
instrucciones espec&iacute;ficas para esto, ya que &eacute;ste es un
nuevo servicio que todav&iacute;a no ha sido totalmente templado.

<p>
A pesar de la corta vida de los portes, existe bastante
informaci&oacute;n de ayuda.  Si est&aacute; interesado en ver un porte
a&ntilde;adido, o si quiere ayudar, o si simplemente le gustar&iacute;a
saber m&aacute;s al respecto, la lista ports@openbsd.org es un buen
lugar para ello.

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [ OpenBSD: 25.html,v 1.14 ]<br>
$Translation: 25.html,v 1.9 2004/08/21 02:26:36 santana Exp $<br>
$OpenBSD: 25.html,v 1.9 2004/08/21 11:43:46 jufi Exp $
</small>
</body>
</html>
