<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n 2.6 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de OpenBSD 2.6">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2001 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/fishbowl_sm.jpg"><img align="left" hspace="24" src="../images/fishbowl_sm.jpg"></a>
<h2><font color="#0000e0">Versi&oacute;n 2.6 de OpenBSD:</font></h2>
<p>

Lanzada el 1 de diciembre de 1.999.<br>
Copyright 1997-1999, Theo de Raadt.
<p>

<a href="#new">Novedades</a>
<p>

<a href="orders.html">Para realizar un pedido del CDROM 2.6, pulse
aqu&iacute;.</a>

<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li><strong>Puede adquirir un CDROM por medio de nuestro
<a href="orders.html">sistema de pedidos</a>.</strong> Puede intentar
que una librer&iacute;a cercana a Vd. se lo consiga,
proporcion&aacute;ndoles la referencia<br>
<font color="#e00000">ISBN 0-9683637-4-1</font>.
<li>Lea la informaci&oacute;n en la <a href="ftp.html">p&aacute;gina de
FTP</a> para ver una lista de r&eacute;plicas del servidor de FTP de
OpenBSD.
<li>Vaya al directorio <font color="#e00000">pub/OpenBSD/2.6/</font> de
cualquiera de estas r&eacute;plicas.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata26.html">p&aacute;gina de
errata para 2.6</a>, para obtener una lista de errores y sus soluciones.
</ul>
</font></h3>
<br clear="all">
<br>

<p>
Todos los derechos de autor y cr&eacute;ditos se pueden encontrar en los
ficheros de fuentes src.tar.gz y srcsys.tar.gz.

<p>
Tambi&eacute;n se encuentran las instrucciones para la
instalaci&oacute;n del CDROM, las mismas que aparecen en el folleto que
le habr&aacute;n enviado en caso de haber adquirido los CDROM desde
<a href="orders.html">http://www.OpenBSD.org/es/orders.html</a>, en
lugar de tener que pasar por una forma de instalaci&oacute;n alternativa
m&aacute;s complicada.  Las instrucciones para obtener la
distribuci&oacute;n e instalarla por ftp (o cualquier otra forma
similar) son muy parecidas;  las instrucciones del CDROM se mantienen
intactas para que pueda comprobar cu&aacute;nto m&aacute;s f&aacute;cil
le habr&iacute;a resultado si hubiera adquirido los CDROM.

<p>
<hr>
En los dos CDROM encontrar&aacute; los siguientes ficheros con una
amplia y detallada informaci&oacute;n para la instalaci&oacute;n de
OpenBSD 2.6 en su m&aacute;quina:

<p>
<dl>
<li>	CD1:2.6/i386/INSTALL.i386
<li>	CD1:2.6/sparc/INSTALL.sparc

<p>
<li>	CD2:2.6/alpha/INSTALL.alpha
<li>	CD2:2.6/amiga/INSTALL.amiga
<li>	CD2:2.6/mac68k/INSTALL.mac68k
<li>	CD2:2.6/hp300/INSTALL.hp300

<p>
<li>Una versi&oacute;n para pmax se encuentra disponible desde los
servidores de ftp, pero no en los CD.
</dl>
<hr>

<p>
La siguiente informaci&oacute;n sirve para una r&aacute;pida
instalaci&oacute;n a aquellos usuarios que est&eacute;n familiarizados
con OpenBSD y con el uso de la nueva orden 'disklabel -E'.  Si al
instalar OpenBSD lo encuentra confuso, lea el fichero INSTALL.*
correspondiente a su plataforma.

<p>
<h3><font color="#e00000">i386:</font></h3>

<p>
Juegue con las opciones de su BIOS e intente activar el arranque con un
CD; int&eacute;ntelo con el CD1.  Si no funcionara, copie desde el CD1
el fichero floppy26.fs, que encontrar&aacute; en el directorio
2.6/i386/, a un disquete y arranque con &eacute;ste.  Si est&aacute;
instalando OpenBSD junto con otro sistema operativo, seguramente
necesite leer las instrucciones en INSTALL.i386.

<p>
Para crear un disquete de arranque desde MS-DOS, necesitar&aacute; el
programa rawrite.exe, que encontrar&aacute; en el directorio
/2.6/tools/.  Para crear un disquete de arranque desde Unix, use la
l&iacute;nea de &oacute;rdenes
'dd if=&lt;fichero&gt; of=/dev/&lt;dispositivo&gt; bs=32k' (en donde
&lt;fichero&gt; es el camino completo hasta el fichero floppy26.fs, y
&lt;dispositivo&gt; es el dispositivo de disquetes [la disquetera], que
podr&iacute;a ser ``floppy'', o ``fd0'', o ``rfd0c'', o ``rfd0a'', ...).
Utilice disquetes correctamente formateados y en buen estado SIN BLOQUES
ERR&Oacute;NEOS, o no funcionar&aacute;n.

<p>
<h3><font color="#e00000">sparc:</font></h3>

<p>
Para arrancar desde el CD1, escriba 'boot cdrom 2.6/sparc/bsd.rd' o 'b
sd(0,6,0)2.6/sparc/bsd.rd', seg&uacute;n cu&aacute;l sea la
versi&oacute;n de su ROM.  De forma alternativa puede copiar el fichero
floppy26.fs, que encontrar&aacute; en el directorio /2.6/sparc/ del CD1,
a un disquete y arrancar con &eacute;ste usando 'boot fd()' o 'boot
floppy' dependiendo de la versi&oacute;n de su ROM.  Existe una tercera
alternativa que consiste en copiar los ficheros kc.fs e inst.fs, que
encontrar&aacute; en el directorio 2.6/sparc/ del CD1, a dos disquetes
distintos.  A continuaci&oacute;n escriba 'kc.fs' y arranque como se ha
descrito anteriormente.  En cuanto la disquetera expulse el disquete,
introduzca &quot;inst.fs&quot;.  Tendr&aacute; que responder a una serie
de preguntas.  Despu&eacute;s deber&aacute; reiniciar con el disquete
&quot;kc.fs&quot;.  Esta vez, cuando el disquete sea expulsado, vuelva a
escribir &quot;kc.fs&quot; y conteste a una serie diferente de
preguntas.

<p>
<h3><font color="#e00000">amiga:</font></h3>

<p>
Debe crear las particiones BSD de acuerdo con la secci&oacute;n de
preparaci&oacute;n del fichero INSTALL.amiga.  Monte el CD2 como
dispositivo CD0 de AmigaOS.  A continuaci&oacute;n ejecute la siguiente
orden CLI: 'CD0:2.6/amiga/utils/loadbsd CD0:2.6/amiga/bsd.rd'.

<p>
<h3><font color="#e00000">hp300:</font></h3>

<p>
Puede arrancar desde la red siguiendo las instrucciones en
INSTALL.hp300.

<p>
<h3><font color="#e00000">alpha:</font></h3>

<p>
Su alpha debe usar SRM firmware (no ARC).  Si tiene un CDROM puede
intentar 'boot -fi 2.6/alpha/bsd.rd dkaX' (use 'show device' para
averiguar su identificador de dispositivo de CDROM).  De modo
alternativo copie el fichero floppy.fs, que encontrar&aacute; en el
directorio /2.6/alpha/ del CD2, a un disquete y arranque con &eacute;ste
escribiendo 'boot dva0'.  Si esto fallara, puede poner bsd.rd en
alg&uacute;n otro dispositivo y arrancarlo, o usar el simpleroot
provisto.

<p>
<h3><font color="#e00000">mac68k:</font></h3>

<p>
Arranque MacOS como de costumbre y reparticione su disco con las
configuraciones A/UX apropiadas.  Extraiga las utilidades Macside a su
disco desde el directorio 2.6/mac68k/utils/ del CD1.  Finalmente
estar&aacute; preparado para configurar el BSD/Mac68k Booter con la
ubicaci&oacute;n de su n&uacute;cleo y para iniciar el sistema.

<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>

<p>
src.tar.gz contiene un archivo de los fuentes para comenzar con
/usr/src.  Este archivo contiene todo lo que necesita excepto los
fuentes del n&uacute;cleo, que se encuentran en un archivo aparte.  Para
extraerlo:

<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>

<p>
srcsys.tar.gz contiene un archivo de los fuentes para comenzar con
/usr/src/sys.  Este archivo contiene todos los fuentes del n&uacute;cleo
que necesita para recompilarlo.  Para extraerlo:

<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del CVS.  Usando estos
&aacute;rboles es posible tener una base inicial para usar los
servidores de anoncvs tal y como se describe en 
<a href="anoncvs.html">http://www.OpenBSD.org/es/anoncvs.html</a>.  Si
se usan estos ficheros, la actualizaci&oacute;n inicial por CVS es mucho
m&aacute;s r&aacute;pida de lo que ser&iacute;a si tuviera que bajar el
&aacute;rbol completo de fuentes de OpenBSD.

<p>
<hr>
<p>
<h3><font color="#e00000">El &Aacute;rbol de portes</font></h3>

<p>
Tambi&eacute;n se incluye un &aacute;rbol de portes.  Para extraerlo:

<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>

<p>
El subdirectorio ports/ est&aacute; sacado del &aacute;rbol de portes de
OpenBSD.  Si todav&iacute;a no sabe nada sobre los portes, lea la
secci&oacute;n 
<a href="ports.html">http://www.OpenBSD.org/es/ports.html</a>.  Este
texto no es un manual que trate sobre c&oacute;mo usar los portes, sino
que m&aacute;s bien es un recolecci&oacute;n de notas de ayuda al
usuario para comenzar a construir el sistema de portes de OpenBSD.

<p>
En realidad el sistema de portes de OpenBSD no est&aacute; completo.
Esto se debe a que la integraci&oacute;n total de los portes en el
entorno de OpenBSD todav&iacute;a es un proyecto relativamente nuevo en
esta versi&oacute;n.  Creemos que los portes que se incluyen aqu&iacute;
son estables, pero es muy importante entender que los portes
continuar&aacute;n experimentando un crecimiento considerable en el
futuro.

<p>
Como acabamos de decir, los portes crecer&aacute;n mucho en el futuro.
El directorio ports/ es una r&eacute;plica de nuestros portes de CVS.
Del mismo modo que nuestro &aacute;rbol completo de fuentes, nuestro
&aacute;rbol de portes se encuentra disponible por anoncvs.  As&iacute;
pues, para poder mantenerlo actualizado, el &aacute;rbol del directorio
ports/ se debe encontrar disponible en un medio con permisos de
lectura/escritura y actualizarlo con una orden como:

<pre>
# cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd
</pre>

<p>
(L&oacute;gicamente debe substituir los nombres del directorio local y
del servidor de acuerdo con la ubicaci&oacute;n de su colecci&oacute;n
de portes y con un servidor anoncvs que se encuentre cerca de Vd.)

<p>
Insistimos en que es importante que lea la p&aacute;gina con las
instrucciones espec&iacute;ficas sobre esto, ya que &eacute;ste es un
servicio nuevo que no ha sido completamente templado.

<p>
A pesar de la corta vida de los portes existe bastante
informaci&oacute;n de ayuda.  Si est&aacute; interesado en ver un porte
a&ntilde;adido, o si le gustar&iacute;a ayudar, o si simplemente le
gustar&iacute;a saber algo m&aacute;s, la lista ports@openbsd.org es un
buen sitio de informaci&oacute;n.

<hr>
<a name="new"></a>
<p>
<h3><font color="#e00000">Novedades</font></h3>

<p>
Esta es una lista parcial de nuevos sistemas y caracter&iacute;sticas
incluidos en OpenBSD 2.6.  Hay un listado m&aacute;s completo en el
tabl&oacute;n de <a href="plus26.html">cambios</a> entre las versiones
2.5 y 2.6.

<p>
<ul>
<li>La novedad m&aacute;s importante es
<a href="http://www.OpenSSH.com/es/">OpenSSH
(http://www.OpenSSH.com/es/)</a>.  OpenSSH es un grupo de herramientas
libres y reutilizables basadas en una versi&oacute;n anterior de Tatu
Ylonen (1.2.12).  Esa versi&oacute;n fue la &uacute;ltima con una
licencia libre.  OpenSSH ha sido actualizada con las normas actuales y
usa la biblioteca <a href="http://www.openssl.org/">OpenSSL</a>.
OpenSSL es libre excepto para su uso comercial en EE.UU. (debido a la
patente de RSA en EE.UU.).  OpenSSH ha sido desarrollado por OpenBSD y
portado a FreeBSD y Linux.

<li>Un buen truco nos permite distribuir el mismo CD-ROM (a EE.UU. y al
resto del mundo) y mantener sistemas y c&oacute;digo
criptogr&aacute;fico fuerte al mismo tiempo sin violar la patente de RSA
en los EE.UU.

<li>La documentaci&oacute;n ha sufrido cambios muy grandes, sobre todo
las p&aacute;ginas de manual y las Preguntas Frecuentes (FAQ) que hay en
las p&aacute;ginas de Internet.  Las p&aacute;ginas de manual incluyen
ahora ejemplos &uacute;tiles sobre c&oacute;mo suplementar las
explicaciones.  Manteniendo toda la documentaci&oacute;n en un modo
conciso y en dos ubicaciones bien conocidas, esperamos evitar la
proliferaci&oacute;n de documentos &quot;How-To&quot;, que fuerzan a los
usuarios a b&uacute;squedas de informaci&oacute;n sin fin.

<li>Una colecci&oacute;n de portes m&aacute;s completa.  Los portes es
el m&eacute;todo a usar cuando se importen y compilen para el sistema
aplicaciones de libre distribuci&oacute;n desde la red (aplicaciones,
programas de correo, navegadores, etc...).  El usuario s&oacute;lo
necesita cambiar al directorio en cuesti&oacute;n y escribir &quot;make
install&quot; para comenzar un proceso que recolectar&aacute; los
fuentes, les aplicar&aacute; parches para OpenBSD, los compilar&aacute;,
y los instalar&aacute; en el paquete.  La mayor&iacute;a de portes
tambi&eacute;n se encuentran disponibles como paquetes precompilados.

<li>Incluye: 
   <ul>
   <li>XFree86 3.3.5
   <li>gcc 2.95
   <li>Apache 1.3.9 + Mod_ssl 2.4.5 + OpenSSL 0.9.4, y soporte para DSO.
   </ul>

<li>Muchas mejoras en seguridad y fiabilidad (f&iacute;jese en el texto
marcado en color rojo en la lista completa).

<li>Soporte para nuevos dispositivos de hardware, sobre todo en la
arquitectura i386 (para PC).
   <ul>
   <li>Soporte para PCI IDE y DMA.
   <li>USB (bus de serie universal).
   <li>Dispositivos ATAPISCSI, incluidos CD-R y CD-RWs.
   </ul>
</ul>
<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: 26.html,v 1.13 ]<br>
$Translation: 26.html,v 1.20 2004/08/24 14:59:38 santana Exp $<br>
$OpenBSD: 26.html,v 1.18 2004/08/24 16:46:58 jufi Exp $
</small>

</body>
</html>
