<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n 2.7 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de OpenBSD 2.7">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2001 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/spacefish.jpg"><img align="left" hspace="24" src="../images/spacefish.jpg"></a>
<h2><font color="#0000e0">Versi&oacute;n 2.7 de OpenBSD:</font></h2>

<p>
Lanzada el 15 de junio de 2.000.<br>
Copyright 1997-2000, Theo de Raadt.<br>
<font color="#e00000">ISBN 0-9683637-5-X</font>

<p>
<a href="#new">Novedades</a><br>
<a href="#install">C&oacute;mo instalar</a><br>
<a href="#ports">C&oacute;mo usar el &aacute;rbol de portes</a><br>
<a href="orders.html">C&oacute;mo adquirir los CD</a><br>
 
<p>
<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li>Haga un pedido del CDROM desde nuestro <a href="orders.html">sistema
de pedidos</a>.
<li>Lea la informaci&oacute;n en la <a href="ftp.html">p&aacute;gina de
FTP</a> para ver una lista r&eacute;plicas del servidor de FTP de
OpenBSD.
<li>Vaya al directorio <font color="#e00000">pub/OpenBSD/2.7/</font> de
cualquiera de estas r&eacute;plicas.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata27.html">p&aacute;gina de
errata para 2.7</a>, para obtener una lista de errores y sus soluciones.
<li>Lea un <a href="plus27.html">informe detallado sobre cambios</a>
acontecidos entre las versiones 2.6 y 2.7.
</ul>
</font></h3>
<br clear="all">
<br>
<p>

<strong>Nota:</strong> Todos los derechos de autor y cr&eacute;ditos
aplicables se pueden encontrar en los respectivos ficheros de fuentes
src.tar.gz, srcsys.tar.gz, X11.tar.gz, o en los ficheros obtenidos
mediante ports.tar.gz.  Los archivos de la distribuci&oacute;n usados
para crear los paquetes desde ports.tar.gz no est&aacute;n incluidos en
el CDROM debido a la falta de espacio.
<p>

<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Novedades</font></h3>
<p>
&Eacute;sta es una lista parcial de los nuevos sistemas y
funcionalidades incluidos en OpenBSD 2.7.  Para ver una lista m&aacute;s
detallada, vaya al <a href="plus27.html">tabl&oacute;n de cambios</a>
entre 2.6 y 2.7.
<p>

<ul>

<li><a href="http://www.OpenSSH.com/es/">OpenSSH</a> dispone ahora de
soporte para los protocolos SSH1 y SSH2.  El protocolo SSH2 va ganando
adeptos lentamente.  Hasta hace bien poco SSH2 tan s&oacute;lo se
encontraba disponible a trav&eacute;s de programas comerciales.  El lado
positivo con SSH2 es que evita el algoritmo de cifrado RSA y usa DSA en
su lugar, que se puede reutilizar con libertad.  El lado negativo es que
DSA no es tan r&aacute;pido en m&aacute;quinas lentas antiguas.  Pero
como OpenSSH todav&iacute;a tiene soporte para el protocolo SSH1 (si
est&aacute;n instaladas las bibliotecas de RSA), nuestros usuarios
obtienen lo mejor de los dos mundos.
<p>

<li>Permanece el truco que se us&oacute; en 2.6, que nos permite
distribuir en todo el mundo el mismo CD-ROM, que contiene
criptograf&iacute;a fuerte, sin violar la patente de RSA en los EE.UU.
La pr&oacute;xima versi&oacute;n de OpenBSD incluir&aacute; el soporte
para RSA en el sistema por definici&oacute;n, gracias a que la patente
caduca el 21 de septiembre de 2.000.
<p>

<li>Amplios cambios en la documentaci&oacute;n, sobre todo en las
p&aacute;ginas de manual (<em>&quot;man pages&quot;</em>) y las
Preguntas Frecuentes (<em>&quot;FAQ&quot;</em>).  Ahora las
p&aacute;ginas de manual incluyen ejemplos &uacute;tiles como suplemento
a las explicaciones.
<p>

<li>Una colecci&oacute;n de &laquo;portes&raquo; m&aacute;s completa y
mucho mejor verificada.
<p>

<li>M&aacute;s de 500 paquetes precompilados y comprobados.
<p>

<li>El sistema incluye los siguientes componentes principales de otros
distribuidores:
<p>
<ul>
<li>XFree86 3.3.6
<li>gcc 2.95.2
<li>perl 5.6.0 m&aacute;s algunos problemas solucionados.
<li>Apache 1.3.12 + Mod_ssl 2.6.2 + OpenSSL 0.9.5a, DSO
<li>ipf 3.3.14
<li>groff 1.15
<li>sendmail 8.10.1
<li>lynx 2.8.2 con soporte para HTTPS a&ntilde;adido.
<li>sudo 1.6.3
<li>versi&oacute;n reciente de ncurses
<li>&Uacute;ltima versi&oacute;n de IPv6 KAME de mayo de 2.000
<li>KTH Kerberos 1.0 
<li>OpenSSH 2.1
</ul>
<p>

<li>Soporte para controladores de dispositivos mejorado.
<p>
<ul>
<li>Soporte para <em>hardware</em> criptogr&aacute;fico para la
aceleraci&oacute;n de resultados con IPSEC, o sea
<a href=http://www.powercrypt.com>PowerCrypt</a>.
<li>Soporte para todos los nuevos controladores scsi de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ahc&sektion=4">Adaptec</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ncr&sektion=4">NCR</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isp&sektion=4">Qlogic</a>, y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adw&sektion=4">Advansys</a>.
<li>Soporte para muchos dispositivos de ethernet nuevos, incluidos
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sis&sektion=4">SiS900/7016</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sf&sektion=4">Adaptec Starfire</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dc&sektion=4">21143</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ste&sektion=4">Sundance ST201 (DEC DFE-550TX)</a>, etc&eacute;tera.
<li>Soporte para dispositivos de ethernet USB nuevos, incluidos
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=aue&sektion=4">ADMtek USB</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cue&sektion=4">CATC USB</a>, y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kue&sektion=4">Kawasaki USB</a>.
<li>Un buen comienzo con el soporte para
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cardbus&sektion=4">cardbus</a>.
<li>Mejoras significativas en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcmcia&sektion=4">pcmcia</a>.
<li>Soporte para muchas m&aacute;s tarjetas de red sin cable, como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wi&sektion=4">WaveLAN</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=an&sektion=4">Aironet</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ray&sektion=4">Aviator</a>, etc&eacute;tera.
<li>Muchas mejoras en el soporte para
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=usb&sektion=4">USB</a>.
<li>Soporte para Hypersparc en el porte para sparc.
<li>Soporte para la mayor&iacute;a de tarjetas de ethernet gigabit en el
mercado, como
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sk&sektion=4">SysKonnect</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wx&sektion=4">Intel</a>, y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ti&sektion=4">Alteon</a>.
<li>Soporte para la
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gdt&sektion=4">
controladora de RAID Vortes ICP</a>.
<li>Soporte para muchos PC que usen buses PCI m&uacute;ltiples basados
en los <em>chipset</em> Intel 451 &oacute; RCC ServerWorks.
<li>Controladores de audio nuevos, incluidos
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=neo&sektion=4">Neomagic</a>, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cmpci&sektion=4">C-Media CMI8x38</a>, y <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=uaudio&sektion=4">USB audio</a>.
<li>Mejoras en el
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pciide&sektion=4">
subsistema PCI IDE</a>, incluido el nuevo soporte para AMD 756.
</ul>
<p>

<li>Muchas mejoras en seguridad y fiabilidad (busque la letra en rojo en
el <a href="plus27.html">fichero de cambios</a>).
<p>

<li>Muchas otras funcionalidades nuevas, incluidas:
<p>
<ul>
<li>Soporte para &laquo;espacio de intercambio&raquo; (<em>swap</em>)
cifrado.
<li>Mejorada la
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&sektion=8">emulaci&oacute;n de Linux</a>.
<li>Soporte para
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_msdos&sektion=8">sistemas de archivo FAT32</a> grandes.
<li>Mejoras significativas al c&oacute;digo para
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=bridge&sektion=4">network bridging</a>.
<li>Mejorado el soporte de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pthreads&sektion=3">pthreads</a>.
<li>Soporte para redes
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vlan&sektion=4">vlan</a>.
</ul>
<p>

</ul>
<p>

<a name="install"></a>
<hr>
<p>
<h3><font color="#0000e0">C&oacute;mo instalar</font></h3>

<p>
Tambi&eacute;n se encuentran las instrucciones para la
instalaci&oacute;n del CDROM, las mismas que aparecen en el folleto de
la car&aacute;tula que incluye el CDROM, en lugar de tener que pasar por
una forma de instalaci&oacute;n alternativa m&aacute;s complicada.  Las
instrucciones para obtener la distribuci&oacute;n e instalarla mediante
ftp (o cualquier otra forma similar) son muy parecidas;  las
instrucciones del CDROM se dejan intactas para que pueda comprobar
cu&aacute;nto m&aacute;s f&aacute;cil le habr&iacute;a resultado si
hubiera tenido los CDROM.

<p>
<hr>
En los dos CDROM encontrar&aacute; los siguientes ficheros con una
extensiva y detallada informaci&oacute;n sobre la instalaci&oacute;n de
OpenBSD 2.7 en su m&aacute;quina:

<p>
<dl>
<li>	CD1:2.7/i386/INSTALL.i386
<p>
<li>	CD2:2.7/sparc/INSTALL.sparc
<li>	CD2:2.7/mvme68k/INSTALL.mvme68k
<li>	CD2:2.7/amiga/INSTALL.amiga
<li>	CD2:2.7/mac68k/INSTALL.mac68k
<li>	CD2:2.7/hp300/INSTALL.hp300
<p>
<li>Las versiones para pmax y sun3 estar&aacute;n disponibles desde los
servidores de ftp, pero no se han incluido en los CD.
</dl>

<hr>

<p>
La siguiente informaci&oacute;n sirve para una r&aacute;pida
instalaci&oacute;n a aquellos usuarios que est&eacute;n familiarizados
con OpenBSD y con el uso de la nueva orden 'disklabel -E'.  Si al
instalar OpenBSD lo encuentra confuso, lea el fichero INSTALL.*
correspondiente a su plataforma.

<p>
<h3><font color="#e00000">i386:</font></h3>

<p>
Juegue con las opciones de su BIOS e intente activar el arranque desde
el CD;  int&eacute;ntelo con el CD1.  Si no funcionara, copie el fichero
floppy27.fs, que encontrar&aacute; en el directorio 2.7/i386/ del CD1, a
un disquete y arranque con &eacute;ste.  Si va a instalar OpenBSD con
otro sistema operativo, aseg&uacute;rese de leer el documento
INSTALL.i386.

<p>
Para crear un disquete de arranque desde MS-DOS, necesitar&aacute; el
programa rawrite.exe que encontrar&aacute; en el directorio /2.7/tools/.
Para crear un disquete de arranque desde Unix, use la orden 
'dd if=&lt;fichero&gt; of=/dev/&lt;dispositivo&gt; bs=32k' (en donde
&lt;fichero&gt; es el camino completo hasta el fichero floppy27.fs, y
&lt;dispositivo&gt; puede ser &quot;floppy&quot;, o &quot;rfd0c&quot;, o
&quot;rfd0a&quot;, ... dependiendo de su sistema).  Utilice disquetes
correctamente formateados y en buen estado, SIN BLOQUES ERR&Oacute;NEOS,
o de lo contrario no funcionar&aacute;n.

<p>
<h3><font color="#e00000">sparc:</font></h3>

<p>
Para arrancar desde el CD2, ponga 'boot cdrom 2.7/sparc/bsd.rd', o
'bsd(0,6,0)2.7/sparc/bsd.rd', seg&uacute;n la versi&oacute;n de su ROM.
De forma alternativa puede copiar el fichero floppy27.fs que
encontrar&aacute; en el directorio /2.7/sparc/ del CD2 a un disquete, y
arrancar con &eacute;ste usando 'boot floppy' o 'boot fd()' dependiendo
de la versi&oacute;n de su ROM.  Existe una tercera alternativa que
consiste en copiar los ficheros kc.fs e inst.fs, que encontrar&aacute;
en el directorio 2.7/sparc/ del CD2, a dos disquetes distintos.  A
continuaci&oacute;n introduzca &quot;kc.fs&quot; y arranque como se ha
descrito anteriormente.  En cuanto la disquetera expulse el disquete,
introduzca &quot;inst.fs&quot;.  Tendr&aacute; que responder a una tanda
de preguntas.  Despu&eacute;s deber&aacute; reiniciar con el disquete
&quot;kc.fs&quot;.  En esta ocasi&oacute;n, cuando el disquete sea
expulsado, reintroduzca &quot;kc.fs&quot; y conteste a una tanda
diferente de preguntas.

<p>
<h3><font color="#e00000">amiga:</font></h3>

<p>
Debe crear las particiones BSD de acuerdo con la secci&oacute;n de
preparaci&oacute;n del fichero INSTALL.amiga.  Monte el CD2 como
dispositivo CD0 de AmigaOS, y a continuaci&oacute;n ejecute la siguiente
orden CLI: 'CD0:2.7/amiga/utils/loadbsd CD0:2.7/amiga/bsd.rd'.

<p>
<h3><font color="#e00000">hp300:</font></h3>

<p>
Puede arrancar desde la red siguiendo las instrucciones en
INSTALL.hp300.

<p>
<h3><font color="#e00000">mac68k:</font></h3>

<p>
Arranque MacOS como de costumbre y particione su disco con las
configuraciones de A/UX apropiadas.  Extraiga las utilidades Macside
desde el directorio 2.7/mac68k/utils/ del CD1 a su disco.  Ejecute Mkfs
para crear sus sistemas de archivo en las particiones A/UX nuevas.  A
continuaci&oacute;n use Installer de BSD/Mac68k para copiar todos los
grupos de archivos del directorio 2.7/mac68k del CD1 a sus particiones.
Finalmente estar&aacute; preparado para configurar el BSD/Mac68k Booter
con la ubicaci&oacute;n del n&uacute;cleo del sistema e iniciar el
sistema.

<p>
<h3><font color="#e00000">sun3:</font></h3>

<p>
La versi&oacute;n para sun3 se debe obtener a trav&eacute;s de ftp.  Una
vez la tenga, puede configurar un arranque sin disco o crear una cinta
de instalaci&oacute;n, tal y como se describe en el documento
INSTALL.sun3.

<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>

<p>
src.tar.gz contiene un archivo de c&oacute;digo fuente para comenzar con
/usr/src.  Este fichero contiene todo lo que va a necesitar excepto el
c&oacute;digo fuente del n&uacute;cleo, que se encuentra en un archivo
aparte.  Para extraerlo:

<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>

<p>
srcsys.tar.gz contiene un archivo de c&oacute;digo fuente para comenzar
con /usr/src/sys.  Este fichero contiene todo el c&oacute;digo fuente
del n&uacute;cleo que necesitar&aacute; para recompilar n&uacute;cleos.
Para extraerlo:

<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del CVS.  Mediante el uso
de estos &aacute;rboles es posible obtener una base para poder empezar a
usar los servidores de cvs an&oacute;nimo tal y como se describe en 
<a href="anoncvs.html">http://www.OpenBSD.org/es/anoncvs.html</a>.  Es
mucho m&aacute;s r&aacute;pido usar estos ficheros para actualizar el
CVS inicial de lo que ser&iacute;a si obtuviera todo el &aacute;rbol de
CVS de OpenBSD desde cero.
<p>

<a name="ports"></a>
<hr>
<p>
<h3><font color="#0000e0">&Aacute;rbol de portes</font></h3>

<p>
Tambi&eacute;n se incluye un &aacute;rbol de portes.  Para extraerlo:

<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>

<p>
El subdirectorio ports/ ha sido obtenido del &aacute;rbol de portes de
OpenBSD.  Si todav&iacute;a no sabe nada sobre los portes, lea la
secci&oacute;n
<a href="ports.html">http://www.OpenBSD.org/es/ports.html</a> ahora.
Este texto no es un manual sobre c&oacute;mo usar los portes, sino
m&aacute;s bien una colecci&oacute;n de notas con el prop&oacute;sito de
ayudar al usuario a empezar con el sistema de portes de OpenBSD.

<p>
En realidad el sistema de portes de OpenBSD no es completo.  Esto se
debe a que la completa integraci&oacute;n de los portes en el entorno de
OpenBSD es a&uacute;n un proyecto novel en el momento de esta
versi&oacute;n.  Creemos que los portes que aqu&iacute; se proveen son
estables, pero es importante tener en cuenta que que los portes
continuar&aacute;n creciendo considerablemente en el futuro.

<p>
Como acabamos de decir, los portes crecer&aacute;n mucho en el futuro.
El directorio ports/ es una r&eacute;plica de nuestro &aacute;rbol de
portes del CVS (ver la p&aacute;gina de manual de cvs(1) si no sabe lo
que es el CVS).  Del mismo modo que con nuestro &aacute;rbol completo de
fuentes, nuestro &aacute;rbol de portes se encuentra disponible mediante
anoncvs.  As&iacute; pues, para mantenerlo actualizado, debe tener su
&aacute;rbol de portes, ports/, disponible en un medio con permiso de
lectura y escritura, y actualizarlo con una orden como:

<pre>
# cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd
</pre>

<p>
(y por supuesto, debe substituir los nombres del directorio local y del
servidor con el de la ubicaci&oacute;n de su colecci&oacute;n de portes
y con el de un servidor anoncvs cercano respectivamente)

<p>
Insistimos en que es importante leer la p&aacute;gina con las
instrucciones espec&iacute;ficas, ya que &eacute;ste es un servicio
nuevo que todav&iacute;a no ha sido pulido totalmente.

<p>
A pesar de la corta vida de los portes, existe bastante
informaci&oacute;n de ayuda.  Si est&aacute; interesado en ver un porte
a&ntilde;adido, o si le gustar&iacute;a ayudar, o si simplemente quiere
saber m&aacute;s, la lista ports@openbsd.org es una buena fuente de
informaci&oacute;n.

<hr>
<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: 27.html,v 1.20 ]<br>
$Translation: 27.html,v 1.23 2004/08/24 14:59:38 santana Exp $<br>
$OpenBSD: 27.html,v 1.21 2004/08/24 16:46:58 jufi Exp $
</small>

</body>
</html>
