<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n 2.8 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de OpenBSD 2.8">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2001 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/MangaRamblo.jpg"><img align="left" hspace="24" src="../images/MangaRamblo.jpg"></a>
<h2><font color="#0000e0">Versi&oacute;n 2.8 de OpenBSD:</font></h2>
<p>

Lanzado el 1 de diciembre de 2.000<br>
Copyright 1997-2000, Theo de Raadt.<br>
<font color="#e00000">ISBN 0-9683637-6-8</font>
<p>

<a href="#new">Novedades</a><br>
<a href="#install">C&oacute;mo instalar</a><br>
<a href="#ports">C&oacute;mo usar el &aacute;rbol de portes</a><br>
<a href="orders.html">C&oacute;mo adquirir los CD</a><br>

<p>
<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li>Realice un pedido del CDROM a trav&eacute;s de nuestro
<a href="orders.html">sistema de pedidos</a>.
<li>Lea la informaci&oacute;n en la <a href="ftp.html">p&aacute;gina de
FTP</a> para ver una lista de los sitios que mantienen r&eacute;plicas
del servidor de FTP de OpenBSD.
<li>Visite el directorio <font color="#e00000">pub/OpenBSD/2.8/</font>
en cualquiera de las r&eacute;plicas.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata28.html">p&aacute;gina de
errata de 2.8</a> con el fin de obtener una lista de errores y
soluciones.
<li>Mire este <a href="plus28.html">informe detallado sobre cambios</a>
entre las versiones 2.7 y 2.8.
</ul>
</font></h3>
<br clear="all">
<br>

<p>
<strong>Nota:</strong> Todos los derechos de autor y cr&eacute;ditos se
pueden encontrar en los respectivos ficheros de fuentes src.tar.gz,
srcsys.tar.gz, X11.tar.gz, o en los ficheros obtenidos mediante
ports.tar.gz.  Los archivos de la distribuci&oacute;n usados para crear
los paquetes del fichero ports.tar.gz no est&aacute;n incluidos en el
CDROM debido a la falta de espacio.

<p>
<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Novedades</font></h3>
<p>
&Eacute;sta es una lista parcial de los nuevos sistemas y
funcionalidades incluidos en OpenBSD 2.8.  Para ver una lista m&aacute;s
detallada, vaya al <a href="plus28.html">tabl&oacute;n de cambios</a>
entre 2.7 y 2.8.

<p>
<ul>

<li><a href="http://www.OpenSSH.com/es/">OpenSSH</a> (con soporte para
los protocolos SSH1 y SSH2) se encuentra ahora en su versi&oacute;n
2.3.0.  Esta versi&oacute;n incluye un servidor de SFTP para
transferencias de archivos seguras.

<li>Debido a que la patente sobre RSA ha caducado, ya no es necesario
instalar aparte las bibliotecas SSL.  Vienen incluidas en la
instalaci&oacute;n del sistema.

<li>Grandes cambios en la documentaci&oacute;n, sobre todo en las
p&aacute;ginas de manual y en las preguntas frecuentes (<em>FAQ</em>).
Ahora, las preguntas frecuentes incluyen ejemplos &uacute;tiles a modo
de suplemento a las explicaciones.

<p>
<li>Una colecci&oacute;n de &laquo;portes&raquo; mucho m&aacute;s
completa y con m&aacute;s comprobaciones. 
<p>
<li>M&aacute;s de 500 paquetes precompilados y verificados.

<p>
<li>OpenBSD 2.8 funciona en los modelos G3, G4 y G4 Cube de Apple iMac.

<p>
<li>El sistema incluye los siguientes componentes principales de otros
distribuidores:

<p>
<ul>
<li>XFree86 3.3.6-current
<li>gcc 2.95.3
<li>perl 5.6.0 con algunas modificaciones.
<li>Apache 1.3.12 (+ parches), Mod_ssl 2.6.2, OpenSSL 0.9.5a, DSO
<li>ipf 3.3.18
<li>groff 1.15
<li>sendmail 8.10.1
<li>lynx 2.8.2 con soporte para HTTPS a&ntilde;adido.
<li>sudo 1.6.3p5
<li>ncurses 5.2
<li>Latest KAME IPv6
<li>KTH Kerberos 1.0.2
<li>OpenSSH 2.3.0
</ul>

<p>
<li>Soporte para controladores de dispositivos muy mejorado.

<p>
<ul>
   <li>Soporte para componentes criptogr&aacute;ficos mejorado;  ahora
   incluye las placas de aceleraci&oacute;n criptogr&aacute;fica Hifn
   PowerCrypt y Broadcom Bluesteelnet (uBsec).
   <li>Soporte para muchos nuevos dispositivos de Ethernet, incluidos
   los adaptadores basados en DP83815 de National Semiconductor,
   adaptadores MiniPCI, PCMCIA basados en 574 de 3Com, y muchos
   dispositivos nuevos de CardBus (Xircom, Intel 21143, Intel CardBus
   II).
   <li>Soporte para la mayor&iacute;a de tarjetas Gigabit Ethernet en
   disponibles en el mercado, o sea las basadas en SysKonnect, Intel y
   Alteon.
   <li>Soporte para la mayor&iacute;a de dispositivos de USB, incluidos
   de Ethernet, de impresi&oacute;n, de audio, etc...  Sincronice su
   Handspring Visor o transfiera archivos MP3 a su Rio.
   <li>Soporte para controladores de RAID de 3ware Escalade de las
   series 3W-5x000 y 3W-6x000.
   <li>Nuevo soporte para audio que incluye las Cirrus Logic CS4280,
   ForteMedia FM801, y los <em>chips</em> de audio integrados que se
   pueden encontrar en las nuevas placas base de VIA e Intel.
   <li>Mejoras y soporte nuevo en el subsistema PCI IDE.
</ul>

<p>
<li>Muchas mejoras en fiabilidad y seguridad (busque la letra en rojo en
el <a href="plus28.html">fichero de cambios</a>).

<p>
<li>Muchas m&aacute;s funcionalidades nuevas, incluidas:

<p>
<ul>
   <li>Soporte para el rat&oacute;n en modo consola en la plataforma
   i386.
   <li>Soporte para la norma AES de cifrado.
   <li>Importado tcfs, un sistema de archivos criptogr&aacute;fico.
   <li>Nuevo servidor de sftp en OpenSSH.
</ul>
<p>
</ul>

<p>
<a name="install"></a>
<hr>

<p>
<h3><font color="#0000e0">C&oacute;mo instalar</font></h3>

<p>
A continuaci&oacute;n se encuentran las instrucciones que podr&iacute;a
encontrar en la car&aacute;tula del CDROM para su instalaci&oacute;n si
lo hubiera adquirido, en lugar de tener que llevar a cabo un tipo de
instalaci&oacute;n alternativo.  Las instrucciones para llevar a cabo
una instalaci&oacute;n mediante ftp (o cualquier otra forma de
instalaci&oacute;n) son muy parecidas;  las instrucciones del CDROM se
reproducen tal cual para que pueda ver cu&aacute;nto m&aacute;s
f&aacute;cil habr&iacute;a resultado si hubiera adquirido el CDROM.

<p>
<hr>
Por favor, lea los siguientes ficheros que se encuentran repartidos
entre los dos CDROM, que contienen una detallada explicaci&oacute;n
sobre c&oacute;mo instalar OpenBSD 2.8 en las diferentes arquitecturas:

<p>
<dl>
<li>	CD1:2.8/i386/INSTALL.i386
<li>	CD1:2.8/powerpc/INSTALL.powerpc
<li>	CD1:2.8/vax/INSTALL.vax
<p>
<li>	CD2:2.8/sparc/INSTALL.sparc
<li>	CD2:2.8/mvme68k/INSTALL.mvme68k
<li>	CD2:2.8/amiga/INSTALL.amiga
<li>	CD2:2.8/mac68k/INSTALL.mac68k
<li>	CD2:2.8/hp300/INSTALL.hp300
<li>	CD2:2.8/sun3/INSTALL.sun3

<p>
<li>Las versiones para pmax se encuentra disponible desde los servidores
de ftp, pero no se ha incluido en los CD.
</dl>

<hr>

<p>
La siguiente informaci&oacute;n sirve para una r&aacute;pida
instalaci&oacute;n a aquellos usuarios que est&eacute;n familiarizados
con OpenBSD y con el uso de la nueva orden 'disklabel -E'.  Si al
instalar OpenBSD lo encuentra confuso, lea el fichero INSTALL.*
correspondiente a su plataforma.

<p>
<h3><font color="#e00000">i386:</font></h3>

<p>
Juegue con las opciones de su BIOS e intente activar la opci&oacute;n de
arranque desde el CD;  intente arrancar desde el CD1.  Si no funcionara,
vuelque la imagen que encontrar&aacute; en el directorio
2.8/i386/floppy28.fs del CD1 a un disquete, y arranque con &eacute;ste.
Si va a instalar OpenBSD con otros sistema operativo, aseg&uacute;rese
de leer antes el documento INSTALL.i386.

<p>
Para crear un disquete de arranque desde MS-DOS, use el programa
rawrite.exe que encontrar&aacute; en el directorio 2.8/tools/.  Para
crear un disquete de arranque desde Unix, use la orden
'dd if=&lt;fichero&gt; of =/dev/&lt;dispositivo&gt; bs=32k' (en donde
&lt;fichero&gt; es el camino completo hasta el fichero floppy28.fs, y
dispositivo puede ser &quot;floppy&quot;, &quot;rfd0c&quot;,
&quot;rfd0a&quot;, ... dependiendo de su sistema).  Utilice disquetes
correctamente formateados y en buen estado, sin BLOQUES ERR&Oacute;NEOS,
o de lo contrario no funcionar&aacute;n.

<p>
Si se cuelga el arranque con dispositivos PCI, o si sufre un
p&aacute;nico durante una fase temprana del arranque, lo m&aacute;s
seguro es que est&eacute; relacionado con el dispositivo de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcibios&sektion=4&manpath=OpenBSD+current&arch=i386">pcibios(4)</a>,
y que tenga que desactivar el dispositivo de pcbios como medida temporal
para solventarlo.  Desde el punto <em>boot&gt;</em>, ejecute la orden
<tt>boot -c</tt> para entrar en la Configuraci&oacute;n del
N&uacute;cleo del Usuario, UKC.  Desde el punto <em>UKC&gt;</em>,
introduzca &quot;disable pcibios&quot; y a continuaci&oacute;n
&quot;quit&quot;.  Cuando logre iniciar el sistema, lea las
instrucciones en
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&sektion=8">config(8)</a>
sobre c&oacute;mo reconfigurar el n&uacute;cleo de su sistema para
desactivar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcibios&sektion=4&manpath=OpenBSD+Current&arch=i386">pcibios(4)</a>
de forma permanente.

<p>
<h3><font color="#e00000">sparc:</font></h3>

<p>
Para arrancar desde el CD2, teclee 'boot cdrom 2.8/sparc/bsd.rd', o
'b sd(0,6,0)2.8/sparc/bsd,rd', seg&uacute;n la versi&oacute;n de su ROM.
De forma alternativa, puede volcar la imagen del fichero
2.8/sparc/floppy28.fs del CD2 a un disquete, y arrancar desde
&eacute;ste usando 'boot floppy' o 'boot fd()', dependiendo de la
versi&oacute;n de su ROM.

<p>
<h3><font color="#e00000">amiga:</font></h3>

<p>
Debe crear las particiones BSD de acuerdo con la secci&oacute;n de
preparaci&oacute;n del fichero INSTALL.amiga.  Monte el CD2 como
dispositivo CD0 de AmigaOS, y a continuaci&oacute;n ejecute la siguiente
orden CLI: 'CD0:2.8/amiga/utils/loadbsd CD0:2.8/amiga/bsd.rd'.

<p>
<h3><font color="#e00000">hp300:</font></h3>

<p>
Puede arrancar por red siguiendo las instrucciones del fichero
INSTALL.hp300.

<p>
<h3><font color="#e00000">mac68k:</font></h3>

<p>
Arranque MacOS como de costumbre, y particione su disco con las
configuraciones A/UX apropiadas.  Extraiga las utilidades Macside desde
el directorio 2.8/mac68k/utils del CD2, y c&oacute;pielas en su disco, y
luego ejecute Mkfs para crear los sistemas de archivos en su disco
duro/r&iacute;gido.  A continuaci&oacute;n use Installer de BSD/Mac68k
para copiar todos los archivos del directorio 2.8/mac68k/ del CD2 a sus
particiones.  Finalmente estar&aacute; preparado para configurar el
BSD/Mac68k Booter con la ubicaci&oacute;n de su n&uacute;cleo
(<em>kernel</em>) e iniciar el sistema.

<p>
<h3><font color="#e00000">sun3:</font></h3>

<p>
Obtenga la distribuci&oacute;n mediante ftp.  Una vez haya hecho esto
podr&aacute; configurar un arranque sin disco o crear una cinta de
instalaci&oacute;n, tal y como se describe en el documento INSTALL.sun3.

<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>

<p>
src.tar.gz contiene un archivo con el c&oacute;digo fuente necesario
para empezar con /usr/src.  Este archivo contiene todo lo que
necesitar&aacute; a excepci&oacute;n del c&oacute;digo fuente del
n&uacute;cleo (&quot;<em>kernel</em>&quot;), que se encuentra en un
archivo aparte.  Para extraerlo:

<p>
<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>

<p>
scrcys.tar.gz contiene un archivo con el c&oacute;digo fuente necesario
para empezar con /usr/src/sys.  Este archivo contiene todo el
c&oacute;digo fuente del n&uacute;cleo (&quot;<em>kernel</em>&quot;),
necesario para recompilar n&uacute;cleos.  Para extraerlo:

<p>
<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del CVS.  Mediante el uso
de estos &aacute;rboles es posible obtener una base con la que poder
empezar a usar los servidores de cvs an&oacute;nimo tal y como se
describe en
<a href="anoncvs.html">http://www.OpenBSD.org/es/anoncvs.html</a>.  Es
mucho m&aacute;s r&aacute;pido utilizar estos archivos para actualizar
el CVS inicial de lo que ser&iacute;a si tuviera que obtener todo el
&aacute;rbol de fuentes de OpenBSD partiendo desde cero.

<p>
<a name="ports"></a>
<hr>

<p>
<h3><font color="#0000e0">&Aacute;rbol de portes</font></h3>

<p>
Tambi&eacute;n se incluye un archivo con el &aacute;rbol de portes.
Para extraerlo:

<p>
<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>

<p>
El subdirectorio ports/ ha sido sacado del &aacute;rbol de portes de
OpenBSD.  Si todav&iacute; no sabe lo que son los portes, lea la
p&aacute;gina
<a href="ports.html">http://www.OpenBSD.org/es/ports.html</a> antes de
continuar.  Este texto no es un manual sobre c&oacute;mo usar los
portes, sino m&aacute;s bien una serie de notas con el prop&oacute;sito
de ayudar al usuario a empezar con el sistema de portes de OpenBSD.

<p>
Es cierto que el sistema de portes de OpenBSD no est&aacute; completo.
Esto se debe a que la integraci&oacute;n total de los portes en el
entorno de OpenBSD todav&iacute;a es un proyecto relativamente nuevo en
el momento del lanzamiento de esta versi&oacute;n.  Creemos que los
portes que aqu&iacute; se proveen son estables, pero es importante que
tenga en cuenta que los portes continuar&aacute;n creciendo en el
futuro.

<p>
Como ya hemos dicho, los portes seguir&aacute;n creciendo en el futuro.
El directorio ports/ representa una r&eacute;plica del &aacute;rbol de
fuentes de los portes del CVS (lea la p&aacute;gina de manual de cvs(1)
si no sabe lo que es CVS).  Del mismo modo que con nuestro &aacute;rbol
completo de fuentes del sistema, el &aacute;rbol de portes se encuentra
disponible mediante anoncvs.  As&iacute; pues, para mantenerlo
actualizado debe tener su &aacute;rbol de portes, ports/, disponible en
un medio con permiso de lectura y escritura, y actualizar el
&aacute;rbol con una orden como:

<p>
<pre>
# cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd
</pre>

<p>
(y por supuesto, debe substituir los nombres del directorio local y del
servidor remoto con los de la ubicaci&oacute;n de su colecci&oacute;n de
portes y con el cd un servidor anoncvs cercano respectivamente)

<p>
Insistimos en que es importante que lea la p&aacute;gina con las
instrucciones espec&iacute;ficas, ya que &eacute;ste es un servicio
relativamente nuevo y que no ha sido completamente pulido.

<p>
A pesar de la corta vida de los portes, existe bastante
informaci&oacute;n de ayuda.  Si est&aacute; interesado en ver un porte
a&ntilde;adido al &aacute;rbol, o si quiere ayudar al desarrollo del
&aacute;rbol de portes, o si simplemente desea obtener m&aacute;s
informaci&oacute;n al respecto, la lista de distribuci&oacute;n
ports@openbsd.org es una buena fuente de informaci&oacute;n.

<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [ OpenBSD: 28.html,v 1.13 ]<br>
$Translation: 28.html,v 1.15 2004/08/21 02:26:37 santana Exp $<br>
$OpenBSD: 28.html,v 1.15 2004/08/21 11:43:46 jufi Exp $
</small>

</body>
</html>
