<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>Versi&oacute;n 2.9 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de OpenBSD 2.9">
<meta name="keywords" content="openbsd,2.9">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/Business.jpg"><img align="left" hspace="24" src="../images/Business.jpg"></a>
<h2><font color="#0000e0">Versi&oacute;n 2.9 de OpenBSD:</font></h2>
<p>

Lanzada el 1 de junio de 2.001<br>
Copyright 1997-2001, Theo de Raadt.<br>
<font color="#e00000">ISBN 0-9683637-7-6</font>
<p>

<a href="#new">Novedades</a><br>
<a href="#install">Brevario de instalaci&oacute;n</a><br>
<a href="#ports">Utilizaci&oacute;n del &aacute;rbol de portes</a><br>
<a href="orders.html">C&oacute;mo adquirir los CD</a><br>

<p>
<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li>Realice un pedido de los CDROM a trav&eacute;s de nuestro
<a href="orders.html">sistema de pedidos</a>.
<li>Lea la informaci&oacute;n en la <a href=ftp.html>p&aacute;gina de
FTP</a> para ver una lista de los sitios que mantienen r&eacute;plicas
del servidor de FTP de OpenBSD.
<li>Vaya al directorio <font color="#e00000">pub/OpenBSD/2.9/</font> en
cualquiera de las r&eacute;plicas.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata29.html">p&aacute;gina de
errata para 2.9</a> con el fin de obtener una lista de errores y
soluciones.
<li>Mire este <a href="plus29.html">informe detallado sobre cambios</a>
entre las versiones 2.8 y 2.9.
</ul>
</font></h3>
<br clear="all">
<br>
<p>

<strong>Nota:</strong> Todos los derechos de autor y cr&eacute;ditos se
pueden encontrar en los ficheros que se encuentran en los respectivos
archivos de los fuentes src.tar.gz, srcsys.tar.gz, XF4.tar.gz, o en los
ficheros individuales obtenidos mediante el archivo ports.tar.gz.  Los
ficheros de la distribuci&oacute;n usados para crear los paquetes del
archivo ports.tar.gz no est&aacute;n incluidos en el CDROM debido a la
falta de espacio.
<p>

<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Novedades</font></h3>
<p>
&Eacute;sta es una lista parcial de los nuevos sistemas y
funcionalidades incluidos en OpenBSD 2.9.  Para ver una lista m&aacute;s
detallada, vaya al <a href="plus29.html">tabl&oacute;n de cambios</a>
entre 2.8 y 2.9.

<p>
<ul>
<li>El rendimiento del sistema de archivos ha recibido un
incre&iacute;ble empuje de el nuevo c&oacute;digo de
<em>softupdates</em> y de <em>dirpref</em>.  Algunas comprobaciones han
dado como resultado un incremento de 60 veces en la velocidad.  Si hay
una buena raz&oacute;n para actualizarse a la versi&oacute;n 2.9, es
&eacute;sta.

<p>
<li><a href="http://www.OpenSSH.com/es/">OpenSSH</a> (con soporte para
los protocolos SSH1 y SSH2) se encuentra ahora en su versi&oacute;n 2.9.
Les animamos a que lleven a cabo transferencias de archivos seguras
usando el subsistema SFTP, que ha mejorado mucho y que ahora se presenta
por igual como servidor y cliente de SFTP.

<p>
<li>Grandes cambios en la documentaci&oacute;n, sobre todo en las
p&aacute;ginas del manual y en las preguntas frecuentes (<em>FAQ</em>).
Ahora, las preguntas frecuentes incluyen ejemplos &uacute;tiles a modo
de suplemento a las explicaciones.

<p>
<li>Una colecci&oacute;n de &laquo;portes&raquo; mucho m&aacute;s
completa y con m&aacute;s comprobaciones. 
<p>
<li>M&aacute;s de 1000 paquetes precompilados y verificados.

<p>
<li>OpenBSD 2.9 ya funciona en el nuevo Apple Titanium PowerBook G4.

<p>
<li>Despu&eacute;s de una ausencia durante dos versiones, el porte de
<a href="alpha.html">OpenBSD/alpha</a> ha vuelto, &iexcl;y ahora con
m&aacute;s soporte para componentes que nunca!

<p>
<li>El sistema incluye los siguientes componentes principales de otros
distribuidores:
<p>
<ul>
<li>XFree86 4.0.3 (i386 tambi&eacute;n contiene servidores de 3.3.x,
ofreciendo de este modo soporte para todos los <em>chipsets</em>)
<li>gcc 2.95.3 (+ parches)
<li>perl 5.6.0 (+ parches)
<li>Apache 1.3.19, mod_ssl 2.8.2, OpenSSL 0.9.6, (+ parches), soporte
para DSO
<li>ipf 3.4.16 (+ parches)
<li>groff 1.15
<li>sendmail 8.11.3
<li>lynx 2.8.2 con soporte adicional para HTTPS
<li>sudo 1.6.3p7
<li>ncurses 5.2
<li>La &uacute;ltima versi&oacute;n de KAME IPv6
<li>KTH Kerberos 1.0.4
<li>OpenSSH 2.9
</ul>

<p>
<li>Grandes mejoras en el soporte de controladores

<p>
<ul>
<li>Controlador para 3Com 3c990 3XP Typhoon/Sidewinder (s&oacute;lo
Ethernet).
<li>Nuevos controladores para componentes de RAID, incluidos:
	<ul>
	<li>Adaptec FSA
	<li>American Megatrends MegaRAID
	<li>Controladoras Compaq Smart ARRAY
	</ul>
<li>Nuevos controladores SCSI, incluidos:
	<ul>
	<li>Initio 940/950
	<li>Symbios Logic 53c1x10
	<li>Adaptadoras PCI basadas en AMD Am53c974
	</ul>
<li>A&ntilde;adido mucho soporte para varias tarjetas de audio de
port&aacute;tiles, incluidas:
	<ul>
	<li>ESS Maestro 1/2/2E
	<li>Yamaha DS-1S
	<li>Dispositivos de audio Cirrus Logic CS4281
	</ul>
<li>El <em>hardware</em> USB ahora se activa de modo predeterminado, e
incluye soporte para teclados y ratones.
</ul>


<p>
<li>Muchas mejoras de seguridad y fiabilidad (busque la letra en rojo en
el <a href="plus29.html">tabl&oacute;n de cambios</a>).

<p>
<li>Muchas otras funcionalidades, incluidas:

<p>
<ul>
<li>Soporte para nombres de usuario largos.
<li>La <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&sektion=8">emulaci&oacute;n</a>
de Linux ha mejorado mucho, lo que permite la ejecuci&oacute;n de muchas
aplicaciones m&aacute;s.
<li>Soporte del &aacute;rbol de extensi&oacute;n 802.1d para
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=bridge&sektion=4">
bridge(4)</a>.
<li>Soporte para <em>bridging</em>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vlan&sektion=4">
vlan(4)</a> que permite muchas m&aacute;s posibilidades para puentes
(ahora se puede usar OpenBSD como interruptor compatible con 802.1Q).
<li>Mecanismo de notificaci&oacute;n del evento
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kqueue&sektion=2">
kqueue(2)</a> del n&uacute;cleo (<em>kernel event</em>).
<li>A&ntilde;adido el nuevo controlador de consola, independiente de la
arquitectura de la m&aacute;quina,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&sektion=4">
wscons(4)</a>.
<li>Mejoras importantes en <em>softupdates</em>, incluidas reparaciones
en la velocidad y la estabilidad.
<li>Errores solucionados y mejoras en los controladores
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=atapiscsi&sektion=4">atapiscsi(4)</a> y <a href="http://www.openbsd.org:/cgi-bin/man.cgi?query=pciide&sektion=4">pciide(4)</a>,
incluido el soporte de UltraDMA/100 para controladoras Intel, Promise y
Highpoint.
</ul>

<p>
</ul>

<p>
<a name="install"></a>
<hr>

<p>
<h3><font color="#0000e0">Breviario de instalaci&oacute;n</font></h3>

<p>
Lo que sigue a continuaci&oacute;n son las instrucciones que
podr&iacute;a encontrar en la car&aacute;tula del CDROM para su
instalaci&oacute;n si lo hubiera adquirido, en lugar de tener que llevar
a cabo un tipo de instalaci&oacute;n alternativo.  Las instrucciones
para llevar a cabo una instalaci&oacute;n mediante ftp (o cualquier otra
forma de instalaci&oacute;n) son muy parecidas;  las instrucciones del
CDROM se reproducen tal cual para que pueda ver cu&aacute;nto m&aacute;s
f&aacute;cil habr&iacute;a resultado si hubiera adquirido el CDROM.

<p>
<hr>
Por favor, lea los siguientes ficheros que se encuentran repartidos
entre los dos CDROM, y que contienen una detallada explicaci&oacute;n
sobre c&oacute;mo instalar OpenBSD 2.9 en las diferentes arquitecturas:

<p>
<ul>
<li>	CD1:2.9/i386/INSTALL.i386
<li>	CD1:2.9/powerpc/INSTALL.powerpc
<li>	CD1:2.9/vax/INSTALL.vax
<p>
<li>	CD2:2.9/sparc/INSTALL.sparc
<li>	CD2:2.9/mvme68k/INSTALL.mvme68k
<li>	CD2:2.9/amiga/INSTALL.amiga
<li>	CD2:2.9/mac68k/INSTALL.mac68k
<li>	CD2:2.9/hp300/INSTALL.hp300
<li>	CD2:2.9/sun3/INSTALL.sun3

<p>
<li>La versi&oacute;n para alpha se encuentra disponible desde los
servidores de FTP, pero no se ha incluido en los CD.
</ul>

<hr>

<p>
La siguiente informaci&oacute;n sirve para una r&aacute;pida
instalaci&oacute;n a aquellos usuarios que est&eacute;n familiarizados
con OpenBSD y con el uso de la orden 'disklabel -E'.  Si al instalar
OpenBSD lo encuentra confuso, lea el fichero INSTALL.* correspondiente a
su plataforma.

<p>
<h3><font color="#e00000">OpenBSD/i386:</font></h3>

<ul>
<p>
Pruebe cambiando las opciones de su BIOS para activar el arranque desde
un CD.  La versi&oacute;n final de OpenBSD/i386 se encuentra en el
primer CD.  Si su BIOS no dispone de soporte para el arranque desde el
CD, tendr&aacute; que crear un disquete de arranque para iniciar el
proceso de instalaci&oacute;n.  Para crear un disquete de arranque,
vuelque la imagen que encontrar&aacute; en el directorio
<em>2.9/i386/floppy29.fs</em> del primer CD a un disquete, y arranque el
sistema desde la disquetera.

<p>
Si quiere usar un sistema de arranque dual de OpenBSD con otro sistema
operativo, tendr&aacute; que leer el documento INSTALL.i386 incluido en
el CD.

<p>
Para crear un disquete de arranque desde MS-DOS, use el programa
<em>rawrite</em>, que encontrar&aacute; en el directorio
<em>2.9/tools/rawrite.exe</em> del primer CD.  Para crear el disquete de
arranque desde un sitema operativo Unix, use la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">
dd(1)</a>.  El siguiente ejemplo ilustra el uso de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">
dd(1)</a>, en donde el <em>dispositivo</em> podr&iacute;a ser
&quot;floppy&quot;, &quot;rfd0c&quot;, o &quot;rfd0a&quot;.

<ul><pre>
# <strong>dd if=&lt;file&gt; of=/dev/&lt;dispositivo&gt; bs=32k</strong>
</pre></ul>

<p>
Aseg&uacute;rese de usar disquetes correctamente formateados, sin
BLOQUES ERR&Oacute;NEOS, o su instalaci&oacute;n fallar&aacute; con casi
toda probabilidad.  Puede obtener m&aacute;s informaci&oacute;n sobre
c&oacute;mo crear un disquete de arranque e instalar OpenBSD/i386 desde
&eacute;ste en la <a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1
de las preguntas frecuentes</a>.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/sparc:</font></h3>

<ul>
<p>
La versi&oacute;n final 2.9 de OpenBSD/sparc est&aacute; ubicada en el
segundo CD.  Para arrancar desde este CD puede usar una de las dos
&oacute;rdenes que se ilustran a continuaci&oacute;n, dependiendo de la
versi&oacute;n de su ROM.

<ul><pre>
&gt; <strong>boot cdrom 2.9/sparc/bsd.rd</strong>
</pre></ul>
&oacute;
<ul><pre>
&gt; <strong>b sd(0,6,0)2.9/sparc/bsd.rd</strong>
</pre></ul>

<p>
Alternativamente, si su sparc no tiene un dispositivo de CD, puede
arrancar desde la disquetera.  Para ello debe volcar la imagen que
encontrar&aacute; en el directorio <em>2.9/sparc/floppy29.fs</em> del
segundo CD a un disquete.  Puede obtener m&aacute;s informaci&oacute;n
sobre c&oacute;mo crear un disquete de arranque e instalar OpenBSD/sparc
desde &eacute;ste, por favor lea la
<a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1 de las preguntas
frecuentes</a>.  Para arrancar desde el disquete, use una de las
&oacute;rdenes que se ilustran a continuaci&oacute;n, dependiendo de la
versi&oacute;n de su ROM.

<ul><pre>
&gt; <strong>boot floppy</strong>
</pre></ul>
&oacute;
<ul><pre>
&gt; <strong>boot fd()</strong>
</pre></ul>

<p>
Aseg&uacute;rese de utilizar disquetes correctamente formateados, sin
BLOQUES ERR&Oaucte;NEOS, o su instalaci&oacute;n fallar&aacute; con casi
toda probabilidad.

<p>
Si su sparc no dispone de una controladora de disquetera ni de CD, puede
configurar una cinta de almacenamiento para arranque o instalar a
trav&eacute;s de la red, tal y como se detalla en el documento
INSTALL.sparc.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/amiga:</font></h3>

<ul>
<p>
Debe crear las particiones BSD de acuerdo con la secci&oacute;n de
preparaci&oacute;n del fichero INSTALL.amiga.  Monte el CD2 como
dispositivo CD0 de AmigaOS, y a continuaci&oacute;n ejecute la siguiente
orden CLI: 'CD0:2.9/amiga/utils/loadbsd CD0:2.9/amiga/bsd.rd'.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/hp300:</font></h3>

<ul>
<p>
Puede arrancar por red siguiendo las instrucciones del fichero
INSTALL.hp300.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/mac68k:</font></h3>

<ul>
<p>
Arranque MacOS como de costumbre, y particione su disco con las
configuraciones A/UX apropiadas.  Extraiga las utilidades Macside desde
el directorio 2.9/mac68k/utils del CD2, y c&oacute;pielas en su disco, y
luego ejecute Mkfs para crear los sistemas de archivos en su disco
duro/r&iacute;gido.  A continuaci&oacute;n use Installer de BSD/Mac68k
para copiar todos los archivos del directorio 2.9/mac68k/ del CD2 a sus
particiones.  Finalmente estar&aacute; preparado para configurar el
BSD/Mac68k Booter con la ubicaci&oacute;n de su n&uacute;cleo
(<em>kernel</em>) e iniciar el sistema.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/sun3:</font></h3>

<ul>
<p>
Puede configurar una instalaci&oacute;n sin disco, o bien crear una
instalaci&oacute;n con cinta, tal y como se describe en el documento
INSTALL.sun3.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/alpha:</font></h3>

<ul>
<p>
Obtenga la OpenBSD a trav&eacute;s de FTP.  Puede instalarlo mediante
una configuraci&oacute;n sin disco o bien arrancando desde la
disquetera, tal y como se describe en el documento INSTALL.alpha.
</p>
</ul>

<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>

<ul>
<p>
src.tar.gz contiene un archivo con el c&oacute;digo fuente necesario
para empezar con /usr/src.  Este archivo contiene todo lo que
necesitar&aacute; a excepci&oacute;n del c&oacute;digo fuente del
n&uacute;cleo (&quot;<em>kernel</em>&quot;), que se encuentra en un
archivo aparte.  Para extraerlo:

<p>
<ul><pre>
# <strong>mkdir -p /usr/src</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/src.tar.gz</strong>
</pre></ul>

<p>
scrcys.tar.gz contiene un archivo con el c&oacute;digo fuente necesario
para empezar con /usr/src/sys.  Este archivo contiene todo el
c&oacute;digo fuente del n&uacute;cleo (&quot;<em>kernel</em>&quot;),
necesario para recompilar n&uacute;cleos.  Para extraerlo:

<p>
<ul><pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/srcsys.tar.gz</strong>
</pre></ul>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del CVS.  Mediante el uso
de estos &aacute;rboles es posible obtener una base con la que poder
empezar a usar los servidores de cvs an&oacute;nimo tal y como se
describe en
<a href="anoncvs.html">http://www.OpenBSD.org/es/anoncvs.html</a>.  Es
mucho m&aacute;s r&aacute;pido utilizar estos archivos para actualizar
el CVS inicial de lo que ser&iacute;a si tuviera que obtener todo el
&aacute;rbol de fuentes de OpenBSD partiendo desde cero.
</ul>

<p>
<a name="ports"></a>
<hr>
<p>
<h3><font color="#0000e0">El &aacute;rbol de portes</font></h3>

<p>
Tambi&eacute;n se incluye un archivo con el &aacute;rbol de portes.
Para extraerlo:

<p>
<ul><pre>
# <strong>cd /usr</strong>
# <strong>tar xvfz /tmp/ports.tar.gz</strong>
# <strong>cd ports</strong>
</pre></ul>

<p>
El subdirectorio <em>ports/</em> ha sido sacado del &aacute;rbol de
portes de OpenBSD.  Si todav&iacute; no sabe lo que son los portes, lea
la p&aacute;gina
<a href="ports.html">http://www.OpenBSD.org/es/ports.html</a> antes de
continuar.  Este texto no es un manual sobre c&oacute;mo usar los
portes, sino m&aacute;s bien una serie de notas con el prop&oacute;sito
de ayudar al usuario a empezar con el sistema de portes de OpenBSD.

<p>
Es cierto que el sistema de portes de OpenBSD no est&aacute; completo.
Y probablemente jam&aacute;s llegar&aacute; a estarlo.  Sin embargo,
est&aacute; creciendo a gran velocidad y se est&aacute; estabilizando
cada vez m&aacute;s.  Casi todos los portes que se incluyen en el
lanzamiento de esta versi&oacute;n final deber&iacute;an compilar e
instalarse sin problemas en la mayor&iacute;a de arquitecturas (por
ejemplo, hay m&aacute;s de 1.200 paquetes que compilan y se instalan en
i386).

<p>
Como ya hemos dicho, los portes seguir&aacute;n creciendo en el futuro.
El directorio <em>ports/</em> representa una r&eacute;plica del
&aacute;rbol de fuentes de los portes del CVS (lea la p&aacute;gina del
manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=1&manpath=OpenBSD+Current&arch=i386&format=html">cvs(1)</a>
si no sabe lo que es CVS).  Del mismo modo que con nuestro &aacute;rbol
completo de fuentes del sistema, el &aacute;rbol de portes se encuentra
disponible mediante anoncvs.  As&iacute; pues, para mantenerlo
actualizado debe tener su &aacute;rbol de portes, ports/, disponible en
un medio con permiso de lectura y escritura, y actualizar el
&aacute;rbol con una orden como:

<p>
<ul><pre>
# <strong>cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd -rOPENBSD_2_9</strong>
</pre></ul>

<p>
(y por supuesto, debe substituir los nombres del directorio local y del
servidor remoto con los de la ubicaci&oacute;n de su colecci&oacute;n de
portes y con el de un servidor anoncvs cercano respectivamente)

<p>
N&oacute;tese que la mayor&iacute;a de los portes se encuentran
disponibles en paquetes precompilados a trav&eacute;s de ftp.  Si
surgiera alg&uacute;n problema, se actualizar&iacute;an los paquetes
para la versi&oacute;n 2.9.

<p>
Si est&aacute; interesado en ver un porte a&ntilde;adido al
&aacute;rbol, o si quiere ayudar al desarrollo del &aacute;rbol de
portes, o si simplemente desea obtener m&aacute;s informaci&oacute;n al
respecto, la lista de distribuci&oacute;n ports@openbsd.org es una buena
fuente de informaci&oacute;n.

<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: 29.html,v 1.26 2002/10/24 20:00:18 jufi Exp ]<br>
$Translation: 29.html,v 1.19 2003/11/25 09:08:05 horacio Exp $<br>
$OpenBSD: 29.html,v 1.17 2003/11/25 09:43:45 horacio Exp $
</small>

</body>
</html>
