<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n 3.0 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página principal de OpenBSD">
<meta name="keywords" content="openbsd,principal">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/Rock.jpg"><img align="left" hspace="24" src="../images/Rock.jpg"></a>
<h2><font color="#0000e0">Versi&oacute;n 3.0 de OpenBSD:</font></h2>
<p>

Fecha de lanzamiento: 1 de diciembre de 2.001<br>
Copyright 1997-2001, Theo de Raadt.<br>
<font color="#e00000">ISBN 0-9683637-8-4</font>
<p>

<a href="#new">Novedades</a><br>
<a href="#install">Breviario de instalaci&oacute;n</a><br>
<a href="#ports">Utilizaci&oacute;n del &aacute;rbol de portes</a><br>
<a href="orders.html">C&oacute;mo adquirir los CD</a><br>

<p>
<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li>Realice un pedido de los CD a trav&eacute;s de nuestro
<a href="orders.html">sistema de pedidos</a>.
<li>Lea la informaci&oacute;n contenida en la
<a href="ftp.html">p&aacute;gina de FTP</a> para ver una lista de los
sitios que mantienen r&eacute;plicas del servidor de FTP de OpenBSD.
<li>Vaya al directorio <font color="#e00000">pub/OpenBSD/3.0/</font> en
cualquiera de la r&eacute;plicas de FTP.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata30.html">p&aacute;gina de
erratas para 3.0</a> con el fin de obtener una lista de errores y
soluciones.
<li>Mire este <a href="plus30.html">informe detallado sobre cambios</a>
entre las versiones 2.9 y 3.0.
</ul>
</font></h3>
<br clear="all">
<br>
<p>

<strong>Nota:</strong> Todos los derechos de autor y cr&eacute;ditos se
pueden encontrar en los ficheros que a su vez se encuentran en los
respectivos archivos de los fuentes src.tar.gz, srcsys.tar.gz,
XF4.tar.gz, o en los ficheros individuales obtenidos mediante el archivo
ports.tar.gz.  Los ficheros de la distribuci&oacute;n usados para crear
los paquetes del archivo ports.tar.gz no est&aacute;n incluidos en el
CDROM debido a la falta de espacio.
<p>

<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Novedades</font></h3>
<p>
&Eacute;sta es una lista parcial de los nuevos sistemas y
funcionalidades incluidos en OpenBSD 3.0.  Para ver una lista m&aacute;s
detallada, vaya al <a href="plus30.html">tabl&oacute;n de cambios</a>
entre 2.9 y 3.0.

<p>
<ul>
<li><a href="http://www.OpenSSH.com/es/">OpenSSH</a> (con soporte para
los protocolos SSH1 y SSH2) se encuentra ahora en su versi&oacute;n 3.0.
Les animamos a que realicen sus transferencias de archivos de modo
seguro utilizando el subsistema SFTP, que ha mejorado mucho y ahora se
presenta por igual como servidor y cliente de SFTP.

<p>
<li>Grandes cambios en la documentaci&oacute;n, sobre todo en las
p&aacute;ginas del manual y en las preguntas frecuentes (<em>FAQ</em>).
Ahora, las p&aacute;ginas del manual incluyen ejemplos &uacute;tiles a
modo de suplemento a las explicaciones.

<p>
<li>Una colecci&oacute;n de &laquo;portes&raquo; mucho m&aacute;s
completa y con m&aacute;s comprobaciones.

<p>
<li>M&aacute;s de 1000 paquetes precompilados y verificados.

<p>
<li>Un nuevo porte <a href="sparc64.html">OpenBSD/sparc64</a> para la
plataforma UltraSPARC.

<p>
<li>Un nuevo filtro para paquetes IP,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&sektion=4">
PF</a>, con capacidad para NAT, y con una sintaxis casi totalmente
compatible con ipf.

<p>
<li>El sistema incluye los siguientes componentes principales de otros
distribuidores:

<p>
<ul>
<li>XFree86 4.1.0 (i386 tambi&eacute;n contiene servidores de 3.3.x,
ofreciendo de este modo soporte para todos los <em>chipsets</em>)
<li>gcc 2.95.3 (+ parches)
<li>perl 5.6.1 (+ parches)
<li>Apache 1.3.19, mod_ssl 2.8.2, OpenSSL 0.9.6b (+ parches), soporte
para DSO
<li>groff 1.15
<li>sendmail 8.12.1
<li>lynx 2.8.2 con soporte adicional para HTTPS
<li>sudo 1.6.3p7
<li>ncurses 5.2
<li>la &uacute;ltima versi&oacute;n de KAME IPv6
<li>KTH Kerberos 1.0.8
<li>Heimdal 0.3f (+ parches)
<li>OpenSSH 3.0
</ul>

<p>
<li>Muchas mejoras de seguridad y fiabilidad (busque la letra en rojo en
el <a href="plus30.html">tabl&oacute;n de cambios</a>).
</ul>

<p>
<a name="install"></a>
<hr>
<p>
<h3><font color="#0000e0">Breviario de instalaci&oacute;n</font></h3>

<p>
Lo que sigue a continuaci&oacute;n son las instrucciones de
instalaci&oacute;n que podr&iacute;a encontrar en la car&aacute;tula del
CDROM si lo hubiera adquirido, en lugar de tener que llevar a cabo un
tipo de instalaci&oacute;n alternativo.  Las instrucciones para llevar a
cabo una instalaci&oacute;n mediante ftp (o cualquier otra forma de
instalaci&oacute;n) son muy parecidas;  las instrucciones del CDROM se
reproducen tal cual para que pueda ver cu&aacute;nto m&aacute;s
f&aacute;cil habr&iacute;a resultado si hubiera adquirido el CDROM.

<p>
<hr>
Por favor, lea los siguientes ficheros que se encuentran repartidos
entre los tres CD, y que contienen una detallada explicaci&oacute;n
sobre c&oacute;mo instalar OpenBSD 3.0 en su m&aacute;quina:

<p>
<ul>
<li>	CD1:3.0/i386/INSTALL.i386
<li>	CD1:3.0/alpha/INSTALL.alpha
<p>
<li>	CD2:3.0/macppc/INSTALL.macppc
<li>	CD2:3.0/mvme68k/INSTALL.mvme68k
<li>	CD2:3.0/amiga/INSTALL.amiga
<li>	CD2:3.0/mac68k/INSTALL.mac68k
<li>	CD2:3.0/hp300/INSTALL.hp300
<li>	CD2:3.0/vax/INSTALL.vax
<p>
<li>	CD3:3.0/sparc/INSTALL.sparc
<li>	CD3:3.0/sparc64/INSTALL.sparc64
</ul>

<hr>

<p>
La siguiente informaci&oacute;n sirve para una r&aacute;pida
instalaci&oacute;n a aquellos usuarios usuarios que est&eacute;n
familiarizados con OpenBSD y con la orden 'disklabel -E'.  Si le resulta
confusa la instalaci&oacute;n de OpenBSD, lea el fichero INSTALL.*
correspondiente a su plataforma.

<p>
<h3><font color="#e00000">OpenBSD/i386:</font></h3>
<ul>

<p>
Juegue con las opciones de su BIOS para activar el arranque desde el CD.
La versi&oacute;n final de OpenBSD/i386 se encuentra en el primer CD.
Si su BIOS no dispone de soporte para el arranque desde el CD,
tendr&aacute; que crear un disquete de arranque para iniciar el proceso
de instalaci&oacute;n.  Para crear un disquete de arranque, vuelque la
imagen que encontrar&aacute; en el directorio
<em>3.0/i386/floppy30.fs</em> del primer CD a un disquete, y arranque el
sistema desde la disquetera.

<p>
O use la imagen <em>3.0/i386/floppyB30.fs</em> del primer CD si necesita
mayor soporte para controladores scsi, o la imagen
<em>3.0/i386/floppyC30.fs</em> del primer CD si necesita m&aacute;s
soporte para port&aacute;tiles.

<p>
Si quiere usar un sistema de arranque dual de OpenBSD con otro sistema
operativo, tendr&aacute; que leer el documento INSTALL.i386 incluido en
el CD.

<p>
Para crear un disquete de arranque desde MS-DOS, use el programa
<em>rawrite</em> que encontrar&aacute; en el directorio
<em>3.0/tools/rawrite.exe</em> del primer CD.  Para crear el disquete de
arranque desde un sistema operativo Unix, use la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">
dd(1)</a>.  El siguiente ejemplo ilustra el uso de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">
dd(1)</a>, en donde <em>dispositivo</em> podr&iacute;a ser
&quot;floppy&quot;, &quot;rfd0c&quot;, or &quot;rfd0a&quot;, y
<em>fichero</em> la imagen de arranque que desee volcar en el disquete.

<ul>
<pre>
# <strong>dd if=&lt;fichero&gt; of=/dev/&lt;dispositivo&gt; bs=32k</strong>
</pre>
</ul>

<p>
Aseg&uacute;rese de usar disquetes correctamente formateados, sin
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
toda probabilidad.  Puede obtener m&aacute;s informaci&oacute;n sobre
c&oacute;mo crear un disquete de arranque e instalar OpenBSD/i386 desde
&eacute;ste en la <a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1
de las preguntas frecuentes</a>.
</ul>

<p>
<h3><font color=#e00000>OpenBSD/alpha:</font></h3>

<ul>
<p>
Desde el punto SRM, introduzca <em>boot -fi 3.0/alpha/bsd.rd dka6</em>,
en donde <em>dka6</em> es una abreviaci&oacute;n del controlador de CD
(puede verificarlo con <em>show dev</em>).

<p>
Si no puede arrancar desde el CD, vuelque la imagen
<em>3.0/alpha/floppy30.fs</em> o la imagen
<em>3.0/alpha/floppyB30.fs</em> (dependiendo de su m&aacute;quina) a un
disquete e introduzca la orden <em>boot dva0</em>.  Lea el fichero
INSTALL.alpha para m&aacute;s detalles.

<p>
Aseg&uacute;rese de usar un disquete correctamente formateado sin
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
toda seguridad.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/macppc:</font></h3>
<ul>

<p>
Introduzca el segundo CD en el dispositivo de CDROM, y encienda el
equipo mientras mantiene presionada la tecla <em>C</em> hasta que se
encienda la pantalla y muestre la l&iacute;nea <em>OpenBSD/macppc
boot</em>.

<p>
De forma alternativa, desde el punto de Open Firmware, introduzca la
orden <em>boot cd:,ofwboot/3.0/macppc/bsd.rd</em>.

<p>
Debido a un error de producci&oacute;n del CD de la versi&oacute;n 3.0,
hay que utilizar la siguiente modificaci&oacute;n de la orden:
<em>boot cd:,OFWBOOT /3.0/macppc/bsd.rd</em>.  Es probable que esta
orden no funcione en algunos de los sistemas <em>New World</em>
m&aacute;s viejos, como iMac (Rev A - Rev C);  en estas m&aacute;quinas
ser&aacute; necesario copiar <em>ofwboot</em> y
<em>/3.0/macppc/bsd.rd</em> a la primera partici&oacute;n HFS del disco
duro, e iniciar con <em>boot hd:,OFWBOOT /bsd.rd</em>.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/hp300:</font></h3>

<ul>
<p>
Introduzca el segundo CD en el lector de CDROM y presione la barra de
espacio durante el encendido del <em>self-test</em>.  Introduzca la
elecci&oacute;n de arranque que corresponda a <em>SYS_CDBOOT</em>.

<p>
De forma alternativa puede arrancar a trav&eacute;s de la red local
siguiendo las instrucciones en INSTALL.hp300.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/amiga:</font></h3>

<ul>
<p>
Cree particiones para BSD de acuerdo con la secci&oacute;n que trata
sobre la preparaci&oacute;n en INSTALL.amiga.  Monte el segundo CD en
AmigaOS como el dispositivo <em>CD0</em>;  a continuaci&oacute;n ejecute
la siguiente orden CLI:
'CD0:3.0/amiga/utils/loadbsd CD0:3.0/amiga/bsd.rd'.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/mac68k:</font></h3>

<p>
<ul>
Arranque MacOS como de costumbre, y particione su disco con las
configuraciones A/UX apropiadas.  Extraiga las utilidades Macside desde
el directorio <em>3.0/mac68k/utils</em> del segundo CD y c&oacute;pielas
en su disco.  Ejecute Mkfs para crear los sistemas de archivos en las
particiones A/UX que acaba de crear.  A continuaci&oacute;n use el
BSD/Mac68k Installer para copiar todos los archivos del directorio
<em>3.0/mac68k</em> del segundo CD a sus particiones.  Ahora ya
est&aacute; preparado para configurar el BSD/Mac68k Booter con la
ubicaci&oacute;n del n&uacute;cleo (<em>kernel</em>) e iniciar el
sistema.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/mvme68k:</font></h3>

<p>
<ul>
Puede crear una cinta de instalaci&oacute;n con arranque o arrancar
desde la red local.<br>
El arranque por red requiere una versi&oacute;n de MVME68K BUG con
soporte para las &oacute;rdenes <em>NIOT</em> y <em>NBO</em> del
depurador.  El fichero INSTALL.mvme68k contiene unas instrucciones
m&aacute;s detalladas.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/vax:</font></h3>

<p>
<ul>
Arranque desde una red local mediante mopbooting tal y como se describe
en INSTALL.vax.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/sparc:</font></h3>

<p>
<ul>
La versi&oacute;n 3.0 de OpenBSD/sparc se encuentra en el tercer CD.
Para arrancar desde este CD puede usar una de las dos &oacute;rdenes que
aparecen a continuaci&oacute;n, dependiendo de la versi&oacute;n de su
ROM.

<ul>
<pre>
&gt; <strong>boot cdrom 3.0/sparc/bsd.rd</strong>
&oacute;
&gt; <strong>b sd(0,6,0)3.0/sparc/bsd.rd</strong>
</pre>
</ul>

<p>
Si su sparc no dispone de un dispositivo de CD puede, de forma
alternativa, arrancar desde el disquete.  Para ello necesitar&aacute;
volcar la imagen <em>3.0/sparc/floppy30.fs</em> del segundo CD a un
disquete.  Para m&aacute;s informaci&oacute;n lea la
<a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1</a> de las
preguntas frecuentes.  Para arrancar desde el disquete use una de las
dos &oacute;rdenes que aparecen a continuaci&oacute;n, dependiendo de la
versi&oacute;n de su ROM.

<ul>
<pre>
&gt; <strong>boot floppy</strong>
&oacute;
&gt; <strong>boot fd()</strong>
</pre>

</ul>
<p>
Aseg&uacute;rese de usar un disquete correctamente formateado, sin
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
toda seguridad.

<p>
Si su sparc no dispone de dispositivo de disquete ni CD, puede
configurar una cinta de arranque o instalarlo por red local, como se
explica en el fichero INSTALL.sparc.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/sparc64:</font></h3>

<ul>
<p>
Introduzca el tercer CD en su dispositivo de CDROM y escriba la orden
<em>boot cdrom</em>.

<p>
Si no funciona, o si no dispone de dispositivo de CDROM, vuelque la
imagen <em>3.0/sparc64/floppy30.fs</em> a un disquete y arranque desde
&eacute;ste mediante la orden <em>boot floppy</em>.<br>
Aseg&uacute;rese de usar un disquete correctamente formateado, sin
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
toda seguridad.

<p>
Tambi&eacute;n puede volcar la imagen <em>3.0/sparc64/miniroot30.fs</em>
en la partici&oacute;n de la memoria de intercambio (<em>swap</em>) del
disco, y arrancar mediante la orden <em>boot disk:b</em>.

<p>
Si ninguno de los m&eacute;todos anteriores funciona, puede arrancar por
red local como se describe en el fichero INSTALL.sparc64.
</ul>

<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>

<ul>
<p>
<em>src.tar.gz</em> contiene un archivo con el c&oacute;digo fuente
necesario para empezar con <em>/usr/src</em>.  Este archivo contiene
todo lo que necesita excepto el c&oacute;digo fuente del n&uacute;cleo
del sistema, que se encuentra en otro archivo.  Para extraerlo:

<p>
<ul>
<pre>
# <strong>mkdir -p /usr/src</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/src.tar.gz</strong>
</pre>
</ul>

<p>
<em>srcsys.tar.gz</em> contiene un archivo con el c&oacute;digo fuente
para empezar con <em>/usr/src/sys</em>.  Este archivo contiene todo el
c&oacute;digo fuente del n&uacute;cleo del sistema necesario para
recompilar n&uacute;cleos.  Para extraerlo:

<p>
<ul>
<pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/srcsys.tar.gz</strong>
</pre>
</ul>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del repositorio de CVS.
Mediante el uso de estos &aacute;rboles es posible obtener una base
desde donde empezar a usar los servidores de cvs an&oacute;nimo, tal y
como se describe en
<a href="anoncvs.html">http://www.OpenBSD.org/anoncvs.html</a>.  La
utilizaci&oacute;n de estos archivos para la actualizaci&oacute;n del
&aacute;rbol de CVS inicial es mucho m&aacute;s r&aacute;pido de lo que
supondr&iacute;a tener que extraer todo el &aacute;rbol de fuentes de
OpenBSD partiendo desde cero.
</ul>

<a name="ports"></a>

<hr>

<p>
<h3><font color="#0000e0">El &aacute;rbol de portes</font></h3>

<p>
Tambi&eacute;n se incluye un &aacute;rbol de portes.  Para extraerlo:

<p>
<ul>
<pre>
# <strong>cd /usr</strong>
# <strong>tar xvfz /tmp/ports.tar.gz</strong>
# <strong>cd ports</strong>
</pre>
</ul>

<p>
El subdirectorio <em>ports/</em> ha sido extraido del &aacute;rbol de
portes de OpenBSD.  Si todav&iacute;a no sabe qu&eacute; son los portes,
lea <a href="ports.html">http://www.OpenBSD.org/es/ports.html</a>.  Esta
secci&oacute;n no es un manual sobre el uso de los portes, sino
m&aacute;s bien una serie de notas con el prop&oacute;sito de ayudar al
usario a empezar a usar el sistema de portes de OpenBSD.

<p>
Es cierto que el sistema de portes de OpenBSD no est&aacute; completo.
Y probablemente jam&aacute;s llegar&aacute; a estarlo.  Sin embargo,
est&aacute; creciendo a gran velocidad y se estabiliza cada vez
m&aacute;s.  Casi todos los portes que se incluyen en el lanzamiento de
esta versi&oacute;n final deber&iacute;an compilar e instalarse sin
problemas en la mayor&iacute;a de plataformas (por ejemplo, hay
m&aacute;s de 1200 paquetes que compilan y se instalan en i386).

<p>
El directorio <em>ports/</em> es una r&eacute;plica de nuestro
&aacute;rbol de portes del CVS (lea la p&aacute;gina del manual de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=1&manpath=OpenBSD+Current&arch=i386&format=html">cvs(1)</a>
si no sabe qu&eacute; es CVS).  Del mismo modo que con nuestro
&aacute;rbol completo de fuentes del sistema, nuestro &aacute;rbol de
portes se encuentra disponible mediante cvs an&oacute;nimo.  As&iacute;
pues, para mantener su sistema de portes actualizado con el de CVS, debe
tener su &aacute;rbol de portes, <em>ports/</em>, disponible en un medio
con permisos de escritura y lectura, y actualizarlo con una orden como:

<p>
<ul>
<pre>
# <strong>cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd -rOPENBSD_3_0</strong>
</pre>
</ul>

<p>
(y por supuesto, debe sustituir los nombres del directorio local y del
servidor remoto por los de la ubicaci&oacute;n de su colecci&oacute;n
local de portes y con el de un servidor de cvs an&oacute;nimo cercano,
respectivamente)

<p>
N&oacute;tese que la mayor&iacute;a de los portes se encuentran
disponibles en forma de paquetes precompilados a trav&eacute;s de ftp.
Si surgiera alg&uacute;n problema, se actualizar&iacute;an los paquetes
para la versi&oacute;n 3.0.

<p>
Si tiene alg&uacute;n inter&eacute;s especial en que se a&ntilde;ada
alg&uacute;n porte, o si desea ayudar, o si simplemente quiere obtener
m&aacute;s informaci&oacute;n al respecto, la lista de correo
ports@openbsd.org es una buena fuente de informaci&oacute;n.

<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [ OpenBSD: 30.html,v 1.19 ]<br>
$Translation: 30.html,v 1.16 2004/08/21 02:26:37 santana Exp $<br>
$OpenBSD: 30.html,v 1.13 2004/08/21 11:43:46 jufi Exp $
</small>

</body>
</html>
