<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n 3.1 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="OpenBSD 3.1">
<meta name="keywords" content="openbsd,principal">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/Systemagic.jpg"><img align="left" width="255" height="323" hspace="24" src="../images/Systemagic.jpg"></a>
<h2><font color="#0000e0">Versi&oacute;n 3.1 de OpenBSD:</font></h2>
<p>

Fecha de lanzamiento: 19 de mayo de 2.002<br>
Copyright 1997-2002, Theo de Raadt.<br>
<font color="#e00000">ISBN 0-9683637-9-2</font>
<p>

<a href="#new">Novedades</a><br>
<a href="#install">Breviario de instalaci&oacute;n</a><br>
<a href="#ports">Utilizaci&oacute;n del &aacute;rbol de portes</a><br>
<a href="orders.html">C&oacute;mo obtener los CD</a><br>

<p>
<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li>Realice un pedido de los CD a trav&eacute;s de nuestro
<a href="orders.html">sistema de pedidos</a>.
<li>Lea la informaci&oacute;n contenida en <a href="ftp.html">la
p&aacute;gina de FTP</a> que incluye un listado de los sitios que
mantienen r&eacute;plicas del servidor de FTP de OpenBSD.  <li>Vaya al
directorio <font color="#e00000">pub/OpenBSD/3.1/</font> en cualquiera
de las r&eacute;plicas de FTP.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata31.html">p&aacute;gina de
erratas para 3.1</a> con el fin de obtener una lista de errores y
soluciones.
<li>Mire este <a href="plus31.html">informe detallado sobre cambios</a>
entre las versiones 3.0 y 3.1.
</ul>
</font></h3>
<br clear="all">
<br>
<p>

<strong>Nota:</strong> Todos los derechos de autor y cr&eacute;ditos se
pueden ver en los ficheros que se encuentran en los respectivos archivos
de los fuentes src.tar.gz, srcsys.tar.gz, y XF4.tar.gz, o en los
ficheros individuales obtenidos mediante el archivo ports.tar.gz.  Los
ficheros de la distribuci&oacute;n usados para crear los paquetes del
archivo ports.tar.gz no est&aacute;n incluidos en el CDROM debido a la
falta de espacio.
<p>

<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Novedades</font></h3>
<p>
&Eacute;sta es un lista parcial de las nuevas funcionalidades y sistemas
incluidas en OpenBSD 3.1.  Puede ver una lista m&aacute;s detallada en
el <a href="plus31.html">tabl&oacute;n de cambios</a> entre 3.0 y 3.1.
<p>

<ul>
<li>Versi&oacute;n 3.2 de
<a href="http://www.OpenSSH.com/es/">OpenSSH</a> (con soporte para los
protocolos SSH1 y SSH2).  Recomendamos las tranferencias de archivo
seguras mediante el subsistema SFTP que se ha mejorado mucho y que
incluye un servidor y un cliente de SFTP.
<p>

<li>Como de costumbre, mejoras en la documentaci&oacute;n, en especial
las p&aacute;ginas del manual y las preguntas frecuentes.  Una gran
parte de nuestro sitio en Internet est&aacute; disponible en varios
idiomas.
<p>

<li>Una colecci&oacute;n de portes m&aacute;s completa y mejor
comprobada.
<p>

<li>M&aacute;s de 1000 paquetes precompilados y comprobados.
<p>

<li>Un soporte de equipos y componentes mucho mejor en la plataforma
<a href="sparc64.html">OpenBSD/sparc64</a>, y con soporte a&ntilde;adido
para X11.
<p>

<li>Numerosas mejoras en el rendimiento de la plataforma
<a href="macppc.html">OpenBSD/macppc</a>, adem&aacute;s de soporte para
servidores de X11 acelerado en algunos modelos.
<p>

<li>Muchas mejoras en nuestro nuevo filtro de paquetes de IP,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&sektion=4">
pf</a>, incluidas mejoras de rendimiento as&iacute; como la capacidad de
filtrar otros protocolos, adem&aacute;s de los protocolos tcp, udp e
icmp, como el protocolo esp.
<p>

<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=authpf&sektion=8">authpf</a>,
una utilidad para conseguir cambios en las reglas de pf(4) por usuario,
para pasarelas.
<p>

<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=raid&sektion=4">
raid</a> (RAIDframe), el <em>software</em> integrado en el núcleo, ahora
puede detectar y configurar automáticamente sus dispositivos de
<em>raid</em> durante el arranque.  Aprovechando esto, el sistema puede
tener su partición raíz montada directamente desde una partición de raid
autodetectada.
<p>

<li>Posibilidad de puentes Wavelan en tarjetas basadas en Prism-II.
<p>

<li>El sistema incluye los siguientes componentes principales de otros
distribuidores:

<p>
<ul>
<li>XFree86 4.2.0 (i386 tambi&eacute;n dispone de servidores de 3.3.X,
dando soporte as&iacute; a todos los <em>chipset</em>)
<li>gcc 2.95.3 (+ parches)
<li>perl 5.6.1 (+ parches)
<li>Soporte para Apache 1.3.24, mod_ssl 2.8.8, OpenSSL 0.9.6b (+
parches), DSO
<li>groff 1.15
<li>sendmail 8.12.2
<li>lynx 2.8.2rel.1 con soporte adicional para HTTPS
<li>sudo 1.6.5p2
<li>ncurses 5.2
<li>&uacute;ltima versi&oacute;n de KAME IPv6
<li>KTH Kerberos 1.0.8
<li>Heimdal 0.4e (+ parches)
<li>OpenSSH 3.2
</ul>

<li>Muchas mejoras de seguridad y fiabilidad (busque la letra en rojo en
el <a href="plus31.html">tabl&oacute;n de cambios</a>).
</ul>

<p>
<a name="install"></a>
<hr>
<p>
<h3><font color="#0000e0">Breviario de instalaci&oacute;n</font></h3>

<p>
Lo que sigue a continuaci&oacute;n son las instrucciones de
instalaci&oacute;n que podr&iacute;a encontrar en la car&aacute;tula del
CDROM si lo hubiera adquirido, en lugar de tener que efectuar un tipo de
instalaci&oacute;n alternativa.  Las instrucciones para llevar a cabo
una instalaci&oacute;n por ftp (o cualquier otra forma de
instalaci&oacute;n) son muy parecidas;  las instrucciones del CDROM se
reproducen tal cual para que pueda ver cu&aacute;nto m&aacute;s
f&aacute;cil habr&iacute;a resultado si hubiera adquirido el CDROM.

<p>
<hr>
Por favor, lea los siguientes ficheros que encontrar&aacute; repartidos
entre los tres CD, y que contienen una detallada explicaci&oacute;n
sobre c&oacute;mo instalar OpenBSD 3.1 en su m&aacute;quina:
<p>
<ul>
<li>	CD1:3.1/i386/INSTALL.i386
<li>	CD1:3.1/alpha/INSTALL.alph
<li>	CD2:3.1/macppc/INSTALL.macppc
<li>	CD2:3.1/vax/INSTALL.vax
<p>
<li>	CD3:3.1/sparc/INSTALL.sparc
<li>	CD3:3.1/sparc64/INSTALL.sparc64
<p>
S&oacute;lo disponibles por FTP:<br>
<li>	CD4:3.1/mvme68k/INSTALL.mvme68k
<li>	CD4:3.1/amiga/INSTALL.amiga
<li>	CD4:3.1/mac68k/INSTALL.mac68k
<li>	CD4:3.1/hp300/INSTALL.hp300
</ul>

<hr>

<p>
La siguiente informaci&oacute;n servir&aacute; para una r&aacute;pida
instalaci&oacute;n a aquellos usuarios que est&eacute;n familiarizados
con OpenBSD y con el uso de la orden <kbd>disklabel -E</kbd>.  Si le
resulta confusa la instalaci&oacute;n de OpenBSD, lea el fichero
INSTALL.* correspondiente a su plataforma.

<p>
<h3><font color="#e00000">OpenBSD/i386:</font></h3>
<ul>

<p>
Juegue con las opciones de su BIOS para activar el arranque desde el CD.
La versi&oacute;n final de OpenBSD/i386 se encuentra en el primer CD.
Si su BIOS no dispone de soporte para el arranque desde el CD,
tendr&aacute; que crear un disquete de arranque para iniciar el proceso
de instalaci&oacute;n.  Para crear un disquete de arranque, vuelque la
imagen que encontrar&aacute; en <em>3.1/i386/floppy31.fs</em>, en el
primer CD, a un disquete y arranque el sistema desde la disquetera.

<p>
O use la imagen <em>3.1/i386/floppyB31.fs</em> del primer CD si necesita
mayor soporte de controladores scsi;  o la imagen
<em>3.1/i386/floppyC31.fs</em> del primer CD si necesita m&aacute;s
soporte para port&aacute;tiles.

<p>
Si va a usar un sistema de arranque dual de OpenBSD con otro sistema
operativo, tendr&aacute; que leer el documento INSTALL.i386 incluido en
el CD.

<p>
Para crear un disquete de arranque desde MS-DOS, use el programa
<em>rawrite</em> que encontrar&aacute; en el directorio
<em>3.1/tools/rawrite.exe</em> del primer CD.  Para crear el disquete de
arranque desde un sistema operativo Unix, use la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">
dd(1)</a>.  El siguiente ejemplo ilustra el uso de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">
dd(1)</a>, en donde <em>dispositivo</em> podr&iacute;a ser
&quot;floppy&quot;, &quot;rfd0c&quot;, o &quot;rfd0a&quot;, y
<em>fichero</em> la imagen de arranque que vaya a volcar al disquete.

<ul><pre>
# <strong>dd if=&lt;fichero&gt; of=/dev/&lt;dispositivo&gt; bs=32k</strong>
</pre></ul>

<p>
Aseg&uacute;rese de usar disquetes correctamente formateados, SIN
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
toda probabilidad.  Puede obtener m&aacute;s informaci&oacute;n sobre
c&oacute;mo crear un disquete de arranque e instalar OpenBSD/i386 desde
&eacute;ste en la <a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1
de las preguntas frecuentes</a>.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/alpha:</font></h3>
<ul>

<p>
Desde el punto SRM, invoque la orden
<em>boot -fi 3.1/alpha/bsd.rd dka6</em>, en donde <em>dka6</em> es una
abreviaci&oacute;n del nombre del dispositivo de CDROM (puede
comprobarlo con <kbd>show dev</kbd>).

<p>
Si no puede arrancar desde el CD, vuelque la imagen
<em>3.1/alpha/floppy31.fs</em> o la imagen
<em>3.1/alpha/floppyB31.fs</em> (dependiendo de su m&aacute;quina) a un
disquete, y ejecute la orden <kbd>boot dva0</kbd>.  Lea el fichero
INSTALL.alpha para m&aacute;s detalles.

<p>
Aseg&uacute;rese de usar un disquete correctamente formateado, SIN
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
toda seguridad.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/macppc:</font></h3>
<ul>

<p>
Introduzca el segundo CD en el dispositivo del CDROM e inicie el equipo
mientras mantiene presionada la tecla <em>C</em> hasta que se encienda
la pantalla y muestre la l&iacute;nea <em>OpenBSD/macppc boot</em>.

<p>
De forma alternativa, desde el punto de Open Firmware, introduzca la
orden <kbd>boot cd:,ofwboot /3.1/macppc/bsd.rd</kbd>
</ul>

<p>
<h3><font color="#e00000">OpenBSD/hp300:</font></h3>
<ul>

<p>
Introduzca el cuarto CD en el dispositivo del CDROM y pulse la barra de
espacio durante la autocomprobaci&oacute;n del encendido.  Introduzca la
elecci&oacute;n de arranque que corresponda a <em>SYS_CDBOOT</em>.

<p>
De forma alternativa puede iniciar por red siguiendo las instrucciones
en INSTALL.hp300.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/amiga:</font></h3>
<ul>

<p>
Cree particiones para BSD de acuerdo con la secci&oacute;n de
INSTALL.amiga que trata sobre la preparaci&oacute;n.  Monte el cuarto CD
en AmigaOS como el dispositivo <em>CD0</em>;  a continuaci&oacute;n,
ejecute la siguiente orden CLI:
<kbd>CD0:3.1/amiga/utils/loadbsd CD0:3.1/amiga/bsd.rd</kbd>.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/mac68k:</font></h3>
<ul>

<p>
Inicie MacOS como de costumbre y particione su disco con las
configuraciones de A/UX apropiadas.  Extraiga las utilidades Macside
desde el directorio <em>3.1/mac68k/utils</em> del cuarto CD y
c&oacute;pielas en el disco duro.  Ejecute <kbd>Mkfs</kbd> para crear
los sistemas de archivos en las particiones de A/UX que acaba de crear.
A continuaci&oacute;n use el BSD/Mac68k Installer para copiar todos los
archivos del directorio <em>3.1/mac68k/</em> del cuarto CD a sus
particiones.  Ahora ya est&aacute; preparado para configurar el
BSD/Mac68k Booter con la ubicaci&oacute;n de su n&uacute;cleo e iniciar
el sistema.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/mvme68k:</font></h3>
<ul>

<p>
Puede crear una cinta de instalaci&oacute;n con arranque o arrancar
desde la red.<br>
El arranque por red requiere una versi&oacute;n de MVME68K BUG con
soporte para las &oacute;rdenes de depurado <kbd>NIOT</kbd> y
<kbd>NBO</kbd>.  El fichero INSTALL.mvme68k contiene instrucciones
m&aacute;s detalladas.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/vax:</font></h3>
<ul>

<p>
Arranque desde una red local mediante <em>mopbooting</em> tal y como se
describe en INSTALL.vax.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/sparc:</font></h3>
<ul>

<p>
La versi&oacute;n 3.1 de OpenBSD/sparc se encuentra en el tercer CD.
Para arrancar desde este CD puede usar una de las dos &oacute;rdenes que
aparecen a continuaci&oacute;n, dependiendo de la versi&oacute;n de su
ROM.

<ul>
<pre>
&gt; <strong>boot cdrom 3.1/sparc/bsd.rd</strong>
&oacute;
&gt; <strong>b sd(0,6,0)3.1/sparc/bsd.rd</strong>
</pre>
</ul>

<p>
Si su sparc no dispone de un dispositivo de CD puede, de forma
alternativa, arrancar desde un disquete.  Para ello tendr&aacute; que
volcar la imagen <em>3.1/sparc/floppy31.fs</em> del segundo CD a un
disquete.  Para m&aacute;s informaci&oacute;n lea la
<a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1</a> de las
preguntas frecuentes.  Para arrancar desde el disquete use una de las
dos &oacute;rdenes que aparecen a continuaci&oacute;n, dependiendo de la
versi&oacute;n de su ROM.

<ul>
<pre>
&gt; <strong>boot floppy</strong>
&oacute;
&gt; <strong>boot fd()</strong>
</pre>
</ul>

<p>
Aseg&uacute;rese de usar un disquete correctamente formateado SIN
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
total seguridad.

<p>
Si su sparc no dispone de dispositivo de disquete ni de CD, puede puede
configurar una cinta de arranque o instalarlo por red, como se explica
en el fichero INSTALL.sparc.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/sparc64:</font></h3>
<ul>

<p>
Introduzca el tercer CD en el dispositivo de CDROM y ejecute la orden
<kbd>boot cdrom</kbd>.

<p>
Si esto no funciona, o si no dispone de un dispositivo de CDROM, vuelque
la imagen <em>3.1/sparc64/floppy31.fs</em> a un disquete y arranque
desde &eacute;ste mediante la orden <kbd>boot floppy</kbd>.<br>
Aseg&uacute;rese de usar un disquete correctamente formateado SIN BLOQUE
ERR&Oacute;NEOS o la instalaci&oacute;n fallar&aacute; con casi toda
seguridad.

<p>
Tambi&eacute;n puede volcar la imagen <em>3.1/sparc/miniroot31.fs</em>
del tercer CD a la partici&oacute;n de memoria de intercambio en el
disco, y arrancar con la orden <kbd>boot disk:b</kbd>.

<p>
Si ninguno de los m&eacute;todos anteriores funciona, puede arrancar por
red como se describe en INSTALL.sparc64.
</ul>

<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>
<ul>

<p>
<em>src.tar.gz</em> contiene un archivo con el c&oacute;digo fuente
necesario para empezar con <em>/usr/src</em>.  Este archivo contiene
todo lo necesario a excepci&oacute;n del c&oacute;digo fuente del
n&uacute;cleo del sistema, que se encuentra en otro archivo.  Para
extraerlo:

<p>
<ul>
<pre>
# <strong>mkdir -p /usr/src</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/src.tar.gz</strong>
</pre>
</ul>

<p>
<em>srcsys.tar.gz</em> contiene un archivo con el c&oacute;digo fuente
para empezar con <em>/usr/src/sys</em>.  Este archivo contiene todo el
c&oacute;digo fuente del n&uacute;cleo del sistema necesario para
recompilar n&uacute;cleos.  Para extraerlo:

<p>
<ul>
<pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/srcsys.tar.gz</strong>
</pre>
</ul>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del repositorio de CVS.
Mediante el uso de estos &aacute;rboles es posible obtener una base
desde la que empezar a usar los servidores de cvs an&oacute;nimo, tal y
como se describe en
<a href="anoncvs.html">http://www.OpenBSD.org/es/anoncvs.html</a>.  El
uso de estos archivos permite un inicio m&aacute;s r&aacute;pido para la
actualizaci&oacute;n del &aacute;rbol de CVS de lo que supondr&iacute;a
bajarse todo el &aacute;rbol de fuentes de OpenBSD completo.

<p>
</ul>
<a name="ports"></a>
<hr>
<p>
<h3><font color="#0000e0">El &aacute;rbol de portes</font></h3>

<p>
Tambi&eacute;n se incluye un &aacute;rbol de portes.  Para extraerlo:

<p>
<ul>
<pre>
# <strong>cd /usr</strong>
# <strong>tar xvfz /tmp/ports.tar.gz</strong>
# <strong>cd ports</strong>
</pre>
</ul>

<p>
El subdirectorio <em>ports/</em> ha sido extra&iacute;do directamente
desde el &aacute;rbol de portes de OpenBSD.  Si todav&iacute;a no sabe
qu&eacute; son los portes, lea
<a href="ports.html">http://www.OpenBSD.org/es/ports.html</a>.  Esta
secci&oacute;n no es un manual de uso de los portes, sino m&aacute;s
bien una serie de apuntes con el prop&oacute;sito de ayudar al usuario a
comenzar a usar el sistema de portes de OpenBSD.

<p>
Es cierto que el sistema de portes de OpenBSD no est&aacute; completo.
Y probablemente nunca lo estar&aacute;.  Sin embargo, est&aacute;
creciendo continuamente y se estabiliza cada vez m&aacute;s.  Casi todos
los portes que se incluyen en el lanzamiento de esta versi&oacute;n
final deber&iacute;an compilarse e instalarse sin problemas en la
mayor&iacute;a de arquitecturas (por ejemplo, hay m&aacute;s de 1500
paquetes que se compilan y se instalan en i386).

<p>
El directorio <em>ports/</em> es una r&eacute;plica de nuestro
&aacute;rbol de portes del CVS (lea la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=1&manpath=OpenBSD+Current&arch=i386&format=html">cvs(1)</a>
si no sabe qu&eacute; es CVS).  Del mismo como que con nuestro
&aacute;rbol completo de fuentes del sistema, nuestro &aacute;rbol de
portes est&aacute; disponible mediante cvs an&oacute;nimo.  As&iacute;
pues, para mantener su sistema de portes actualizado con el de CVS, debe
tener un &aacute;rbol de portes, <em>ports/</em>, disponible en un medio
accesible con permisos para lectura y escritura, y actualizarlo con una
orden como:

<p>
<ul>
<pre>
# <strong>cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd -rOPENBSD_3_1</strong>
</pre>
</ul>

<p>
(y por supuesto, debe substituir los nombres del directorio local y del
servidor remoto del ejemplo con los de la ubicaci&oacute;n de su
colecci&oacute;n de portes en el sistema y con un servidor de cvs
an&oacute;nimo cercano)

<p>
N&oacute;tese que la mayor&iacute;a de los portes se encuentran
disponibles mediante ftp como paquetes precompilados.  Si surgiera
alg&uacute;n problema, se actualizar&iacute;an los paquetes de la
versi&oacute;n 3.1.

<p>
Si tiene inter&eacute;s en que se a&ntilde;ada alg&uacute;n porte, o si
quiere ayudar, o si simplemente necesita m&aacute;s informaci&oacute;n,
la lista ports@openbsd.org es un buen sitio.

<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [ OpenBSD: 31.html,v 1.15 ]<br>
$Translation: 31.html,v 1.13 2004/08/21 02:26:37 santana Exp $<br>
$OpenBSD: 31.html,v 1.13 2004/08/21 11:43:46 jufi Exp $
</small>

</body>
</html>
