<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n 3.2 de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="OpenBSD 3.2">
<meta name="keywords" content="openbsd,principal">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#24248e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/MrPond.gif"><img align="left" width="255" height="323" hspace="24" src="../images/MrPond.gif" alt="MrPond.gif"></a>
<h2><font color="#0000e0">Versi&oacute;n 3.2 de OpenBSD:</font></h2>
<p>

Fecha de lanzamiento: 1 de noviembre de 2002<br>
Copyright 1997-2002, Theo de Raadt.<br>
<font color="#e00000">ISBN 0-9731791-0-4</font>
<p>

<a href="#new">Novedades</a><br>
<a href="#install">Breviario de instalaci&oacute;n</a><br>
<a href="#ports">Utilizaci&oacute;n del &aacute;rbol de portes</a><br>
<a href="orders.html">C&oacute;mo obtener los CD</a><br>

<p>
<h3><font color="#0000e0">
Para obtener los archivos de esta versi&oacute;n:
<ul>
<li>Realice un pedido de los CD a trav&eacute;s de nuestro
<a href="orders.html">sistema de pedidos</a>.
<li>Lea la informaci&oacute;n contenida en <a href="ftp.html">la
p&aacute;gina de FTP</a> que incluye un listado de los sitios que
mantienen r&eacute;plicas del servidor de FTP de OpenBSD.
<li>Vaya al directorio <font color="#e00000">pub/OpenBSD/3.2/</font> en
cualquiera de las r&eacute;plicas de FTP.
<li>D&eacute; un breve repaso al resto de esta p&aacute;gina.
<li>D&eacute; un vistazo a la <a href="errata32.html">p&aacute;gina de
erratas para 3.2</a> con el fin de obtener una lista de errores y
soluciones.
<li>Mire este <a href="../plus32.html">informe detallado sobre
cambios</a> entre las versiones 3.1 y 3.2.
</ul>
</font></h3>
<br clear="all">
<br>
<p>

<strong>Nota:</strong>  Todos los derechos de autor y cr&eacute;ditos se
pueden ver en los ficheros que se encuentran en los respectivos archivos
de fuentes src.tar.gz, srcsys.tar.gz, XF4.tar.gz, o en los ficheros
individuales obtenidos mediante el archivo ports.tar.gz.  Los ficheros
de la distribuci&oacute;n utilizados para crear los paquetes del archivo
ports.tar.gz no est&aacute;n incluidos en el CDROM debido a la falta de
espacio.
<p>

<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Novedades</font></h3>
<p>
&Eacute;sta es una lista parcial de las nuevas funcionalidades y
sistemas incluidas en OpenBSD 3.2.  Puede ver una lista m&aacute;s
detallada en el <a href="../plus32.html">tabl&oacute;n de cambios</a>
entre 3.1 y 3.2.
<p>

<ul>
<li><a href="http://www.OpenSSH.com/es">OpenSSH</a> (con soporte para
los protocolos SSH1 y SSH2), est&aacute; ahora en su versi&oacute; 3.5.
La separaci&oacute;n de privilegios ahora viene activada de forma
predeterminada para mayor seguridad.
<p>

<li>Pila no ejecutable en i386, sparc, sparc64, alpha y powerpc.  Datos
no-exec y bss en sparc, sparc64 y alpha.  Con esto se evita que algunas
clases de posibles desbordamientos de memoria puedan ser
&laquo;explotables&raquo; en el futuro.
<p>

<li>
Apache se ejecuta chroot por definici&oacute;n.  Para desactivarlo,
v&eacute;ase la nueva opci&oacute;n <b>-u</b>.
<p>

<li>
Una reducci&oacute;n de binarios <em>setuid</em> muy significativa.
Muchos de los binarios que todav&iacute;a retienen el <em>setuid</em> se
han modificado para que las operaciones que requieran el uso de
privilegios del superusuario <em>root</em> se realicen antes, y que
inmediatamente despu&eacute;s se revoque este privilegio.
<p>

<li>
El soporte para componentes de cifrado asim&eacute;trico y
sim&eacute;trico ahora viene activado por definici&oacute;n, si se tiene
alguno de estos dispositivos en la m&aacute;quina.
<p>

<li>
Como es habitual, m&aacute;s mejoras en la documentaci&oacute;n, sobre
todo en las p&aacute;ginas del manual y las preguntas frecuentes.  Una
gran parte de las p&aacute;ginas en Internet est&aacute;n disponibles en
varios idiomas.
<p>

<li>
Una colecci&oacute;n de portes m&aacute;s completa y mejor verificada.
La cantidad de portes <em>setuid/setgid</em> tambi&eacute;n se ha
reducido bastante.  Muchos de los portes <em>setuid</em> que quedan se
han modificado para que los privilegios sean revocados lo antes posible.
<p>

<li>
M&aacute;s de 1.800 paquetes precompilados y verificados.
<p>

<li>
Mejor soporte de v&iacute;deo y X11 para las plataformas
<a href="sparc.html">OpenBSD/sparc</a>,
<a href="sparc64.html">OpenBSD/sparc64</a> y
<a href="alpha.html">OpenBSD/alpha</a>.
<p>

<li>
Muchas mejoras generales y, en particular, de estabilidad en nuestro
filtro de paquetes,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&amp;sektion=4">
pf</a>, que incluye:
<ul>
<li>nueva clave <em>antispoof</em>:  la detecc&iacute;on de
<em>spoofing</em> de forma f&aacute;cil
<li>un lenguaje en el fichero de reglas mucho m&aacute;s simple
<li>capacidades de filtrado extendidas
<li>entradas en la tabla de control del estado una por regla
<li>soporte de expansi&oacute;n de interfaz din&aacute;mico;  ya no es
necesario volver a cargar los grupos de reglas en los cambio de IP.
</ul>
<p>

<li>Una nueva herramienta,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=systrace&amp;sektion=4">systrace</a>,
para el control en detalle del comportamiento de las aplicaciones y sus
derechos a nivel de llamadas al sistema.
<p>

<li>El sistema incluye los siguientes componentes principales
provenientes de terceras partes:
<p>
<ul>
<li>XFree86 4.2.1 (y i386 tambi&eacute;n tiene servidores de 3.3.X,
dando as&iacute; soporte para todos los <em>chipset</em>)
<li>gcc 2.95.3 (+ parches)
<li>perl 5.6.1 (+ parches)
<li>Apache 1.3.26, mod_ssl 2.8.10, soporte DSO
<li>OpenSSL 0.9.7beta3 (+ parches)
<li>groff 1.15
<li>sendmail 8.12.6
<li>lynx 2.8.2rel.1 con soporte a&ntilde;adido para HTTPS
<li>sudo 1.6.6
<li>ncurses 5.2
<li>&Uacute;ltima versi&oacute;n de KAME IPv6
<li>KTH Kerberos 1.0.8
<li>Heimdal 0.4e (+ parches)
<li>OpenSSH 3.5
</ul>
<p>

<li>Muchas mejoras de seguridad y fiabilidad del sistema (v&eacute;ase
la letra en rojo del <a href="../plus32.html">tabl&oacute;n de cambios
completo</a>).
<p>
</ul>

<a name="install"></a>
<hr>
<p>
<h3><font color="#0000e0">Breviario de instalaci&oacute;n</font></h3>
<p>
Lo que viene a continuaci&oacute;n son las instrucciones de
instalaci&oacute;n que se encuentran en la car&aacute;tula del CDROM.
Las instrucciones para una instalaci&oacute;n mediante FTP (o cualquier
otra alternativa de instalaci&oacute;n) son muy parecidas;  las
instrucciones del CDROM se dejan intactas con el fin de mostrar lo
f&aacute;cil que es instalar con los CD en lugar de otro modo.
<p>

<hr>
Por favor, lea los siguiente ficheros que encontrar&aacute; repartidos
entre los tres CD, y que contienen un detallada explicaci&oacute;n sobre
c&oacute;mo instalar OpenBSD 3.2 en su m&aacute;quina:
<p>
<ul>
<li>	CD1:3.2/i386/INSTALL.i386
<li>	CD1:3.2/alpha/INSTALL.alpha
<p>
<li>	CD2:3.2/macppc/INSTALL.macppc
<li>	CD2:3.2/vax/INSTALL.vax
<p>
<li>	CD3:3.2/sparc/INSTALL.sparc
<li>	CD3:3.2/sparc64/INSTALL.sparc64
</ul>
<hr>

<p>
La siguiente informaci&oacute;n servir&aacute; para una r&aacute;pida
instalaci&oacute;n a aquellos usuarios que est&eacute;n familiarizados
con OpenBSD y con el uso de la orden <kbd>disklabel -E</kbd>.  Si le
resulta confusa la instalaci&oacute;n de OpenBSD, lea el fichero
INSTALL.* correspondiente a su plataforma.
<p>

<p>
<h3><font color="#e00000">OpenBSD/i386:</font></h3>
<ul>
Juegue con las opciones de su BIOS para activar el arranque desde el
CD1.  La versi&oacute;n final de OpenBSD/i386 se encuentra en el primer
CD.  Si su BIOS no dispone de soporte para el arranque desde el CD,
tendr&aacute; que crear un disquete de arranque para iniciar el proceso
de instalaci&oacute;n.  Para crear un disquete de arranque, vuelque la
imagen que encontrar&aacute; en <em>3.2/i386/floppy32.fs</em>, en el
primer CD, a un disquete y arranque el sistema desde la disquetera.

<p>
O use la imagen <em>3.2/i386/floppyB32.fs</em> del primer CD si necesita
mayor soporte de controladores scsi;  o la imagen
<em>3.2/i386/floppyC32.fs</em> del primer CD si necesita m&aacute;s
soporte para port&aacute;tiles.

<p>
Si va a usar un sistema de arranque dual de OpenBSD con otro sistema
operativo, tendr&aacute; que leer el documento INSTALL.i386 incluido en
el CD.

<p>
Para crear un disquete de arranque desde MS-DOS, use el programa
<em>rawrite</em> que encontrar&aacute; en el directorio
<em>3.2/tools/rawrite.exe</em> del primer CD.  Para crear el disquete de
arranque desde un sistema operativo Unix, use la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&amp;sektion=1">
dd(1)</a>.  El siguiente ejemplo ilustra el uso de 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&amp;sektion=1">
dd(1)</a>, en donde <em>dispositivo</em> podr&iacute;a ser
&quot;floppy&quot;, &quot;rfd0c&quot;, o &quot;rfd0a&quot;, y
<em>fichero</em> la imagen de arranque que vaya a volcar al disquete.

<ul><pre>
# <strong>dd if=&lt;fichero&gt; of=/dev/&lt;dispositivo&gt; bs=32k</strong>
</pre></ul>

<p>
Aseg&uacute;rese de usar disquetes correctamente formateados,
SIN BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n
fallar&aacute; con casi toda probabilidad.  Puede obtener
m&aacute;s informaci&oacute;n sobre c&oacute;mo crear un
disquete de arranque e instalar OpenBSD/i386 desde &eacute;ste
en la <a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1 de
las preguntas frecuentes</a>.
</ul>

<p>
<h3><font color="#e00000">OpenBSD/alpha:</font></h3>
<ul>
Desde el punto SRM, invoque la orden <em>boot -fi 3.2/alpha/bsd.rd
dka6</em>, en donde <em>dka6</em> es una abreviaci&oacute;n del nombre
del dispositivo de CDROM (puede comprobarlo con <kbd>show dev</kbd>).

<p>
Si no puede arrancar desde el CD, vuelque la imagen del CD1
<em>3.2/alpha/floppy32.fs</em> o la imagen
<em>3.2/alpha/floppyB32.fs</em> (dependiendo de su m&aacute;quina) a un
disquete, y ejecute la orden <kbd>boot dva0</kbd>.  Lea el fichero
INSTALL.alpha para m&aacute;s detalles.

<p>
Aseg&uacute;rese de usar un disquete correctamente formateado, SIN
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
toda seguridad.
</ul>


<p>
<h3><font color="#e00000">OpenBSD/macppc:</font></h3>
<ul>
Introduzca el segundo CD en el dispositivo del CDROM e inicie el equipo
mientras mantiene presionada la tecla <em>C</em> hasta que se encienda
la pantalla y muestre la l&iacute;nea <em>OpenBSD/macppc boot</em>.

<p>
De forma alternativa, desde el punto de Open Firmware, introduzca la
orden <kbd>boot cd:,ofwboot /3.2/macppc/bsd.rd</kbd>
</ul>


<p>
<h3><font color="#e00000">OpenBSD/vax:</font></h3>
<ul>
Arranque desde una red local mediante <em>mopbooting</em> tal y como se
describe en INSTALL.vax.
</ul>


<p>
<h3><font color="#e00000">OpenBSD/sparc:</font></h3>
<ul>
La versi&oacute;n 3.2 de OpenBSD/sparc se encuentra en el tercer CD.
Para arrancar desde este CD puede usar una de las dos &oacute;rdenes que
aparecen a continuaci&oacute;n, dependiendo de la versi&oacute;n de su
ROM.

<ul>
<pre>
&gt; <strong>boot cdrom 3.2/sparc/bsd.rd</strong>
&oacute;
&gt; <strong>b sd(0,6,0)3.2/sparc/bsd.rd</strong>
</pre>
</ul>

<p>
Si su sparc no dispone de un dispositivo de CD puede, de forma
alternativa, arrancar desde un disquete.  Para ello tendr&aacute; que
volcar la imagen <em>3.2/sparc/floppy32.fs</em> del tercer CD a un
disquete.  Para m&aacute;s informaci&oacute;n lea la
<a href="../faq/es/faq4.html#4.1">secci&oacute;n 4.1</a> de las
preguntas frecuentes.  Para arrancar desde el disquete use una de las
dos &oacute;rdenes que aparecen a continuaci&oacute;n, dependiendo de la
versi&oacute;n de su ROM.

<ul>
<pre>
&gt; <strong>boot floppy</strong>
&oacute;
&gt; <strong>boot fd()</strong>
</pre>
</ul>

<p>
Aseg&uacute;rese de usar un disquete correctamente formateado SIN
BLOQUES ERR&Oacute;NEOS, o la instalaci&oacute;n fallar&aacute; con casi
total seguridad.

<p>
Si su sparc no dispone de dispositivo de disquete ni de CD, puede puede
configurar una cinta de arranque o instalarlo por red, como se explica
en el fichero INSTALL.sparc.
</ul>


<p>
<h3><font color="#e00000">OpenBSD/sparc64:</font></h3>
<ul>
Introduzca el tercer CD en el dispositivo de CDROM y ejecute la orden
<kbd>boot cdrom</kbd>.

<p>
Si esto no funciona, o si no dispone de un dispositivo de CDROM, vuelque
la imagen <em>3.2/sparc64/floppy32.fs</em> del tercer CD a un disquete y
arranque desde &eacute;ste mediante la orden <kbd>boot floppy</kbd>.<br>
Aseg&uacute;rese de usar un disquete correctamente formateado SIN BLOQUE
ERR&Oacute;NEOS o la instalaci&oacute;n fallar&aacute; con casi toda
seguridad.

<p>
Tambi&eacute;n puede volcar la imagen <em>3.2/sparc/miniroot32.fs</em>
del tercer CD a la partici&oacute;n de memoria de intercambio en el
disco, y arrancar con la orden <kbd>boot disk:b</kbd>.

<p>
Si ninguno de los m&eacute;todos anteriores funciona, puede arrancar por
red como se describe en INSTALL.sparc64.
</ul>


<p>
<h3><font color="#e00000">Notas sobre el c&oacute;digo
fuente:</font></h3>
<ul>
<em>src.tar.gz</em> contiene un archivo con el c&oacute;digo fuente
necesario para empezar con <em>/usr/src</em>.  Este archivo contiene
todo lo necesario a excepci&oacute;n del c&oacute;digo fuente del
n&uacute;cleo del sistema, que se encuentra en otro archivo.  Para
extraerlo:

<p>
<ul>
<pre>
# <strong>mkdir -p /usr/src</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/src.tar.gz</strong>
</pre>
</ul>

<p>
<em>srcsys.tar.gz</em> contiene un archivo con el c&oacute;digo fuente
para empezar con <em>/usr/src/sys</em>.  Este archivo contiene todo el
c&oacute;digo fuente del n&uacute;cleo del sistema necesario para
recompilar n&uacute;cleos.  Para extraerlo:

<p>
<ul>
<pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/srcsys.tar.gz</strong>
</pre>
</ul>

<p>
Estos dos &aacute;rboles est&aacute;n sacados del repositorio de CVS.
Mediante el uso de estos &aacute;rboles es posible obtener una base
desde la que empezar a usar los servidores de cvs an&oacute;nimo, tal y
como se describe en
<a href="anoncvs.html">http://www.OpenBSD.org/es/anoncvs.html</a>.  El
uso de estos archivos permite un inicio m&aacute;s r&aacute;pido para la
actualizaci&oacute;n del &aacute;rbol de CVS de lo que supondr&iacute;a
bajarse todo el &aacute;rbol de fuentes de OpenBSD completo.


<p>
</ul>
<a name="ports"></a>
<hr>
<p>
<h3><font color="#0000e0">El &aacute;rbol de portes</font></h3>

<p>
Tambi&eacute;n se incluye un &aacute;rbol de portes.  Para extraerlo:

<p>
<ul>
<pre>
# <strong>cd /usr</strong>
# <strong>tar xvfz /tmp/ports.tar.gz</strong>
# <strong>cd ports</strong>
</pre>
</ul>

<p>
El subdirectorio <em>ports/</em> ha sido extra&iacute;do directamente
desde el &aacute;rbol de portes de OpenBSD.  Si todav&iacute;a no sabe
qu&eacute; son los portes, lea
<a href="ports.html">http://www.OpenBSD.org/es/ports.html</a>.  Esta
secci&oacute;n no es un manual de uso de los portes, sino m&aacute;s
bien una serie de apuntes con el prop&oacute;sito de ayudar al usuario a
comenzar a usar el sistema de portes de OpenBSD.

<p>
Es cierto que el sistema de portes de OpenBSD no est&aacute; completo.
Y probablemente nunca lo estar&aacute;.  Sin embargo, est&aacute;
creciendo continuamente y se estabiliza cada vez m&aacute;s.  Casi todos
los portes que se incluyen en el lanzamiento de esta versi&oacute;n
final deber&iacute;an compilarse e instalarse sin problemas en la
mayor&iacute;a de arquitecturas (por ejemplo, hay m&aacute;s de 1500
paquetes que se compilan y se instalan en i386).


<p>
El directorio <em>ports/</em> es una r&eacute;plica de nuestro
&aacute;rbol de portes del CVS (lea la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1">
cvs(1)</a> si no sabe qu&eacute; es CVS).  Del mismo como que con
nuestro &aacute;rbol completo de fuentes del sistema, nuestro
&aacute;rbol de portes est&aacute; disponible mediante cvs
an&oacute;nimo.  As&iacute; pues, para mantener su sistema de portes
actualizado con el de CVS, debe tener un &aacute;rbol de portes,
<em>ports/</em>, disponible en un medio accesible con permisos para
lectura y escritura, y actualizarlo con una orden como:

<p>
<ul>
<pre>
# <strong>cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd -rOPENBSD_3_2</strong>
</pre>
</ul>

<p>
(y por supuesto, debe substituir los nombres del directorio local y del
servidor remoto del ejemplo con los de la ubicaci&oacute;n de su
colecci&oacute;n de portes en el sistema y con un servidor de cvs
an&oacute;nimo cercano)

<p>
N&oacute;tese que la mayor&iacute;a de los portes se encuentran
disponibles mediante ftp como paquetes precompilados.  Si surgiera
alg&uacute;n problema, se actualizar&iacute;an los paquetes de la
versi&oacute;n 3.2.

<p>
Si tiene inter&eacute;s en que se a&ntilde;ada alg&uacute;n porte, o si
quiere ayudar, o si simplemente necesita m&aacute;s informaci&oacute;n,
la lista ports@openbsd.org es un buen sitio.


<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: 32.html,v 1.24 ]<br>
$Translation: 32.html,v 1.12 2004/08/24 14:59:39 santana Exp $<br>
$OpenBSD: 32.html,v 1.11 2004/08/24 16:46:58 jufi Exp $
</small>

</body>
</html>
