<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN//2.0">
<html>
<head>
<title>OpenBSD/alpha</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD/alpha page">
<meta name="keywords" content="openbsd,alpha">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2000 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<h2>OpenBSD/alpha</h2>

<hr>

<h3><font color="#0000e0"><strong>Cronolog&iacute;a y Estado
Actual:</strong></font></h3>

<p>
El porte de OpenBSD/alpha se comenz&oacute; a desarrollar en el verano
de 1.996, utilizando el c&oacute;digo del porte de NetBSD/alpha que
comenz&oacute; a desarrollar Chris Demetriou &lt;cgd@netbsd.org&gt; en
1.994.  Despu&eacute;s del desarrollo del porte original de OpenBSD,
algunos problemas con los derechos de autor impidieron que OpenBSD
pudiera llevar un seguimiento del c&oacute;digo de NetBSD.  A pesar de
esto, el trabajo sobre el porte para alpha continu&oacute; adelante y
se llevaron a cabo muchas correcciones.  Mientras hac&iacute;amos estas
correcciones NetBSD continuaba mejorando el porte para alpha, pero
nosotros no pod&iacute;amos hacer uso de estas mejoras.  Al cabo de un
tiempo, y debido a la falta de programadores y a la imposibilidad de
usar el c&oacute;digo de NetBSD, el soporte para componentes y
programas fue quedando obsoleto.  Esto hizo que las versiones 2.5 y 2.6
para alpha s&oacute;lo incluyeran en el n&uacute;cleo unos pocos
avances.  Como resultado de este estancamiento el porte para alpha no
se incluy&oacute; con el lanzamiento de la versi&oacute;n 2.7 de
OpenBSD.
</p>

<p>
Recientemente se ha despertado un gran inter&eacute;s en actualizar el
porte.  Esto, junto con el hecho de que NetBSD cambi&oacute; la
licencia sobre su c&oacute;digo alpha y que por lo tanto ya no existen
problemas con los derechos de autor, ha provocado que se lleve a cabo
un esfuerzo para reanimar el porte para alpha (para conocer los
detalles sobre porqu&eacute; no pod&iacute;amos hacer un seguimiento
continuado del c&oacute;digo de NetBSD, lea la p&aacute;gina sobre
nuestra <a href="policy.html">pol&iacute;tica</a>).
</p>

<p>
En la actualidad no existe ning&uacute;n mantenedor para el porte de
alpha.  Cualquier discusi&oacute;n t&eacute;cnica sobre el porte para
alpha debe dirigirse a 
<a href="mailto:alpha@openbsd.org">&lt;alpha@openbsd.org&gt;</a>.  Si
est&aacute; interesado en cualquier modo en el desarrollo del porte
para alpha, por favor env&iacute;e sus preguntas a esta
direcci&oacute;n.  Si est&aacute; interesado en el puesto de mantenedor
del porte para alpha, ayude un poco al proyecto y pres&eacute;ntese
para este puesto.
</p>


<h3><font color="#0000e0"><strong>Proyectos (sin
orden):</strong></font></h3>

<ul>
<li>Actualizar el n&uacute;cleo para alpha con el que tiene NetBSD.
<li>Bibliotecas compartidas.
<li>Bibliotecas compartidas de compat_osf1.
<li>bus_dma (hasta ahora s&oacute;lo parcialmente para buses cia y
    tsc).
</ul>


<h3><font color="#0000e0"><strong><i>Hardware</i> con
Soporte:</strong></font></h3>

<p>
Debido a los cambios que se est&aacute;n aconteciendo en el porte para
alpha, el <i>hardware</i> para el que existe soporte en la actualidad
est&aacute; en el aire.  Todo lo que podemos decir es que
todav&iacute;a existe soporte para los siguientes componentes, aunque
esto podr&iacute;a cambiar en cualquier momento.
</p>

<ul>
   <li><b>Serie DEC 3000/[3456789]00 con los siguientes
   perif&eacute;ricos:</b>
   <ul> 
     <li>Hardware que funciona:
     <ul>
        <li>Puertos serie integrados.
        <li>Ethernet LANCE integrado.
        <li>Chips SCSI integrados (53c[f]94)
	    (aunque es posible que no funcionen los dos al mismo
	    tiempo).
     </ul>
     <li>Puede funcionar pero no han sido probados:
     <ul>
        <li>Ranura opcional TurboChannel LANCE (PMAD-A).
     </ul>
   
     <li>*No* funcionan todav&iacute;a:
     <ul>
        <li>Frame buffers de cualquier tipo.
        <li>Otras placas opcionales TurboChannel.
        <li>El chip RDSI/Audio.
     </ul>
  </ul>
  
   <li><b>AlphaStation {200,250,255,400,500}, AXPpci,<br>
       Multia (aunque muchas Multias se han estropeado desde el
       principio o han desarrollado alg&uacute;n tipo de problema)<br>
       Sistemas que utilizan los siguientes perif&eacute;ricos:</b>
  <ul> 
     <li>Hardware que funciona:
     <ul>
        <li>NCR 53c810 SCSI (placa PCI o integrado).
        <li>Puertos serie ns16550 integrados.
        <li>Ethernet basada en DC21040 (placa PCI o integrada).
        <li>Placas ethernet PCI basadas en DC21140.
        <li>Puentes PCI-PCI basados en DC21050 
	    (aunque otros tipos de puentes PCI-PCI podr&iacute;an
	    funcionar).
        <li>Placas de v&iacute;deo PCI VGA.
        <li>Placas ISA VGA.
        <li>Placas de v&iacute;deo DEC ZLXp-E1
	    (basadas en DC21030-based, &quot;TGA&quot;).
        <li>Tarjetas ethernet PCI e ISA compatibles con NE2000.
	<li>Placas ethernet ISA SMC/WD 8003, 8013, y SMC
	    &quot;Elite16&quot;.
        <li>Tarjetas ethernet 3Com 3c503.
        <li>Tarjetas ethernet 3Com 3c5xx/3c9xx.
	<li>Tarjetas ethernet basadas en Lite-On PNIC (82c168, 82c169).
        <li>Teclado.
        <li>Ratones PS/2.
        <li>Controladoras IDE
	    (incluida la controladora IDE integrada de algunas
	    m&aacute;quinas).
        <li>Tarjetas Intel Etherexpress Pro/100B.
        <li>Tarjetas serie multipuerto ISA de Cyclades.
     </ul>
   
     <li>Pueden funcionar pero no han sido probados:
     <ul>
        <li>Puertos paralelos integrados.
        <li>Placas de puertos serie ISA de la familia ns16x50.
        <li>Placas serie multipuerto ISA ns16x50.
        <li>Otras placas SCSI NCR 53c8xx.
        <li>Las placas ISA controladoras SCSI Adaptec 152*.
     </ul>
   
     <li>*No* funciona todav&iacute;a:
     <ul>
        <li>Hardware de sonido 
	    (incluido Windows Sound System integrado en algunas
	    m&aacute;quinas).
        <li>Placas de v&iacute;deo PCI DEC ZLXp-E2 y ZLXp-E3.
        <li>La controladora SCSI integrada en la AlphaStation 600.
        <li>Placas PCI e ISA que no aparecen en la lista de arriba.
        <li>El controlador de la disquetera.
     </ul>
  </ul>
  
   <li><b>En este momento no existe soporte para ninguno de los
       siguientes sistemas:</b>
   <ul>
      <li>Sistemas DECpc AXP 150 systems (sistemas de tipo PC EISA-bus)
      <li>Sistemas &laquo;servidores&raquo; Alpha Server
	  (siempre que no sean la AlphaServer 400, que podr&iacute;a
	  ser una AlphaStation 400 disfrazada).
      <li>Sistemas Alpha Multiprocessor.
      <li>
      <li> EB164, PC164, PC164[LSR]X.
      <li>Sistemas Digital Personal Workstation (Miata).
      <li>Sistemas basados en el 21264.
      <li>Sistemas API (Alpha Processor, Inc.).
   </ul>
</ul>

<h3><font color="#0000e0"><strong><i>Snapshots:</i></strong></font></h3>

<p>
Mientras estemos intentando revivir el porte para alpha, las versiones
de prueba ser&aacute;n, como m&iacute;nimo, espor&aacute;dicas e
impredecibles.  Si est&aacute; interesado en ayudar, le animamos a que
se baje una de estas versiones (<i>&quot;snapshot&quot;</i>), lo
sincronice con <i>&quot;-current&quot;</i>, y a que haga pruebas.
</p>

<hr>
<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: alpha.html,v 1.48 2001/01/23 22:36:38 brad Exp ]<br>
$Translation: alpha.html,v 1.9 2001/02/19 21:23:26 horacio Exp $<br>
$OpenBSD: alpha.html,v 1.7 2001/02/20 12:57:45 jufi Exp $
</small>

</body>
</html>
