<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/alpha</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD/alpha page">
<meta name="keywords" content="openbsd,alpha">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<h2>OpenBSD/alpha</h2>

<hr>

<h3><font color="#0000e0"><strong>Cronolog&iacute;a y Estado
Actual:</strong></font></h3>

<p>
El porte para la arquitectura alpha vienen del porte de NetBSD/alpha,
escrito por Chris Demetriou &lt;cgd@netbsd.org&gt;.  Desafortunadamente
ya no es posible llevar un seguimiento desde cerca debido a que algunos
problemas con los derechos de autor nos lo impide;  vea nuestra
p&aacute;gina sobre <a href="policy.html">nuestra pol&iacute;tica</a>
si desea saber m&aacute;s detalles.  Nos hemos esforzado por mantenerlo
actualizado, lo que tambi&eacute;n incluye la localizaci&oacute;n y
soluci&oacute;n de muchos problemas con 64 bits en los directorios de
usuario.  Muchas de las mejoras que se mencionan m&aacute;s abajo no se
encuentran en NetBSD, as&iacute; que si quiere saber cu&aacute;les son
tendr&aacute; que investigarlo por s&iacute; mismo.

<p>
La raz&oacute;n para la existencia de este porte fue, en un principio,
la de poder ofrecer a los usuarios de alpha un sistema operativo
OpenBSD;  Dicho de otro modo, no se hizo ning&uacute;n tipo de esfuerzo
especial por desarrollar este porte en las partes dependientes de la
m&aacute;quina.  Lo m&aacute;s importante que se hizo fue asegurarse de
que todas las herramientas que se necesitaban para construir un sistema
completo, estuvieran incluidas en el &aacute;rbol y que fueran
actualizadas con los cambios distribuidos por Chris en un paquete
aparte de herramientas para alpha.

<p>
Hoy hay m&aacute;s desarrolladores que tienen m&aacute;quinas alpha y
que est&aacute;n mostrando un inter&eacute;s por un desarrollo
m&aacute;s activo del porte, pero todav&iacute;a hay muy poca actividad
en el desarrollo en s&iacute;.  Esto, hasta ahora, ha provocado:

<ul>
   <li>Un ataque a gran escala para reparar los problemas residuales de
       'long' vs 'int' en 64 bits, en todo el &aacute;rbol de fuentes
       de los directorios de usuario.  La mayor&iacute;a de
       &eacute;stos han sido ya reparados, y ahora rara vez se
       encuentran nuevos problemas en 64 bits.
   <li>Adaptaci&oacute;n del controlador ethernet if_ed.
   <li>Analizaci&oacute;n del MBR y etiquetado de disco en i386.
   <li>DDB (depurador del n&uacute;cleo)
   <li>Soporte IDE y ATAPI.
   <li>F&aacute;cil instalaci&oacute;n con disquete.
   <li>Reparado el controlador de VGA de la consola en la
       estaci&oacute;n de trabajo.  Tambi&eacute;n se le ha
       a&ntilde;adido &quot;stand-out&quot;.
</ul>

<h3><font color="#0000e0"><strong>Proyectos (sin
orden):</strong></font></h3>

<ul>
   <li>ISA DMA (permite el uso de muchos perif&eacute;ricos comunes
       para PC).
   <li>Soporte para la disquetera (requiere ISA DMA).
   <li>Formato ELF para ficheros objeto (permite bibliotecas
       compartidas).
   <li>Algunos arreglos en egcs para el Ramdisk.
</ul>

<p>
Hasta el momento, 
<a href="http://www.appli.se/niklas/">Niklas Hallqvist</a>
<a href="mailto:niklas@openbsd.org">&lt;niklas@openbsd.org&gt;</a> ha
intentado mantener el porte pero, a pesar de que m&aacute;s personas
tienen alpha, este porte se mantiene activo a duras penas.
</p>

<h3><font color="#0000e0"><strong>Hardware con
Soporte:</strong></font></h3>

<ul>
   <li><b>Serie DEC 3000/[3456789]00 con los siguientes
   perif&eacute;ricos:</b>
   <ul> 
     <li>Hardware que funciona:
     <ul>
        <li>Puertos serie integrados.
        <li>Ethernet LANCE integrado.
        <li>Chips SCSI integrados (53c[f]94)
	    (aunque es posible que no funcionen los dos al mismo
	    tiempo).
     </ul>
     <li>Puede funcionar pero no han sido probados:
     <ul>
        <li>Ranura opcional TurboChannel LANCE (PMAD-A).
     </ul>
   
     <li>*No* funcionan todav&iacute;a:
     <ul>
        <li>Frame buffers de cualquier tipo.
        <li>Otras placas opcionales TurboChannel.
        <li>El chip RDSI/Audio.
     </ul>
  </ul>
  
   <li><b>AlphaStation {200,250,255,400,500}, AXPpci,<br>
       Multia (aunque muchas Multias se han estropeado desde el
       principio o han desarrollado alg&uacute;n tipo de problema)<br>
       Sistemas que utilizan los siguientes perif&eacute;ricos:</b>
  <ul> 
     <li>Hardware que funciona:
     <ul>
        <li>NCR 53c810 SCSI (placa PCI o integrado).
        <li>Puertos serie ns16550 integrados.
        <li>Ethernet basada en DC21040 (placa PCI o integrada).
        <li>Placas ethernet PCI basadas en DC21140.
        <li>Puentes PCI-PCI basados en DC21050 
	    (aunque otros tipos de puentes PCI-PCI podr&iacute;an
	    funcionar).
        <li>Placas de v&iacute;deo PCI VGA.
        <li>Placas ISA VGA.
        <li>Placas de v&iacute;deo DEC ZLXp-E1
	    (basadas en DC21030-based, &quot;TGA&quot;).
        <li>Tarjetas ethernet PCI e ISA compatibles con NE2000.
	<li>Placas ethernet ISA SMC/WD 8003, 8013, y SMC
	    &quot;Elite16&quot;.
        <li>Tarjetas ethernet 3Com 3c503.
        <li>Tarjetas ethernet 3Com 3c5xx/3c9xx.
	<li>Tarjetas ethernet basadas en Lite-On PNIC (82c168, 82c169).
        <li>Teclado.
        <li>Ratones PS/2.
        <li>Controladoras IDE
	    (incluida la controladora IDE integrada de algunas
	    m&aacute;quinas).
        <li>Tarjetas Intel Etherexpress Pro/100B.
        <li>Tarjetas serie multipuerto ISA de Cyclades.
        <li>Tarjetas SCSI basadas en Adaptec 2940.
     </ul>
   
     <li>Pueden funcionar pero no han sido probados:
     <ul>
        <li>Puertos paralelos integrados.
        <li>Placas de puertos serie ISA de la familia ns16x50.
        <li>Placas serie multipuerto ISA ns16x50.
        <li>Otras placas SCSI NCR 53c8xx.
        <li>Las placas ISA controladoras SCSI Adaptec 152*.
     </ul>
   
     <li>*No* funciona todav&iacute;a:
     <ul>
        <li>Hardware de sonido 
	    (incluido Windows Sound System integrado en algunas
	    m&aacute;quinas).
        <li>Placas de v&iacute;deo PCI DEC ZLXp-E2 y ZLXp-E3.
        <li>La controladora SCSI integrada en la AlphaStation 600.
        <li>Placas PCI e ISA que no aparecen en la lista de arriba.
        <li>El controlador de la disquetera.
     </ul>
  </ul>
  
   <li><b>En este momento no existe soporte para ninguno de los
       siguientes sistemas:</b>
   <ul>
      <li>Sistemas DECpc AXP 150 systems (sistemas de tipo PC EISA-bus)
      <li>Sistemas &laquo;servidores&raquo; Alpha Server
	  (siempre que no sean la AlphaServer 400, que podr&iacute;a
	  ser una AlphaStation 400 disfrazada).
      <li>Sistemas &laquo;multiprocesadores&raquo; Alpha
          Multiprocessor.
   </ul>
</ul>

<h3><font color="#0000e0"><strong>Snapshots:</strong></font></h3>

<p>
OpenBSD/alpha vio su primera versi&oacute;n seria con OpenBSD 2.1, y
desde entonces es parte integral de las versiones de lanzamiento de
OpenBSD.  Entre versi&oacute;n y versi&oacute;n tambi&eacute;n salen
revisiones de prueba (&quot;snapshots&quot;) de vez en cuando.
</p>

<hr>
<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: alpha.html,v 1.44 2000/03/11 19:00:43 rohee Exp]<br>
$Translation: alpha.html,v 1.7 2000/06/02 19:47:16 horacio Exp $<br>
$OpenBSD: alpha.html,v 1.4 2000/06/02 22:46:36 wvdputte Exp $
</small>

</body>
</html>
