<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN//2.0">
<html>
<head>
<title>OpenBSD/alpha</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD/alpha page">
<meta name="keywords" content="openbsd,alpha">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2000 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<h2>OpenBSD/alpha</h2>

<hr>

<h3><font color="#0000e0"><strong>Cronolog&iacute;a y Estado
Actual:</strong></font></h3>

<p>
El porte OpenBSD/alpha empez&oacute; durante el verano de 1.996, usando
el c&oacute;digo del porte NetBSD/alpha que hab&iacute;a creado Chris
Demetriou &lt;cgd@netbsd.org&gt; en 1.994.  A partir de la
creaci&oacute;n del porte de OpenBSD, algunos problemas con los
derechos de autor impidieron que OpenBSD pudiera continuar un
seguimiento del porte de NetBSD.  A pesar de ello, se continu&oacute;
trabajando sobre el porte para alpha y se solucionaron muchos errores.
Mientras OpenBSD se dedicaba a solucionar estos errores NetBSD
segu&iacute;a mejorando el porte para alpha, pero desafortunadamente no
pud&iacute;amos utilizar estas mejoras.  Seg&uacute;n fue pasando el
tiempo, y debido a una carencia de programadores y a la imposibilidad
de usar el c&oacute;digo de NetBSD, el soporte para hardware y software
fue quedando obsoleto.  Esto hizo que las versiones 2.5 y 2.6 de alpha
contuvieran muy pocas mejoras en el n&uacute;cleo del sistema.  A
consecuencia de estos inconvenientes el porte para alpha no se
incluy&oacute; en la versi&oacute;n 2.7 de OpenBSD.
</p>

<p>
M&aacute;s recientemente se ha despertado un gran inter&eacute;s en
actualizar el porte.  Esto ha coincidido con el hecho de que NetBSD
cambi&oacute; la licencia para su c&oacute;digo alpha, de modo que ya
no existen problemas con los derechos de autor, y a consecuencia de
ello ha habido un esfuerzo para resucitar el porte para alpha (si
quiere conocer m&aacute;s detalles sobre porqu&eacute; no pudimos
llevar un seguimiento del c&oacute;digo de NetBSD, mire en la
p&aacute;gina sobre <a href="policy.html">nuestra pol&iacute;tica</a>).
</p>

<p>
En la actualidad no hay nadie que se encargue de mantener el porte para
alpha.  Cualquier debate de car&aacute;cter t&eacute;cnico sobre el
porte para alpha debe dirigirse a 
<a href="mailto:alpha@openbsd.org">&lt;alpha@openbsd.org&gt;</a>.  Si
est&aacute; interesado en el desarrollo del porte para alpha, por favor
env&iacute;e cualquier pregunta al respecto a esta direcci&oacute;n.
Si est&aacute; interesado en mantener el porte para alpha, ayude al
proyecto y pida el puesto de mantenedor.
</p>


<h3><font color="#0000e0"><strong>Proyectos (sin
orden):</strong></font></h3>

<ul>
   <li>Actualizar el n&uacute;cleo de alpha con el de NetBSD.
   <li>Nuevo binutils con soporte para el formato de ficheros objeto
       ELF (permite bibliotecas compartidas).
   <li>Nuevos bloques de arranque con soporte para ELF.
   <li>Actulizar compat_osf1.
</ul>


<h3><font color="#0000e0"><strong>Hardware con
Soporte:</strong></font></h3>

<p>
Debido a los cambios que est&aacute;n teniendo lugar en la actualidad
en el porte para alpha, el hardware con soporte est&aacute; sujeto a
cont&iacute;nuos cambios.  Por lo que sabemos, todav&iacute;a existe
soporte para el siguiente hardware, pero esto es algo que podr&iacute;a
cambiar en cualquier momento.
</p>

<ul>
   <li><b>Serie DEC 3000/[3456789]00 con los siguientes
   perif&eacute;ricos:</b>
   <ul> 
     <li>Hardware que funciona:
     <ul>
        <li>Puertos serie integrados.
        <li>Ethernet LANCE integrado.
        <li>Chips SCSI integrados (53c[f]94)
	    (aunque es posible que no funcionen los dos al mismo
	    tiempo).
     </ul>
     <li>Puede funcionar pero no han sido probados:
     <ul>
        <li>Ranura opcional TurboChannel LANCE (PMAD-A).
     </ul>
   
     <li>*No* funcionan todav&iacute;a:
     <ul>
        <li>Frame buffers de cualquier tipo.
        <li>Otras placas opcionales TurboChannel.
        <li>El chip RDSI/Audio.
     </ul>
  </ul>
  
   <li><b>AlphaStation {200,250,255,400,500}, AXPpci,<br>
       Multia (aunque muchas Multias se han estropeado desde el
       principio o han desarrollado alg&uacute;n tipo de problema)<br>
       Sistemas que utilizan los siguientes perif&eacute;ricos:</b>
  <ul> 
     <li>Hardware que funciona:
     <ul>
        <li>NCR 53c810 SCSI (placa PCI o integrado).
        <li>Puertos serie ns16550 integrados.
        <li>Ethernet basada en DC21040 (placa PCI o integrada).
        <li>Placas ethernet PCI basadas en DC21140.
        <li>Puentes PCI-PCI basados en DC21050 
	    (aunque otros tipos de puentes PCI-PCI podr&iacute;an
	    funcionar).
        <li>Placas de v&iacute;deo PCI VGA.
        <li>Placas ISA VGA.
        <li>Placas de v&iacute;deo DEC ZLXp-E1
	    (basadas en DC21030-based, &quot;TGA&quot;).
        <li>Tarjetas ethernet PCI e ISA compatibles con NE2000.
	<li>Placas ethernet ISA SMC/WD 8003, 8013, y SMC
	    &quot;Elite16&quot;.
        <li>Tarjetas ethernet 3Com 3c503.
        <li>Tarjetas ethernet 3Com 3c5xx/3c9xx.
	<li>Tarjetas ethernet basadas en Lite-On PNIC (82c168, 82c169).
        <li>Teclado.
        <li>Ratones PS/2.
        <li>Controladoras IDE
	    (incluida la controladora IDE integrada de algunas
	    m&aacute;quinas).
        <li>Tarjetas Intel Etherexpress Pro/100B.
        <li>Tarjetas serie multipuerto ISA de Cyclades.
     </ul>
   
     <li>Pueden funcionar pero no han sido probados:
     <ul>
        <li>Puertos paralelos integrados.
        <li>Placas de puertos serie ISA de la familia ns16x50.
        <li>Placas serie multipuerto ISA ns16x50.
        <li>Otras placas SCSI NCR 53c8xx.
        <li>Las placas ISA controladoras SCSI Adaptec 152*.
     </ul>
   
     <li>*No* funciona todav&iacute;a:
     <ul>
        <li>Hardware de sonido 
	    (incluido Windows Sound System integrado en algunas
	    m&aacute;quinas).
        <li>Placas de v&iacute;deo PCI DEC ZLXp-E2 y ZLXp-E3.
        <li>La controladora SCSI integrada en la AlphaStation 600.
        <li>Placas PCI e ISA que no aparecen en la lista de arriba.
        <li>El controlador de la disquetera.
     </ul>
  </ul>
  
   <li><b>En este momento no existe soporte para ninguno de los
       siguientes sistemas:</b>
   <ul>
      <li>Sistemas DECpc AXP 150 systems (sistemas de tipo PC EISA-bus)
      <li>Sistemas &laquo;servidores&raquo; Alpha Server
	  (siempre que no sean la AlphaServer 400, que podr&iacute;a
	  ser una AlphaStation 400 disfrazada).
      <li>Sistemas &laquo;multiprocesadores&raquo; alpha
          Multiprocessor.
      <li>EB164, PC164, PC164[LSR]X
      <li>Sistemas Digital Personal Workstation (Miata)
      <li>Sistemas basados en 21264
      <li>Sistemas API (Alpha Processor, Inc.)
   </ul>
</ul>

<h3><font color="#0000e0"><strong>Snapshots:</strong></font></h3>

<p>
Durante el tiempo que dure el proceso de actualizaci&oacute;n del porte
para alpha, los resultados en las versiones de prueba ser&aacute;n
impredecibles, y se lanzar&aacute;n espor&aacute;dicamente.  Si
est&aacute; interesado en ayudar, le animamos a que obtenga una
versi&oacute;n de prueba, la sincronice con -current e investigue.
</p>

<hr>
<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: alpha.html,v 1.45 2000/07/10 20:26:13 niklas Exp ]<br>
$Translation: alpha.html,v 1.7 2000/06/02 19:47:16 horacio Exp $<br>
$OpenBSD: alpha.html,v 1.5 2000/07/30 22:48:14 horacio Exp $
</small>

</body>
</html>
