<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/arc</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="documento">
<meta name="description" content="página principal de OpenBSD/arc">
<meta name="keywords" content="openbsd,arc">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2001 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<h2>OpenBSD/arc</h2>

<hr>
<h3><strong>Cronolog&iacute;a y Estado Actual:</strong></h3>

<p>
No est&aacute; muy claro c&oacute;mo empez&oacute; todo.  Parece ser
que el primer trabajo sobre esta plataforma lo llev&oacute; a cabo CMU
como parte de su proyecto Mach.  El hardware con el que empezaron
fueron estaciones de trabajo dec basadas en DEC R2000/R3000.  Este
c&oacute;digo lo utilizaron más tarde los grupos Sprite y BSD.  El
c&oacute;digo de 4.4BSD, conocido como porte `pmax', fue liberado y
puesto a disposici&oacute;n p&uacute;blica a mediados de 1.993.
M&aacute;s tarde fue fusionado en el &aacute;rbol de NetBSD por varias
personas, pero nunca lleg&oacute; a ser muy estable, fiable, ni
completo.  El porte ha tenido una gran variedad de problemas con las
herramientas de compilaci&oacute;n debidos a que el formato ejecutable
a.out es imperfecto para la arquitectura MIPS.

<p>
Per Fogelstr&ouml;m se familiariz&oacute; con el c&oacute;digo
despu&eacute;s de portarlo para una placa casera basada en IDT R3081.
A ra&iacute;z de portarlo para la placa MIPS R4400 Acer PICA, le
a&ntilde;adi&oacute; soporte para R4400.  Willowglen Singapore
adquiri&oacute; una segunda placa PICA para Theo de Raadt, para que
&eacute;ste pudiera mejorar el porte, a fin de que fuera usado como
sistema de desarrollo para un proyecto interno.  Desde entonces, Theo,
Per y otros han completado el porte.

<p>
La Acer PICA es una plataforma muerta.  Acer ya no fabrica esta
m&aacute;quina;  pero a&uacute;n peor, estas m&aacute;quinas son muy
escasas.  Pero la de Acer PICA fue s&oacute;lo una entre muchas otras
m&aacute;quinas similares, fabricadas por otras compa&ntilde;&iacute;as
como MIPS, Deskstation, NEC, y Olivetti.  Estas m&aacute;quinas se
conocieron como ARC, y se fabricaron de acuerdo con las
especificaciones de 
<a href="http://www.microsoft.com/hwdev/download/respec/riscspec.zip">Advanced RISC Computing</a>.
No es probable que se fabriquen nuevas m&aacute;quinas con BIOS ARC
para MIPS.  Microsoft anunci&oacute; que no desarrollar&iacute;a
soporte para MIPS en sus sistemas a partir de NT 4.0.  OpenBSD/arc
ofrece una excelente alternativa a NT, sobre todo ahora que no
habr&aacute; actualizaciones de NT para MIPS.  La
compa&ntilde;&iacute;a Deskstation ha cerrado, as&iacute; que no
habr&aacute; m&aacute;s m&aacute;quinas ARC MIPS de esta
compa&ntilde;&iacute;a.

<p>
Como resultado, el c&oacute;digo ha sido modificado para hacerlo
m&aacute;s vers&aacute;til, y al final deber&iacute;a tener soporte
para un abanico m&aacute;s amplio de procesadores MIPS: R4000, R4xx,
R43xx, R4400, R46x0, R4700, R5000, R8000 y R10000.

<h3>M&aacute;quinas con Soporte:</h3>

<ul>
  <li>Acer Pica: 150MHz R4400PC, ISA, con ethernet integrada, scsi,
      v&iacute;deo, y puertos serie.</li>
  <li><a href="http://www.deskstation.com">Deskstation</a>
      Tyne: 133MHz R4600, ISA y VLB.</li>
  <li><a href="http://www.deskstation.com">Deskstation</a>
      rPC44: 100MHz R4400PC, bus EISA.</li>
  <li>Placa de evaluaci&oacute;n de 
      <a href="http://www.algor.co.uk">Algorithmics</a>
      R4000/R5000/R10000</li>
  <li>NEC RiscStation.</li>
</ul>

<h3>Dispositivos con Soporte:</h3>
<ul>
  <li>gr&aacute;ficos:</li>
  <ul>
    <li>Adaptador de gr&aacute;ficos S3 VGA integrado en PICA.</li>
    <li>Adaptador de gr&aacute;ficos Standard VGA en rPC44 y Tyne.</li>
    <li>Nota: actualmente X11R6 s&oacute;lo tiene soporte para placas
        S3.</li>
  </ul>
 
  <li>teclado:</li>
  <ul>
    <li>Teclado compatible Standard PC con mapeado de teclado opcional
        por control de software.</li>
  </ul>
  
  <li>rat&oacute;n:</li>
  <ul>
    <li>Rat&oacute;n PS2 en PICA</li>
    <li>Rat&oacute;n para puerto serire en /dev/tty00 en rPC44 y
    Tyne.</li>
  </ul>
 
  <li>puertos serie:</li>
  <ul>
    <li>tty00 y tty01 integrados en PICA
        (todav&iacute;a no se pueden usar como consola).</li>
    <li>tty00 y tty01 ISA en sistemas sin puertos serie en la placa base
        (Tyne).</li>
    <li>tty02 y tty03 ISA 
        (en todos los sistemas con soporte para ISA).</li>
  </ul>

  <li>puertos paralelos:</li>
  <ul>
    <li>ISA (rPC44 and Tyne) o integrado (PICA).</li>
  </ul>
 
  <li>disquetera:</li>
  <ul>
    <li>S&oacute;lo en PICA.</li>
  </ul>
 
  <li>ethernet:</li>
  <ul>
    <li>Controlador ethernet SONIC integrado (s&oacute;lo PICA).</li>
    <li>Placas 3Com Etherlink
        (todos los sistemas con soporte para ISA).</li>
    <li>Placas ISA compatibles con NE2000.</li>
  </ul>
 
  <li>SCSI:</li>
  <ul>
    <li>Controlador SCSI integrado NCR53C96 (PICA)</li>
    <li>Controlador SCSI VLB &quot;Buslogic BT-440C/445C&quot;.</li>
    <li>Controlador SCSI ISA &quot;Buslogic BT-545&quot; en rPC44.</li>
  </ul>
 
  <li>IDE:</li>
  <ul>  
    <li>Discos IDE por medio de controlador wd en bus ISA.
        Arranque s&oacute;lo en sistemas Deskstation.</li>
  </ul>

  <li>Miscel&aacute;neos:</li>
  <ul>
    <li>Joystick en bus ISA.</li>
  </ul>
</ul>
</p>

<h3>Otros Portes en los que Estamos Trabajando:</h3>

<ul>
  <li>Placas Algorithmics P-4032 y P-5064.</li>
</ul>
</p>

<p>
Las personas que est&aacute;n m&aacute;s dedicadas a OpenBSD/arc
actualmente son Per Fogelstr&ouml;m, Theo de Raadt, Nikklas Hallqvist,
Warner Losh, y otros.  &iexcl;Cualquier otro ser&aacute; bienvenido!

<p>
<h3>Desarrollo Reciente:</h3>

<ul>
  <li>Soporte para bus PCI en placas Algorithmics P-4032 y P-5064.</li>
  <li>Soporte para procesadores <a href="http://www.qedinc.com">QED</a>
      RM52x0 (derivados del R5000)</li>
  <li>N&uacute;cleo DDB funcional.</li>
</ul>
</p>

<p>
El porte ARC est&aacute; completo, incluida cualquier
caracter&iacute;stica que pueda esperar de un porte de OpenBSD.

<hr>

<p>
Cada cierto periodo de tiempo se lanzan <a href="ftp.html">versiones
preliminares (<em>&quot;snapshots&quot;</em>)</a> del porte de arc.

<p>
Env&iacute;e un mensaje a 
<a href="mailto:imp@openbsd.org">Warner Losh</a> y 
<a href="mailto:pefo@openbsd.org">Per Fogelstr&ouml;m</a> para
cualquier asunto relacionado con este porte.

<hr>

<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: arc.html,v 1.35 2001/08/25 10:07:25 jufi Exp ]<br>
$Translation: arc.html,v 1.6 2001/08/28 17:55:03 horacio Exp $<br>
$OpenBSD: arc.html,v 1.5 2001/08/29 06:23:08 jufi Exp $
</small>

</body>
</html>
