<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
       "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="cómo portar aplicaciones de audio a OpenBSD">
<meta name="keywords" content="openbsd,portes,audio">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1998-2002 de OpenBSD">

<title>C&oacute;mo portar aplicaciones de audio a OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
</head>

<body text="#000000" bgcolor="#ffffff" link="#23238e">
<!-- máx. 72 caracteres por línea -->
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<h1>C&oacute;mo portar aplicaciones de audio a OpenBSD</h1>

<p>
En la actualidad este documento s&oacute;lo trata sobre temas
relacionados con muestras de sonido, pero se aceptan contribuciones
sobre sintetizadores y tablas de ondas.

<p>
Las aplicaciones de audio suelen ser dif&iacute;ciles de portar ya que
&eacute;ste es un terreno en donde no existen normativas que regulen las
interfaces, aunque no existe mucha diferencia entre c&oacute;mo se
aborda el tema en diferentes sistemas operativos.

<p>
<h2><font color="#e00000">Utilizaci&oacute;n de
<code>ossaudio</code></font></h2>

<p>
La emulaci&oacute;n <code>ossaudio</code> es la posibilidad m&aacute;s
simple, pero no siempre funciona y generalmente no es una buena idea.

<ul>
   <li>Redefine <code>ioctl</code>.  Si el c&oacute;digo que va a ser
   portado usa <code>ioctl</code> para m&aacute;s de un audio,
   tendr&aacute; que <code>#undef ioctl</code> y usar la forma simple
   <code>_ossioctl</code>.
    
   <li>Algunas funciones de sonido de linux no son emuladas.

   <li>Las aplicaciones con el correcto soporte para sonido de linux que
   no sean espec&iacute;ficas de la arquitectura intel, tienden a usar
   estas funciones.
</ul>

<p>
<h2><font color="#e00000">Utilizaci&oacute;n de c&oacute;digo de NetBSD
o FreeBSD ya existente</font></h2>

<p>
Como compartimos parte de la interfaz de audio con NetBSD y FreeBSD,
comenzar con un porte de NetBSD es razonable.  Hay que tener cuidado por
que algunos ficheros cambian de sitio, y algunas entradas en
<code>sys/audioio.h</code> son obsoletas.  Adem&aacute;s, muchos portes
tienden a estar codificados de modo incorrecto y s&oacute;lo funcionan
en un tipo de m&aacute;quina.  Algunos cambios son necesarios.  Siga
leyendo.

<p>
<h2><font color="#e00000">C&oacute;mo escribir c&oacute;digo de
OpenBSD</font></h2>

<p>
<h3><font color="#0000e0">Independencia del <em>hardware</em></font></h3>

<p>
<strong>NO SE DEBE ASUMIR NADA SOBRE EL HARDWARE DE AUDIO QUE SE
UTILICE</strong><br>
C&oacute;digo incorrecto es el c&oacute;digo que s&oacute;lo verifica el
campo <code>a_info.play.precision</code> con 8 &oacute; 16 bits, y que
asume como buenas las muestras de audio firmadas o no, bas&aacute;ndose
en el comportamiento de soundblaster.  Siempre se debe verificar el tipo
de muestra de modo expl&iacute;cito, y codificar de acuerdo con
&eacute;sta.  Un ejemplo simple:

<pre>
AUDIO_INIT_INFO(&amp;a_info);
a_info.play.encoding = AUDIO_ENCODING_SLINEAR;
a_info.play.precision = 16;
a_info.play.sample_rate = 22050;
error = ioctl(audio, AUDIO_SETINFO, &amp;a_info);
if (error)
	/* deal with it */
error = ioctl(audio, AUDIO_GETINFO, &amp;a_info);
switch(a_info.play.encoding)
	{
case AUDIO_ENCODING_ULINEAR_LE:
case AUDIO_ENCODING_ULINEAR_BE:
	if (a_info.play.precision == 8)
	    /* ... */
	else 
	    /* ... */
	break;
case ...

default:
	/* don't forget to deal with what you don't know !!! For instance, */
	fprintf(stderr, 
		"Unsupported audio format (%d), ask ports@ about that\n",
		a_info.play.encoding);

	}
/* now don't forget to check what sampling frequency you actually got */
</pre>

<p>
Esto viene a ser el fragmento de c&oacute;digo m&aacute;s peque&ntilde;o
con que se tendr&aacute; que tratar en la mayor&iacute;a de casos.

<p>
<h3><font color="#0000e0">Formatos de 16 bits y
&quot;endian&quot;</font></h3>

<p>
Para uso normal simplemente se pide el tipo de condificaci&oacute;n
(v.g., <code>AUDIO_ENCODING_SLINEAR</code>) y se saca una
codificaci&oacute;n con tipo de &quot;endian&quot; (v.g.,
<code>AUDIO_ENCODING_SLINEAR_LE</code>).

<p>
Teniendo en cuenta que una tarjeta de sonido no tiene que usar el mismo
tipo de &quot;endian&quot; que la plataforma, hay que estar preparado
para esto.  El modo m&aacute;s f&aacute;cil es, probablemente, preparar
una memoria intermedia de audio entera, y usar <code>swab(3)</code> si
se requiere un cambio del tipo de &quot;endian&quot;.  Al tratar con
muestras externas suele ser:

<ol>
   <li>analizar el formato de la muestra,
   <li>introducir la muestra,
   <li>cambiar el tipo de &quot;endian&quot; si no corresponde al de
   nuestro formato,
   <li>computar la salida deseada en la memoria intermedia,
   <li>cambiar el tipo de &quot;endian&quot; si la tarjeta de sonido no
   corresponde a nuestro formato,
   <li>y jugar con la memoria intermedia.
</ol>

<p>
Si se est&aacute; jugando con una muestra de sonido que se encuentra en
el formato de la tarjeta de sonido, se pueden eliminar los pasos 3 y 5.

<p>
<h3><font color="#0000e0">Calidad de audio</font></h3>

<p>
El <em>hardware</em> puede tener unas limitaciones extra&ntilde;as, como
que no pueda obtener más de 22050 Hz en est&eacute;reo y sin embargo
obtenga hasta 44100 en mono.  En casos como &eacute;ste y similares hay
que ofrecer un cambio al usuario para que escoja sus preferencias, e
intentar dar el mejor rendimiento posible.  Por ejemplo, ser&iacute;a
est&uacute;pido limitar la frecuencia a 22050 Hz ya que la salida es en
est&eacute;reo.  &iquest;Y si el usuario no tiene un sistema de sonido
en est&eacute;reo conectado a la salida de su tarjeta de audio?

<p>
Tambi&eacute;n ser&iacute;a est&uacute;pido codificar las limitaciones
de soundblaster en su programa.  Intente sobrepasar la barrera de
22050&nbsp;Hz/stereo y verifique los resultados.

<p>
<h4>Muestras de frecuencia</h4>

<p>
Las muestras de frecuencia devueltas por la tarjeta de sonido siempre
deben ser verificadas.  Una discrepancia del 5% es medio tono, y algunas
personas tienen un o&iacute;do m&aacute;s fino que eso, aunque la
mayor&iacute;a de nosotros no notemos nada.  Su aplicaci&oacute;n
deber&iacute;a ser capaz de llevar a cabo un &laquo;remuestreo&raquo; al
instante, posiblemente de forma nativa o a trav&eacute;s de aplicaciones
de &laquo;remuestreo&raquo; de Shannon.

<p>
<h4>Campo din&aacute;mico</h4>

<p>
Los muestreos no siempre usan el campo de valores entero.  Primero, las
muestras grabadas con un volumen bajo no sonar&aacute;n muy altas en la
m&aacute;quina, forzando al usuario a subir el volumen.  Segundo, en
m&aacute;quinas con audio mal aislado, la salida de sonido bajo
significa que la mayor parte de lo que se oye es el latido de la
m&aacute;quina y no el sonido esperado.  Finalmente, la
conversi&oacute;n muda de 16 bits a 8 bits le puede dejar con tan
s&oacute;lo 4 bits de audio utilizables, lo que da como resultado una
p&eacute;sima calidad.

<p>
Si es posible, la mejor soluci&oacute;n est&aacute; en escanear todo lo
que se vaya a escuchar con anterioridad, y ponerlo en escala de modo que
entre dentro del campo din&aacute;mico.  Si no se puede permitir esto
pero puede planear con anterioridad lo que vaya a escuchar, puede
ajustar la potencia del volumen;  s&oacute;lo debe asegurarse de que el
factor de potencia se mantiene en una frecuencia baja en
comparaci&oacute;n con la del sonido que quiera escuchar, y que no haya
ning&uacute;n <em>desbordamiento</em> (&eacute;stos siempre
sonar&aacute;n mucho peor que la mejora que intente conseguir).<br>
Ya que la percepci&oacute;n del volumen del sonido es
logar&iacute;tmica, generalmente bastar&aacute; con usar cambios
aritm&eacute;ticos.  Si sus datos est&aacute;n firmados, deber&iacute;a
codificar el cambio de forma expl&iacute;cita como una divisi&oacute;n,
ya que el operador de C <code>&gt;&gt;</code> no se puede portar a datos
firmados.

<p>
Si lo dem&aacute;s fallara, deber&iacute;a por lo menos intentar proveer
al usuario con una opci&oacute;n escalable de sonido.

<p>
<h3><font color="#0000e0">Rendimiento del audio</font></h3>

<p>
Las aplicaciones de poca demanda no deben preocupar mucho.  Tenga en
cuenta que algunos de nosotros usamos OpenBSD en 68030 de baja demanda,
y que si una aplicaci&oacute;n de sonido puede funcionar, deber&iacute;a
hacerlo.

<p>
No se olvide de llevar a cabo bancos de pruebas.  Las optimizaciones
teor&eacute;ticas son s&oacute;lo eso:  teor&iacute;a.  Deber&iacute;a
recolectar algunas cifras para poder comprobar qu&eacute; se puede
mejorar ampliamente y qu&eacute; no.

<p>
Para aplicaciones de audio de alto rendimiento, como mpegI-layer3, hay
que tener en consideraci&oacute;n algunos puntos:

<ul>
   <li>La interfaz de audio le proveer&aacute; con el tama&ntilde;o de
   bloque natural del <em>hardware</em>.  Tenga en cuenta que
   <code>write</code>, como una llamada del sistema, incurre en un coste
   alto comparado con el proceso interno de audio.

   <li>El ancho de banda es un factor muy importante a tener en cuenta
   cuando se trata sobre audio.  Una forma &uacute;til para optimizar un
   aparato de audio es verlo como un descompresor.  Cuanto m&aacute;s
   tiempo pueda mantener los datos comprimidos, mejor.  Los bucles muy
   cortos que aportan muy poco procesamiento son por lo general una mala
   idea.  Es mucho mejor combinar todo el procesamiento en un bucle.

   <li>Algunos formatos incurren en m&aacute;s suspensi&oacute;n que
   otros.  Se debe usar el <code>ioctl</code> <code>AUDIO_GETENC</code>
   para obtener todos los formatos con los que est&eacute; provisto el
   dispositivo de audio.  Tenga un cuidado especial con el indicador
   <code>AUDIO_ENCODINGFLAG_EMULATED</code>.  Si ya puede obtener
   salidas de todo tipo de formatos extra&ntilde;os de su
   aplicaci&oacute;n y se encuentra bastante optimizada para ello,
   intente usar un formato nativo a cualquier coste.  Por otra parte, el
   c&oacute;digo de emulaci&oacute;n presente en el dispositivo de audio
   se puede decir que est&aacute; suficientemente optimizado en ese
   caso, y no tiene porqu&eacute; substituirlo con c&oacute;digo nuevo
   programado con prisas.
</ul>

<p>
Un modelo que es posible que tenga que seguir para obtener resultados
&oacute;ptimos es el de compilar primero un peque&ntilde;o programa de
pruebas que investigue sobre el <em>hardware</em> de audio disponible, y
entonces pasar a configurar su programa de modo que trate de forma
&oacute;ptima con este <em>hardware</em>.  Se puede asumir que los
usuarios que esperan unos resultados de audio buenos recompilar&aacute;n
su porte cuando cambien de <em>hardware</em>.

<p>
<h3><font color="#0000e0">Tiempo real o sincronizado</font></h3>

<p>
Aun cuando OpenBSD no sea un sistema en tiempo real, es posible
programar aplicaciones de audio para tiempo real, como puedan ser
juegos.  En tal caso es necesario rebajar el tama&ntilde;o de los
bloques para que los efectos de sonido no se desincronicen con el juego.
El problema con esto es que el dispositivo de audio puede sufrir
&laquo;inanici&oacute;n&raquo;, lo que dar&iacute;a unos resultados
terribles.

<p>
Si solamente quiere sincronizar el audio con la salida de algunos
gr&aacute;ficos, pero se puede predecir el comportamiento de su
programa, es m&aacute;s f&aacute;cil alcanzar la sincronizaci&oacute;n.
Ejecute las muestras de audio y pregunte al dispositivo de audio
qu&eacute; es lo que est&aacute; ejecutando con
<code>AUDIO_GETOOFFS</code>, y entonces use esa informaci&oacute;n para
postsicronizar los gr&aacute;ficos.  Si se lo pide con bastante
frecuencia (digamos que cada d&eacute;cima de segundo), y siempre que
tenga suficiente potencia para ejecutar su aplicaci&oacute;n, puede
obtener una sincronizaci&oacute;n bastante buena de este modo.  Es
posible que tenga que trastocar un poco las cifras por una constante de
contrapeso, ya que existe desincronizaci&oacute;n entre los informes del
audio, lo que se est&aacute; ejecutando, y el tiempo que tarda XWindow
en mostrar algo.

<p>
<h2><font color="#e00000">Aportaci&oacute;n del
c&oacute;digo</font></h2>

<p>
En el caso de las aplicaciones de audio, trabajar con el autor del
programa original es muy importante.  Si su c&oacute;digo s&oacute;lo
funciona, por ejemplo, con tarjetas soundblaster, es muy posible que
tenga que tratar con otra tecnolog&iacute;a en breve.

<p>
<strong>Si no le env&iacute;a sus comentarios en ese momento, el trabajo
que Vd. haga habr&aacute; sido en vano</strong>.

<p>
Tambi&eacute;n es posible que el autor ya se haya dado cuenta de los
problemas con los que est&eacute; tratando y que est&eacute; trabajando
en ellos en su &aacute;rbol de desarrollo actual.  Si los parches que
Vd. est&aacute; escribiendo son de m&aacute;s de un par de
l&iacute;neas, es una buena idea que intente cooperar.


<hr>
<a href="porting.html"><img height="24" width="24" src="../back.gif" border="0" alt="Porting"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>

<br><small>
Originally [OpenBSD: audio-port.html,v 1.8 2003/03/06 13:51:31 naddy Exp ]<br>
$Translation: audio-port.html,v 1.16 2009/05/26 22:53:51 ajacoutot Exp $<br>
$OpenBSD: audio-port.html,v 1.12 2009/05/26 21:30:39 ajacoutot Exp $
</small>

</body>
</html>
