<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="document">
<meta name="description" content="Libros sobre BSD y OpenBSD">
<meta name="keywords" content="openbsd,libros,información">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1998-2003 de OpenBSD.">
<meta name="generator" content="editor vi de UNIX">
<meta name="Author" content="Ian Darwin">
<title>Colecci&oacute;n de libros de OpenBSD</title>
</head>

<body bgcolor="#ffffff">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" border="0" src="../images/smalltitle.gif"></a>
<p>
<h2><font color="#cc0000">Libros sobre UNIX y BSD</font></h2>
<hr>

<p>
Con el fin de facilitar que se pueda pedir directamente cualquiera de
los libros que aqu&iacute; se recomiendan, estamos asociados con
<a href="http://www.amazon.com/">Amazon.com</a>.  <i>Si realiza su
pedido desde uno de los enlaces donde lea &laquo;Pedido a Amazon&raquo;,
estar&aacute; ayudando a recolectar fondos para el proyecto OpenBSD.</i>

<p>
<strong>N. del T.</strong> todos los libros aqu&iacute; mencionados
est&aacute;n escritos en ingl&eacute;s.

<p>
<ul>
<li><a href="#1">Libros espec&iacute;ficos de OpenBSD</a>
<li><a href="#2">Libros espec&iacute;ficos de BSD</a>
<li><a href="#3">Gu&iacute;as de usuario de Unix</a>
<li><a href="#4">Administraci&oacute;n de sistemas Unix</a>
<li><a href="#5">Programaci&oacute;n en Unix</a>
<li><a href="#6">Administraci&oacute;n de Redes</a>
<li><a href="#7">Criptograf&iacute;a</a>
</ul>
<hr>

<h3><a name="1">Libros espec&iacute;ficos de OpenBSD</a></h3>
<dl>
<dt><i>Building Firewalls with OpenBSD and PF</i>
<dd>por Jacek Artymiak
<dd>
Jacek Artymiak, el autor, conocido por sus series de excelentes
art&iacute;culos en Internet sobre pf y seguridad de OpenBSD en general,
ha escrito este libro que cubre OpenBSD y pf en 200 p&aacute;ginas.
<dd>[<a href="http://www.devguide.net/books/buildingfirewallswithopenbsdandpf/">Pedido desde devguide.net</a>]
<p>
<dt>
<i>Building Linux and OpenBSD Firewalls</i>
<dd>por Wes Sonnenreich y Tom Yates.
<dd>
Este libro describe el proceso de instalaci&oacute;n de OpenBSD 2.5 y la
gesti&oacute;n b&aacute;sica de las herramientas para cortafuegos del
sistema.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0471353663/openbsdA/">Pedido a Amazon</a>]
</dl>

<hr>

<h3><a name="2">Libros espec&iacute;ficos de BSD</a></h3>

<dl>
<dt>
<i>The Design and Implementation of the 4.4 BSD Operating System</i>
<dd>por Marshal Kirk McKusick, Keith Bostic, Michael J.  Karels, y John
S. Quarterman
<dd>
Con 549 p&aacute;ginas m&aacute;s un &iacute;ndice, 
<a href="http://cseng.aw.com/book/0,3828,0201549794,00.html">este
libro</a> puede ser considerado como muy completo.  A McKusick, Bostic y
Karels se les conoce muy bien por ser de los primeros en pasar al Grupo
de Investigaci&oacute;n de Sistemas Inform&aacute;ticos de Berkeley
(CSRG - &quot;Computer Systems Research Group&quot;) durante el periodo
de transici&oacute;n entre 4.3BSD a 4.4BSD.  Este libre trata las
versiones 4.4 y 4.4-Lite, y se extiende sobre todo aquello que quiso
saber sobre el funcionamiento del sistema.  No se puede aplicar a
OpenBSD en su totalidad, pero probablemente sea lo m&aacute;s cercano
que existe un comprensivo manual sobre el funcionamiento interno de
OpenBSD.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201549794/openbsdA/">Pedido a Amazon</a>]

<p>
<dt>
<i>Source Code Secrets: The Basic 386BSD Operating System Reference
(Volume 1 of Operating System Source Code Secrets)</i>
<dd>por L. W. Jolitz y William Jolitz; 1997
<dd>
Los Jolitz fueron los constructores del primer porte de BSD a la
arquitectura PC-386, y merecen el m&eacute;rito por haber hecho que BSD
fuera portable a esta arquitectura de bajo coste.  Las versiones
anteriores, llamadas &quot;386bsd&quot;, se describieron en varios
art&iacute;culos en <i>Dr. Dobbs Journal</i>.  Este libro va m&aacute;s
all&aacute; de esos art&iacute;culos y ofrece una completa
colecci&oacute;n de c&oacute;digo fuente con notas adicionales.  No todo
el libro es aplicable a las versiones modernas de OpenBSD, pero es
posible aprender mucho de &eacute;l.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1573980269/openbsdA/">Pedido a Amazon</a>]

<p>
<dt>
<i>Berkeley Unix: A Simple and Comprehensive Guide</i>
<dd>por James Wilson
<dd>
Comienza con las &oacute;rdenes m&aacute;s b&aacute;sicas y termina con
t&eacute;cnicas de programaci&oacute;n avanzada.  Tambi&eacute;n trata
muy a fondo las llamadas al sistema.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=047161582X/openbsdA/">Pedido a Amazon</a>]

<p>
<dt>
<i>An Introduction to Berkeley Unix and ANSI C</i>
<dd>por Jack Hodges
<dd>
Una introducci&oacute;n al sistema operativo y al lenguaje de
programaci&oacute;n.  Este libro est&aacute; dirigido hacia el
autoaprendizaje y no requiere conocimientos previos de Unix.  Cubre los
fundamentos de la programaci&oacute;n, el uso correcto de la sintaxis,
el estilo de programaci&oacute;n, depurado, l&oacute;gica, y la
programaci&oacute;n del sistema con C.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0130684953/openbsdA/">Pedido a Amazon</a>]

<p>
<dt>
<dt>
<i>4.4 BSD User's Reference Manual (URM)</i>
<dd>publicado por O'Reilly, 1994
<dd>
Se trata de una versi&oacute;n imprimida de las p&aacute;ginas de manual
de usuario.  Su distribuci&oacute;n de OpenBSD incluye las
p&aacute;ginas para su consulta en pantalla; y estas &uacute;ltimas son
las espec&iacute;ficas de OpenBSD y est&aacute;n m&aacute;s al
d&iacute;a.  Por tanto no necesita este libro: use la orden <i>man</i>.

<p>
<dt>
<dt>
<i>4.4 BSD System Manager's Manual (SMM)</i>
<dd>publicado por O'Reilly, 1994
<dd>
Este libro explica en detalle todo aquello que necesita saber para hacer
funcionar un sistema BSD.  Hay mucho en este libro de relevancia para
OpenBSD.  Por desgracia, este libro no est&aacute; disponible
actualmente.  A&uacute;n peor, debido a restricciones de AT&amp;T, las
ediciones electr&oacute;nicas no se incluyeron en las distribuciones de
4.4BSD, por lo que algunos de estos libros no vienen incluidos en
OpenBSD.  Los pocos que existen se pueden encontrar en la 
<a href="docum.html">p&aacute;gina de Documentos</a>.

<p>
<dt>
<dt>
<i>BSD mit Methode</i>
<dd>Publicado por C&amp;L Computer- und LLiteraturverlag GmbH, 1998
<dd>
<a href="http://www.cul.de/buecher/bsd.html">Un libro en
alem&aacute;n</a> sobre los tres Unix libres de BSD, que cubre los temas
esenciales de instalaci&oacute;n, configuraci&oacute;n de X y
administraci&oacute;n del sistema, as&iacute; como programaci&oacute;n
en PERL y consejos sobre LaTeX/LyX.  El libro tambi&eacute;n trata el
entorno de escritorio KDE.<br>
Incluye versiones m&aacute;s antiguas de OpenBSD en los dos CDROMs.<br>
Por lo visto, no se encuentra disponible mediante Amazon.com, sino
<a href="http://www.lob.de/cgi-bin/work/frameset?flag=jfl&amp;frame=yes&amp;id=38effe1813566">Lehmann's Online Bookshop</a>.
Sin embargo, se puede obtener una 
<a href="http://www.lob.de/cgi-bin/work/frameset?flag=jfl&amp;frame=yes&amp;id=38effe1813566">versi&oacute;n m&aacute;s moderna de los CDROM</a>.
</dl>
<hr>

<h3><a name="3">Gu&iacute;as de usuario de Unix</a></h3>

<dl>
<dt><i>Unix Made Easy</i>
<dd>por John Muster
<dd>Un libro sobre Unix en general que cubre todas las &aacute;reas del
sistema.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0078821738/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>UNIX Power Tools</i>
<dd>por Jerry D. Peek, Tim O'Reilly, y Mike Loukides
<dd>Este libro se encuentra ya en su segunda edici&oacute;n.  Trata
cientos de trucos, t&eacute;cnicas poco conocidas, y utilidades
a&ntilde;adidas.  Tenga en cuenta que muchas de las utilidades se
encuentran disponibles en OpenBSD o, con m&aacute;s probabilidad, se
encuentran disponibles como portes o paquetes.  La mayor parte de la
secci&oacute;n 52.03, que trata sobre la dificultad para portar software
a Unix diferentes, se puede descartar si Vd. aprende sobre el 
<a href="ports.html">mecanismo de portes</a> que forma parte de OpenBSD.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1565922603/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i><a href="http://www.rodsbooks.com/multiboot/">The Multi-Boot
Configuration Handbook</a></i>
<dd>por Rod Smith
<dd>
Este libro explica las t&eacute;cnicas del arranque m&uacute;ltiple.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0789722836/openbsdA/">Pedido a Amazon</a>]
</dl>

<hr>

<h3><a name="4">Administraci&oacute;n de sistemas Unix</a></h3>

<dl>
<dt><i>UNIX System Administration Handbook</i>
<dd>por Evi Nemeth, Garth Snyder, Scott Seebass, y Trent R.  Hein
<dd>
&Eacute;ste es un libro excelente sobre administraci&oacute;n de
sistemas Unix.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0130206016/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>Essential System Administration</i>
<dd>por AEleen Frisch
<dd>
Este libro cubre muchas tareas fundamentales para la
administraci&oacute;n de sistemas.  Incluye ejemplos para una amplia
variedad de sistemas operativos Unix, incluido BSD.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1565921275/openbsdA/">Pedido a Amazon</a>]
</dl>

<hr>

<h3><a name="5">Programaci&oacute;n en Unix</a></h3>

<dl>
<dt><i>Unix Systems for Modern Architectures</i>
<dd>por Curt Schimmel
<dd>
Este libro lleva al lector a trav&eacute;s de todos los modelos de
n&uacute;cleos de bajo nivel para arquitecturas de multiprocesadores.
OpenBSD todav&iacute;a no ha implementado la capacidad para
multiprocesadores pero, &iquest;qu&eacute; cree que est&aacute;n leyendo
los desarrolladores?
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201633388/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>Lions' Commentary on UNIX 6th Edition with Source Code</i>
<dd>por John Lions
<dd>
Aunque el UNIX descrito en este libro sea para BSD como un Ford Modelo T
para un Mustang de los 70, Ken Thompson, el creador de UNIX, dice que
&laquo;despu&eacute;s de 20 a&ntilde;os, &eacute;sta todav&iacute;a es
la mejor exposici&oacute;n del funcionamiento de un sistema operativo
`aut&eacute;ntico'&raquo;.  Originalmente circularon fotocopias
ilegales, con las que la mayor&iacute;a de programadores y
desarrolladores de primera y segunda generaci&oacute;n de UNIX
comenzaron.  Se recomienda como una buena introducci&oacute;n sobre
c&oacute;mo un sistema operativo de tiempo compartido funciona.  Es
bastante m&aacute;s corto que el libro anterior de McKusick.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1573980137/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>The Practice of Programming</i>
<dd>por Brian W. Kernighan y Rob Pike
<dd>
Brian Kernighan ha tomado parte en otros dos libros que tambi&eacute;n
recomendamos, aunque &eacute;stos no sean espec&iacute;ficos de UNIX;
estos libros son especialmente &uacute;tiles para programadores en UNIX
y otros entornos.  Este libro trata sobre consideraciones
pr&aacute;cticas de programaci&oacute;n para C, C++ y Java.  Muy
recomendable.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=020161586X/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>The Elements of Programming Style</i>
<dd>por Brian W. Kernighan y P. J. Plauger
<dd>
Este libro es muy parecido a <i>The Practice of Programming</i>, pero
m&aacute;s antiguo.  Los ejemplos est&aacute; en Fortran y PL/I.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0070342075/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>Advanced Programming in the Unix Environment</i>
<dd>por W. Richard Stevens
<dd>
&Eacute;ste es un libro muy detallado y muy f&aacute;cil de leer.
Contiene varios ejemplos de los que puede aprender.  Hay mucha
informaci&oacute;n sobre las llamadas a bibliotecas y al sistema, e
informaci&oacute;n asociada a &eacute;stas para que se puedan usar.  En
combinaci&oacute;n con las p&aacute;ginas de manual de OpenBSD, este
libro es excelente.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201563177/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>The C Programming Language</i>
<dd>por Brian W. Kernighan y Dennis M. Ritchie
<dd>
Este libro es una gu&iacute;a clara y concisa sobre el lenguaje de
programaci&oacute;n en C, tal vez la &uacute;nica que vaya a necesitar
jam&aacute;s.  El contenido es estrictamente sobre el lenguaje C, y no
sobre c&oacute;mo usar tal o cual compilador ni nada parecido.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0131103628/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>C: A Reference Manual</i>
<dd>por Samuel P. Harbison y Guy L. Steele 
<dd>
Si s&oacute;lo pudiera tener dos libros sobre C y uno de ellos fuera
<i>The C Programming Language</i>, &iexcl;&eacute;ste ser&iacute;a el
segundo!  Este libro no es una tutorial, sino un libro de referencia (de
aqu&iacute; el t&iacute;tulo); trata sobre la sintaxis, los tipos de
datos, las funciones de las bibliotecas C ISO, y la compatibilidad de C
y C++.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0133262243/openbsdA/">Pedido a Amazon</a>]

</dl>

<hr>

<h3><a name="6">Administraci&oacute;n de redes</a></h3>
<dl>
<dt><i>SSH, The Secure Shell.</i>
<dd>por Daniel J. Barrett y Richard Silverman
<dd>La gu&iacute;a definitva.  Aborda OpenSSH en detalle.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0596000111/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>TCP/IP Illustrated, Volume 1</i>
<dd>por W. Richard Stevens
<dd>
&laquo;Administraci&oacute;n de redes&raquo; es un t&iacute;tulo poco
apropiado para este libro.  Es una enciclopedia del protocolo TCP/IP.
Este libro ofrece informaci&oacute;n y diagramas de utilidad, para poder
comprender TCP/IP hasta su nivel m&aacute;s bajo.  Entusiastas,
desarrolladores, y administradores de redes por igual disfrutar&aacute;n
con la lectura de este libro.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0201633469/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>Kerberos: A Network Authentication System</i>
<dd>por Brian Tung
<dd>
Una gu&iacute;a para administradores de redes basadas en Kerberos.
Explica conceptos sobre el sistema Kerberos, as&iacute; como su
instalaci&oacute;n y administraci&oacute;n.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0201379244/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>IPsec: The New Security Standard for the Internet, Intranets and
Virtual Private Networks</i>
<dd>por Naganand Doraswamy y Dan Harkins 
<dd>
Este libro explica sobre la suite del protocolo IPsec.  Tambi&eacute;n
explica su relaci&oacute;n con su despliegue actual, como en VPNs, e
ideas futuras.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0130118982/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>Computer Networks</i>
<dd>por Andy Tanenbaum
<dd>
Este libro es una gu&iacute;a de alto nivel para redes
inform&aacute;ticas modernas.  Introduce un amplio abanico de
protocolos, conceptos, y tecnolog&iacute;as.  Tambi&eacute;n cubre
tecnolog&iacute;as de fibra &oacute;ptica, LANs, IPs, y mucho
m&aacute;s.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0133499456/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>DNS and BIND</i>
<dd>por Paul Albitz y Cricket Liu
<dd>
Este libro es una excelente introducci&oacute;n a DNS y BIND,
&uacute;til para cualquiera que deba implementar DNS en OpenBSD.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0596001584/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>DHCP</i>
<dd>por Ted Lemon y Ralph E. Droms
<dd>
Recomendado por <a href="http://www.isc.org/">Internet Software
Consortium</a>, la organizaci&oacute;n que produce el software
cliente/servidor DHCP incluido en OpenBSD.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1578701376/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>Managing NFS and NIS</i>
<dd>por Hal Stern
<dd>
Informaci&oacute;n esencial con ejemplos sobre la gesti&oacute;n de NFS
y NIS.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=1565925106/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>802.11 Security</i>
<dd>por Bruce Potter y Bob Fleck
<dd>
Contiene informaci&oacute;n sobre los fundamentos de la seguridad en
redes inal&aacute;mbricas, inclu&iacute;das soluciones pr&aacute;cticas
para la configuraci&oacute;n de clientes, puntos de acceso, y pasarelas
bajo varios sistemas operativos.  Tiene dos cap&iacute;tulos dedicados a
OpenBSD 3.1, que cubren wi, bridge, pf y altq.
<dd>[<a href="http://www.amazon.com/exec/obidos/ISBN=0596002904/openbsdA/">Pedido a Amazon</a>]
</dl>

<hr>

<p>
<h3><a name="7">Criptograf&iacute;a</a></h3>
<dl>
<dt><i>Applied Cryptography: Protocols, Algorithms, and Source Code in
C</i>
<dd>por Bruce Schneier
<dd>
Una extensiva explicaci&oacute;n sobre la Criptograf&iacute;a, con
informaci&oacute;n sobre su historia, protocolos, y algoritmos.  Este
libro es una gran introducci&oacute;n a la criptograf&iacute;a, con
informaci&oacute;n b&aacute;sica suficiente como para poder comprender
este campo.  Adem&aacute;s, contiene una secci&oacute;n de referencia
muy amplia.<br>
Comentario de un cliente de Amazon: &quot;<i>Es normal encontrarse con
que los maestros de las artes t&eacute;cnicas misteriosas son parcos en
palabras a la hora de comunicarse.  Bruce Schneier demuestra ser un gran
comunicador t&eacute;cnico.  &Eacute;ste es un libro que trata sobre un
asunto esot&eacute;rico - que se asienta sobre una base de
matem&aacute;tica te&oacute;rica - que incluso los profanos en el tema
pueden leer.  Por supuesto que es necesario que el lector se encuentre
motivado por un inter&eacute;s en el tema, y el nivel t&eacute;cnico
requiere algunas veces unos conocimientos previos de la teor&iacute;a
num&eacute;rica, pero no es necesaria una licenciatura en
matem&aacute;tica te&oacute;rica para poder disfrutar y sacar provecho
de la lectura de Applied Cryptography.</i>&quot;
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0471117099/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>Handbook of Applied Cryptograpy</i>
<dd>por Alfred J. Menezes, Paul C. van Oorschot y Scott A.  Vanstone 
<dd>
Una nueva y detallada mirada a la Criptograf&iacute;a.  Los autores
escriben:
<dd>
&laquo;... las t&eacute;cnicas criptogr&aacute;ficas de claves
p&uacute;blicas son ampliamente utilizadas en la actualidad,
especialmente en la industria de servicios financieros, en el sector
p&uacute;blico, y por personas con car&aacute;cter privado, como por
ejemplo para el correo electr&oacute;nico.  Esta gu&iacute;a ser&aacute;
de una ayuda inestimable, tanto para el principiante como para el
experto que necesite una visi&oacute;n m&aacute;s amplia dentro del
&aacute;rea de la Criptograf&iacute;a.  Es una gu&iacute;a necesaria y
duradera para los profesionales que practican el arte de la
Criptograf&iacute;a.&raquo;
<dd>
El libro se encuentra
<a href="http://cacr.math.uwaterloo.ca/hac/index.html">disponible de
forma gratuita</a> y al completo (s&oacute;lo para uso personal) desde
el sitio de los autores del libro, en formatos PDF o PostScript.
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN=0849385237/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>SSL and TLS Essentials: Securing the Web</i>
<dd>por Stephen A. Thomas 
<dd>
Este libro ofrece una introducci&oacute;n a los protocolos SSL y TSL,
con ejemplos.  El protocolo SSL es en la actualidad la base para
transferencias de datos seguros y transacciones seguras en Internet.
Adem&aacute;s del cifrado, este libro tambi&eacute;n cubre la integridad
de los datos y detalles sobre el protocolo SSL.
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0471383546/openbsdA/">Pedido a Amazon</a>]

<p>
<dt><i>SSL and TLS: Designing and Building Secure Systems</i>
<dd>por Eric Rescorla
<dd>
Este libro ofrece informaci&oacute;n comprensiva sobre los protocolos
SSL y TLS, y trata sobre la operaci&oacute;n y seguridad de
&eacute;stos, junto con los detalles sobre su utilizaci&oacute;n e
implementaci&oacute;n.  Tambi&eacute;n tiene unos cap&iacute;tulos que
tratan sobre HTTP a trav&eacute;s de SSL, y de SMTP a trav&eacute;s de
TLS (STARTTLS).  Eric Rescorla es el autor de <tt>ssldump</tt>, una
utilidad que se puede usar para monitorizar las conexiones de SSL.  Ha
escrito varias implementaciones comerciales y libres de SSL.
<dd>
[<a href="http://www.amazon.com/exec/obidos/ISBN%3D0201615983/openbsdA/">Pedido a Amazon</a>]
<p>
<dt><i>Big Book of IPsec RFCs: Internet Security Architecture</i>
<dd>compilado por Pete Loshin
<dd>
Una reimpresi&oacute;n completa de los 
<a href="../faq/es/faq13.html#rfc">RFC de IPsec</a> con un &iacute;ndice
y un glosario extendido.

</dl>

<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: books.html,v 1.40 2003/07/19 04:57:22 jose Exp ]<br>
$Translation: books.html,v 1.27 2003/07/19 18:31:45 horacio Exp $<br>
$OpenBSD: books.html,v 1.26 2003/07/20 14:10:08 jufi Exp $
</small>

</body>
</html>
