<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="cómo crear/actualizar un porte para OpenBSD.">
<meta name="keywords" content="openbsd,portes">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1998-2002 de OpenBSD.">

<title>Notas sobre los portes de OpenBSD</title>
</head>
 
<body text="black" bgcolor="white" link="#23238e">
<!-- máx. 72 caracteres por línea -->
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<h2><font color="#e00000">Notas sobre los portes de OpenBSD</font></h2>

<p>
En este documento se describe c&oacute;mo crear o c&oacute;mo actualizar
un porte.  Es una lista &uacute;til para recordar qu&eacute; cosas se
deben hacer.  No es exacta ni perfecta.  Cualquier comentario o pregunta
al respecto debe dirigirse a
<a href="mailto:ports@openbsd.org">&lt;ports@openbsd.org&gt;</a>.

<hr>
<ol>
<li> 
Si quiere ser un mantenedor, subscr&iacute;base a la lista
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a>.

 <ul>
 <li>Aqu&iacute; tienen lugar todas las dicusiones sobre los portes.
 <li>La lectura de esta lista es importante, ya que muchos anuncios van
 a esta lista.
 <li>Ah&iacute; encontrar&aacute; a muchos mantenedores de portes.  A
 menudo pueden darle buenos consejos o probar su porte.
 </ul>

<br>
<li>Ser el mantenedor de un porte es <b>algo m&aacute;s</b> que
limitarse a entregar portes al &aacute;rbol de CVS.  Tambi&eacute;n hay
que mantenerlos actualizados, y contestar dudas sobre &eacute;stos.
    
<br>
<br>
<li>Obtenga una copia del &aacute;rbol de portes del cvs.  Puede
encontrar las instrucciones sobre c&oacute;mo hacerlo en
<a href="anoncvs.html">http://www.openbsd.org/es/anoncvs.html</a>.

<br>
<br>
<li>Escoja una ubicaci&oacute;n en donde poner su porte, y cree una
infraestructura b&aacute;sica ah&iacute;.  Use la plantilla de
<tt>Makefile</tt> que encontrar&aacute; en
<tt>/usr/ports/infrastructure/templates/Makefile.template</tt>.
NEED_VERSION est&aacute; obsoleto y no debe usarse en los nuevos portes.
Los mantenedores de portes deber&iacute;an actualizar su &aacute;rbol de
portes, incluido <tt>bsd.port.mk</tt>.

<ul>
<li>Cree el directorio <tt>pkg</tt>.
<li>Cree los ficheros vac&iacute;os <tt>pkg/DESCR</tt> y
<tt>pkg/PLIST</tt>.
</ul>

<br>
<li>A&ntilde;ada las porciones con &quot;fetch&quot; del fichero
<tt>Makefile</tt>.

<ul>
<li>Rellene EXTRACT_SUFX si es algo a parte de un .tar.gz.  Otros
ejemplos pueden ser .tar.Z o .tgz.

<li>Rellene DISTNAME, que es el nombre del fichero menos el sufijo de la
extensi&oacute;n.  Por ejemplo, si tuviera <tt>foo-1.0.tar.gz</tt>,
DISTNAME ser&iacute;a foo-1.0.

<li>Rellene MASTER_SITES, que es una URL para los directorios en donde
el fichero distfile est&aacute; ubicado.  Por ejemplo,
<tt>ftp://ftp.openbsd.org/pub/OpenBSD/distfiles/</tt> .  <b>No olvide la
barra final.</b> Como m&iacute;nimo, intente tener tres sitios
diferentes.  Ponga el de m&aacute;s f&aacute;cil acceso primero, ya que
los recorrer&aacute; por orden.

<li>Recuerde que <tt>fetch</tt> hace referencia al fichero como
${MASTER_SITES}${DISTNAME}$EXTRACT_SUFX}.  Se usar&aacute;n las tres.
No configure DISTNAME para que apunte al fichero directamente.

<li>Puede comprobar si ha rellenado estos valores correctamente,
escribiendo <b>make fetch-all</b>.
</ul>

<p>
Existen opciones y herramientas disponibles para portes m&aacute;s
complejos:

<ul>
<li>Tambi&eacute;n puede disponer de la variable PATCHFILES.
&Eacute;sta es una lista de parches de distribuidores (no de OpenBSD)
para el porte.  Generalmente son soluciones de fiabilidad, de seguridad,
o algo parecido.

<li>Si sus portes est&aacute;n disponibles en r&eacute;plicas
p&uacute;blicas grandes como GNU, SunSite, o CPAN, disponemos de una
lista de sitios en
<tt>/usr/ports/infrastructure/templates/network.conf.template</tt> para
su uso.  Configure MASTER_SITES como ${MASTER_SITE_GNU}.  o
${MASTER_SITE_SUNSITE}, etc.  Para simplificar este proceso, utilice la
composici&oacute;n ${MASTER_SITE_FOO:=subdir/} para a&ntilde;adir el
subdirectorio de distribuci&oacute;n.

<li>Generalmente los portes corresponden a versiones espec&iacute;ficas
de software.  Una vez que se han obtenido, se hace una suma de
comprobaci&oacute;n sobre los ficheros y se compara(n) a la(s) suma(s)
de comprobaci&oacute;n grabada(s) en <tt>distinfo</tt>.  As&iacute;
pues, para evitar confusi&oacute;n, <tt>DISTFILES</tt> y
<tt>PATCHFILES</tt> deber&iacute;an tener n&uacute;meros de
versi&oacute;n claramente visibles.  No coja foo-latest.tar.gz si es un
enlace a <tt>foo-1.0.5.tar.gz</tt>.  Si es necesario, preg&uacute;ntele
gentilmente al autor del programa original para aclarar las
distinciones.

<li>Si un porte cualquiera necesitara m&aacute;s de unos 5 DISTFILES +
PATCHFILES para funcionar, use DIST_SUBDIR para evitar demasiada
confusi&oacute;n en <tt>/usr/ports/distfiles</tt>.

<li>No se debe incluir n&uacute;meros de versi&oacute;n en DIST_SUBDIR.
Cuando se actualiza el porte a una versi&oacute;n posterior, es posible
que no cambien algunos ficheros de distfiles, pero si DIST_SUBDIR ha
cambiado, fetch los volver&aacute; a bajar.  Aun en el caso en que todos
los ficheros distfile cambiaran, ser&iacute;a m&aacute;s f&aacute;cil
para el usuario hacer un seguimiento completo.

<li>No es necesario que todos los DISTFILES y PATCHFILEs vengan del
mismo conjunto de MASTER_SITES.  Se pueden definir sitios suplementarios
usando las variables MASTER_SITES0 hasta MASTER_SITES9.  Simplemente,
escriba DISTFILES=foo-1.0.5.tar.gz:5 para obtener
<tt>foo-1.0.5.tar.gz</tt> desde MASTER_SITES5.

<li>Algunos portes no siempre necesitan obtener todos los ficheros.  Por
ejemplo, algunos portes pueden tener algunas opciones de
compilaci&oacute;n, y ficheros asociados que s&oacute;lo se requieren en
el caso concreto.  O es posible que necesiten algunos ficheros
s&oacute;lo para algunas arquitecturas y no para otras.  En ese caso,
esos ficheros suplementarios opcionales deben ser mencionados en la
variable SUPDISTFILES.  Objetivos como puedan ser <tt>makesum</tt> o
<tt>mirror-distfiles</tt> obtendr&aacute;n esos ficheros suplementarios
que no son necesarios para los otros.
</ul>

<br>
<li>Cree una suma de comprobaci&oacute;n en <tt>distinfo</tt> mediante
<b>make makesum</b>, y verifique que la suma de comprobaci&oacute;n es
correcta mediante <b>make checksum</b>.

<ul>
<li>En algunos casos extra&ntilde;os, las sumas de comprobaci&oacute;n
de los ficheros no se pueden verificar con fiabilidad.  En tales casos
es deseable que se comunique con el autor del software y con el
mantenedor del sitio del archivo.  En el peor de los casos, los ficheros
cuyas sumas de comprobaci&oacute;n no se puedan verificar, se
mencionar&aacute;n en la variable IGNOREFILES.

<li>Todos los ficheros en DISTFILES suelen ser procesados durante la
extracci&oacute;n con make extract.  Se puede usar EXTRACT_ONLY para
limitar la extracci&oacute;n a un subgrupo de ficheros (probablemente
vac&iacute;os).  El uso personal de esta variable es para personalizar
la extracci&oacute;n.  Por ejemplo, si algunos ficheros DISTFILES
necesitaran alg&uacute;n trato especial, bastar&iacute;a con eliminarlos
de EXTRACT_ONLY y gestionarlos de modo manual despu&eacute;s de la
extracci&oacute;n.  Por motivos hist&oacute;ricos, make extract
configura primero el directorio local junto con los ficheros de
extracci&oacute;n.  As&iacute;, el proveer de un objetivo previo a la
extracci&oacute;n es bastante inusual (y un comportamiento muy
sospechoso, que indica un alto grado de ofuscaci&oacute;n en el porte).

<li>Los parches que necesiten un trato espec&iacute;fico deben ser
mencionados en DISTFILES, y eliminados de EXTRACT_ONLY por motivos
hist&oacute;ricos.
</ul>

<br>
<li>Extraiga el porte con <b>make extract</b>.  Preste atenci&oacute;n a
la ubicaci&oacute;n de la base de los fuentes, que suele ser
<tt>w-${PKGNAME}${FLAVOR_EXT}/${DISTNAME}</tt>.  Es probable que tenga
que modificar la variable WRKDIST del fichero Makefile si es distinta.

<br>
<br>
<li>Lea la documentaci&oacute;n sobre la instalaci&oacute;n y se
dar&aacute; cuenta de lo que debe hacer para construir el porte y de
cualquier opci&oacute;n especial que pueda ser necesaria.

<br>
<br>
<li>Ahora es un buen momento para pensar en qu&eacute; tipo de
restricciones en la licencia se han aplicado a su porte.  Muchos
ser&aacute;n de libre redistribuci&oacute;n, pero muchos otros no.
Necesitamos la respuesta a cuatro preguntas para poder distribuir los
portes como es debido.  Estas respuestas son los valores PERMIT_* en el
fichero <tt>Makefile</tt>.

<ul>
<li>PERMIT_PACKAGE_CDROM nos indica que podemos incluir el paquete en el
cdrom.
<li>PERMIT_PACKAGE_FTP nos indica que podemos incluir el paquete en los
servidores p&uacute;blicos de ftp.
<li>PERMIT_DISTFILES_CDROM nos indica si podemos poner una
r&eacute;plica de los distfiles en el cdrom.
<li>PERMIT_DISTFILES_FTP nos indica si podemos poner una r&eacute;plica
de los distfiles en los servidores p&uacute;blicos de ftp.
</ul>

<p>
Configure esos valores con Yes si est&aacute; permitido, o a una cadena
de comentarios que explique porqu&eacute; no est&aacute; permitido.
Preste atenci&oacute;n a cualquier condici&oacute;n especial que pueda
tener que cumplir m&aacute;s tarde.  Por ejemplo, algunos portes
requieren que se instale una copia de la licencia que los
acompa&ntilde;a.  Le recomendamos que ponga la licencia en
<tt>/usr/local/share/DISTNAME/</tt>.

<br>
<br>
<li>A&ntilde;ada las opciones de configuraci&oacute;n al fichero
<tt>Makefile</tt> y/o genere el gui&oacute;n de configuraci&oacute;n.

<ul>
<li>Puede a&ntilde;adir un gui&oacute;n de configuraci&oacute;n del
porte con el nombre `configure' a un directorio que llamar&aacute;
<tt>scripts/</tt>.  Esto ser&aacute; ejecutado antes de ejecutar
cualquier configuraci&oacute;n especificada por CONFIGURE_STYLE.

<li>Si usa GNU configure, es probable que antes quiera ejecutar
'./configure --help' para ver qu&eacute; opciones hay disponibles.

<li>Cualquier otra cosa que quiera anular se puede cambiar
a&ntilde;adiendo los indicadores --option al par&aacute;metro
CONFIGURE_ARGS en el fichero <tt>Makefile</tt>.

<li>Use CONFIGURE_ARGS+= para a&ntilde;adir a la variable.  Use
CONFIGURE_ARGS= para anularla.
</ul>

<br>
<li>Intente construir el porte con <b>make build</b>.

<ul>
<li>Si est&aacute; de suerte, el porte se compilar&aacute; sin errores.

<li>Si termina el proceso con un error, tendr&aacute; que generar
parches para su porte.  Intente imaginar qu&eacute; cambios puede
necesitar y haga un parche para ellos.

<li>Los parches deben ser relativos a ${WRKDIST}.

<li>El modo m&aacute;s f&aacute;cil de reconfigurar un porte y probar
los parches es <b>make clean patch</b>.  Esto eliminar&aacute; el
directorio local, har&aacute; la reextracci&oacute;n, y aplicar&aacute;
los parches.
</ul>

<br>
<li>Empiece un ciclo de <b>make build</b>, genere un parche (o use
<b>make update-patches</b>), y <b>make clean patch</b>.

<ul>
<li>Los parches van en el directorio <tt>patches/</tt>, y deben llevar
nombre del tipo patch-* (en donde * sea algo con sentido).  Le
recomendamos que nombre sus parches patch-FILENAME, en donde FILENAME
sea el nombre del fichero al que se est&eacute; aplicando el parche
(<b>make update-patches</b> hace esto autom&aacute;ticamente).

<li>La aplicaci&oacute;n de PATCHFILES es la primera mitad de 'make
patch'.  Se puede invocar por separado como 'make dispatch', que es un
objetivo conveniente para los mantenedores de parches.  Ignore esto si
no lo ha configurado.

<li>Parchee s&oacute;lo un fichero fuente por cada patchfile.

<li>Use <b>make update-patches</b> para generar parches.

<li>Todos los parches DEBEN ser relativos a ${WRKDIST}.

<li>Compruebe que los parches <b>NO</b> contengan indicadores que puedan
ser reemplazados por cvs.  Si contiene alguno, entonces sus parches no
ser&aacute;n aplicados despu&eacute;s de haberlos entregado.  Puede
entregar sus cambios con -kk para evitar esto.

<li>Escriba una peque&ntilde;a explicaci&oacute;n al principio del
ficheo del parche sobre su prop&oacute;sito (no es obligatorio).

<li><b>Por favor</b>, env&iacute;e sus parches al autor original del
software.
</ul>

<br>
<li>Intente activar <tt>SEPARATE_BUILD</tt>.

<br>
<ul>
<li>Si el porte se puede construir con ficheros objeto fuera de su
&aacute;rbol de fuentes, ser&aacute; m&aacute;s limpio (muchos programas
que usan <tt>CONFIGURE_STYLE=gnu</tt> pueden), y puede ayudar a los
usuarios que montan su &aacute;rbol de portes en varias arquitecturas.

<li>Esto tambi&eacute;n le puede evitar alg&uacute;n esfuerzo, ya que es
posible que pueda reiniciar el ciclo en <tt>configure</tt> la
mayor&iacute;a de las veces.
</ul>

<br>
<li>Lea detenidamente la salida (si es que produce alguna) y retoque
cualquier opci&oacute;n necesaria en el fichero Makefile.  Para repetir,
invoque la orden `<b>make clean configure</b>'.

<p>
Nota: aseg&uacute;rese de que los ficheros dependientes del
anfitri&oacute;n van a <tt>/etc</tt> o <tt>/etc/&lt;nombre&gt;</tt>,
pero <b>NUNCA SUBSTITUYA O MODIFIQUE</b> ficheros que existan en
<tt>/etc</tt>.  Es mejor poner install en
<tt>/usr/local/share/&lt;nombre&gt;</tt> y que los copie a <tt>/etc</tt>
o <tt>/etc/&lt;nombre&gt;</tt>, s&oacute;lo si los ficheros no existen.
Si los ficheros existen, muestre un mensaje que indique que tal y tal
fichero necesita ser modificado.  Esto tambi&eacute;n garantiza que los
ficheros sean incluidos en el paquete, ya que todo lo que haya en
<tt>/usr/local</tt> se incluye en PLIST.  Despu&eacute;s de que un
paquete haya sido instalado, se mostrar&aacute; el contenido de
<tt>pkg/MESSAGE</tt>, si es que existe.

<p>
Las ubicaciones de los ficheros de OpenBSD son:

<pre>
   ejecutables del usuario:		/usr/local/bin
   ejecutables del adminstrador:	/usr/local/sbin
   ejecutables por programas:		/usr/local/libexec
   bibliotecas:				/usr/local/lib
   datos dep. arquitectura:		/usr/local/lib/&lt;nombre&gt;
   ficheros include instalados:		/usr/local/include o
					/usr/local/include/&lt;nombre&gt;
   datos de m&aacute;qina
   &uacute;nicos:	       			/etc o /etc/&lt;nombre&gt;
   estado local:			/var/run
   ficheros de
   puntuaci&oacute;n de juegos:		/var/games
   ficheros GNU info:			/usr/local/info
   p&aacute;ginas del manual:			/usr/local/man/...
   s&oacute;lo lectura indep. 
   arquitectura:			/usr/local/share/&lt;nombre&gt;
   documentaci&oacute;n 
   miscel&aacute;nea:				/usr/local/share/doc/&lt;nombre&gt;
</pre>

<li>Empiece un ciclo de makes hasta que el porte est&eacute; listo.  Use
Patch (ver arriba), clean, y make hasta generar el porte.
L&iacute;brese de todos los avisos si es posible, especialmente de los
avisos relacionados con la seguridad.

<br>
<br>
<li>Controle la sem&aacute;ntica de SEPARATE_BUILD.  Debe hacerlo
s&oacute;lo si el porte se compila con SEPARATE_BUILD definido.  Lo
ideal ser&iacute;a que el porte no modificara ning&uacute;n fichero en
${WRKSRC} despu&eacute;s de <b>make patch</b>.  Puede
comprobarlo asegur&aacute;ndose de que usted no tenga acceso de
escritura a ${WRKSRC}.  Entonces puede configurar
<tt>SEPARATE_BUILD=concurrent</tt>...  alguien podr&iacute;a usar el
mismo &aacute;rbol de fuentes para compilarlo en arquitecturas
diferentes de forma simult&aacute;nea.  De otro modo, configure
<tt>SEPARATE_BUILD=simple</tt>...  compilar en distintas arquitecturas
de forma simult&aacute;nea puede acarrear problemas, ya que muchos
ficheros de fuentes pueden ser regenerados en momentos dif&iacute;ciles.

<br>
<br>
<li>A&ntilde;ada <tt>COMMENT</tt> en el fichero Makefile.  COMMENT es
una <b>CORTA</b> descripci&oacute;n en una l&iacute;nea del porte (60
caracteres máximo).  <b>NO</b> incluya el nombre del paquete (o el
n&uacute;mero de la versi&oacute;n del software) en el comentario.
<b>NO</b> lo empiece con may&uacute;scula a menos que tenga un
significado sem&aacute;ntico, y <b>NO</b> lo termine con un punto.
<b>NI SIQUIERA EMPIECE CON UN ART&Iacute;CULO INDETERMINADO COMO
&quot;a&quot; o &quot;as&quot; (ingl&eacute;s, por supuesto);  elimine
el art&iacute;culo del todo.</b>

<br>
<br>
<li>Edite <tt>pkg/DESCR</tt>, <tt>pkg/PLIST</tt>.
<ul>
<li><tt>DESCR</tt> es una descripci&oacute;n m&aacute;s larga del porte.
Desde uno hasta unos cuantos p&aacute;rrafos que expliquen brevemente lo
que hace el porte ser&aacute; suficiente.  Se recomienda usar un
m&aacute;ximo de 72 caracteres por l&iacute;nea.  Esto se puede hacer
editando primero el fichero <tt>DESCR</tt> y ejecut&aacute;ndolo a
continuaci&oacute;n mediante <b>fmt -w 72</b>.

<li>PLIST se mantendr&aacute; vac&iacute;o de momento.
</ul>

<br><li>
Si la aplicaci&oacute;n necesita crear un usuario o un grupo, hay que
escoger el id de menor rango de
<code>/usr/ports/infrastructure/db/user.list</code> para que lo use el
porte y asegurarse de que el porte se a&ntilde;ade a este fichero en el
momento de la entrega por cvs.

<br><br><li>
Instale la aplicaci&oacute;n con <b>make install</b>.  Si el porte
instala bibliotecas din&aacute;micas, compruebe sus tablas de
s&iacute;mbolos con <code>nm</code>, ya que alg&uacute;n software
equivocado quita las bibliotecas din&aacute;micas, lo que puede
conllevar fallos extra&ntilde;os m&aacute;s tarde.  Por otra parte, los
binarios ejecutables DEBER&Iacute;AN ser eliminados;  se puede usar
<b>file</b> para determinar cu&aacute;les.  Si el porte ya incluyera
c&oacute;digo para eliminar los binarios (o sea, el objetivo
<tt>install-strip</tt>), util&iacute;licelo;  en caso contrario, debe
incluirlo en el fichero <tt>Makefile</tt>.

<br>
<br>
<li><b>Verifique los agujeros de seguridad del porte otra vez</b>.  Esto
es especialmente importante para programas de red y setuid.  Lea
nuestras <a href="porting.html#Security">recomendaciones de
seguridad</a>.  Registre en el fichero <tt>pkg/SECURITY</tt> todo
aquello que pueda ser interesante y las soluciones.  Este fichero debe
ser una lista de problemas potenciales auditados, junto con parches
importantes, de modo que otra persona pueda ver a primera vista lo que
se ha hecho.  Por ejemplo:

<pre> 
      &#36;OpenBSD&#36;

      ${WRKDIR}/receiver.c
         call to mktemp (wrapper function do_mktemp) does seem to be correct.

      The server makes extensive use of strlcpy/strlcat/snprintf.
</pre>

<li>Cree el fichero <tt>pkg/PLIST</tt>.  Despu&eacute;s de que la
instalaci&oacute;n se haya completado use la orden de desarrollador
<b>make plist</b>, que compila el fichero <tt>PLIST</tt> en el
directorio <tt>pkg</tt>.  Este fichero es un candidato a la lista de
paquetes.

<p>
&iexcl;Atento!  Los ficheros se encuentran por la marca de tiempo
(<i>timestamp</i>).  Esto significa que NO DEBE:

<ul>
<li>listar ning&uacute;n fichero instalado con 'tar' ya que su marca de
tiempo no cambiar&aacute; y por lo tanto no ser&aacute; encontrado por
'find';
<li>actualizar el fichero <tt>info/dir</tt> si se a&ntilde;aden los
ficheros .info.  Aseg&uacute;rese tambi&eacute;n de que
<tt>info/dir</tt> no forma parte de PLIST;
<li>intentar hacer nada especial con enlaces o enlaces
simb&oacute;licos.  Una prueba r&aacute;pida de 'tar' muestra que hace
lo correcto con los enlaces y enlaces simb&oacute;licos, as&iacute; que
no hay raz&oacute;n para ning&uacute;n caso especial en la lista de
paquetes.  A&uacute;n as&iacute;...
</ul>

<p>
Lea detenidamente <tt>PLIST</tt> y verifique que se haya instalado todo,
y que la instalaci&oacute;n haya tenido lugar en las ubicaciones
pertinentes.  Se puede a&ntilde;adir cualquier parte que no se haya
instalado a una regla `post-install' en el fichero Makefile del porte.

<p> Los portes que instalen bibliotecas compartidas tendr&aacute;n otro
fichero llamado <tt>PFRAG.shared</tt>.

<ul>
<li><tt>PLIST</tt> describe los ficheros independientemente de si la
arquitectura tiene soporte para bibliotecas compartidas o no.

<li><tt>PFRAG.shared</tt> describe s&oacute;lo aquellos ficheros que se
hayan instalado en las arquitecturas con soporte para bibliotecas
compartidas.

<li><tt>PFRAG.noshared</tt> describe s&oacute;lo aquellos ficheros que
se hayan instalado en las arquitecturas sin soporte para bibliotecas
compartidas.
</ul>

<br>
<li>Siga desinstalando y reinstalando hasta que est&eacute; perfecto.
<i>Perfecto</i> es cuando todo instala y desinstala en su
ubicaci&oacute;n correcta.  Para desinstalar se usa la orden
'pkg_delete' &lt;nombre_paquete&gt;'.  Para reinstalar se usa la orden
'sudo make reinstall'.  Lea la p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_create&apropos=0&sektion=0&manpath=OpenBSD+Current&format=html">pkg_create(1)</a>
para ver otras &oacute;rdenes que se pueden a&ntilde;adir a PLIST para
asegurarse de que est&aacute; todo limpio.  Despu&eacute;s de una
desinstalaci&oacute;n, la orden
    <pre>
    find /usr/local -newer w-${PKGNAME}${FLAVOR_EXT}/fake-${MACHINE_ARCH}[-${FLAVOR}]/.install_started -print
    </pre>
deber&iacute;a mostrar s&oacute;lo la lista de nombre de directorios
t&iacute;picos.
    
<br>
<br>
<li>
Pruebe el paquete.  Despu&eacute;s de que el porte haya instalado
correctamente, use la orden <b>make package</b> para crear un paquete.
Para probar el paquete, primero use <b>pkg_delete</b> y a
continuaci&oacute;n <b>pkg_add</b>.  Los resultados después de
<b>pkg_add</b> deber&iacute;an ser EXACTAMENTE los mismos que los
resultados despu&eacute;s de <b>make install</b>.

<br>
<br>
<li>
Env&iacute;e una breve nota a 
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a> para pedir
comentarios y pruebas.  Adjunte el porte a este mensaje y
env&iacute;elo.

<p>
Intente que otros usuarios lo prueben en varias plataformas.

<ul>
<li>La plataforma de DEC Alpha es buena porque s&oacute;lo tiene
bibliotecas est&aacute;ticas y porque <code>sizeof(int) !=
sizeof(long)</code>.

<li>La plataforma de Sun SPARC es buena porque es muy com&uacute;n y
porque su orden de byte es al rev&eacute;s que en i386;  si hubiera
llevado a cabo el desarrollo en SPARC, entonces querr&aacute; probarlo
en i386.
</ul>

<br>
<li>Incorpore cualquier informaci&oacute;n que reciba.  Pru&eacute;belo
de nuevo en su plataforma.  Consiga que quienes le enviaron
informaci&oacute;n sobre la primera prueba, vuelvan a probar el nuevo
porte.

<br>
<br>
<li>Finalmente, incl&uacute;yalo en el &aacute;rbol de portes.  Si no
tiene acceso al CVS, pida a alguien en 
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a> que haga la
entrega.

<br>
<br>
<li>Si es un desarrollador con acceso a CVS, entr&eacute;guelo Vd.
mismo.  Generalmente usamos &quot;import&quot; para un porte nuevo, en
lugar de usar &quot;add&quot; para cada uno de tropecientos (o una
docena) ficheros.  &quot;import&quot; usa n&uacute;meros de
versi&oacute;n &quot;vendor branch&quot; como 1.1.1.1, pero no se
preocupe por eso.  Si efect&uacute;a cambios a un fichero
espec&iacute;fico (editar y entregar por cvs), ser&aacute; 1.2 y se
usar&aacute; ese n&uacute;mero.

<p>
De un modo breve, &quot;cvs import&quot; se suele usar cuando un se crea
un porte.  A partir de ah&iacute; se suele usar &quot;cvs add&quot; y
&quot;cvs rm&quot; para a&ntilde;adir o eliminar ficheros individuales,
y el ciclo normal editar-&gt;entregar para los cambios.  Puede usar algo
como esto:

<pre>
$ cd kaffe1
$ make clean	# &iexcl;en realidad no querr&aacute; 
                # comprobar todo el trabajo!
$ cvs -d cvs.openbsd.org:/cvs import -m 'kaffe port' ports/lang/kaffe1 \
	<i>SuNombre</i> <i>SuNombre_YYYY-MMM-DD</i>
</pre>

<ul>
<li>-d cvs.openbsd.org:/cvs indica la direcci&oacute;n de cvs.  Se puede
omitir esto si se ha definido una variable de entorno CVSROOT.

<li>-m 'kaffe port' es su mensaje de registro.  Ponga lo que quiera

<li>ports/lang/kaffe1 es el camino relativo a /cvs, en donde reside el
porte.

<li><i>SuNombre</i> (substituir con su nombre de ingreso) es el
&quot;vendor tag&quot; (etiqueta del distribuidor).  Vd. lo
import&oacute;, as&iacute; que Vd. es el distribuidor.

<li><i>SuNombre_YYYY-MMM-DD</i> (v.g., ian_2000-jan-01) es el
&quot;vendor release tag&quot; (etiqueta de lanzamiento del
distribuidor).  Tan buena como cualquier otra.
</ul>

<p>
A modo de ejemplo real, he aqu&iacute; la salida de la
comprobaci&oacute;n del porte Kaffe1, que uno de nosotros hizo el 8 de
septiembre de 1.998:

<pre>
$ cd kaffe1
$ make clean &gt;/dev/null
$ cvs import -m 'kaffe1.0(==JDK1.1) port' ports/lang/kaffe1 ian ian_1998-Sep-08
ian@cvs.openbsd.org's password: (l&oacute;gicamente no se muestra)
I ports/lang/kaffe1/CVS
I ports/lang/kaffe1/files/CVS
I ports/lang/kaffe1/pkg/CVS
N ports/lang/kaffe1/Makefile
cvs server: Importing /cvs/ports/lang/kaffe1/files
N ports/lang/kaffe1/files/md5
cvs server: Importing /cvs/ports/lang/kaffe1/pkg
N ports/lang/kaffe1/pkg/COMMENT
N ports/lang/kaffe1/pkg/DESCR
N ports/lang/kaffe1/pkg/PLIST

No conflicts created by this import
$ 
</pre>

<li>Por &uacute;ltimo, a&ntilde;ada una entrada de una l&iacute;nea para
el nuevo porte en el fichero <tt>Makefile</tt> de su directorio de
primer nivel;  por ejemplo, para <tt>ports/lang/kaffe1</tt>,
a&ntilde;&aacute;dala en <tt>ports/lang/Makefile.</tt>

<br>
<br>
<li>&iexcl;Mantenga el porte!  Seg&uacute;n pase el tiempo pueden surgir
problemas, o pueden aparecer nuevas versiones del software.  Debe
intentar mantener su porte actualizado:  en otras palabras,
&laquo;probar, comprobar, verificar, probar, ...&raquo;

<br>
<br>
<li>Cuando actualice un porte, recuerde gestionar las dependencias.  No
debe dejar que ning&uacute;n otro porte que dependa del suyo pueda
quedar &laquo;roto&raquo;.  En caso de que surjan problemas,
comun&iacute;quese con los mantenedores de estos portes.  Asimismo,
est&eacute; atento a las actualizaciones de otros portes de los que
pueda depender el suyo, y compruebe que el mantenedor haya hecho bien su
trabajo.

</ol>
 
&iexcl;Gracias por su apoyo el proceso de portes de OpenBSD!

<hr>

<a href="porting.html"><img height="24" width="24" src="../images/back.gif"
 border="0" alt="Porting"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: checklist.html,v 1.52 ]<br>
$Translation: checklist.html,v 1.26 2003/11/02 01:09:02 horacio Exp $<br>
$OpenBSD: checklist.html,v 1.26 2003/11/02 01:30:43 horacio Exp $
</small>
</body>
</html>
