<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de criptografía de OpenBSD">
<meta name="keywords" content="openbsd,cryptografía,cifrado,openssh,openssl,kerberos">
<meta name="keywords" content="ipsec,isakmp,ike,blowfish,des,rsa,dsa">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1997-2002 de OpenBSD.">
<title>Criptograf&iacute;a en OpenBSD</title>
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<img align="left" alt="[OpenBSD]" height="166" width="197" src="../images/blowfish-notext.jpg">
<br>
<br>
<br>
&#8211;&#8211;El &quot;mantra&quot; de cualquier buen ingeniero de
seguridad es : &laquo;La seguridad no es un producto, sino un
proceso.&raquo;  Es algo m&aacute;s que dise&ntilde;ar
criptograf&iacute;a fuerte en un sistema;  es dise&ntilde;ar el sistema
por completo de manera que todas las medidas de seguridad, incluyendo la
criptograf&iacute;a, funcionen al un&iacute;sono.&#8212;&#8212;<br>
<br>
-- Bruce Schneier, autor de &quot;Applied Cryptography&quot;.
<br clear="all">
<h2><font color="#e00000">Criptograf&iacute;a</font></h2>
<hr>

<b>&Iacute;ndice de contenidos</b><br>
<a href="#why">&iquest;Por qu&eacute; incluimos
criptograf&iacute;a?</a>.<br> 
<a href="#ssh">OpenSSH</a>.<br> 
<a href="#prng">Generadores de n&uacute;meros pseudoaleatorios</a>
(PRNG): ARC4, ...<br>
<a href="#hash">Funciones de resumen criptogr&aacute;fico
(<em>&quot;hash functions&quot;</em>)</a>: MD5, SHA1, ...<br>
<a href="#trans">Transformaciones criptogr&aacute;ficas</a>: DES,
Blowfish, ...<br>
<a href="#hardware">Soporte para componentes
criptogr&aacute;ficos</a><br>
<a href="#people">Se buscan cript&oacute;grafos internacionales</a><br>
<a href="#papers">Otros textos</a><br>
<p>

<hr>

<p>
<a name="why"></a>
<h3><font color="#e00000">&iquest;Por qu&eacute; incluimos
criptograf&iacute;a?</font></h3><p>

En dos palabras:  <b>porque podemos</b>.

<p>
El proyecto OpenBSD est&aacute; ubicado en Canad&aacute;.

<p>
La <a href="../ECL.html">Lista sobre Controles a la Exportaci&oacute;n
de Canad&aacute;</a> no impone ninguna restricci&oacute;n significativa
a la exportaci&oacute;n de <em>software</em> criptogr&aacute;fico, y es
incluso m&aacute;s expl&iacute;cita sobre la exportaci&oacute;n de
<em>software</em> de libre disponibilidad.  Marc Plumb ha realizado un 
<a href="http://www.efc.ca/pages/doc/crypto-export.html">estudio para
comprobar las leyes sobre criptograf&iacute;a</a>.

<p>
Gracias a este detalle, el proyecto OpenBSD ha integrado
criptograf&iacute;a en muchas partes del sistema operativo.  Una
condici&oacute;n <em>sine qua non</em> que exigimos del
<em>software</em> criptogr&aacute;fico que usamos es que sea de
<a href="policy.html">dominio p&uacute;blico y con licencias
decentes</a>.  No hacemos uso directo de criptograf&iacute;a con
patentes restrictivas.  Tambi&eacute;n exigimos que provenga de
pa&iacute;ses con leyes sobre la exportaci&oacute;n &uacute;tiles para
nosotros, ya que no deseamos quebrantar las leyes de ning&uacute;n
pa&iacute;s.  Los componentes criptogr&aacute;ficos que usamos hoy en
d&iacute;a fueron escritos en Argentina, Australia, Canad&aacute;,
Alemania, Grecia, Noruega, y Suecia.

<p>
Cuando creamos revisiones de las versiones de OpenBSD, las versiones
preliminares (<em>snapshots</em>), construimos los binarios para
&eacute;stas en pa&iacute;ses libres, para asegurarnos de que todo el
c&oacute;digo fuente y binario que ponemos a disposici&oacute;n de los
usuarios est&eacute; libre de toda sospecha.  En el pasado hemos
compilado nuestras versiones binarias en Canad&aacute;, Suecia y
Alemania.

<p>
OpenBSD incluye Kerberos V.  El c&oacute;digo base que usamos es el de
la versi&oacute;n exportable de Heimdal, de Suecia.  Hemos ampliado
nuestro c&oacute;digo fuente del entorno gr&aacute;fico X11 para usar
Kerberos.

<p>
<img align="right" src="../images/vpnc-test-partner.gif" alt="VPNC TEST PARTNER">
OpenBSD fue el primer sistema operativo que incluy&oacute; IPsec.  Hemos
incluido IPsec desde el lanzamiento de OpenBSD 2.1 en 1997.  Nuestra
implementaci&oacute;n de IPsec integrada en el n&uacute;cleo, con
aceleraci&oacute;n de <em>hardware</em> basada en una variedad de
tarjetas, y nuestro d&aelig;mon libre ISAKMP, se usa como una de las
m&aacute;quinas para las pruebas de conformidad de IPsec realizadas por
<a href="http://www.vpnc.org">VPNC</a>.
<br clear="all">

<p>
La criptograf&iacute;a es hoy un importante medio para mejorar la
<a href="security.html">seguridad</a> en un sistema operativo.  La
criptograf&iacute;a que se utiliza en OpenBSD se puede clasificar
seg&uacute;n varios aspectos, descritos en esta p&aacute;gina.

<p>
<a name="ssh"></a>
<h3><font color="#e00000">OpenSSH</font></h3>

<p>
Desde la versi&oacute;n 2.6, OpenBSD contiene
<a href="http://www.openssh.com/es/">OpenSSH</a>, una versi&oacute;n de
ssh totalmente libre y sin grav&aacute;menes de patentes.
<a href="http://www.openssh.com/es/">OpenSSH</a> interaccionaba con la
versi&oacute;n 1 de ssh y adem&aacute;s a&ntilde;ad&iacute;a muchas
caracter&iacute;sticas:

<ul>
<li>todos los componentes de naturaleza restrictiva (o sea, patentes;
ve&aacute;se
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl(8)</a>)
hab&iacute;an sido eliminados directamente del c&oacute;digo fuente;
cualquier componente bajo licencia o patentado usaba bibliotecas
externas;
  
<li>hab&iacute;a sido actualizado para dar soporte al protocolo 1.5 de
ssh;

<li>conten&iacute;a adem&aacute;s soporte para autenticaci&oacute;n y
pases de tickets con Kerberos;

<li>inclu&iacute;a soporte para autenticaci&oacute;n con
&laquo;contrase&ntilde;a de uso de una sola vez&raquo; (<em>one-time
password</em>) con 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&amp;sektion=1">
skey(1)</a>.
</ul>

<p>
Dicho brevemente, tomamos una versi&oacute;n de ssh bajo licencia libre
y la &laquo;OpenBSD-izamos&raquo;.  Un a&ntilde;o m&aacute;s tarde,
extendimos OpenSSH para que tambi&eacute;n incluyera el protocolo SSH 2.
El resultado fue el soporte para los 3 protocolos principales de SSH:
1.3, 1.5 y 2.0.

<p>
<a name="prng"></a>
<h3><font color="#e00000">Generadores de n&uacute;meros
pseudoaleatorios</font></h3>

<p>
Un generador de n&uacute;meros pseudoaleatorios (PRNG, <em>Pseudo Random
Number Generator</em>) provee a las aplicaciones con una fuente de
n&uacute;meros que tienen ciertas propiedades importantes para la
seguridad del sistema:

<p>
<ul>
<li>Deber&iacute;a ser imposible que un extra&ntilde;o pudiera predecir
la salida del generador de n&uacute;meros aleatorios, incluso si conoce
la salida anterior.

<li>Los n&uacute;meros generados no deber&iacute;an tener patrones que
se repitieran, lo que quiere decir que el PRNG deber&iacute;a tener una
longitud de ciclo muy larga.
</ul>

<p>
Un PRNG es, por lo general, un algoritmo en el que los mismos valores
iniciales producir&aacute;n las mismas secuencias de salida.  En un
sistema operativo multiusuario existen muchos recursos que permiten
alimentar el PRNG con datos aleatorios.  El n&uacute;cleo de OpenBSD usa
el interruptor de tiempo del rat&oacute;n, las se&ntilde;ales de
interrupci&oacute;n de datos de la red, las se&ntilde;ales producidas
entre diferentes pulsaciones de teclado y la informaci&oacute;n de E/S
del disco, para alimentar la entrop&iacute;a.  Los n&uacute;meros
aleatorios est&aacute;n disponibles para las rutinas del n&uacute;cleo y
se exportan mediante dispositivos a programas en los directorios de
usuario.

<p>
Hasta el momento, los n&uacute;meros aleatorios se usan en las
siguientes partes:

<p>
<ul>
<li>Asignaci&oacute;n din&aacute;mica de sin_port en bind(2).
<li>PIDs de procesos.
<li>IDs de datagramas de IP.
<li>IDs de transacci&oacute;n de RPC (XID).
<li>IDs de transacci&oacute;n de NFS RPC (XID).
<li>IDs de requerimiento de DNS.
<li>N&uacute;meros de generaci&oacute;n de I-nodos (ver
getfh(2) y fsirand(8)).
<li>Perturbaciones de tiempo en traceroute(8).
<li>Nombres temporales m&aacute;s robustos para mktemp(3) y
mkstemp(3).
<li>Aleatoriedad a&ntilde;adida al valor TCP ISS para la
protecci&oacute;n contra ataques de &laquo;falseamiento de
direcciones&raquo; (<em>spoofing</em>).
<li>Relleno aleatorio en los paquetes esp_old de IPsec.
<li>Generaci&oacute;n de &laquo;sales&raquo; para los distintos
algoritmos de las contrase&ntilde;as.
<li>Generaci&oacute;n de retos S/Key falsos.
<li>En <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd&amp;sektion=8">isakmpd(8)</a>,
proveer pruebas vivas de intercambios de claves.
</ul>

<p>
<a name="hash"></a>
<h3><font color="#e00000">Funciones de resumen criptogr&aacute;fico
(<em>hash functions</em>)</font></h3><p>

<p>
Una funci&oacute;n de resumen criptogr&aacute;fico comprime sus datos de
entrada en una cadena de tama&ntilde;o constante.  Para una
funci&oacute;n de resumen criptogr&aacute;fico no es factible encontrar:

<p>
<ul>
<li>dos entradas que tengan la misma salida (resistencia a la
colisi&oacute;n);
<li>una entrada diferente para una entrada dada con la misma salida
(resistencia a 2a preimagen).
</ul>

<p>
MD5, SHA1 y RIPEMD-160 se usan en OpenBSD como funciones de resumen
criptogr&aacute;fico, v.g.:

<p>
<ul>
<li>En
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&amp;sektion=1">
S/Key(1)</a> para proveer contrase&ntilde;as de uso de una sola vez.

<li>En
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&amp;sektion=4">IPsec(4)</a> 
e <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd&amp;sektion=8">isakmpd(8)</a>
para autenticar el origen de los datos de los paquetes y asegurar la
integridad de los paquetes.
   
<li>Para las contrase&ntilde;as MD5 de estilo FreeBSD (no activadas por
definici&oacute;n), v&eacute;ase
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd.conf&amp;sektion=5">passwd.conf(5)</a>

<li>En <em>libssl</em> para la firma digital en los mensajes.
</ul>

<p>
<a name="trans"></a>
<h3><font color="#e00000">Transformaciones
criptogr&aacute;ficas</font></h3>

<p>
Las transformaciones criptogr&aacute;ficas se usan para cifrar y
descifrar datos.  &Eacute;stas son com&uacute;nmente utilizadas con una
clave de cifrado para cifrar datos, y con una clave de descifrar para
descifrarlos.  La seguridad de una transformaci&oacute;n
criptogr&aacute;fica deber&iacute;a descansar s&oacute;lo en el material
de la clave.

<p>
OpenBSD provee transformaciones como DES, 3DES, Blowfish y Cast para el
n&uacute;cleo del sistema y los programas en directorios de usuario, y
se usan en muchas partes, como por ejemplo:

<p>
<ul>
<li>En libc para crear contrase&ntilde;as con 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=blf_key&amp;sektion=3">Blowfish(3)</a>.
V&eacute;anse tambi&eacute;n las
<a href="../papers/bcrypt-paper.ps">ponencias de USENIX</a> sobre este
tema.

<li>En
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&amp;sektion=4">IPsec(4)</a>
para proveer confidencialidad en la red.
   
<li>En
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd&amp;sektion=8">isakmpd(8)</a>
para proteger los intercambios en los que se negocie material de clave
IPsec.
   
<li>En AFS para proteger los mensajes que pasan por la red, dando
confidencialidad para el acceso remoto a los sistemas de archivos.
   
<li>En libssl para dejar que las aplicaciones se comuniquen mediante el
protocolo <em>de facto</em> criptogr&aacute;ficamente seguro, SSL.
</ul>

<p>
<a name="hardware"></a>
<h3><font color="#e00000">Soporte para componentes criptogr&aacute;ficos
(<em>hardware</em>)</font></h3>

<p>
A partir de la versi&oacute;n 2.7 de OpenBSD se empez&oacute; a
a&ntilde;adir soporte para componentes criptogr&aacute;ficos, como
aceleradores de cifrado y generadores de n&uacute;meros aleatorios.

<p>
<ul>
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crypto&amp;sektion=9">IPsec crypto dequeue</a></b><br>
Hemos modificado IPsec para poder implementar algunas funciones
criptogr&aacute;ficas.  La mayor parte del c&oacute;digo de IPsec
necesita usar criptograf&iacute;a para procesar cada paquete, lo que
requiere cierta sincronizaci&oacute;n.  Para usar el <em>hardware</em>
de un modo correcto y r&aacute;pido, es necesario separar estos dos
componentes, como hemos hecho nosotros.  De este modo se mejoran incluso
los resultados obtenidos del <em>software</em>.

<p>
<li><li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hifn&amp;sektion=4">Hifn 7751</a></b><br>
Las tarjetas que usen Hifn 7751 se pueden utilizar como aceleradoras de
criptograf&iacute;a sim&eacute;trica, o sea
<a href="http://www.soekris.com/vpn1201.htm">Soekris VPN1201 o
VPN1211</a> (<a href="http://www.soekris.com/how_to_buy.htm">
informaci&oacute;n sobre compra</a>) o
<a href="http://www.powercrypt.com">PowerCrypt</a>.  Con el uso de una
Hifn 7751 en cada extremo de un t&uacute;nel se obtienen unos resultados
de 64Mbits por segundo para 3DES/SHA1 ESP, una mejor&iacute;a de casi un
600% en una CPU P3/550.  Estamos trabajando para mejorar unos cuantos
puntos, pero desde el 13 de abril de 2000, el c&oacute;digo ya se
considera estable.  Hemos desarrollado nuestro propio dispositivo para
el soporte de este <em>chip</em>, en lugar de usar el dispositivo de
<a href="http://www.powercrypt.com">PowerCrypt</a> (desarrollado en los
EE.UU.), as&iacute; como nuestros enlaces del dispositivo con IPsec.

<p>
El 7751 est&aacute; actualmente considerado como lento de acuerdo con
las normas de la industria, y muchos distribuidores disponen de
<em>chips</em> m&aacute;s veloces (en la actualidad, incluso el Hifn
tiene un <em>chip</em> m&aacute;s veloz aunque m&aacute;s caro).  El
rendimiento m&aacute;ximo con 3DES SHA1 ESP es de unos 64Mbit/seg.

<p>
Despu&eacute;s del lanzamiento de la versi&oacute;n 2.9, se
a&ntilde;adi&oacute; soporte para el <em>chip</em> Hifn 7951, un
versi&oacute;n simplificada del 7751 que incluye un acelerador de claves
p&uacute;blicas (sin soporte) y un generador de n&uacute;meros
aleatorios (con soporte).  Las tarjetas fueron una donaci&oacute;n de
<a href="http://www.soekris.com/">Soekris Engineering</a>.

<p>
Despu&eacute;s del lanzamiento de la versi&oacute;n 3.0, se
a&ntilde;adi&oacute; soporte para el <em>chip</em> Hifn 7811, una
versi&oacute;n m&aacute;s r&aacute;pida del 7751 (unos 130Mbit/s) con un
generador de n&uacute;meros aleatorios.  La tarjeta fue una
donaci&oacute;n de <a href="http://www.gtgi.com/">GTGI</a>.

<p>
Con posterioridad al lanzamiendo de la versi&oacute;n 3.2, se
a&ntilde;adi&oacute; soporte para el algoritmo de compresi&oacute;n LZS
utilizado por
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipcomp&amp;sektion=4">ipcomp(4)</a>.

<p>
Con posterioridad a OpenBSD 3.4 se ha a&ntilde;adido soporte para los
<i>chips</i> 7955 y 7956.  Adem&aacute;s de todas las funcionalidades
que ya ten&iacute;a en <i>chip</i> 7951 anterior, con &eacute;stos se
a&ntilde;ade AES.

<p>
Al principio fue muy dif&iacute;cil tratar con la compa&ntilde;&iacute;a
Hifn (incluso llegaron a amenazarnos con llevarnos a juicio por haber
aplicado ingenier&iacute;a inversa en su algoritmo de desbloqueo
criptol&oacute;gico), pero recientemente han sido muy amables y nos han
ofrecido placas y soporte.

<p>
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=lofn&amp;sektion=4">Hifn 6500</a></b><br>
Este dispositivo es una unidad criptogr&acute;fica asim&eacute;trica.
Contiene soporte para los algoritmos RSA, DSA, y DH, as&iacute; como
para otras funciones principales de c&acute;lculo.  Tambi&eacute;n
contiene un generador de n&uacute;meros aleatorios de alto rendimiento.
Disponemos de uno de estos dispositivos, toda la documentaci&oacute;n
necesaria, y c&oacute;digo de muestra.  A partir de OpenBSD 3.1, tanto
el generador de n&uacute;meros aleatorios como la unidad de
n&uacute;meros grandes funcionan.

<p>
<li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=nofn&amp;sektion=4">Hifn 7814/7851/7854</a></b><br>
Este dispositivo es un procesador de paquetes y una unidad de
criptograf&iacute;a asim&eacute;trica.  Tiene soporte para los
algortimos RSA, DSA, y DH, as&iacute; como para otras funciones
importantes con n&uacute;meros grandes, y tambi&eacute;n tiene un
generador de n&uacute;meros aleatorios.  En la actualidad s&oacute;lo
hay soporte para la m&aacute;quina de n&uacute;meros grandes y el
generador de n&uacute;meros aleatorios (no para transformaciones de
paquetes).

<p>
<li><li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ubsec&amp;sektion=4">Broadcom BCM5801/BCM5802/BCM5805/BCM5820/BCM5821/BCM5822/5823 (o el <em>chip</em> beta Bluesteelnet 5501/5601)</a></b><br>
Inmediatamente despu&eacute;s del lanzamiento de OpenBSD 2.7,
conseguimos a&ntilde;adir el soporte para las primeras piezas que nos
dio el fabricante, en concreto empezamos con el 5501.  Estos
dispositivos ofrecen el rendimiento criptogr&aacute;fico m&aacute;s alto
que hemos visto.

<p>
Bluesteelnet fue adquirida por Broadcom y comenz&oacute; a fabricar
piezas reales.  Su nuevo BCM5805 es parecido, con la excepci&oacute;n de
que tambi&eacute;n le han a&ntilde;adido un artefacto asim&eacute;trico
para el funcionamiento de DSA, RSA, y otros algoritmos parecidos.  Con
un rendimiento inicial aproximado de una velocidad m&aacute;s de cuatro
veces superior a la del Hifn, esperamos que este procesador se
popularice muy pronto.

<p>
El trato con la gente de Broadcom/Bluesteelnet ha sido exquisito.  Nos
entregaron la documentaci&oacute;n completa y c&oacute;digo de muestra
de sus procesadores, y una cantidad de tarjetas suficiente para hacer
pruebas.

<p>
A partir de la versi&oacute;n 2.8 se modific&oacute; este controlador
para que pudiera generar n&uacute;meros aleatorios en el BCM5805 y en
versiones similares, y que pasara esos datos al dispositivo de
entrop&iacute;a del n&uacute;cleo del sistema.

<p>
A partir de la versi&oacute;n 2.9 se a&ntilde;adi&oacute; soporte para
el BCM5820, que es en gran parte una versi&oacute;n m&aacute;s
r&aacute;pida del BCM5805 (64 bits, mayor velocidad de reloj).  A partir
de la versi&oacute;n 3.0 tambi&eacute;n se a&ntilde;adi&oacute; soporte,
no verificado, para el BCM5821.

<p>
A partir de la versi&oacute;n 3.1, hay soporte para la m&aacute;quina de
n&uacute;meros grandes, y las operaciones de RSA/DH/DSA pueden ser
aceleradas.

<p>
El soporte para las BCM5801, BCM5802, BCM5821 y BCM5822 se
a&ntilde;adi&oacute; antes de la versi&oacute;n 3.2 (el soporte para la
BCM5821 no funcionaba a causa de algunos requisitos de manejos del
interruptor no documentados).

<p>
En la versi&oacute;n 3.4 se ha a&ntilde;adido soporte parcial para
BCM5823.  El <i>chip</i> tiene soporte para AES, pero el controlador no.

<p>
<li><li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ises&amp;sektion=4">Securealink PCC-ISES</a></b><br>
<a href="http://www.safenet-inc.com/technology/chips/safexcel_ises.asp">
PCC-ISES</a> es un nuevo <em>chipset</em> de los Pa&iacute;ses Bajos.
Hemos recibido muestras del <em>hardware</em> y documentaci&oacute;n, y
ya estamos trabajando en el desarrollo de un controlador.  Por el
momento el controlador es capaz de alimentar al dispositivo de
entrop&iacute;a del n&uacute;cleo con n&uacute;meros aleatorios.

<p>
<li><b>SafeNet SafeXcel 2141</b><br>
Hemos recibido documentaci&oacute;n y muestras de las tarjetas
criptogr&aacute;ficas de
<a href="http://www.safenet-inc.com/technology/chips/safexcel_2141.asp">
SafeNet</a>.  Ya hemos empezado a trabajar para desarrollar, como
m&iacute;nimo, el soporte de la criptograf&iacute;a sim&eacute;trica de
estos dispositivos.

<p>
<li><li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=txp&amp;sektion=4">3com 3cr990</a></b><br>
3com nos entreg&oacute; un controlador para el soporte del componente de
ethernet de este <em>chipset</em>, y bas&acute;ndonos en esto hemos
desarrollado nuestro propio controlador de ethernet.  Este controlador
ya ha sido integrado, despu&eacute;s de haber conseguido una licencia
libre sobre el microc&oacute;digo.  Debido a la pobre
documentaci&oacute;n y a una falta de cooperaci&oacute;n (en parte
debida a los altos tipos de beneficios de 3Com), las funciones de IPsec
del <em>chip</em> no tienen soporte... esto ha resultado ser una
completa p&eacute;rdida de tiempo.

<p>
<li><b>Tarjeta Intel IPsec</b><br>
Del mismo modo en que Intel se niega en rotundo a proveer
informaci&oacute;n sobre sus componentes de la divisi&oacute;n de redes,
a diferencia de la mayor&iacute;a de compa&ntilde;&iacute;as,
tambi&eacute;n se ha negado a proveernos de ning&uacute;n tipo de
documentaci&oacute;n.  Hemos hablado con unos cinco t&eacute;cnicos
integrados en proyectos de desarrollo para esos productos.  Todos ellos
quer&iacute;an que pudi&eacute;ramos disponer de la documentaci&oacute;n
necesaria.  Pero est&aacute;n atados de manos por unos gestores que no
alcanzan a entender qu&eacute; beneficio podr&iacute;an obtener
d&aacute;ndonos documentaci&oacute;n.  &Oacute;lvidese de Intel (si
quiere adquirir <em>hardware</em> gigabit ethernet, le recomendamos
cualquier otra cosa... por un simple motivo: la mayor&iacute;a de
controladores que tenemos para componentes de redes de Intel han sido
desarrollados sin documentaci&oacute;n).

<p>
<li><li><b><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pchb&amp;sektion=4">Intel 82802AB/82802AC Firmware Hub RNG</a></b><br>
El <em>chip</em> 82802 (que se encuentra en las placas base i810, i820,
i840, i850 e i860) contiene un generador de n&uacute;meros aleatorios
(RNG).  Para IPsec de alto rendimiento se requiere m&aacute;s
entrop&iacute;a de n&uacute;meros aleatorios.  Desde el 10 de abril de
2000, disponemos de soporte para el RNG.  A&ntilde;adiremos m&aacute;s
soporte para otros RNG que se encuentran en <em>chips</em>
criptogr&aacute;ficos.

<p>
<li><b>VIA C3 RNG</b><br>
La nueva cpu VIA C3 contiene un generador de n&uacute;meros aleatorios
como instrucci&oacute;n.  Desde OpenBSD <a href="33.html">3.3</a>, este
generador de n&uacute;meros aleatorios se usa dentro del n&uacute;cleo
del sistema para alimentar la fuente de entrop&iacute;a.

<p>
<li><b>OpenSSL</b><br>
Hace unos a&ntilde;os ten&iacute;amos un proyecto para el soporte de
tarjetas criptogr&aacute;ficas con capacidad para RSA/DH/DSA de forma
autom&aacute;tica, a trav&eacute;s de llamadas a OpenSSL.  A partir de
OpenBSD 3.2 ese soporte funciona, y cualquier tarjeta que tenga soporte
con esa funcionalidad utilizar&aacute; autom&aacute;ticamente el
<em>hardware</em>, incluidos OpenSSH y httpd en modo SSL.  No se
requiere ning&uacute;n cambio en las aplicaciones.
</ul>

<p>
<b>Si alguna persona quiere ayudarnos a programar controladores,
<a href="#people">puede unirse al equipo</a>.</b>

<p>
<a name="people"></a>
<h3><font color="#e00000">Se buscan cript&oacute;grafos
internacionales</font></h3><p>

Nuestro proyecto necesita personas que trabajen en estos sistemas.  Si
alg&uacute;n cript&oacute;grafo, que no sea estadounidense y que cumpla
los requisitos que se han enumerado en esta p&aacute;gina, est&aacute;
interesado en ayudar con criptograf&iacute;a integrada en OpenBSD, puede
contactar con nosotros.

<p>
<a name="papers"></a>
<h3><font color="#e00000">Otros textos</font></h3><p>

Los miembros del equipo de OpenBSD han escrito unas cuantas ponencias
sobre los cambios en criptograf&iacute;a que ellos mismos han aplicado a
OpenBSD.  Las versiones en postscript de estos documentos estan
disponibles como sigue.

<ul>
   <li>A Future-Adaptable Password Scheme.<br>
       <a href="events.html#usenix99">Usenix 1999</a>,
       por <a href="mailto:provos@openbsd.org">Niels Provos</a>,
       <a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
       <a href="../papers/bcrypt-paper.ps">Ponencia</a> y 
       <a href="../papers/bcrypt-slides.ps">diapositivas</a>.
<p>
  <li>Cryptography in OpenBSD: An Overview.<br>
      <a href="events.html#usenix99">Usenix 1999</a>,
      por <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
      <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
      <a href="mailto:art@openbsd.org">Artur Grabowski</a>,
      <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
      <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
      <a href="../papers/crypt-paper.ps">Ponencia</a> y 
      <a href="../papers/crypt-slides.ps">diapositivas</a>.

<p>
  <li>Implementing Internet Key Exchange (IKE).<br>
      <a href="events.html#usenix2000">Usenix 2000</a>,
      por <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a> y
      <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>.<br>
      <a href="../papers/ikepaper.ps">Ponencia</a> y
      <a href="../papers/ikeslides.ps">diapositivas</a>.
<p>
  <li>Encrypting Virtual Memory<br>
      <a href="events.html#sec2000">Usenix Security 2000</a>,
      por <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
      <a href="../papers/swapencrypt.ps">Ponencia</a> y
      <a href="../papers/swapencrypt-slides.ps">diapositivas</a>.
<p>
 <li>The Design of the OpenBSD Cryptographic Framework.<br>
	  <a href="events.html#usenix2003">Usenix 2003</a>, por
	  <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
	  <a href="mailto:jason@openbsd.org">Jason L. Wright</a>, y
	  <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
	  <a href="../papers/ocf.pdf">Ponencia</a>.
</ul>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: crypto.html,v 1.125 ]<br>
$Translation: crypto.html,v 1.60 2003/11/15 14:17:26 horacio Exp $<br>
$OpenBSD: crypto.html,v 1.58 2003/11/17 18:09:45 horacio Exp $
</small>

</body>
</html>
