<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
   <title>CTM</title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#23238e">

<center>
<img alt="CTM para OpenBSD" src="../images/bsdctm.gif" width=401 height=126>
</center>

<h3>&iquest;Qu&eacute; es CTM?</h3>

<p>
CTM es un sistema para realizar cambios a diario a un &aacute;rbol de
fuentes accesible por correo electr&oacute;nico;  CTM ha sido
dise&ntilde;ado por Poul-Henning Kamp.  Este sistema es un buen modo
para estar actualizado con los fuentes en &quot;current&quot; o con el
&aacute;rbol del CVS, sobre todo si la conexi&oacute;n a internet de
que disponemos no es buena, como por ejemplo con modem.

<p>
CTM usa muy poco ancho de banda para distribuir los cambios al
&aacute;rbol, y los comprime usando gzip -9.

<h3>&iquest;C&oacute;mo funciona?</h3>

<p>
El principio b&aacute;sico es que Vd. se subscriba a una lista de
correo espec&iacute;fica para un &aacute;rbol de fuentes particular.
Cada d&iacute;a recibir&aacute; un mensaje por correo
electr&oacute;nico que contendr&aacute; todos los cambios acontecidos
en ese &aacute;rbol durante ese periodo.  Un grupo de diferencias se
conoce como un &laquo;delta&raquo;.

<p>
Vd. empieza con un grupo inicial o &laquo;base&raquot; al que se
ir&aacute; aplicando parches con las sucesivas &laquo;deltas&raquo;.
Para empezar a usar ctm debe bajarse la &uacute;ltima
&laquo;base&raquo; existente y todas las deltas que hayan aparecido
hasta ese momento.  Una vez que haya aplicado los parches a su base con
esas deltas, ya puede empezar un proceso normal con las sucesivas
deltas que ir&aacute; recibiendo por medio de la lista de correo.  Las
bases est&aacute;n divididas en partes de 1.400KB cada una, para que
sean m&aacute;s f&aacute;ciles de transferir por l&iacute;neas de baja
calidad y para que las pueda copiar en disquetes tal cual est&aacute;n.

<p>
Las bases se generan aproximadamente una vez cada 100 deltas, de este
modo nunca tendr&aacute; que bajarse m&aacute;s de 100 deltas a la vez
para poder ponerse al d&iacute;a.

<h3>&iquest;Cu&aacute;nto ancho de banda usa CTM?</h3>

<p>
Como ya se ha mencionado anteriormente, la base contiene un
&aacute;rbol completo de fuentes en formato TAR, y por lo tanto es
bastante grande.  Debe obtener la base y todas las deltas subsecuentes
hasta el momento por ftp, desde el sitio que se indica m&aacute;s
abajo.  Los tama&ntilde;os son:

<ul>
<li>aproximadamente de 115MB para OpenBSD-cvs
<li>aproximadamente de 37MB para OpenBSD-cvs-x11
<li>aproximadamente de 65MB para OpenBSD-src
<li>aproximadamente de 35MB para OpenBSD-src-x11
<li>aproximadamente de 2MB para OpenBSD-ports
<li>recuerde que estos ficheros est&aacute;n comprimidos...
    multipl&eacute;quelos por cinco para obtener el tama&ntilde;o
    aproximado una vez descomprimidos
<li>las deltas relativas a una base est&aacute;n entre 10KB y 100KB, y
    algunas veces hasta un par de MB
<li>ctm siempre divide las deltas en mensajes de 100KB, que son
    reensamblados de modo autom&aacute;tico
</ul>

<p>
Las actualizaciones por ctm m&aacute;s grandes son raras, aunque pueden
ocurrir si ha habido una actualizaci&oacute;n importante como binutils,
perl, etc...

<h3>&iquest;C&oacute;mo uso CTM?</h3>

<ul>
<li>Subscr&iacute;base en la lista de correo de ctm para los fuentes
    que quiera.

    <p>
    Hay varias listas de correo relacionadas con ctm.  Existe una lista
    para actualizarse con las actualizaciones del &aacute;rbol de cvs,
    una lista para el &aacute;rbol de fuentes, una lista para las
    actualizaciones de X11 de los anteriores, una lista para el
    &aacute;rbol de portes, y una lista para ver los mensajes de
    &quot;log&quot; del generador ctm de deltas.

   <p>
   Las siguientes &oacute;rdenes le dar&aacute;n de alta en las listas
   apropiadas:

<br><br><tt>
Para el &aacute;rbol de cvs (sin la parte de X11):<br>
   <b>echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org</b><br>
Para la parte de X11 del &aacute;rbol de cvs:<br>
   <b>echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org</b><br>
Para el &aacute;rbol de fuentes (sin la parte de X11):<br>
   <b>echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org</b><br>
Para la parte de X11 del &aacute;rbol de fuentes:<br>
   <b>echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org</b><br>
Para el &aacute;rbol de portes:<br>
   <b>echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org</b><br>
Para los &quot;log&quot; de ctm:<br>
   <b>echo subscribe ctm-log | mail majordomo@OpenBSD.org</b><br>
</tt><br>

<li>Espere hasta que reciba su primera delta.

<li>Desarch&iacute;vela y ensamble la delta de ctm usando ctm_rmail.
<br>
<br>
<tt>
    <b>ctm_rmail -p. -d. -b. folder</b>
</tt>
<br>
<br>
en donde <b>folder</b> se debe substituir por el buz&oacute;n de correo
que contenga el mensaje con la delta.
<br>
De esta forma habr&aacute; descodificado la delta de ctm y la
habr&aacute; copiado en el directorio en que se encuentre.  La delta
ser&aacute; un fichero con la forma OpenBSD-XXX.YYYY.gz, en donde XXX
ser&aacute; &quot;src&quot; o &quot;cvs&quot;, y YYYY ser&aacute; el
n&uacute;mero correspondiente a la delta.

<p>

<li>Para bajarse la base, h&aacute;galo del servidor de ftp que se
    indica m&aacute;s abajo, del subdirectorio <b>base/OpenBSD-cvs</b>
    (para OpenBSD-cvs) o <b>base/OpenBSD-src</b> (para OpenBSD-src).
    B&aacute;jese todos los ficheros en ese directorio, y una vez que
    los tenga puede crear el &aacute;rbol de fuentes base con la
    siguiente orden:

<br><br>
<tt>
    <b>cd target <br>
    cat /split/OpenBSD-* | tar zxf - <br>
</b></tt><br>

en donde <b>split</b> debe ser substituido por el nombre del directorio
en el que copi&oacute; los ficheros que se baj&oacute;.

<p>
Ya no es necesario que conserve esos ficheros si est&aacute; seguro de
que tiene un &aacute;rbol completo.  Sin embargo, aseg&uacute;rese de
anotar el n&uacute;mero de la base antes de seguir.

<p>
Ahora necesitar&aacute; bajarse las deltas que hayan sido generadas
desde que se gener&oacute; la base.  Vaya el servidor de ftp que se
indica a continuaci&oacute;n, en el subdirectorio <b>OpenBSD-cvs</b> u
<b>OpenBSD-src</b>, y b&aacute;jese todos los ficheros cuyos
n&uacute;meros sean <i>mayores</i> que el n&uacute;mero de la base que
haya usado.

<p>
Las direcciones de ftp para la base y las deltas son:

<ul>
<li><a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/">ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/</a>
</ul>

<ul>
<li><a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/">ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/</a>
</ul>

<ul>
<li><a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/</a>
</ul>

<p>

<ul>
<li><b>NOTA:</b> Estoy muy interesado en encontrar otros servidores
alrededor del mundo que quisieran replicar estas deltas.
</ul>

<p>

<li>Ejecute ctm.
<br>
  <br>
  <tt>
     <b>cd target<br>
     ctm -v -v /deltas/OpenBSD-cvs.*</b><br></tt>

<br>
en donde <b>target</b> debe substituirlo por el nombre del directorio
en el que quiera ubicar su &aacute;rbol de cvs, y <b>deltas</b> por el
nombre del directorio en el que haya copiado las deltas.

<p>
Tardar&aacute; un tiempo en procesar todas las deltas, pero las
invocaciones diarias de <b>ctm_rmail</b> y <b>ctm</b> no
tardar&aacute;n tanto.
</ul>

<h3>&iquest;Debo escoger el &aacute;rbol de fuentes o el de cvs?</h3>

<p>
Esto depende del espacio en disco del que disponga, entre otros
factores.  Como ctm todav&iacute;a no puede manejar ficheros que hayan
sido modificados fuera del proceso de ctm, tal vez la mejor
elecci&oacute;n sea cvs-tree.  De este modo puede comprobar su
&aacute;rbol de fuentes actual desde su &aacute;rbol de cvs, y mantener
su modo local en su &aacute;rbol de fuentes, dejando que s&oacute;lo
ctm toque su &aacute;rbol de fuentes.

<p>
Sin embargo, la parte negativa es que necesitar&aacute; mucho espacio
en disco.  Un &aacute;rbol de fuentes requiere unos 300MB, pero si
tiene su propio &aacute;rbol de cvs necesitar&aacute; unos 400MB para
&eacute;ste, <b>m&aacute;s</b> otros 300MB para el &aacute;rbol que se
haya bajado.

<p>
Esto sin tener en cuenta los 100MB o m&aacute;s que necesitar&aacute;
para un compilaci&oacute;n (dependiendo de la arquitectura).

<p>
Si s&oacute;lo tiene el &aacute;rbol de fuentes, tan s&oacute;lo
ser&aacute; necesario tratar modificaciones a nivel local.  Un modo de
hacerlo es usando el sistema de archivos <b>union</b>, aunque han
habido informes en los que se aseguraba que el sistema de archivos
<b>union</b> puede ser inestable si tanto en las capas superiores como
en las inferiores residen en el mismo sistema de archivos
f&iacute;sico.  Si ubica sus capas superiores e inferiores en sistemas
de archivos separados, no debe surgir ning&uacute;n problema.  Un
ejemplo de esto es el que sigue a continuaci&oacute;n:

<p>
Supongamos que su &aacute;rbol actualizado por ctm se encuentra en
<b>/usr/src-ctm</b>, y que su &aacute;rbol de fuentes real, el que
modific&oacute; y del que llev&oacute; a cabo la compilaci&oacute;n, se
encuentra en <b>/usr/src</b>.  <b>/usr/src</b> deber&iacute;a ser al
principio un directorio vac&iacute;o.  La siguiente orden
configurar&aacute; el montaje de &quot;union&quot;:
<br>
<br>
<tt>
    <b>mount -t union -o -b /usr/src-ctm /usr/src</b>
</tt>
<br>
<br>
Las modificaciones que se hayan hecho a los ficheros en /usr/src se
convertir&aacute;n en un fichero dentro de /usr/src, y esconder&aacute;
el que haya en src-ctm.  Si los cambios se hacen mediante ctm al
&aacute;rbol src-ctm, esos cambios <b>no</b> se ver&aacute;n si hay un
fichero en la capa superior que lo esconda.

<p>
El sistema de archivos &quot;union&quot; se debe desmontar
peri&oacute;dicamente, y buscar si hay ficheros locales de
&quot;union&quot;.
<br>
<br>
<tt>
    <b>umount /usr/src <br>
    find /usr/src -type f</b> <br>
</tt>
<br>
<br>
Las &oacute;rdenes <b>ls -W</b> y <b>rm -W</b> tambi&eacute;n son muy
&uacute;tiles, ya que objetos llamados &quot;whiteouts&quot; en
/usr/src tambi&eacute;n esconder&aacute;n ficheros en src-ctm.

<p>
Si tiene el &aacute;rbol de cvs puede usar la orden <b>cvs checkout</b>
para bajar un &aacute;rbol de fuentes desde cvs-tree, y cada vez que lo
actualice con ctm puede usar la orden <b>cvs update</b> para actualizar
su &aacute;rbol de fuentes.

<br>
<br>
Para bajarse un &aacute;rbol de fuentes inicial:<br>
<tt>
    <b>cd /usr <br>
    cvs -qd YOUR_CVS_TREE checkout src</b> <br><br>
</tt>
y despu&eacute;s de cada actualizaci&oacute;n por ctm:<br>
<tt>
    <b>cd /usr/src <br>
    cvs -q update -PAd</b> <br>
</tt>

<h3>&iquest;Es CTM estable en OpenBSD?</h3>

CTM se ha usado durante algo m&aacute;s de un a&ntilde;o para OpenBSD,
y durante varios a&ntilde;os para FreeBSD.  CTM ofrece bastante
fiabilidad y estabilidad.

<h3>M&aacute;s informaci&oacute;n</h3>

Si tiene problemas con ctm, un buen sitio por donde empezar es por la
gu&iacute;a de FreeBSD:

<ul>
<li> <a href="http://www.FreeBSD.org/handbook/ctm.html">http://www.FreeBSD.org/handbook/ctm.html</a>
</ul>

Tambi&eacute;n existen p&aacute;ginas de manual para todas las
utilidades de ctm, que vienen incluidas en el paquete de fuentes.  Si
tiene OpenBSD instalado, deber&iacute;a tener ya las p&aacute;ginas de
manual, los fuentes, y los binarios.  En caso contrario las puede
obtener del mismo servidor de ftp que se indica m&aacute;s abajo para
las deltas.

<p>
Tambi&eacute;n puede contactar con las listas de correo de OpenBSD o
conmigo si tiene dificultades con ctm, aunque mi tiempo libre suele ser
bastante limitado.

<p>
Sumario:

<p>

<ul>
<li>Listas de correo:

   <ul>
   <li> <b>echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe ctm-log | mail majordomo@OpenBSD.org</b>
   </ul>

<li>FTP (para la base y sus deltas correspondientes;  OpenBSD tiene ctm
    en el &aacute;rbol de fuentes, pero si no dispone de los fuentes o
    binarios, aqu&iacute; tambi&eacute;n puede encontrar los fuentes):

   <ul>
   <li> <a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm">ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm</a>
   <li> <a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm">ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm</a>
   <li> <a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm">ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm</a>
   </ul>
</ul>

<p>
Cualquier anuncio o notificaci&oacute;n importante aparecer&aacute; en:
<ul>
<li>misc@OpenBSD.org
<li>announce@OpenBSD.org
</ul>

<p>
<b>NOTA:</b> Si usa CTM para OpenBSD, por favor env&iacute;eme un
mensaje para que pueda saber cu&aacute;ntas personas lo est&aacute;n
usando.

<h3>Reconocimientos</h3>

<li>A Poul-Henning Kamp (phk@FreeBSD.org) por hacer posible CTM y por
    ayudarme a poner en funcionamiento la generaci&oacute;n de deltas.

<li>A Theo de Raadt (deraadt@theos.com) por hacer posible OpenBSD y
    darme desde el principio los recursos que necesitaba para generar
    las deltas de ctm en cvs.OpenBSD.org (ahora se generan en otra
    parte), y por el nombre m&aacute;gico del servidor.

<li>A Todd C. Miller (millert@OpenBSD.org) por montar y mantener las
    listas de correo de ctm.

<li>A Bob Beck (beck@OpenBSD.org), Artur Grabowski (art@OpenBSD.org),
    Magnus Holmberg (mho@OpenBSD.org) y Wolfram Schneider
    (wosch@FreeBSD.org) por montar el espacio para las bases y deltas
    en ctm.*OpenBSD.org.

<li> ... y a todos los dem&aacute;s que tambi&eacute;n contribuyeron de
    un modo indirecto.
</ul>

<p>
&iexcl;Buena suerte!

<p>
t

<hr>

<address><a href="mailto:graichen@OpenBSD.org">Thomas Graichen</a></address>
<br>
Logotipo de OpenBSD/CTM dise&ntilde;ado para el proyecto de OpenBSD por 
<a href="mailto:flipk@openbsd.org">Phillip F Knaack</a>.

<p>
<!-- Created: Mon Oct 28 22:20:54 MET 1996 -->
<!-- hhmts start -->
<small>
Originally [OpenBSD: ctm.html,v 1.11 2000/03/25 02:29:49 wvdputte Exp ]<br>
$Translation: ctm.html,v 1.6 2000/06/08 12:18:12 horacio Exp $<br>
$OpenBSD: ctm.html,v 1.3 2000/06/11 15:47:38 wvdputte Exp $
</small>
<!-- hhmts end -->

</body>
</html>
