<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>CTM</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="document">
<meta name="description" content="Página de OpenBSD/CTM">
<meta name="keywords" content="openbsd,ctm">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2004 de OpenBSD.">
</head>
<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<center>
<img alt="CTM para OpenBSD" src="../images/bsdctm.gif" width=401 height=126>
</center>

<h3><font color="#0000e0">&iquest;Qu&eacute; es CTM?</font></h3>

<p>
CTM es un sistema para realizar cambios con intervalos de tiempo
regulares a un &aacute;rbol de fuentes accesible por correo
electr&oacute;nico;  CTM ha sido dise&ntilde;ado por Poul-Henning Kamp.
Este sistema es un buen modo para estar actualizado con el &aacute;rbol
actual de c&oacute;digo fuente (<em>-current</em>) o con el &aacute;rbol
del CVS, sobre todo si la conexi&oacute;n a internet de que dispone es
lenta, como puede ser en el caso de una conexi&oacute;n por
m&oacute;dem.

<p>
OpenBSD CTM distribuye todos los m&oacute;dulos del repositorio de CVS
de OpenBSD m&aacute;s versiones sacadas de varios de estos
m&oacute;dulos.  CTM usa muy poco ancho de banda para distribuir los
cambios al &aacute;rbol, y los comprime usando <code><strong>gzip
-9</strong></code>.  A diferencia de <a href="cvsup.html">CVSup</a>, CTM
ha sido escrito en C y por lo tanto est&aacute; disponible en todas las
plataformas en las que exista un porte de OpenBSD.  El sistema que
implementa CTM se diferencia de otros m&eacute;todos de acceso al
repositorio de CVS de OpenBSD en la recepci&oacute;n del c&oacute;digo.

<p>
Ante <strong>cualquier</strong> problema, sugerencia, informe o duda
sobre CTM, contacte con el mantenedor de CTM,
<a href="mailto:hgw@d1906.inka.de">Hans G&uuml;nter Weigand</a>.<br>
<small>(Por favor, no pregunte a otras personas de OpenBSD por el
soporte de CTM, ya que estar&aacute;n ocupados haciendo otras cosas.
Gracias)</small>

<h3><font color="#0000e0">&iquest;C&oacute;mo funciona?</font></h3>

<p>
El principio b&aacute;sico es que Vd. se subscriba a una lista de correo
espec&iacute;fica para un &aacute;rbol de fuentes o m&oacute;dulo de CVS
en concreto.  Cada d&iacute;a recibir&aacute; mensajes por correo
electr&oacute;nico que contendr&aacute; grupos con todos los cambios
acontecidos en ese &aacute;rbol durante ese periodo.  Cada uno de esos
grupos de diferencias se conoce como un <strong>delta</strong>.  El
servidor de CTM crea nuevas deltas cada doce horas.

<p>
Vd. empieza con un grupo inicial o &laquo;base&raquo; al que se
ir&aacute; aplicando parches con las sucesivas &laquo;deltas&raquo;.
Para empezar a usar ctm debe bajarse la &uacute;ltima &laquo;base&raquo;
existente y todas las deltas que hayan aparecido hasta ese momento.  Una
vez que haya aplicado los parches a su base con esas deltas, ya puede
empezar un proceso normal con las sucesivas deltas que ir&aacute;
recibiendo por medio de la lista de correo.  Las bases est&aacute;n
divididas en partes de 1400KB cada una, para que sean m&aacute;s
f&aacute;ciles de transferir por l&iacute;neas de baja calidad.

<p>
Las bases se generan aproximadamente una vez cada 50 deltas, de este
modo nunca tendr&aacute; que bajarse m&aacute;s de 50 deltas a la vez
para poder ponerse al d&iacute;a.

<p>
En la actualidad existen dos tipos de archivos de deltas base.  Durante
bastante tiempo estuvimos creando los ficheros
<tt><strong>tar.gz</strong></tt> a mano, pero ahora hemos vuelto a las
deltas base reales.  Estas &uacute;ltimas contienen sumas de
comprobaci&oacute;n
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md5&amp;sektion=1">
md5(1)</a> y se generan de forma autom&aacute;tica, por lo que son algo
m&aacute;s seguras.  Puede distinguir entre los dos tipos de deltas base
por el nombre y extensi&oacute;n del archivo.  Por ejemplo, un archivo
<tt><strong>tar.gz</strong></tt> ser&iacute;a
<tt><strong>OpenBSD-cvs.1450.tar.gz</strong></tt>, mientras que una base
delta ser&iacute;a <tt><strong>OpenBSD-cvs.1500A.gz</strong></tt>.
M&aacute;s adelante puede ver instrucciones detalladas.


<h3><font color="#0000e0">&iquest;Cu&aacute;nto ancho de banda usa
CTM?</font></h3>

<p>
El grupo de deltas base y todas las deltas relativas hasta la m&aacute;s
reciente se obtienen mediante ftp desde los sitios que se mencionan
m&aacute;s adelante.  Los tama&ntilde;os son:

<ul>
<li>Aproximadamente de 215MB para OpenBSD-cvs
<li>Aproximadamente de 40MB para OpenBSD-cvs-x11
<li>Aproximadamente de 65MB para OpenBSD-cvs-xf4
<li>Aproximadamente de 83MB para OpenBSD-src
<li>Aproximadamente de 36MB para OpenBSD-src-x11
<li>Aproximadamente de 4MB para OpenBSD-ports
<br>Recuerde que estos ficheros est&aacute;n comprimidos.  Los ficheros
descomprimidos son unas cinco veces mayores.
<li>Las deltas relativas a una base est&aacute;n entre 10KB y 500KB, y
algunas veces hasta un par de MB
<li>CTM siempre divide las deltas en mensajes de 100KB, que son
reensamblados de modo autom&aacute;tico
<li>Si una delta es mayor de 5MB, no ser&aacute; enviada por correo
electr&oacute;nico.  En lugar de ello se enviar&aacute; un aviso para
que la obtenga mediante ftp.  Las actualizaciones de mayor volumen por
CTM son inusuales, y s&oacute;lo ocurren despu&eacute;s de que se haya
importado un cambio importado en el &aacute;rbol de fuentes, como
binutils, Perl, gcc, XFree86, etc... o despu&eacute;s de aplicar una
etiqueta al repositorio de CVS.
</ul>


<h3><font color="#0000e0">&iquest;C&oacute;mo uso CTM?</font></h3>

<ul>
<li>Subscr&iacute;base en la lista de correo de CTM correspondiente a
los fuentes que desee obtener.

<p>
Hay varias listas de correo relacionadas con CTM.  Existe una lista para
las actualizaciones del repositorio de CVS, una lista para el
&aacute;rbol de fuentes, una lista para las actualizaciones de X11 de
los anteriores, una lista para el &aacute;rbol de portes, y una lista
para los registros &quot;<em>log</em>&quot; del generador CTM de deltas.

<p>
Las siguientes &oacute;rdenes le dar&aacute;n de alta en las listas
apropiadas:

<p>
Para el repositorio de CVS (los m&oacute;dulos <em>CVSROOT</em>,
<em>ports</em>, <em>src</em> y <em>www</em> pero no los m&oacute;dulos
<em>X11</em> y <em>XF4</em>):
<pre>
	echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org
</pre>
Para el m&oacute;dulo <em>X11</em> del repositorio de CVS:
<pre>
	echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org
</pre>
Para el m&oacute;dulo <em>XF4</em> del repositorio de CVS:
<pre>
	echo subscribe OpenBSD-cvs-xf4 | mail majordomo@OpenBSD.org
</pre>
Para una copia del m&oacute;dulo <em>src</em>:
<pre>
	echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org
</pre>
Para una copia del m&oacute;dulo <em>X11</em>:
<pre>
	echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org
</pre>
Para una copia del m&oacute;dulo <em>ports</em>:
<pre>
	echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org
</pre>
Para la lista de registros (<em>&quot;log&quot;</em>) de CTM:
<pre>
	echo subscribe ctm-log | mail majordomo@OpenBSD.org
</pre>

<p>
<li>Instale el programa CTM desde un paquete o desde la colecci&oacute;n
de portes.  Puede encontrar el porte en
<tt><strong>/usr/ports/devel/ctm</strong></tt>.

</ul>
<strong>Nota:</strong> Los ejemplos que vienen a continuaci&oacute;n
s&oacute;lo hacen referencia a OpenBSD-cvs.  El resto de grupos
funcionan del mismo modo.

<p>
<ul>
<li>Obtenga todo el grupo de bases desde un sitio de FTP.  Lo
encontrar&aacute; en el subdirectorio
<tt><strong>base/OpenBSD-cvs</strong></tt>.  B&aacute;jese todos los
ficheros de ese directorio.  Una vez que los tenga todos puede crear el
&quot;archivo base&quot; con ellos y desarchivarlo con las siguientes
&oacute;rdenes, dependiendo del tipo de archivo que tenga:

<pre>
	cat split/OpenBSD-cvs.1500A.gz.* &gt; OpenBSD-cvs.1500A.gz
	cd target
	ctm -v -v -v .../OpenBSD-cvs.1500A.gz
</pre>

<p>
&oacute;

<pre>
	cat split/OpenBSD-cvs.1450.tar.gz.* &gt; OpenBSD-cvs.1450.tar.gz
	cd target
	tar -xzvf .../OpenBSD-cvs.1450.tar.gz
</pre>

<p>
en donde <tt><strong>split</strong></tt> es el directorio en el que ha
copiado los archivos que se baj&oacute;, y
<tt><strong>target</strong></tt> es el sitio que ha escogido para
desempaquetar el archivo.

<p>
No es necesario que conserve estos grupos de archivos base, siempre que
est&eacute; seguro de que tiene un &aacute;rbol completo.  Pero puede
conservar el grupo de archivos base como copia de seguridad.  De
cualquier modo aseg&uacute;rese de anotar el n&uacute;mero del grupo de
bases antes de continuar.

<p>
<li>Ahora debe obtener las deltas que hayan sido generadas desde que
obtuvo el grupo de bases.  Vaya a uno de los sitios de FTP que se
indican m&aacute;s adelante, al subdirectorio
<tt><strong>OpenBSD-cvs</strong></tt>, y b&aacute;jese todos los
ficheros cuyo n&uacute;mero sea <em>mayor</em> que el n&uacute;mero de
la base que us&oacute; anteriormente.  A continuaci&oacute;n aplique
estas deltas:

<pre>
	cd target
	ctm -v -v -v deltas/OpenBSD-cvs.*
</pre>
 
<p>
en donde <tt><strong>target</strong></tt> es el directorio en el que se
encuentra su &aacute;rbol de fuentes, y <tt><strong>deltas</strong></tt>
es el directorio en el que ha guardado las deltas.

<li>Espere hasta que haya recibido su primera delta desde la lista de
distribuci&oacute;n.
<p>
<li>Desarchive, desensamble, y aplique la delta de CTM usando
<code><strong>ctm_rmail</strong></code>.

<p>
<pre>
	ctm_rmail -p /tmp -d deltas -b target folder
</pre>

<p>
en donde <tt><strong>folder</strong></tt> es el buz&oacute;n de correo
que contiene el mensaje con la delta.  Esto descodificar&aacute; la
delta de CTM y la guardar&aacute; en el directorio
<tt><strong>deltas</strong></tt>.  La delta ser&aacute; un archivo de la
forma <tt><strong>OpenBSD-cvs.<var>XXXX</var>.gz</strong></tt>, en donde
<var>XXXX</var> es el n&uacute;mero de la delta.  A continuaci&oacute;n
se aplicar&aacute; la delta al &aacute;rbol del directorio ubicado en
<tt><strong>target</strong></tt>, que es el sitio en el que
desarchiv&oacute; el grupo base anteriormente.

<p>
Repita este &uacute;ltimo paso cada vez que reciba una delta desde la
lista de distribuci&oacute;n.  Si lo desea, puede automatizar este paso
usando procmail, maildrop, o alg&uacute;n otro programa parecido de la
<a href="ports.html">colecci&oacute;n de portes</a>.
</ul>

<p>
En la siguiente lista puede ver los servidores de FTP que tienen deltas
de CTM:

<ul>
<li>El servidor principal de FTP se encuentra en:
<p>
<a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/</a>.
<p>
Este servidor se actualiza de forma autom&aacute;tica durante el proceso
de generaci&oacute;n de deltas de CTM.  Los grupos b&aacute;sicos se
encuentran disponibles en forma de archivos &uacute;nicos de gran
tama&ntilde;o en el directorio <tt><b>base</b></tt>.  Los archivos
divididos est&aacute;n ubicados en el directorio
<tt><b>base-split</b></tt>.
</ul>

<ul>
<li><a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/</a>
<p>

Este servidor se actualiza con las deltas de CTM recibidas en las listas
de correo.  Adem&aacute;s contiene las deltas base divididas en el
subdirectorio <tt><b>base</b></tt>, que es una r&eacute;plica de
<a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/</a>.
</ul>

<ul>
<li><a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/">
ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/</a>
<p>
es id&eacute;ntico a
<p>
<li><a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/">
ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/</a>
<p>
y es una r&eacute;plica de
<a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
ftp://ctm.se.OpenBSD.org</a>.
</ul>

<p>
<b>NOTA:</b> Estoy muy interesado en encontrar otros
servidores alrededor del mundo que quieran replicar estas deltas.
Contacte <a href="mailto:hgw@d1906.inka.de">conmigo</a>.

<p>
<h3><font color="#0000e0">&iquest;Debo escoger el &aacute;rbol de
fuentes o el repositorio de CVS?</font></h3>

<p>
Esto depende del espacio en disco del que disponga, entre otros
factores.  Como CTM no puede manejar muy bien ficheros que hayan sido
modificados fuera del proceso de CTM, la mejor elecci&oacute;n es, sin
duda, el repositorio de <a href="anoncvs.html">CVS</a>.  De este modo
puede comprobar su &aacute;rbol de fuentes actual desde su repositorio
de CVS, llevar un seguimiento de la versi&oacute;n <em>-stable</em>, y
mantener sus modificaciones locales en su &aacute;rbol de fuentes.  CVS
fusionar&aacute; sin problemas sus cambios locales.  Tambi&eacute;n
podr&aacute; usar todas las &oacute;rdenes de CVS a excepci&oacute;n de
&oacute;rdenes como <kbd><strong>cvs commit</strong></kbd> y
<kbd><strong>cvs tag</strong></kbd>.

<p>
Sin embargo, la parte negativa es que necesitar&aacute; mucho espacio en
disco.  Un &aacute;rbol de fuentes requiere unos 370MB, pero si tiene su
propio repositorio de CVS necesitar&aacute; aproximadamente 1GB para
&eacute;ste, <strong>m&aacute;s</strong> otros 370MB para el
&aacute;rbol que se haya bajado.

<p>
Esto sin tener en cuenta los 100MB o m&aacute;s que necesitar&aacute;
(dependiendo de la arquitectura), para los ficheros generados durante la
compilaci&oacute;n del c&oacute;digo fuente.

<p>
Si s&oacute;lo tiene el &aacute;rbol de fuentes, tan s&oacute;lo
ser&aacute; necesario tratar modificaciones a nivel local.  Un modo de
hacerlo es usando el sistema de archivos <strong>union</strong>, (ver
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_union&amp;sektion=8">mount_union(8)</a>)
aunque existen informes en los que se asegura que el sistema de archivos
<strong>union</strong> puede ser inestable si tanto en las capas
superiores como en las inferiores residen en el mismo sistema de
archivos f&iacute;sico.  Si ubica sus capas superiores e inferiores en
sistemas de archivos separados, no debe surgir ning&uacute;n problema.
Un ejemplo de esto es el que sigue a continuaci&oacute;n:

<p>
Supongamos que su &aacute;rbol actualizado por CTM se encuentra en
<tt><strong>/usr/src-ctm</strong></tt>, y que su &aacute;rbol de fuentes
real, el que modific&oacute; y del que llev&oacute; a cabo la
compilaci&oacute;n, se encuentra en <tt><strong>/usr/src</strong></tt>.
<tt><strong>/usr/src</strong></tt> deber&iacute;a ser al principio un
directorio vac&iacute;o.  La siguiente orden configurar&aacute; el
montaje de &quot;union&quot;:
<pre>
	mount -t union -o -b /usr/src-ctm /usr/src
</pre>

<p>
Las modificaciones que se hayan hecho a los ficheros en
<tt><strong>/usr/src</strong></tt> se convertir&aacute;n en un fichero
dentro de <tt><strong>/usr/src</strong></tt>, y esconder&aacute; el que
haya en <tt><strong>src-ctm</strong></tt>.  Si los cambios se hacen
mediante CTM al &aacute;rbol <tt><strong>src-ctm</strong></tt>, esos
cambios <strong>no</strong> se ver&aacute;n si hay un fichero en la capa
superior que lo esconda.

<p>
El sistema de archivos &quot;union&quot; se debe desmontar
peri&oacute;dicamente, y buscar si hay ficheros locales de
&quot;union&quot;.

<pre>
	umount /usr/src
	find /usr/src -type f
</pre>

<p>
Las &oacute;rdenes <tt><strong>ls -W</strong></tt> y <tt><strong>rm
-W</strong></tt> tambi&eacute;n ser&aacute;n de utilidad, ya que los
llamados <em>&quot;whiteouts&quot;</em> en
<tt><strong>/usr/src</strong></tt> tambi&eacute;n esconder&aacute;n
ficheros en <tt><strong>src-ctm</strong></tt>.

<p>
Si tiene el repositorio de CVS, puede usar la orden <tt><strong>cvs
checkout</strong></tt> para obtener el &aacute;rbol de fuentes desde el
anterior, y cada vez que actualice con CTM podr&aacute; usar la orden
<tt><strong>cvs update</strong></tt> para actualizar su repositorio de
fuentes.

<p>
Para obtener un repositorio de fuentes inicial:
<pre>
	cd /usr
	cvs -qd SU_REPOSITORIO_CVS checkout -P src
</pre>

<p>
y despu&eacute;s de cada actualizaci&oacute;n por CTM:
<pre>
	cd /usr/src
	cvs -q update -Pd
</pre>


<h3><font color="#0000e0">&iquest;Es CTM estable en OpenBSD?</font></h3>

CTM se ha usado durante algo m&aacute;s de cinco a&ntilde;os con
OpenBSD, y durante algunos a&ntilde;os m&aacute;s para FreeBSD.  CTM
ofrece mucha fiabilidad y estabilidad.

<h3><font color="#0000e0">&iquest;Cu&aacute;l es el futuro de
CTM?</font></h3>

Hay muchas posibilidades de cambios (peque&ntilde;os) y de
optimizaciones.  Entre &eacute;stos:

<ul>
<li>CTM nunca env&iacute;a una delta mayor de 5MB por correo.  Esto se
puede cambiar de dos formas: se podr&iacute;a incrementar el
tama&ntilde;o m&aacute;ximo para deltas, o se podr&iacute;a instalar una
cola desde la que s&oacute;lo se enviar&iacute;a un cierto n&uacute;mero
de mensajes diario.  Por ejemplo, si una delta tuviera un tama&ntilde;o
de 6MB, se dividir&iacute;a en 96 mensajes de correo.  Estos se
enviar&iacute;an a una cola.  Durante el primer d&iacute;a se
enviar&iacute;an los primeros 50 mensajes, y durante el segundo
d&iacute;a los 46 restantes m&aacute;s los los primeros 4 mensajes de la
delta siguiente.

<li>El <em>software</em> de CTM podr&iacute;a ser reprogramada, o por lo
menos reparado para un mejor funcionamiento.  Su implementaci&oacute;n
en C no es un buen ejemplo de buena programaci&oacute;n.  De este modo
tambi&eacute;n se podr&iacute;a aprovechar para a&ntilde;adirle nuevas
funcionalidades, como la posibilidad de firmar las deltas de CTM con
PGP.
</ul>

&iexcl;<a href="mailto:hgw@d1906.inka.de">Env&iacute;eme</a> su
opini&oacute;n sobre CTM!

<h3><font color="#0000e0">M&aacute;s informaci&oacute;n</font></h3>

Si desea saber m&aacute;s sobre CTM, un buen sitio por donde empezar es
por la gu&iacute;a de FreeBSD:

<ul>
<li> <a href="http://www.FreeBSD.org/handbook/ctm.html">
http://www.FreeBSD.org/handbook/ctm.html</a>
</ul>

Tambi&eacute;n existen p&aacute;ginas de manual para todas las
utilidades de CTM.


<h3><font color="#0000e0">Sumario:</font></h3>

<p>
<ul>
<li>Listas de correo:

<ul>
<li><tt>echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org</tt>
<li><tt>echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org</tt>
<li><tt>echo subscribe OpenBSD-cvs-xf4 | mail majordomo@OpenBSD.org</tt>
<li><tt>echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org</tt>
<li><tt>echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org</tt>
<li><tt>echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org</tt>
<li><tt>echo subscribe ctm-log | mail majordomo@OpenBSD.org</tt>
</ul>

<p>
<li>FTP (para los grupos base y sus deltas correspondientes):

   <ul>
   <li> <a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
        ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/</a>
   <li> <a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/">
        ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/</a>
   <li> <a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/">
        ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/</a>
   <li> <a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
        ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/</a>
   </ul>
</ul>

<p>
Cualquier anuncio o nota importante sobre CTM se enviar&aacute; a la
lista de correo announce@OpenBSD.org.


<h3><font color="#0000e0">Reconocimientos</font></h3>

<ul>
<li>A Poul-Henning Kamp (phk@FreeBSD.org) por hacer posible CTM y por
ayudarme a poner en funcionamiento la generaci&oacute;n de deltas.

<li>A Theo de Raadt (deraadt@theos.com) por hacer posible OpenBSD y
proveer desde el principio de los recursos necesarios para generar las
deltas de CTM en cvs.OpenBSD.org (ahora se generan en otra parte), y por
el nombre m&aacute;gico del servidor.

<li>A Todd C. Miller (millert@OpenBSD.org) por montar y mantener las
listas de correo de CTM.

<li>A Bob Beck (beck@OpenBSD.org), Artur Grabowski (art@OpenBSD.org),
Magnus Holmberg (mho@OpenBSD.org) y Wolfram Schneider
(wosch@FreeBSD.org) por montar el espacio para los grupos base y deltas
en ctm.*OpenBSD.org.

<li>A Thomas Graichen (graichen@OpenBSD.org) por empezar CTM para
OpenBSD y mantenerlo durante todos estos a&ntilde;os.
 
<li>A Wim Vandeputte (wvdputte@OpenBSD.org) por el hospedaje actual de
CTM.

<li> ... y a todos los dem&aacute;s que tambi&eacute;n contribuyeron de
un modo indirecto.
</ul>

<p>
Logotipo de OpenBSD/CTM dise&ntilde;ado para el proyecto de OpenBSD por
<a href="mailto:flipk@openbsd.org">Phillip F Knaack</a>.

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD" /></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ctm.html,v 1.26 ]<br>
$Translation: ctm.html,v 1.20 2004/09/05 21:13:46 santana Exp $<br>
$OpenBSD: ctm.html,v 1.17 2004/09/06 16:51:03 saad Exp $
</small>
</body>
</html>
