<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>Acontecimientos de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-1998 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenBSD]" height="30" width="141" SRC="../images/smalltitle.gif">

<p>
<h2><font color="#e00000">Acontecimientos</font></h2>

<p>
Los desarrolladores, usuarios y patrocinadores de OpenBSD acuden a
ferias comerciales y conferencias, leen ponencias, y organizan sesiones
conocidas como &laquo;ramas de un mismo tronco&raquo; (BOF, &quot;Birds
Of a Feather&quot;).  Todo esto presenta la oportunidad de descubrir
m&aacute;s cosas sobre OpenBSD o simplemente de conocer personas con
una forma de pensar parecida.

<hr>

<h2>Acontecimientos venideros:</h2>
<dl>

<p>
<li><strong>
<a href="http://www.apachecon.com/">
ApacheCon Europa 2000.
del 23 al 25 de octubre de 2.000.  Londres, R.U.
</a></strong>
<p>
Habr&aacute; un puesto de informaci&oacute;n de OpenBSD, para que la
gente pueda ir a charlar con el personal de OpenBSD.  Tambi&eacute;n
dispondremos de art&iacute;culos esenciales para su armario (camisetas,
polos, gorras), para su equipo (CDs de la 2.7) y para su mente (unas
copas m&aacute;s tarde).  Si quiere echar una mano, contacte con
<a href="mailto:wvdputte@openbsd.org">Wim</a>.

<p>

</dl>

<hr>

<h2>Acontecimientos pasados:</h2>

(Los acontecimientos m&aacute;s recientes est&aacute;n al final de la
lista)

<dl>

<p>
<li><strong>
<a href="http://www.usenix.org/publications/library/proceedings/ana97/index.html">
Usenix Annual Technical Conference. 6-10 de enero de 1.997. Anaheim, California, EE.UU.
</a></strong>
<p>
Theo de Raadt mantuvo un BOF (encuentro con personas con intereses
comunes) sobre OpenBSD.

<p>
<li><strong>
<a href="http://www.defcon.org/html/defcon-5.html">
Defcon V.
11-13 de julio de 1.997. Las Vegas, Nevada, EE.UU.
</a></strong>
<p>
En esta conferencia, el equipo de OpenBSD vendi&oacute; unos 100 CDs de
la versi&oacute;n 2.1 de OpenBSD.
<p>
&Eacute;sta es la principal conferencia sobre seguridad, y en ella
muchos de los ponentes hablaron muy bien de nuestra postura sobre
seguridad... en particular gente como los integrantes de 
<a href="http://www.l0pht.com">L0phT</a>.

<p>
<li><strong>
HOPE.
Agosto de 1.997. Nueva York, Nueva York, EE.UU.
</strong>
<p>
La habitaci&oacute;n de terminales consisti&oacute; principalmente de
una Decstation con OpenBSD 2.1.  Una vez m&aacute;s, los integrantes de
<a href="http://www.l0pht.com">L0phT</a> tuvieron muy buenas palabras
para con nuestra seguridad.

<p>
<li><strong>
<a href="http://www.hip97.nl">
HIP.
Agosto de 1.997. Almere, Pa&iacute;ses Bajos.</a>
</strong>
<p>
Niels dio una
<a href="http://www.physnet.uni-hamburg.de/provos/hip97-tcpip.html">charla</a>
sobre los problemas de las conexiones TCP/IP no cifradas, ofreciendo
IPSEC como una posible soluci&oacute;n.

<p>
<li><strong>
<a href="http://www.usenix.org/publications/library/proceedings/sec98/index.html">
Usenix Security.
26-29 de enero de 1998. San Antonio, Texas, EE.UU.
</a></strong>
<p>
Durante esta conferencia, Theo present&oacute; una charla vespertina que
b&aacute;sicamente fue una lista de problemas de seguridad solucionados
e historias de alerta sobre subsistemas en los que se podr&iacute;an
encontrar problemas en el futuro 
(<a href="../papers/security98-slides.ps">disponibilidad de 
diapositivas</a>).
<p>
Los PCs del cuarto del terminal funcionaban con OpenBSD 2.2.

<p>
<li><strong>
<a name="usenix-neworleans"></a>
<a href="http://www.usenix.org/publications/library/proceedings/usenix98/index.html">
Usenix Annual Technical Conference.
15-19 de junio de 1.998. Nueva Orle&aacute;ns, Louisiana, EE.UU.
</a></strong>
<p>
Fuerte presencia de OpenBSD en Feenix y en seguimientos normales durante
Usenix 1998.  Theo dio una charla general sobre lo que ofrece el
Proyecto OpenBSD.  Angelos particip&oacute; en un panel sobre IPSEC (que
es un t&iacute;pico muy propio de OpenBSD, ya que el desarrollo de IPSEC
en ese momento se encontraba mucho m&aacute;s avanzado en OpenBSD que en
cualquier otro sistema).
<p>
Los PCs de la habitaci&oacute;n de terminales funcionaban con OpenBSD
2.3.  Vendimos muchos CDROMs.  El primer dise&ntilde;o de la camiseta de
OpenBSD tambi&eacute;n se vendi&oacute; bastante bien.

<p>
<li><strong>
<a href="http://www.blackhat.com">
BlackHat Sessions.  29-30 de julio de 1.998. Las Vegas, Nevada, EE.UU.
</a></strong>
<p>
Theo de Raadt present&oacute; una charla bajo el t&iacute;tulo
&quot;Auditing software for security&quot;, que trat&oacute; sobre el
proceso del equipo de auditor&iacute;as de seguridad de OpenBSD y sobre
las lecciones que hab&iacute;a aprendido el equipo.  La charla se
concentr&oacute; en c&oacute;mo se solucionan los errores en nuestro
proceso (no s&oacute;lo agujeros), ya que nadie sabe cu&aacute;ndo 5
errores pueden actuar juntos para convertirse en un agujero.

<p>
<a name="defcon98"></a>
<li><strong>
<a href="http://www.defcon.org/html/defcon-6.html">
Defcon VI.
31 de julio al 2 de agosto de 1.998. Las Vegas, Nevada, EE.UU.
</a></strong>
<p>
El enrutador con el mundo exterior estaba en una m&aacute;quina con
OpenBSD 2.3.  Particip&oacute; en una competici&oacute;n para
&laquo;capturar el indicador&raquo; en la que una habitaci&oacute;n
llena de &quot;crackers&quot; intentaban entrar por la fuerza en esta
m&aacute;quina y en otras con otros sistemas operativos.  Nadie
consigui&oacute; entrar en la m&aacute;quina con OpenBSD.
<p>
Se vendieron casi 100 CDROMs de OpenBSD (se agotaron otra vez).  Los
primates de <a href="http://www.monkey.org">monkey.org</a> trajeron las
camisetas con el entrelazado de 2.3 a la conferencia, y vendieron casi
200 camisetas.  Los beneficios obtenidos fueron donados al Proyecto
OpenBSD.

<p>
<li><strong>
<a href="http://opensource.oreilly.com/townmeet.html">
O'Reilly and Associates Open Source Developer Days.
21 de agosto de 1.998. San Jos&eacute;, California, EE.UU.
</a></strong>
<p>
Los miembros del equipo de OpenBSD se encontraron disponibles para
discutir el papel de OpenBSD entre los otros proyectos de software
libre disponibles, y tambi&eacute;n se vendieron CDs y camisetas.

<p>
<li><strong>
<a href="http://www.acm.uiuc.edu/conference">
Reflections/Projections 1998.
2-4 de octubre de 1.998. Champaign-Urbana, Illinois, EE.UU.
</a></strong>
<p>
Theo de Raadt habl&oacute; en un panel sobre software abierto/libre con
Eric Raymond y otros.

<p>
<li><strong>
<a href="http://www.nceexpo.com/">
NCEE '98.
9 y 10 de octubre de 1.998. Auburn, Maine, EE.UU.
</a></strong>
<p>
Se envi&oacute; un extenso informe de los hechos a advocacy@openbsd.org.
Aunque la venta de camisetas y CDROMs dej&oacute; mucho que desear,
tuvimos buenas oportunidades para dar a conocer m&aacute;s el proyecto y
resaltar sus puntos fuertes.

<p>
<li><strong>
IP-dagarna.
29 y 30 de octubre de 1.998. Estocolmo, Suecia.  (en sueco)
</a></strong>
<p>
En esta conferencia, dedicada por completo a IP, Niklas Hallqvist, del
equipo de OpenBSD, dio una charla sobre el protocolo de gesti&oacute;n
de claves IKE (tambi&eacute;n conocido como ISAKMP/Oakley) y las
experiencias de la implementaci&oacute;n de <strong>isakmpd</strong>,
una implementaci&oacute;n de IKE patrocinada por Ericsson Radio Systems
y desarrollada principalmente para el IPSEC de OpenBSD.
<p>

<p>
<li><strong>
<a href="http://www.asc.unam.mx/disc98">
DISC - Seguridad en C&oacute;mputo 98:
2-7 de noviembre de 1.998. Ciudad de M&eacute;xico.
</a></strong>
<p>
Theo de Raadt dio una charla sobre auditor&iacute;as de seguridad,
patrocinada por <a href="http://www.core-sdi.com">CORE SDI S.A.</a>,
una compa&ntilde;&iacute;a de auditor&iacute;as de seguridad que ha
apostado firmemente por el futuro de OpenBSD
(<a href="../papers/mexico98-slides.ps">est&aacute;n disponibles las
diapositivas</a>).

<p>
<li><strong>
<a name="lisaboston-98"></a>
<a href="http://usenix.org/events/lisa98">
LISA '98: 12th Systems Administration Conference
6-11 de diciembre de 1.998. Boston, Massachusetts.
</a></strong>
<p>
Aparecieron m&aacute;s de 10 miembros del equipo de OpenBSD.  OpenBSD
fue, con diferencia, el grupo de representaci&oacute;n m&aacute;s
grande de software libre en la conferencia.
<p>
Usenix nos hizo donaci&oacute;n de una mesa en la zona de
distribuidores en la que vendimos CDROMs de 2.4, camisetas con
entrelazado de 2.3, y la nuevas con bordado de 2.4.
<p>
Un BOF de OpenBSD tuvo lugar en una de esas tardes, dirigido por Theo
de Raadt.
<p>
La habitaci&oacute;n de terminales ten&iacute;a OpenBSD 2.4 funcionando
en 45 m&aacute;quinas.  Es obvio que la confianza en OpenBSD ha
incrementado, ya que muchas personas que en ocasiones anteriores, y
debido a problemas de seguridad acontecidos en el pasado, no
hab&iacute;an usado la habitaci&oacute;n de terminales de Usenix,
fueron vistos usando las m&aacute;quinas.
<p>
En la junta de miembros hab&iacute;a un cargador de programas PalmPilot
con OpenBSD.

<p>
<li><strong>
<a name="ipsec98"></a>
<a href="http://www.netman.se/kurs/96.html">
IPsec/VPN Interoperability tests &amp; seminar
14 de diciembre de 1.998. Estocolmo, Suecia.  (en sueco)
</a></strong>
<p>
OpenBSD estuvo representado como una entre una docena de
implementaciones de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">IPsec</a>
que fueron comprobadas para verificar la interoperabilidad.  Las
pruebas tuvieron &eacute;xito, tanto por la tecnolog&iacute;a en
general, como por OpenBSD en particular.  Pudimos mantener una
comunicaci&oacute;n cifrada con cada uno de los distribuidores
presentes, y negociar claves a trav&eacute;s de IKE con todos los que
dispon&iacute;an de capacidad para ello.

<p>
<li><strong>
<a href="http://www.europen.se/NordU99">
NordU99 -- The first EurOpen/USENIX Conference.
9-12 de febrero de 1.999. Estocolmo, Suecia.
</a></strong>
<p>
Un par de miembros del equipo de OpenBSD estuvieron ah&iacute;, y
tambi&eacute;n algunos de los miembros del grupo de usuarios suecos.
Los CDs de OpenBSD se vendieron al final de una charla sobre seguridad,
y el proyecto fue aplaudido por su esfuerzo continuado de auditar
partes sensibles a la seguridad del sistema.

<p>
<li><strong>
<a href="http://www.ietf.org/proceedings/99mar/index.html">
44th IETF meeting.
15-19 de marzo de 1.999. Minne&aacute;polis, Minnesota, EE.UU.
</a></strong>
<p>
Algunos miembros del equipo de OpenBSD estuvieron en esta conferencia,
en especial nuestros desarrolladores de IPSEC.

<p>
<li><strong>
<a href="http://www.linuxexpo.org">
5th Annual Linux Expo.
18-22 de mayo de 1.999. Raleigh, Carolina del Norte, EE.UU.
</a></strong>
<p>
Algunos miembros del equipo de OpenBSD estuvieron en esta conferencia
vendiendo CDs de OpenBSD 2.5 y camisetas de OpenBSE, as&iacute; como de
Blowfish, que se vendi&oacute; r&aacute;pidamente.  OpenBSD fue el
&uacute;nico BSD representado en la exposici&oacute;n, y fue una buena
oportunidad de presentar una alternativa segura a Linux.

<p>
<a name="usenix99"></a>
<li><strong>
<a href="http://www.usenix.org/events/usenix99/index.html">
Usenix Annual Technical Conference.
6-11 de junio de 1.999. Monterey, California, EE.UU.
</a></strong>
<p>
Algunos desarrolladores de OpenBSD presentaron ponencias en Freenix.
<p>
La <a href="http://www.usenix.org">Asociaci&oacute;n USENIX</a>
otorg&oacute; a OpenBSD un fondo para llevar a cabo la
producci&oacute;n de CDs de OpenBSD 2.5 (distribuimos la nueva
versi&oacute;n de forma gratuita entre los participantes de la
Conferencia Anual de USENIX en junio).
<p>
Los miembros del equipo de Usenix estuvieron implicados en la
autor&iacute;a y presentaci&oacute;n de cuatro ponencias relacionadas
con OpenBSD:
<p>
<ul>
<a name="anoncvs_paper"></a>
<li>Opening the Source Repository with Anonymous CVS.<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por <a href="mailto:chuck@openbsd.org">Charles D. Cranor</a>,
    <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
    <a href="../papers/anoncvs-paper.ps">ponencia</a> y
    <a href="../papers/anoncvs-slides.ps">diapositivas</a>.
<p>
<li>A Future-Adaptable Password Scheme.<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por <a href="mailto:provos@openbsd.org">Niels Provos<a/>,
    <a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
    <a href="../papers/bcrypt-paper.ps">ponencia</a> y
    <a href="../papers/bcrypt-slides.ps">diapositivas</a>.
<p>
<li>Cryptography in OpenBSD: An Overview.<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
    <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
    <a href="mailto:art@openbsd.org">Artur Grabowski</a>,
    <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/crypt-paper.ps">ponencia</a> y
    <a href="../papers/crypt-slides.ps">diapositivas</a>.
<p>
<li>strlcpy and strlcat -- consistent, safe, string copy and
    concatenation.<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por <a href="mailto:millert@openbsd.org">Todd C. Miller</a>,
    <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
    <a href="../papers/strlcpy-paper.ps">ponencia</a> y
    <a href="../papers/strlcpy-slides.ps">diapositivas</a>.
<p>
</ul>

<p>
<li><strong>
<a href="http://www.defcon.org/html/defcon-6.html">
Defcon VII.
9-11 de julio de 1.999. Las Vegas, Nevada, EE.UU.
</a></strong>
<p>
En esta conferencia, el equipo de OpenBSD vendi&oacute; unos 100 CDs de
la versi&oacute;n 2.5 y una tonelada de camisetas.
<p>

<p>
<li><strong>
<a href="http://www.ietf.org/proceedings/99jul/index.html">
45th IETF meeting.
12-16 de julio de 1.999. Oslo, Noruega
</a></strong>
<p>
Una cantidad de miembros del equipo de OpenBSD de todo el mundo
estuvieron en esta conferencia.  Adem&aacute;s de atender a los grupos
de trabajo de IPSec y DNS (entre otros), hicimos pruebas de
interoperabilidad de IPSec/IKE con el proyecto japon&eacute;s KAME.
Adem&aacute;s, Angelos D. Keromytis present&oacute; su trabajo sobre
keynote y isakmpd en OpenBSD.
<p>

<p>
<li><strong>
<a href="http://www.usenix.org/events/sec99/index.html">
Usenix Security.
23-26 de agosto de 1.999. Washington, DC, EE.UU.
</a></strong>
<p>
Apareci&oacute; mucha gente de OpenBSD de la costa este, y vendieron
CDs y camisetas.  Por el contexto de las discusiones qued&oacute; bien
claro que muchas personas estaban bien informadas sobre OpenBSD, y que
OpenBSD se estaba usando para papeles relacionados de modo muy
significante con la seguridad.

<p>
<li><strong>
<a href="http://www.auug.org.au/winter/auug99">
AUUG'99.
11-8 de septiembre de 1.999. Melbourne, Australia.
</a></strong>
<p>
Theo de Raadt dio dos charlas sobre temas relacionados con la
&laquo;calidad del software&raquo;, y particip&oacute; en un panel
sobre c&oacute;mo se est&acute;n coordinando los proyectos de
c&oacute;digo abierto.

<p>
<li><strong>
<a name="ipsec99"></a>
<a href="http://ip-dagarna.netman.se/interoptest.asp">
IPsec Interoperability tests.
27-30 de septiembre de 1.999. Estocolmo, Suiza. (en sueco)
</a></strong>
<p>
Una docena de distribuidores, entre ellos OpenBSD, probaron la
interoperabilidad de m&aacute;s de 15 productos
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">IPsec</a>,
tanto pasarelas como anfitriones.  Las pruebas se llevaron a cabo con
&eacute;xito en lo que respecta a IPSec en general y
autenticaci&oacute;n de clave precompartida pero, debido a la marcha
contra reloj, no pudimos probar el soporte del certificado de forma
apropiada.  Los resultados se presentaron m&aacute;s tarde ese
Oto&ntilde;o en una conferencia en Estocolmo.

<p>
<li><strong>
<a href="http://www.acm.uiuc.edu/conference">
Reflections/Projections 1999
8-10 de octubre de 1.999. Champaign-Urbana, Illinois, EE.UU.
</a></strong>
<p>
Theo de Raadt dio una charla a las 10:00am del d&iacute;a 9.  Otros
desarrolladores de OpenBSD de la costa Este tambi&eacute;n estuvieron
presentes.

<p>
<li><strong>
<a href="http://www.opensource-forum.com/konferens/">
Linux &amp; Open Source Software '99
21 de octubre de 1.999.  Estocolmo, Suecia.  (en sueco)
</a></strong>
<p>
Niklas Hallqvist habl&oacute; sobre c&oacute;mo usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">IPsec</a>
para hacer las comunicaciones seguras.

<p>
<li><strong>
<a href="http://ip-dagarna.netman.se/">
IP-dagarna 1999
27-28 de octubre de 1.999. Estocolmo, Suecia. (en sueco)
</a></strong>
<p>
H&aring;kan Olsson y Jakob Schlyter hablaron durante la sesi&oacute;n
sobre DNSSEC del d&iacute;a 27.

<p>
<a name="lisa99">
<li><strong>
<a href="http://www.usenix.org/events/lisa99/">
13th Systems Administration Conference (LISA 99)
7-12 de noviembre de 1.999. Seattle, Washington, EE.UU.
</a></strong>
<p>
Bob Beck present&oacute; una ponencia sobre la soluci&oacute;n de la
Universidad de Alberta al problema de conexiones de Ethernet
p&uacute;blicas, basada en OpenBSD, durante las sesiones
t&eacute;cnicas que comenzaron a las 11:00am del d&iacute;a 11.
<p>
Tambi&eacute;n estuvieron muchas otras personas de OpenBSD en esta
conferencia, as&iacute; como un punto de venta de CDs y camisetas.  Su
ponencia se encuentra disponible en:

<p>
<ul>
<li>Dealing with Public Ethernet Jacks-Switches, Gateways, and
    Authentication.<br>
    <a href="events.html#lisa99">LISA 1999</a>,
    by <a href="mailto:beck@openbsd.org">Bob Beck</a>.<br>
    <a href="../papers/authgw-paper.ps">ponencia</a> y
    <a href="../papers/authgw-slides.ps">diapositivas</a>.
</ul>

<p>
<li><strong>
<a href="http://thebazaar.org">
The Bazaar.
14-16 de diciembre de 1.999. Nueva York, Nueva York, EE.UU.
</a></strong>
<p>
Wes Sonnenreich y Tom Yates presentaron una tutor&iacute;a sobre la
construcci&oacute;n de cortafuegos con OpenBSD.  Tuvo lugar un BoF de
BSDs de c&oacute;digo abierto.  Se vendieron CDs y camisetas de la
versi&oacute;n 2.6.  Representantes de la prensa, de gobiernos
internacionales e instituciones militares mostraron un inter&eacute;s
especial.

<p>
<li><strong>
BSD BOF session, LinuxWorld Expo, Nueva York (EE.UU.).
Jueves, 3 de febrero de 2.000, de 5:30 a 8:30 pm.
</a></strong>
<p>
Representantes de OpenBSD, BSDi, y FreeBSD organizaron una sesi&oacute;n
de BoF en la 
<a href="http://www.linuxworldexpo.com/">New York LinuxWorld Expo</a>.<br>
Hubo instalaciones de CDs, comida gratis... &iexcl;y hasta cuernos de
d&aelig;mon gratuitos!

<p>
<li><strong>
<a href="http://www.nordu.org/NordU2000/">
NordU 2000 -- The second EurOpen/USENIX Conference.
8-11 de febrero de 2.000. Malmo, Suecia.
</a></strong>
<p>
Estuvieron presentes unos 15 miembros del equipo de OpenBSD.  Se
vendieron CDs y camisetas de OpenBSD en un punto de venta cedido por la
conferencia.
<br>
Theo de Raadt dio una charla como conferenciante invitado, el
mi&eacute;rcoles por la ma&ntilde;ana, sobre porqu&eacute; sufre la
calidad/seguridad del software, y qu&eacute; podemos hacer para
mejorarlo.

<p>
<li><strong>                                    
<a href="http://www.zdevents.com/comdex/spring2000/">
Linux Business Expo / COMDEX Spring 2000,
19 de abril de 2.000, Chicago, IL, EE.UU.
</a></strong>
<p>
Louis Bertrand represent&oacute; a OpenBSD en un BoF de BSD, en el que
participaron FreeBSD/BSDI, NetBSD y Apple (Darwin es un derivado de
BSD).  Estuvieron presentes unas 75 personas, muchas de las cuales eran
nuevas en *BSD.  Fue una gran oportunidad para explorar la futura
cooperaci&oacute;n entre los distintos grupos y compa&ntilde;&iacute;as
de BSD.

<p>                                             
<li><strong>
<a href="http://www.dursec.com">
CanSecWest.
10-12 de mayo de 2.000.
Robson Conference Centre, Vancouver, BC, Canad&aacute;.
</a></strong>
<p>
Theo de Raadt habl&oacute; sobre porqu&eacute; los programadores
contin&uacute;an comietendo los mismos errores est&uacute;pidos,
qu&eacute; tipo de esfuerzos podr&iacute;an mejorar esto, y c&oacute;mo
est&aacute; relacionado todo esto con los esfuerzos de
auditor&iacute;as.  Rain Forest Puppy, Ron Gula (Network Security
Wizards), Ken Williams (E&amp;Y), March Roesch (snort/HiverWorld), y
Fyodor (nmap) se encontraron entre los conferenciantes en este
encuentro (una nota personal:  Theo se dio cuenta de que tres
compa&ntilde;&iacute;as l&iacute;deres de Sistemas de Detecci&oacute;n
de Intrusos en Redes usaban OpenBSD como su sistema operativo de base:
Hiverworld, Network Security Wizards, y NFR).

<p>
<li><strong>
<a href="http://www.converge2000.com">
CONVERGENCE 2000.
18 de mayo de 2.000.
Convention Centre, Calgary, Alberta, Canad&aacute;.</a></strong><p>
Theo de Raadt particip&oacute; en un panel de discusi&oacute;n sobre
los pros y contras de usar software de C&oacute;digo Abierto en
distintos entornos comerciales.  Los usuarios de OpenBSD de la zona
repartieron carteles de OpenBSD y OpenSSH, y se sorprendieron por la
cantidad de compa&ntilde;&iacute;as de Calgary que usaban sigilosamente
OpenBSD.

<p>
<li><strong>
<a href="http://www.manlug.mcc.ac.uk/calendar.html">
OpenBSD : The Open Source Secure Operating System.
17 de junio de 2.000, 14:00.
Manchester, RU.
</a></strong><p>
Sam Smith ofreci&oacute; un resumen de las funcionalidades y
caracter&iacute;sticas de OpenBSD 2.7 y de OpenSSH 2.1.

<p>
<li><strong>
<a href="../reprints/crypto2000.html">
OpenBSD Crypto 2000 conference.
15-20 de junio de 2.000, Calgary, AB, Canad&aacute;.
</a></strong>
<p>
Repitiendo la tradici&oacute;n iniciada con una reuni&oacute;n parecida
que tuvo lugar el a&ntilde;o pasado, muchos desarrolladores de OpenBSD
venidos de todas partes del mundo se dieron cita en Calagary con el fin
de pasar un largo fin de semana con sesiones de cerveza y
&quot;hacking&quot;.  Como en la ocasi&oacute;n anterior, s&oacute;lo
se pudo atender a la reuni&oacute;n por invitaci&oacute;n personal.  Se
llevaron a cabo muchas cosas significativas, incluido hacer funcionar
ipv6 + ipsec en dispositivos de hardware criptogr&aacute;fico.

<p>
<li><strong>
<a name="usenix2000">
<a href="http://www.usenix.org/events/usenix2000/">
Usenix Annual Technical Conference.
18-23 de junio de 2.000. San Diego, California, EE.UU.
</a></strong>
<p>
Casi 20 desarrolladores de OpenBSD aparecieron en el 25 aniversario de
Usenix.  Tuvimos un punto de venta, as&iacute; como la
presentaci&oacute;n de algunas ponencias.  Los que participaron en la
conferencia tuvieron la oportunidad de comprobar la nueva
versi&oacute;n, OpenBSD 2.7, en las 30 estaciones de trabajo de la sala
de terminales.  Por primera vez, la sala de terminales y redes wavelan
tambi&eacute;n tuvieron una conexi&oacute;n IPv6, y algunos usuarios lo
pudieron descubrir por s&iacute; mismos.  Theo organiz&oacute; un BoF
el mi&eacute;rcoles por la tarde, despu&eacute;s del cual los
desarrolladores tuvieron una sesi&oacute;n de c&aacute;nticos en sus
respectivas lenguas con la ayuda del helio.
<ul>
<p>
<li>Implementing Internet Key Exchange, IKE.<br>
    <a href="#usenix2000">Usenix 2000</a>
    por <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>.<br>
    <a href="../papers/ikepaper.ps">ponencia</a> y
    <a href="../papers/ikeslides.ps">diapositivas</a>.
<p>
<li>Transparent Network Security Policy Enforcement.<br>
    <a href="#usenix2000">Usenix 2000</a>
    por <a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
    <a href="mailto:jason@openbsd.org">Jason L. Wright</a>.<br>
    <a href="../papers/bridgepaper.ps">ponencia</a> y
    <a href="../papers/bridgeslides.ps">diapositivas</a>.
<p>
<li>Safety Checking of Kernel Extensions.<br>
    <a href="#usenix2000">Usenix 2000</a>
    por <a href="mailto:cmetz@openbsd.org">Craig Metz</a>.
</ul>

<p>
<li><strong>
<a href="http://www.linuxtag.de/2000/english/">
LinuxTag 2000,
29 de junio a 2 de julio de 2.000.  Stuttgart, Alemania.</a></strong>
<p>
Hubo un punto de venta de BSD en el que tuvimos nuestros primeros
<a href="27.html">CDs de OpenBSD 2.7</a> para Europa, as&iacute; como
el nuevo <a href="tshirts.html#11">polo de Blowfish</a> azul con
bordado.
<br>
Christian Weisgerber dio una
<a href="http://www.linuxtag.de/2000/english/conference/talks.php3?ID=3">charla sobre BSD</a>.

<p>
<li><strong>
<a href="http://conferences.oreilly.com/oscon2000/">
O'Reilly Open Source Conference 2000,
17 al 20 de julio de 2.000.  Monterey, California, EE.UU.
</a></strong>
<p>
Ian Darwin present&oacute; una tutorial sobre
<a href="http://www.oreillynet.com/pub/w/bsd_tutorials.html">Cortafuegos/Servidores de Internet Seguros con OpenBSD</a>,
y se encarg&oacute; &eacute;l solo del punto de venta de OpenBSD
durante el resto de la muestra.  Kjell Wooding tom&oacute; parte en un
panel de discusi&oacute;n sobre el Futuro de los BSD, y habl&oacute;
sobre la
<a href="http://www.oreillynet.com/pub/w/bsd_presentations.html">Seguridad por definici&oacute;n</a>.
Las dos sesiones estuvieron repletas de p&uacute;blico, y se vio como
m&iacute;nimo a un administrador de sistemas Linux corriendo en busca
de un teclado, con el p&aacute;nico reflejado en sus ojos,
despu&eacute;s de la charla sobre seguridad.

<p>
La tutorial de Ian se encuentra disponible en:
<ul>
	<li>Secure Internet Servers and Firewalls with OpenBSD.
	por Ian F. Darwin,
	<a href=../papers/oreilly2000/>diapositivas</a>.
	</ul>

<p>
<li><strong>
<a href="http://www.defcon.org">
Defcon 2000.
28 al 30 de julio de 2.000. Las Vegas, Nevada, EE.UU.
</a></strong>
<p>
Kjell Wooding, nuestro mantenedor de ipf, James Phillips, del
<a href="http://www.deadly.org">OpenBSD Journal</a>, y Theo de Raadt
estuvieron vendiendo CDROMs, camisetas y carteles de OpenBSD durante el
viernes y el s&aacute;bado.  Una gran cantidad de gente visit&oacute;
nuestra mesa y al final agotamos las existencias de CDROMs y camisetas,
lo que nos permiti&oacute; visitar la Presa Hoover durante el domingo y
relajarnos un poco).
<p>
Nos sorprendi&oacute; mucho toda la gente que se par&oacute; en nuestro
puesto para decirnos que confiaban en OpenBSD.

<p>
<li><strong><a name="sec2000"></a>
<a href="http://www.usenix.org/events/sec2000/">
Usenix Security.
14 al 17 de agosto de 2.000. Denver, Colorado, EE.UU.
</a></strong><p>
Algunos desarrolladores de OpenBSD estuvieron presentes, y se
present&oacute; una ponencia:

<ul>
<p>
<li>Encrypting Virtual Memory</a><br>
    <a href="#sec2000">Usenix Security 2000</a>
    por <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
    <a href="../papers/swapencrypt.ps">ponencia</a> y
    <a href="../papers/swapencrypt-slides.ps">diapositivas</a>.
</ul>

<p>
<li><strong>
<a href="http://www.opensource-forum.com/konferens">
The Open Source Revolution.
5 de octubre de 2.000. Stocolmo, Suecia.
</a></strong>
<p>
Theo de Raadt dio una charla sobre c&oacute;mo han cambiado las
expectaciones de los usuarios en torno a la seguridad predefinida
durante los &uacute;ltimos a&ntilde;os.

</dl>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: events.html,v 1.125 2000/10/24 17:23:21 deraadt Exp ]<br>
$Translation: events.html,v 1.15 2000/10/27 00:08:09 horacio Exp $<br>
$OpenBSD: events.html,v 1.13 2000/10/27 13:43:03 jufi Exp $
</small>

</body>
</html>
