<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>Acontecimientos de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<p>
<h2><font color="#e00000">Acontecimientos</font></h2>

<p>
Los desarrolladores, usuarios y patrocinadores de OpenBSD acuden a
ferias comerciales y conferencias, leen ponencias, y organizan sesiones
conocidas como &laquo;ramas de un mismo tronco&raquo; (BOF, <em>Birds Of
a Feather</em>).  Todo esto presenta la oportunidad de descubrir
m&aacute;s cosas sobre OpenBSD o simplemente de conocer personas con una
forma de pensar parecida.

<hr>

<h2>Acontecimientos venideros:</h2>

<h3>2003</h3>
<dl>
<li><strong><a name="London2003"></a>
<a href="http://www.linuxexpo.org.uk/">
Linux Expo London 2003</a></strong>,
del 9 al 8 de octubre de 2003.  Londre, RU.<br>
Habr&aacute; un punto de ventas.  Contactar con
<a href="mailto:wim@openbsd.org">Wim</a> para m&aacute;s
informaci&oacute;n.
<p>
<li><strong><a name="Saarbrucken2003"></a>
<a href="http://www.linux-kongress.org/2003/index.html">
Linux Kongress Saarbr&uuml;cken 2003</a></strong>,
del 14 al 16 de octubre de 2003.  Saarbr&uuml;cken, Alemania.<br>
Habr&aacute; un punto de ventas.  Contactar con
<a href="mailto:wim@openbsd.org">Wim</a> para m&aacute;s
informaci&oacute;n.
<p>
<li><strong><a name=Lyon2003></a>
<a href="http://www.aldil.org/agenda/journees/2003/">
Les V<sup>&egrave;mes</sup> Journ&eacute;es du Libre 2003</a></strong>,
del 31 de octubre al 1 de noviembre de 2003.  Lyon, Francia.<br>
Miod dar&aacute; una charla y habr&aacute; un punto de ventas.
Contactar con <a href="mailto:wim@openbsd.org">Wim</a> para m&aacute;s
informaci&oacute;n.
<p>
<li><strong><a name="Luxembourg2003"></a>
<a href="http://www.linuxday.lu/">
Linuxday Luxembourg 2003</a></strong>,
del 6 al 8 de noviembre de 2003.  Luxemburgo.<br>
Habr&aacute; un punto de ventas.  Contactar con
<a href="mailto:wim@openbsd.org">Wim</a> para m&aacute;s
informaci&oacute;n.
<p>
<li><strong><a name="20c3"></a>
<a href="http://www.ccc.de/congress/2003/">
20th Chaos Communication Congress 2003</a></strong>,
del 27 al 29 de diciembre de 2003.  Berl&iacute;n, Alemania.<br>
Habr&aacute; un punto de ventas.  Contactar con
<a href="mailto:wim@openbsd.org">Wim</a> para m&aacute;s
informaci&oacute;n.
</dl>

<h3>2004</h3>
<dl>
<li><strong><a name="NordU2004"></a>
<a href="http://www.nordu.org/NordU2004/index.html">
6th NordU/USENIX Conference 2004</a></strong>,
del 28 de enero al 1 de febrero de 2004.  Copenague, Dinamarca.<br>
Habr&aacute; un punto de ventas.  Contactar con
<a href="mailto:wim@openbsd.org">Wim</a> para m&aacute;s
informaci&oacute;n.
<p>
</dl>

<hr>

<h2>Acontecimientos pasados:</h2>

<dl>

<h3>2003</h3>
<li><strong><a name="bsdcon2003"></a>
<a href="http://www.usenix.org/events/bsdcon03/">
BSDCon '03</a></strong>,
del 8 al 12 de septiembre de 2003.  San Mateo, California.<br>
OpenBSD estuvo representado en el Informe sobre el Estado de BSD, y
David Rosenthal dio una charla sobre una aplicaci&oacute;n de seguridad
basada en OpenBSD.
<p>

<li><strong><a name="sucon2003"></a>
<a href="http://www.sucon.ch/">SUCON '03</a></strong>,
5 de septiembre de 2003.  Zurich, Suiza.<br>
Daniel Hartmeier dio una charla sobre pf;
<a href="http://open.bsdcow.net/events/sucon2003/">hay unas
im&aacute;genes disponibles</a>.
<p>

<li><strong><a name="camp2003"></a>
<a href="http://www.ccc.de/camp/">
Chaos Communication Camp 2003</a></strong>,
del 7 al 10 de agosto de 2003, en 
<a href="http://www.paulshof.de/body-mehr.html">un campo</a> cerca de
Berl&iacute;n, Alemania.<br>
Se organiz&oacute; un enorme poblado de OpenBSD.  Asistieron varios
desarrolladores de OpenBSD.
<p>


<li><strong><a name="sec2003"></a>
<a href="http://www.usenix.org/events/sec03/">
Usenix Security</a></strong>,
del 4 al 8 de agosto de 2003, en Washington, DC, EE.UU.<br>
Niels Provos present&oacute; dos ponencias sobre avances en seguridad
desarrollados por OpenBSD, incluida la funcionalidad de privsep en
OpenSSH y tambi&eacute;n systrace.  Asistieron varios desarrolladores de
OpenBSD.
<p>

<li><strong><a name="linuxtag2003"></a>
<a href="http://www.linuxtag.org/2003/en/index.html">
LinuxTag 2003</a></strong>,
del 10 al 13 de julio de 2003, en el Centro de Convenciones de
Karlsruhe, Alemania.<br>
Habr&aacute;n puestos de OpenBSD y OpenSSH en el recinto principal.
<p>

<li><strong><a name="lsm2003"></a>
<a href="http://libresoftwaremeeting.org/">
Libre Software Meeting 2003</a></strong>,
del 9 al 12 de julio de 2003, en Metz, Francia.<br>
Matthieu Herrb dio <a href="../papers/xf86-sec.pdf">una charla sobre la
seguridad en XFree86</a>.  Tambi&eacute;n hubo un puesto con
desarrolladores de OpenBSD.
<p>

<li><strong><a name="lud2003"></a>
<a href="http://www.linuxuserexpo.com/">
Linux User &amp; Developer Expo 2003</a></strong>,
del 24 al 26 de junio de 2003, en el NEC de Birmingham, Reino Unido.<br>
Hubo un puesto con desarrolladores de OpenBSD.
<p>

<li><strong><a name="usenix2003"></a>
<a href="http://www.usenix.org/events/usenix03/">
Usenix Annual Technical Conference</a></strong>,
del 9 al 14 de junio de 2003, en San Antonio, Texas, EE.UU.<br>
Atendieron unos cuantos desarrolladores de OpenBSD, y se present&oacute;
una ponencia:
<ul>
<li>The Design of the OpenBSD Cryptographic Framework<br>
    <a href="events.html#usenix2003">Usenix 2003</a>, por
    Angelos D. Keromytis,
    Jason L. Wright, y
    Theo de Raadt.<br>
    <a href="../papers/ocf.pdf">Ponencia</a>.
</ul>
<p>

<li><strong>OpenBSD c2k3 "Hackathon"</strong>,
del 9 al 19 de mayo de 2003, en Calgary, Canad&aacute;<br>
M&aacute;s de 50 desarrolladores se congregaron en Calgary para una
larga sesi&oacute;n de desarrollo que dur&oacute; 10 d&iacute;as.
<p>

<li><strong><a href="http://www.webb.it/">
Webbit 2003</a></strong>,
del 9 al 11 de mayo de 2003, en Padua, Italia<br>
Giacomo Cariello y Wim Vandeputte estuvieron presentes, y
tambi&eacute;n se impartieron varias
<a href="http://www.deadly.org/article.php3?sid=20030503101052">charlas
relacionadas con OpenBSD</a>.
<p>

<li><strong><a href="http://cansecwest.com/">
CanSecWest 03</a></strong>,
10 de abril de 2003, en Vancouver, Canad&aacute;<br>
Theo di&oacute; una charla sobre c&oacute;mo acabar con los
desbordamientos de memoria usando ProPolice y la nueva tecnolog&iacute;a
W^X.  La charla est&aacute; disponible en una
<a href="../papers/csw03.mgp">presentaci&oacute;n de magicpoint</a>.
<p>

<li><strong><a href="http://www.cebit.de/">
CeBIT 2003</a></strong>,
viernes, 14 de marzo de 2003, en Hannover, Alemania<br>
Tuvimos un
<a href="http://www.linux-events.de/LinuxPark/cebit/Specials/openbooth.html">punto de venta</a>
en Halle 6, A53/068.  El viernes, Henning y Markus dieron una charla
sobre OpenBSD y OpenSSH.  Se encuentran disponibles las
<a href="../papers/cebit2003.tgz">diapositivas</a>
<p>

<li><strong><a href="http://www.linuxforum.dk/2003/english/">
LinuxForum 2003</a></strong>,
1 de marzo de 2003, en Copenague<br>
Daniel dio una charla sobre pf (diapositivas disponibles en formatos
<a href="../papers/linuxforum2k3.tar.gz">mgp</a> y
<a href="http://www.benzedrine.cx/linuxforum/">html</a>).  Fue una
conferencia peque&ntilde;a pero agradable, organizada conjuntamente por
los grupos de usuarios daneses de Linux y BSD.
<p>

<li><strong><a href="http://www.cuug.ab.ca">
CUUG - The Calgary Unix Users Group</a></strong>,
25 de febrero de 2003, a las 18:00 MST, en Calgary<br>
El desarrollador principal de OpenBSD, Theo de Raadt, dio una charla
sobre algunos de los cambios recientes en OpenBSD que est&aacute;n
pavimentando el camino hacia la completa eliminaci&oacute;n de ataques y
riesgos de seguridad causados por desbordamientos de memoria.
<p>

<li><strong>
<a href="http://www.fosdem.org/">
FOSDEM 2003</a></strong>,
del 8 al 9 de febrero de 2003, en Bruselas<br>
Henning y Philipp dieron una charla sobre el desarrollo de pf en
OpenBSD<i>-current</i>
(<a href="../papers/fosdem2k3-pf.mgp">slides</a>), y el s&aacute;bado
por la tarde hubo una cena de OpenBSD.
<p>

<li><strong>
<a href="http://linuxsolutions.fr/FR/home/index.php?site=default">
Linux Solutions</a></strong>,
del 4 al 6 de febrero de 2003, en CNIT, Par&iacute;s La
D&eacute;fense<br>
Hubo un puesto de informaci&oacute;n con varios desarrolladores de
OpenBSD, adem&aacute;s de camisetas y los CD de OpenBSD 3.2.
<p>

<h3>2002</h3>

<li><strong><a href="http://www.ccc.de/congress/2002/">
19c3: the 19th CCC Congress</a></strong>,
Berl&iacute;n, del 27 al 29 de diciembre de 2002<br>
Hubo un espacio enorme reservado para usuarios y desarrolladores de
OpenBSD, un par de pruebas con sistemas <i>-current</i> y, para los
curiosos, una primer vistazo a las camisetas de OpenBSD 3.2.
<p>

<li><strong>
<a href="http://2002.eurobsdcon.org/">
BSDCon Europe 2002</a></strong>,
del 15 al 17 de noviembre de 2002, en Amsterdam, Holanda<br>
Se cont&oacute; con la asistencia de representantes de OpenBSD; Phillip
B&uuml;hler y Henning Brauer hablaron sobre el
<a href="../papers/tuning-openbsd.ps">afinamiento del rendimiento de
redes con OpenBSD</a>, e Ian Darwin dio una tutorial sobre
<a href="../papers/eurobsd-firewalls-2002.pdf">cortafuegos con
OpenBSD</a>.
<p>

<li><strong>
<a href="http://www.usenix.org/events/lisa02/">
LISA '02: 16th Systems Administration Conference</a></strong>,
3-8 noviembre de 2002, Filadelfia, EE.UU.<br>
Mickey y Jason estuvieron en el puesto de la expo (el &uacute;nico BSD
representado) y vendieron los CD de la versi&oacute;n
<a href="32.html">3.2</a>.
<p>

<li><strong>
<a href="http://lsm.abul.org">
The 3rd Libre Software Meeting</a></strong>,
del 9 al 13 de julio de 2002, Burdeos, Francia<br>
Estuvieron presentes varios desarrolladores y usuarios de OpenBSD en el
encuentro, y Niels Provos present&oacute; su herramienta de
gesti&oacute;n de llamadas al sistema,
<a href="http://www.citi.umich.edu/u/provos/systrace">systrace</a>
<p>

<li><strong>
<a href="http://www.Webb.it">
Webb.it 02</a></strong>,
del 5 al 7 de julio de 2002, P&aacute;dua, Italia<br>
Asistieron desarrolladores de OpenBSD, que estuvieron vendiendo los CD,
camisetas, etc.
<p>

<li><strong><a href="http://www.softwarelivre.rs.gov.br/forum">
The Annual International Free Software Forum</a></strong>,
del 2 al 4 de mayo de 2002, Porto Alegre-RS, Brasil<br>
En su mayor parte fue una reuni&oacute;n Linux/GNU, pero este a&ntilde;o
los sistemas operativos BSD tuvieron m&aacute;s oportunidades para
probar su val&iacute;a.  Edson Brandi habl&oacute; sobre FreeBSD, Diego
Linke sobre NetBSD, y Ricardo Nascimento Ferreira sobre OpenBSD.
<p>

<li><strong><a href="http://www.usenix.org/events/bsdcon02/">
BSDCON 2002</a></strong>,
del 11 al 14 de febrero de 2002, San Francisco, California, EE.UU.<br>
Todd Miller dio una charla sobre el estado actual de OpenBSD y
particip&oacute; en un panel de discusi&oacute;n sobre BSD.  Se
encuentran disponibles las
<a href="../slides/bsdcon_2002/index.html">diapositivas</a>.
<p>

<li><strong><a href="http://www.linuxexpoparis.com">
Linux expo Paris 2002</a></strong>,
del 30 de enero al 1 de febrero de 2002, Par&iacute;s, Francia</br>
La Linux Expo 2002 francesa fue bastante peque&ntilde;a, y como suele
ocurrir el quiosco de OpenBSD acab&oacute; con otros del lado de la
expo.  Durante el primer d&iacute;a, casi toda la mercanc&iacute;a se
agot&oacute; e incluso llegamos a vender la versi&oacute;n anterior, la
2.9, durante los d&iacute;as restantes a algunos que no quisieron irse
sin un CD en sus manos...
<p>

<li><strong><a href="http://musess.mcmaster.ca/">
MUSESS 2002</a></strong>,
del 25 al 26 de enero de 2002, McMaster University, Ontario,
Canad&aacute;<br>
Louis Bertrand dio una presentaci&oacute;n sobre OpenBSD titulada
<strong>Repara los errores, asegura el sistema</strong>.  Se encuentran
disponibles las
<a href="../slides/musess_2002/index.html">diapositivas</a>.
<p>

<h3>2001</h3>

<li><strong><a href="http://www.usenix.org/events/lisa01/">
USENIX LISA 2001</a></strong>,
del 2 al 7 de diciembre de 2001, San Diego, California, EE.UU.<br>
Niels Provos di&oacute; una presentaci&oacute;n, y hubo un puesto de
venta de camisetas y CD de OpenBSD 3.0.
<p>

<li><strong><a href="http://www.ietf.org/meetings/IETF-52.html">
52nd IETF</a></strong>,
del 9 al 14 de diciembre de 2001, Salt Lake City, Utah, EE.UU.<br>
Angelos, Itojun y Jakob estuvieron presentes.
<p>

<li><strong>
<a href="http://www.disc2000.unam.mx/disc/index-ing.html">
DISC 2001</a></strong>,
del 26 al 29 de noviembre de 2001, Ciudad de M&eacute;xico,
M&eacute;xico<br>
Theo de Raadt volvi&oacute; a explicar el proceso de auditor&iacute;as
de seguridad y las elecciones de configuraci&oacute;n seguras
posteriores que hizo en OpenBSD, durante una charla titulada
&laquo;Pensamientos actualizados sobre la programaci&oacute;n de un
sistema operativo seguro&raquo;.

<p>
<li><strong>
<a href="http://www.linux.org.hk">
LinuxCafe</a></strong>,
15 de septiembre de 2001, Hong Kong, China<br>
Shell Hung dio una introducci&oacute;n sobre BSD y una
demostraci&oacute;n de OpenBSD en HKLUG.

<p>
<li><strong>
VPN Bakeoff</strong>,
del 13 al 18 de agosto de 2001, Finlandia<br>
Jakob e Itojun estuvieron presentes.

<p>
<li><strong>
<a href="http://www.hal2001.org">
HAL 2001</a></strong>,
Agosto de 2001, Twente, Pa&iacute;ses Bajos<br>
Muchos desarrolladores de OpenBSD estuvieron presentes, e incluso
tuvimos nuestra propia tienda.  Niels, Rees y Dugsong dieron charlas;
m&aacute;s informaci&oacute;n en el sitio de HAL2001.  Y, por supuesto,
se vendieron camisetas y unidades de CDROM.

<p>
<li><strong>
<a href="http://conferences.oreilly.com/oscon/">
O'Reilly Open Source Conference</a></strong>,
Del 23 al 27 de Julio de 2001, San Diego, California, EE.UU.<br>
Hubo un puesto de venta de CD, camisetas, etc., de OpenBSD.  Ian Darwin
present&oacute; su tutorial <em>&quot;Firewalls and Secure Internet
Servers with OpenBSD&quot;</em>.

<p>
<li><strong>
<a href="http://www.defcon.org">
DEF CON Nine</a></strong>,
13 al 15 de julio de 2001, Las Vegas, EE.UU.<br>
Desarrolladores y usuarios de OpenBSD hacen de &eacute;ste un punto de
encuentro anual, y tambi&eacute;n tuvimos una mesa de venta de unidades
de CD, camisetas, etc.

<p>
<li><strong>
<a href="http://www.sek.co.kr/sek2001/sek_html/main.htm">
Software Exhibition of Korea</a></strong>,
del 26 al 29 de junio de 2001, Se&uacute;l, Corea<br>
urisecure/NDS patrocin&oacute; un puesto de OpenBSD con CD, carteles, y
una demostraci&oacute;n en directo del <em>hardware</em> de
aceleraci&oacute;n de IPSEC de OpenBSD.

<p>
<li><strong>
<a href="http://www.usenix.org/events/usenix01/">
2001 USENIX Annual Technical Conference</a></strong>,
del 25 al 30 de junio de 2001, Boston, EE.UU.<br>
Los desarrolladores de OpenBSD participaron y organizaron un puesto de
venta de CD y camisetas en esta conferencia.

<p>
<li><strong>
<a href="http://www.olymfair.org/eng/workshop.htm">
Information Security OlymFair</a></strong>,
del 16 al 18 de mayo de 2001, Se&uacute;l, Corea<br>
Dug Song ofreci&oacute; una introducci&oacute;n detallada de OpenBSD a
la comunidad de seguridad coreana.

<p>
<li><strong>
<a href="http://www.osdem.org/">
2001 Open Source and Free Software Developers' Meeting</a></strong>,
del 3 al 4 de febrero de 2001, Bruselas, B&eacute;lgica<br>
Puesto de venta e informaci&oacute;n de OpenBSD con algunas charlas
programadas.

<li><strong>
<a href="http://www.linuxexpoparis.com/">
2001 Linux Expo</a></strong>,
Del 1 al 2 de febrero de 2001, Par&iacute;s, Francia<br>
Puesto de venta e informaci&oacute;n en la zona `F´.


<h3>2000</h3>

<li><strong>
<a href="http://www.usenix.org/events/lisa2000/">
LISA 2000, USENIX Systems Administration Conference</a></strong>,
Del 3 al 8 de diciembre de 2000, Nueva Orle&aacute;ns, EE.UU.<br>
Wim Vandeputte y otros voluntarios organizaron un punto de venta con
camisetas, carteles y los nuevos CDs de la versi&oacute;n 2.8.

<p>
<li><strong>
<a href="http://www.disc2000.unam.mx/disc/index-ing.html">
DISC 2000</a></strong>,
Del 26 de noviembre al 1 de diciembre de 2000, Ciudad de M&eacute;xico,
M&eacute;xico<br>
Theo de Raadt explic&oacute; el proceso de auditor&iacute;a de seguridad
y las elecciones de configuraci&oacute;n seguras hechas en OpenBSD,
durante una charla bajo el t&iacute;tulo &laquo;Seguro por
Definici&oacute;n&raquo;.  Durante los d&iacute;as siguientes
tambi&eacute;n particip&oacute; en dos paneles con varios expertos de
seguridad que llegaron desde todo el mundo.  Despu&eacute;s de esto,
Theo escal&oacute; uno de los volcanes m&aacute;s altos, el Malinche.

<p>
<li><strong>
<a href="http://www.nluug.nl/events/nj2000">
NLUUG Najaarsconferentie 2000</a></strong>,
9 de noviembre de 2000, Ede, Pa&iacute;ses Bajos<br>
Hubo un puesto de OpenBSD al que acudi&oacute; gente para obtener
informaci&oacute;n o para comprar camisetas, polos, gorras y CDs de la
versi&oacute;n 2.7.

<p>
<li><strong>
<a name="ipsec2000"></a>
<a href="http://www.upperside.fr/baipsecy2k.htm">
IPsec 2000 Global Summit</a></strong>,
Del 24 al 27 de octubre de 2000, Par&iacute;s La Defense, Francia<br>
Niels Provos puso el punto final a la conferencia sobre la arquitectura
IPsec en OpenBSD.  La charla fue bien recibida por muchas personas que
mostraron un gran inter&eacute;s en nuestros dispositivos de
aceleraci&oacute;n criptogr&aacute;fica.

<ul>
<li>The IPsec Architecture in OpenBSD</a><br>
    <a href="#ipsec2000">IPsec 2000 Global Summit</a>
    por Niels Provos.<br>
    <a href="../papers/ipsec-slides.ps">diapositivas</a>.
</ul>

<p>
<li><strong>
<a href="http://ApacheCon.Com/2000/EU/">
ApacheCon Europa 2000</a></strong>,
Del 23 al 25 de octubre de 2000, Londres, Inglaterra<br>
Hubo un puesto de OpenBSD en el que la gente acudi&oacute; en busca de
informaci&oacute;n y para charlar con el personal local de OpenBSD.
Tambi&eacute;n tuvimos art&iacute;culos indispensables para el armario
(camisetas, polos y gorras), para los equipos inform&aacute;ticos (CDs
de la 2.7), y para relajar la mente (unas copas m&aacute;s tarde).

<p>
<li><strong><a href="http://www.bsdcon.com/">
BSD Con 2000</a></strong>,
Del 18 al 20 de octubre de 2000, Monterey, CA, EE.UU.<br>
David Terrell organiz&oacute; un punto de venta de camisetas y CDs de
OpenBSD y contest&oacute; preguntas.

<p>
<li><strong>
<a name=opensource2000></a>
<a href="http://www.opensource-forum.com/konferens">
The Open Source Revolution</a></strong>,
5 de octubre de 2000, Estocolmo, Suecia<br>
Theo de Raadt habl&oacute; sobre c&oacute;mo lo que los usuarios esperan
de la seguridad predeterminada ha cambiado en los &uacute;ltimos
a&ntilde;os.

<p>
<li><strong>
<a name="sec2000"></a>
<a href="http://www.usenix.org/events/sec2000/">
Usenix Security</a></strong>,
Del 14 al 17 de agosto de 2000, Colorado, EE.UU.<br>
Estuvieron presentes algunos desarrolladores de OpenBSD, y se
present&oacute; una ponencia:
<ul>
<li>Encrypting Virtual Memory</a><br>
    <a href="#sec2000">Usenix Security 2000</a>
    por Niels Provos.<br>
    <a href="../papers/swapencrypt.ps">Ponencia</a> y
    <a href="../papers/swapencrypt-slides.ps">diapositivas</a>.
</ul>

<p>
<li><strong>
<a href="http://www.defcon.org/html/defcon-8-post.html">
Defcon 2000</a></strong>,
Del 28 al 30 de julio de 2000, Las Vegas, Nevada, EE.UU.<br>
Kjell Wooding, nuestro mantenedor de ipf, James Phillips, de
<a href="http://www.deadly.org">OpenBSD Journal</a>, y Theo de Raadt
organizaron un punto de venta de CDs, camisetas y carteles de OpenBSD el
s&aacute;bado y el viernes.  Una gran cantidad de gente visit&oacute; la
mesa y se agotaron las existencias de CDs y camisetas (lo que nos
permiti&oacute; visitar la Presa Hoover durante el domingo y relajarnos
un poco).
<br>
Nos sorprendi&oacute; mucho toda la gente que se par&oacute; en nuestro
puesto para decirnos que hab&iacute;an puesto su confianza en OpenBSD.

<p>
<li><strong>
<a href="http://conferences.oreilly.com/oscon2000/">
O'Reilly Open Source Conference 2000</a></strong>,
Del 17 al 20 de julio de 2000, Monterey, California, EE.UU.<br>
Ian Darwin present&oacute; una
<a href="../papers/oreilly2000/">tutorial</a> sobre
<a href="http://www.oreillynet.com/pub/w/bsd_tutorials.html">
Servidores/Cortafuegos de Internet Seguros con OpenBSD</a>, y se
encarg&oacute; &eacute;l s&oacute;lo de llevar el puesto de venta
durante el resto de la conferencia.  Kjell Wooding tom&oacute; parte en
un panel de discusi&oacute;n sobre el futuro de los BSD, y habl&oacute;
sobre la
<a href="http://www.oreillynet.com/pub/w/bsd_presentations.html">
Seguridad por Definici&oacute;n</a>.  Asisti&oacute; bastante
p&uacute;blico a estas dos sesiones, y se pudo ver al menos un
administrador de sistemas Linux corriendo, buscando un teclado, con la
cara descompuesta por el miedo, cuando acab&oacute; la charla sobre
seguridad.

<p>
<li><strong>
<a href="http://www.linuxtag.de/2000/english/">
LinuxTag 2000</a></strong>,
Del 29 de junio al 2 de julio de 2000, Stuttgart, Alemania<br>
Hubo un punto de venta de BSD en el que estaban los primeros
<a href="27.html">CDs de OpenBSD 2.7</a> para Europa y el nuevo
<a href="tshirts.html#11">Polo con bordado de Blowfish</a> azul marino.
<br>
Christian Weisgerber dio una
<a href="http://www.linuxtag.de/2000/english/conference/talks.php3?ID=3">
charla sobre BSD</a>.

<p>
<li><strong>
<a name="usenix2000">
<a href="http://www.usenix.org/events/usenix2000/">
Usenix Annual Technical Conference</a></strong>,
del 18 al 23 de junio, San Diego de 2000, California, EE.UU.<br>
Casi 20 desarrolladores de OpenBSD aparecieron en el 25 aniversario de
Usenix.  Tuvimos un punto de venta, as&iacute; como la
presentaci&oacute;n de algunas ponencias.  Los que participaron en la
conferencia tuvieron la oportunidad de comprobar la nueva
versi&oacute;n, OpenBSD 2.7, en las 30 estaciones de trabajo de la sala
de terminales.  Por primera vez, la sala de terminales y redes wavelan
tambi&eacute;n tuvieron una conexi&oacute;n IPv6, y algunos usuarios lo
pudieron descubrir por s&iacute; mismos.  Theo organiz&oacute; un BoF el
mi&eacute;rcoles por la tarde, despu&eacute;s del cual los
desarrolladores tuvieron una sesi&oacute;n de c&aacute;nticos en sus
respectivas lenguas con la ayuda del helio.
<ul>
<p>
<li>Implementing Internet Key Exchange, IKE<br>
    <a href="#usenix2000">Usenix 2000</a>
    por Angelos D. Keromytis, y
    Niklas Hallqvist.<br>
    <a href="../papers/ikepaper.ps">Ponencia</a> y
    <a href="../papers/ikeslides.ps">diapositivas</a>.
<p>
<li>Transparent Network Security Policy Enforcement<br>
    <a href="#usenix2000">Usenix 2000</a>
    por Angelos D. Keromytis, y
    Jason L. Wright.<br>
    <a href="../papers/bridgepaper.ps">Ponencia</a> y
    <a href="../papers/bridgeslides.ps">diapositivas</a>.
<p>
<li>Safety Checking of Kernel Extensions<br>
    <a href="#usenix2000">Usenix 2000</a>
    por Craig Metz.
</ul>

<p>
<li><strong>
<a href="http://www.manlug.mcc.ac.uk/calendar.html">
OpenBSD: The Open Source Secure Operating System</a></strong>,
17 de junio a las 14:00 de 2000, Manchester, Inglaterra<br>
Sam Smith dio un repaso a las funcionalidades que aparecen en OpenBSD
2.7 y en OpenSSH 2.1.  Sus
<a href="http://www.manlug.mcc.ac.uk/20000617/">diapositivas</a>
est&aacute;n disponibles en las p&aacute;ginas del grupo de usuarios.

<p>
<li><strong>
<a href="../reprints/crypto2000.html">
OpenBSD Crypto 2000 conference</a></strong>,
del 15 al 20 de junio de 2000, Calgary, AB, Canad&aacute;<br>
Repitiendo la tradici&oacute;n iniciada con una reuni&oacute;n parecida
que tuvo lugar el a&ntilde;o pasado, muchos desarrolladores de OpenBSD
venidos de todas partes del mundo se dieron cita en Calagary con el fin
de pasar un largo fin de semana con sesiones de cerveza y
&quot;hacking&quot;.  Como en la ocasi&oacute;n anterior, s&oacute;lo se
pudo atender a la reuni&oacute;n por invitaci&oacute;n personal.  Se
llevaron a cabo muchas cosas significativas, incluido hacer funcionar
ipv6 + ipsec en dispositivos de hardware criptogr&aacute;fico.

<p>
<li><strong>
<a href="http://www.converge2000.com">
CONVERGENCE 2000</a></strong>,
18 de mayo de 2000, Convention Centre, Calgary, Alberta,
Canad&aacute;<br>
Theo de Raadt particip&oacute; en un panel de discusi&oacute;n sobre los
pros y contras de usar software de C&oacute;digo Abierto en distintos
entornos comerciales.  Los usuarios de OpenBSD de la zona repartieron
carteles de OpenBSD y OpenSSH, y se sorprendieron por la cantidad de
compa&ntilde;&iacute;as de Calgary que usaban OpenBSD &laquo;en la
intimidad&raquo;.

<p>
<li><strong>
CanSecWest</strong>,
del 10 al 12 de mayo de 2000, Robson Conference Centre, Vancouver, BC,
Canad&aacute;<br>
Theo de Raadt habl&oacute; sobre porqu&eacute; los programadores
contin&uacute;an comietendo los mismos errores est&uacute;pidos,
qu&eacute; tipo de esfuerzos podr&iacute;an mejorar esto, y c&oacute;mo
est&aacute; relacionado todo esto con los esfuerzos de
auditor&iacute;as.  Rain Forest Puppy, Ron Gula (Network Security
Wizards), Ken Williams (E&amp;Y), March Roesch (snort/HiverWorld), y
Fyodor (nmap) se encontraron entre los conferenciantes en este encuentro
(una nota personal:  Theo se dio cuenta de que tres
compa&ntilde;&iacute;as l&iacute;deres de Sistemas de Detecci&oacute;n
de Intrusos en Redes usaban OpenBSD como su sistema operativo de base:
Hiverworld, Network Security Wizards, y NFR).

<p>
<li><strong>
<a href="http://www.zdevents.com/comdex/spring2000/">
Linux Business Expo / COMDEX Spring 2000</a></strong>,
19 de abril de 2000, Chicago, IL, EE.UU.<br>
Louis Bertrand represent&oacute; a OpenBSD en un BoF de BSD, en el que
participaron FreeBSD/BSDI, NetBSD y Apple (Darwin es un derivado de
BSD).  Estuvieron presentes unas 75 personas, muchas de las cuales eran
nuevas en *BSD.  Fue una gran oportunidad para explorar la futura
cooperaci&oacute;n entre los distintos grupos y compa&ntilde;&iacute;as
de BSD.

<p>
<li><strong>
<a href="http://www.nordu.org/NordU2000/">
NordU 2000 -- The second EurOpen/USENIX Conference</a></strong>,
del 8 al 11 de febrero de 2000, Malmo, Suecia<br>
Estuvieron presentes unos 15 miembros del equipo de OpenBSD.  Los CDs y
camisetas de OpenBSD se vendieron en un puesto de venta donado por los
organizadores.<br>
Adem&aacute;s, Theo de Raadt dio una charla como invitado el
mi&eacute;rcoles por la ma&ntilde;ana sobre porqu&eacute; sufre la
calidad/seguridad del software, y qu&eacute; podemos hacer para
mejorarlo.

<p>
<li><strong>
BSD BOF session, LinuxWorld Expo</strong>,
Jueves, 3 de febrero de 2000, Nueva York, EE.UU.<br>
Representantes de OpenBSD, BSDi, y FreeBSD organizaron una sesi&oacute;n
de para sistemas derivados de BSD (BoF) en la
<a href="http://www.linuxworldexpo.com/">New York LinuxWorld Expo</a>.<br>
Hubo instalaciones de CDs, comida gratis... &iexcl;y hasta cuernos de
d&aelig;mon gratuitos!


<h3>1999</h3>

<li><strong>
The Bazaar</strong>,
del 14 al 16 de diciembre de 1999, Nueva York, NY, EE.UU.<br>
Wes Sonnenreich y Tom Yates presentaron una tutorial sobre la
construcci&oacute;n de cortafuegos con OpenBSD.  Se organiz&oacute; una
reuni&oacute;n de los BSD de c&oacute;digo abierto.  Se vendieron CDs de
la versi&oacute;n 2.6 y camisetas.  Representantes de la prensa, de
gobiernos internacionales e instituciones militares mostraron un
inter&eacute;s especial.

<p>
<a name="lisa99">
<li><strong>
<a href="http://www.usenix.org/events/lisa99/">
13th Systems Administration Conference (LISA 99),</a></strong>
del 7 al 12 de noviembre de 1999, Seattle, Washington, EE.UU.<br>
Bob Beck present&oacute; una ponencia sobre la soluci&oacute;n de la
Universidad de Alberta al problema de conexiones de Ethernet
p&uacute;blicas, basada en OpenBSD, durante las sesiones t&eacute;cnicas
que comenzaron a las 11:00am del d&iacute;a 11.
<br>
Tambi&eacute;n estuvieron muchas otras personas de OpenBSD en esta
conferencia, as&iacute; como un punto de venta de CDs y camisetas.  Su
ponencia se encuentra disponible en:

<ul>
<li>Dealing with Public Ethernet Jacks-Switches, Gateways, and
Authentication<br>
    <a href="events.html#lisa99">LISA 1999</a>,
    por Bob Beck.<br>
    <a href="../papers/authgw-paper.ps">Ponencia</a> y
    <a href="../papers/authgw-slides.ps">diapositivas</a>.
</ul>

<p>
<li><strong>
IP-dagarna 1999,</strong>
del 27 al 28 de octubre de 1999, Estocolmo, Suecia (en sueco)<br>
H&aring;kan Olsson y Jakob Schlyter hablaron durante la sesi&oacute;n
sobre DNSSEC del d&iacute;a 27.

<p>
<li><strong>
<a href="http://www.opensource-forum.com/konferens/">
Linux &amp; Open Source Software '99,</a></strong>
21 de octubre de 1999, Estocolmo, Suecia (en sueco)<br>
Niklas Hallqvist habl&oacute; sobre c&oacute;mo usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">IPsec</a>
para hacer las comunicaciones seguras.

<p>
<li><strong>
<a href="http://www.acm.uiuc.edu/conference">
Reflections/Projections 1999,</a></strong>
del 8 al 10 de octubre de 1999, Champaign-Urbana, Illinois, EE.UU.<br>
Theo de Raadt dio una charla a las 10:00am del d&iacute;a 9.  Otros
desarrolladores de OpenBSD de la costa Este tambi&eacute;n estuvieron
presentes.

<p>
<li><strong>
<a name="ipsec99"></a>
<!-- <a href=http://ip-dagarna.netman.se/interoptest.asp> -->
IPsec Interoperability tests,</a></strong>
del 27 al 30 de septiembre de 1999, Estocolmo, Suecia (en sueco)<br>
Una docena de distribuidores, entre ellos OpenBSD, probaron la
interoperabilidad de m&aacute;s de 15 productos
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">IPsec</a>,
tanto pasarelas como anfitriones.  Las pruebas se llevaron a cabo con
&eacute;xito en lo que respecta a IPsec en general y
autenticaci&oacute;n de clave precompartida pero, debido a la marcha
contra reloj, no pudimos probar el soporte del certificado de forma
apropiada.  Los resultados se presentaron m&aacute;s tarde ese
Oto&ntilde;o en una conferencia en Estocolmo.

<p>
<li><strong>
<a href="http://www.auug.org.au/winter/auug99">
AUUG'99,</a></strong>
del 8 al 11 de septiembre de 1999, Melbourne, Australia<br>
Theo de Raadt dio dos charlas sobre temas relacionados con la
&laquo;calidad del software&raquo;, y particip&oacute; en un panel sobre
c&oacute;mo se est&acute;n coordinando los proyectos de c&oacute;digo
abierto.

<p>
<li><strong>
<a href="http://www.usenix.org/events/sec99/index.html">
Usenix Security,</a></strong>
del 23 al 26 de agosto de 1999, Washington, DC, EE.UU.<br>
Apareci&oacute; mucha gente de OpenBSD de la costa Este, y vendieron CDs
y camisetas.  Por el contexto de las discusiones qued&oacute; bien claro
que muchas personas estaban bien informadas sobre OpenBSD, y que OpenBSD
se estaba usando para papeles relacionados de modo muy significante con
la seguridad.

<p>
<li><strong>
<a href="http://www.ietf.org/proceedings/99jul/index.html">
45th IETF meeting,</a></strong>
del 12 al 16 de julio de 1999, Oslo, Noruega<br>
Unos cuantos miembros del equipo de OpenBSD de todo el mundo estuvieron
en esta conferencia.  Adem&aacute;s de atender a los grupos de trabajo
de IPsec y DNS (entre otros), hicimos pruebas de interoperabilidad de
IPsec/IKE con el proyecto japon&eacute;s KAME.  Adem&aacute;s, Angelos
D. Keromytis present&oacute; su trabajo sobre keynote y isakmpd en
OpenBSD.

<p>
<li><strong>
<a href="http://www.defcon.org/html/defcon-6.html">
Defcon 6.0,</a></strong>
del 9 al 11 de julio de 1999, Las Vegas, Nevada, EE.UU.<br>
En esta conferencia el equipo de OpenBSD vendi&oacute; unos 100 CDs de
la versi&oacute;n 2.5 y much&iacute;simas camisetas.

<p>
<a name="usenix99"></a>
<li><strong>
<a href="http://www.usenix.org/events/usenix99/index.html">
Usenix Annual Technical Conference,</a></strong>
del 6 al 11 de junio de 1999, Monterey, California, EE.UU.<br>
La <a href="http://www.usenix.org">Asociaci&oacute;n USENIX</a>
otorg&oacute; a OpenBSD un fondo para llevar a cabo la producci&oacute;n
de CDs de OpenBSD 2.5 (distribuimos la nueva versi&oacute;n de forma
gratuita entre los participantes de la Conferencia Anual de USENIX en
junio).
<br>
Los miembros del equipo de Usenix estuvieron implicados en la
autor&iacute;a y presentaci&oacute;n de cuatro ponencias relacionadas
con OpenBSD:

<ul>
<a name="anoncvs_paper"></a>
<li>Opening the Source Repository with Anonymous CVS<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por Charles D. Cranor, y
    Theo de Raadt.<br>
    <a href="../papers/anoncvs-paper.ps">Ponencia</a> y
    <a href="../papers/anoncvs-slides.ps">diapositivas</a>.
<br>
<li>A Future-Adaptable Password Scheme<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por Niels Provos, y
    David Mazieres.<br>
    <a href="../papers/bcrypt-paper.ps">Ponencia</a> y
    <a href="../papers/bcrypt-slides.ps">diapositivas</a>.
<br>
<li>Cryptography in OpenBSD: An Overview<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por Theo de Raadt,
    Niklas Hallqvist,
    Artur Grabowski,
    Angelos D. Keromytis, y
    Niels Provos.<br>
    <a href="../papers/crypt-paper.ps">Ponencia</a> y
    <a href="../papers/crypt-slides.ps">diapositivas</a>.
<br>
<li>strlcpy and strlcat -- consistent, safe, string copy and
    concatenation<br>
    <a href="events.html#usenix99">Usenix 1999</a>,
    por Todd C. Miller, y
    Theo de Raadt.<br>
    <a href="../papers/strlcpy-paper.ps">Ponencia</a> y
    <a href="../papers/strlcpy-slides.ps">diapositivas</a>.
<p>
</ul>

<p>
<li><strong>
<a href="http://www.linuxexpo.org">
5th Annual Linux Expo,</a></strong>
del 18 al 22 de mayo de 1999, Raleigh, North Carolina, EE.UU.<br>
Algunos miembros del equipo de OpenBSD estuvieron en esta conferencia y
vendieron CDs de OpenBSD 2.5, y camisetas de OpenBSE y Blowfish, que se
agotaron con gran rapidez.  OpenBSD fue el &uacute;nico BSD con
representaci&oacute;n en la exposici&oacute;n, y tuvimos la oportunidad
de presentar una alternativa segura a Linux.

<p>
<li><strong>
<a href="http://www.ietf.org/proceedings/99mar/index.html">
44th IETF meeting,</a></strong>
del 15 al 19 de marzo de 1999, Minneapolis, Minnesota, EE.UU.<br>
Algunos miembros del equipo de OpenBSD estuvieron presentes en esta
conferencia, en particular nuestros desarrolladores de IPSEC.

<p>
<li><strong>
<a href="http://www.europen.se/NordU99">
NordU99 -- The first EurOpen/USENIX Conference,</a></strong>
del 9 al 12 de febrero de 1999, Estocolmo, Sweden<br>
Un par de miembros del equipo de OpenBSD y algunos usuarios suecos
estuvieron presentes.  Se vendieron CDs de OpenBSD, y al final de una
charla de seguridad aplaudieron al proyecto por su esfuerzo continuado
de auditar partes sensibles del sistema.


<h3>1998</h3>
 
<li><strong>
<a name="ipsec98"></a>
<a href="http://www.netman.se/kurs/96.html">
IPsec/VPN Interoperability tests &amp; seminar,</a></strong>
14 de diciembre de 1998, Estocolmo, Suecia (en sueco)<br>
OpenBSD estuvo representado entre una docena de implementaciones de
<a href=http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html>IPsec</a>
sobre las que se llevaron a cabo comprobaciones de interoperabilidad.
Las comprobaciones tuvieron bastante &eacute;xito, tanto en la
tecnolog&iacute;a en general como en OpenBSD en particular.  Pudimos
mantener comunicaciones cifradas con cada uno de los distribuidores
all&iacute; presentes, y tambi&eacute;n llevar a cabo negociaciones de
claves a trav&eacute;s de IKE con todos aquellos que dispon&iacute;an de
esta capacidad.

<p>
<li><strong>
<a name="lisaboston-98">
<a href="http://usenix.org/events/lisa98">
LISA '98: 12th Systems Administration Conference,</a></strong>
del 6 al 11 de diciembre de 1998, Boston, Massachusetts, EE.UU.<br>
Se cont&oacute; con la presencia de m&aacute;s de 10 miembros del equipo
de OpenBSD.  La representaci&oacute;n de OpenBSD en la conferencia fue
la m&aacute;s numerosa con diferencia sobre otros grupos de sistema
libres.  Usenix nos cedi&oacute; un puesto en la zona de distribuidores
en el que vendimos CDs de la 2.4, camisetas de la 2.3 y la 2.4, y polos.
Durante una de las tardes se organiz&oacute; un encuentro de OpenBSD
dirigido por Theo de Raadt.  Pudimos ver un PalmPilot funcionando con
OpenBSD.
<br>
La sala de terminales funcionaba con 45 m&aacute;quinas con OpenBSD.
Resulta obvio que la confianza en OpenBSD ha crecido mucho, ya que
pudimos ver a mucha gente preocupada por la seguridad usando las
m&aacute;quinas.

<p>
<li><strong>
<a href="http://www.asc.unam.mx/disc98">
DISC - Seguridad en C&oacute;mputo 98,</a></strong>
del 2 al 7 de noviembre de 1998, Ciudad de M&eacute;xico<br>
Theo de Raadt dio una charla sobre auditor&iacute;as de seguridad,
patrocinada por
<a href="http://www.core-sdi.com">CORE SDI S.A.</a>, una
compa&ntilde;&iacute;a de auditores de seguridad que ha apostado
fuertemente por el futuro de OpenBSD (est&aacute;n disponibles las
<a href="../papers/mexico98-slides.ps">diapositivas</a>).

<p>
<li><strong>
IP-dagarna,</strong>
29 y 30 de octubre de 1998, Estocolmo, Suecia (en sueco)<br>
En esta conferencia, totalmente dedicada a IP, Niklas Hallqvist, del
equipo de OpenBSD, dio una charla sobre el protocolo gesti&oacute;n de
gesti&oacute;n de claves IKE (tambi&eacute;n llamado ISAMKP/Oakley) y
sobre las experiencias con la implementaci&oacute;n de
<strong>isakmpd</strong> y la de IKE, creada con fondos de Ericsson
Radio Systems y desarrollada principalmente por el grupo de IPSEC de
OpenBSD.

<p>
<li><strong>
<a href="http://www.nceexpo.com/">
NCEE '98,</a></strong>
9 y 10 de octubre de 1998, Auburn, Maine, EE.UU.<br>
Se envi&oacute; un extenso informe a advocacy@openbsd.org.  La venta de
camisetas y CDs dej&oacute; mucho que desear, pero aprovechamos para
resaltar los puntos fuertes del proyecto.

<p>
<li><strong>                                    
<a href="http://www.acm.uiuc.edu/conference">
Reflections/Projections 1998,</a></strong>
del 2 al 4 de octubre de 1998, Champaign-Urbana, Illinois, EE.UU.<br>
Theo de Raadt habl&oacute; en un panel sobre software abierto/libre con
Eric Raymond y otros.

<p>                                             
<li><strong>
<a href="http://opensource.oreilly.com/townmeet.html">
O'Reilly and Associates Open Source Developer Days,</a></strong>
21 de agosto de 1998, San Jos&eacute;, California, EE.UU.<br>
Los miembros del equipo de OpenBSD estuvieron disponibles para discutir
sobre el papel de OpenBSD entre los otros proyectos de sistemas libres
existentes.  Tambi&eacute;n se vendieron algunos CDs y camisetas.

<p>
<a name="defcon98">
<li><strong><a href="http://www.defcon.org/html/defcon-6.html">
Defcon VI,</a></strong>
del 31 de julio al 2 de agosto de 1998, Las Vegas, Nevada, EE.UU.<br>
El enrutador hacia el exterior era una m&acute;quina con OpenBSD 2.3.
Estuvo implicada en una competici&oacute;n para &laquo;capturar el
indicador&raquo; en la que, en una sala llena de <em>crackers</em>,
intentaban entrar de forma ilegal en esta m&aacute;quina y en otras con
otros sistemas operativos.  No pudieron entrar en la m&aacute;quina con
OpenBSD.
<br>
Se vendieron casi 100 CDs de OpenBSD 2.3 (se nos agotaron otra vez).
Los primates de <a href="http://www.monkey.org">monkey.org</a> trajeron
camisetas de OpenBSD 2.3 a la conferencia, y vendieron 200.  El dinero
obtenido lo donaron al proyecto OpenBSD.

<p>
<li><strong>
<a href="http://www.blackhat.com">
BlackHat Sessions,</a></strong>
del 29 al 30 de julio de 1998, Las Vegas, Nevada, EE.UU.<br>
Theo de Raadt present&oacute; una charla bajo el t&iacute;tulo de
&laquo;Auditar el software por seguridad&raquo;, que trataba sobre el
proceso de auditor&iacute;a de seguridad del equipo de OpenBSD y lo que
el equipo hab&iacute;a aprendido todo este tiempo.  La charla se
centr&oacute; en c&oacute;mo nuestro proceso soluciona errores
l&oacute;gicos, no s&oacute;lo agujeros de seguridad, ya que nadie sabe
cu&aacute;ndo 5 errores actuar&aacute;n de forma conjunta para
convertirse en un agujero de seguridad.

<p>
<li><strong>
<a name="usenix-neworleans"></a>
<a href="http://www.usenix.org/publications/library/proceedings/usenix98/index.html">
Usenix Annual Technical Conference,</a></strong>
del 15 al 19 de junio de 1998, Nueva Orle&aacute;ns, Louisiana,
EE.UU.<br>
En Usenix 1998 hubo una presencia muy fuerte de OpenBSD, tanto en las
conferencias normales como en las de Freenix.  Theo dio una charla
general sobre lo que tiene que ofrecer el proyecto de OpenBSD.  Angelos
particip&oacute; en un panel sobre IPSEC (que es un tema muy relacionado
con OpenBSD, ya que el desarrollo de IPSEC en ese momento se encontraba
mucho m&aacute;s avanzado en OpenBSD que en cualquier otro).
<br>
Los PCs de la sala de terminales funcionaban con OpenBSD 2.3.  Vendimos
muchos CDs.  El primer dise&ntilde;o de la camiseta de OpenBSD se
vendi&oacute; tambi&eacute;n bastante bien.

<p>
<li><strong>
<a href="http://www.usenix.org/publications/library/proceedings/sec98/index.html">
Usenix Security,</a></strong>
del 26 al 29 de enero de 1998, San Antonio, Texas, EE.UU.<br>
En esta conferencia Theo present&oacute; una charla vespertina que
result&oacute; ser una lista de problemas de seguridad solucionados y
avisos sobre subsistemas en los que se podr&iacute;a encontrar futuros
problemas (est&aacute;n disponibles
<a href="../papers/security98-slides.ps">las diapositivas</a>).
<br>
Los PC de la sala de terminales funcionaban con OpenBSD 2.2.


<h3>1997</h3>

<li><strong>
<a href="http://www.hip97.nl">
HIP,</a></strong>
Agosto de 1997, Almere, Pa&iacute;ses Bajos<br>
Niels particip&oacute; en una
<a href="http://www.physnet.uni-hamburg.de/provos/hip97-tcpip.html">
charla</a> sobre los problemas de las conexiones TCP/IP no cifradas,
proponiendo IPSEC como posible soluci&oacute;n.

<p>
<li><strong>HOPE</strong>,
Agosto de 1997, Nueva York, NY, EE.UU.<br>
La sala de terminales consisti&oacute; principalmente de DECstations con
OpenBSD 2.1.  Los componentes de
<a href="http://www.l0pht.com">L0phT</a> volvieron a hablar muy bien
sobre nuestra seguridad.

<p>
<li><strong>
<a name="defcon5"></a>
<a href="http://www.defcon.org/html/defcon-5.html">
Defcon V,</a></strong>
del 11 al 13 de julio de 1997, Las Vegas, Nevada, EE.UU.<br>
En esta conferencia el equipo de OpenBSD vendi&oacute; unos 100 CDs de
la versi&oacute;n 2.1.
<br>
&Eacute;sta es la conferencia m&aacute;s importante sobre seguridad, y
muchos de los oradores hablaron muy bien sobre nuestro trabajo en torno
a la seguridad... en particular algunos como los de
<a href="http://www.l0pht.com">L0phT</a>.


<p>
<li><strong>
<a href="http://www.usenix.org/publications/library/proceedings/ana97/index.html">
Usenix Annual Technical Conference,</a></strong>
del 6 al 10 de enero de 1997, Anaheim, California, EE.UU.<br>
Theo de Raadt organiz&oacute; una reuni&oacute;n para OpenBSD.

</dl>


<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: events.html,v 1.220 ]<br>
$Translation: events.html,v 1.79 2003/10/05 00:04:37 horacio Exp $<br>
$OpenBSD: events.html,v 1.72 2003/10/05 00:22:05 horacio Exp $
</small>

</body>
</html>
