<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Objetivos del Proyecto OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de objetivos del proyecto OpenBSD">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2004 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Objetivos del Proyecto</font></h2>
<hr>

<p>
L&oacute;gicamente, cada uno de los desarrolladores que trabajan en
OpenBSD tiene sus propios objetivos y prioridades, pero se puede hacer
una clasificaci&oacute;n de objetivos comunes a todos ellos:

<ul>
   <li>Proveer la mejor plataforma de desarrollo posible.  Dar
   <a href="anoncvs.html">acceso a todo el c&oacute;digo fuente</a> a
   desarrolladores y usuarios, incluyendo la capacidad de ver
   directamente los cambios en el &aacute;rbol del CVS.  Los usuarios
   pueden incluso mirar nuestro &aacute;rbol de fuentes y los cambios
   que se aplican a &eacute;ste
   <a href="http://www.openbsd.org/cgi-bin/cvsweb">directamente desde la
   <em>web</em></a><p>
   
   <li>Integraci&oacute;n de c&oacute;digo de calidad de cualquier
   fuente con un <a href="policy.html">copyright aceptable</a>
   (preferiblemente del estilo ISC o Berkeley;  GPL es aceptable como
   &uacute;ltimo recurso, aunque nunca en el n&uacute;cleo del sistema,
   y NDA no es aceptable bajo ning&uacute;n concepto).  Queremos que el
   c&oacute;digo fuente se encuentre disponible para que cualquiera lo
   pueda usar con CUALQUIER PROP&Oacute;SITO, y sin restricciones.
   <strong>Nos esforzamos para que nuestro software sea consistente y
   seguro, y animamos a las empresas a que usen cualquier parte que
   quieran.</strong> Existen <a href="products.html">derivados
   comerciales</a> de OpenBSD.<p>

   <li>Prestar atenci&oacute;n a los <a href="security.html">problemas
   de seguridad y solucionarlos antes de que otros lo hagan</a>
   (intentar ser el sistema operativo m&aacute;s seguro).<p>

   <li><a href="crypto.html">M&aacute;s integraci&oacute;n de software
   criptogr&aacute;fico</a>.  Esto quiere decir IPsec, IPv6,
   m&aacute;quinas de clave de sesi&oacute;n, Kerberos, free-AFS, y
   otras formas de criptograf&iacute;a fuerte o de sistemas que hagan
   uso de &eacute;sta.  OpenBSD se desarrolla y distribuye desde
   Canad&aacute;, y de acuerdo con la ley canadiense es legal la
   exportaci&oacute;n de criptolog&iacute;a a todo el mundo (de acuerdo
   con <a href="http://www.efc.ca/pages/doc/crypto-export.html">el
   trabajo de un canadiense sobre el tema, y tal y como est&aacute;
   <a href="http://axion.physics.ubc.ca/ECL.html">documentado en la
   lista de Control de Exportaci&oacute;n de Canad&aacute;</a>).  Los
   desarrolladores de OpenBSD participan de modo activo en la
   investigaci&oacute;n y desarrollo de IPsec.<p>

   <li>Seguimiento e implementaci&oacute;n de normas (ANSI, POSIX,
   partes de X/Open, etc...).<p>

   <li>Trabajar para la consecuci&oacute;n de un &aacute;rbol de fuentes
   muy independiente de la arquitectura.  <a href="plat.html">Dar
   soporte a la mayor cantidad posible de sistemas y hardware</a>.<p>

   <li>Permanecer lo m&aacute;s al margen que sea posible de
   pol&iacute;ticas de todo tipo.  Las soluciones se deben adoptar en
   base al m&eacute;rito t&eacute;cnico.<p>

   <li>No permitir que problemas serios se queden sin resolver.<p>

   <li>Proveer de una buena plataforma para la
   compilaci&oacute;n/desarrollo cruzado.<p>

   <li>Importar paquetes externos con modificaciones m&iacute;nimas, con
   el fin de que las actualizaciones sean m&aacute;s f&aacute;ciles.
   Tambi&eacute;n enviar a los autores los cambios efectuados.<p>

   <li>Llevar a cabo, aproximadamente cada seis meses, el lanzamiento de
   una nueva versi&oacute;n en CDROM, sobre todo para recoger fondos
   para el proyecto...<p>
</ul>

<a name="funding"></a>
<h2><font color="#e00000">Fondos del Proyecto</font></h2>

<p>
Naturalmente, el proyecto OpenBSD, debido a los costes de l&iacute;neas
para Internet y a los mismos problemas de actualizaci&oacute;n de
hardware que todo el mundo experimenta, requiere fondos para funcionar.
Por este motivo el proyecto vende los CDROM de nuestras versiones
m&aacute;s recientes.  Tambi&eacute;n se empezaron a dise&ntilde;ar
camisetas con el fin de recolectar fondos para el proyecto.  Por tanto,
cuando compre un CD de OpenBSD o una camiseta en una conferencia, o en
cualquier otro de nuestros puntos de venta, o desde nuestra 
<a href="orders.html">página de pedidos de CDROM</a>, estar&aacute;
ayudando a incrementar las posibilidades de que OpenBSD contin&uacute;e
desarrollando nuevas versiones en el futuro.

<p>
Las donaciones se pueden efectuar como fondos econ&oacute;micos o como
<a href="want.html">equipamiento (hardware)</a>, y en cualquier caso su
nombre aparecer&aacute; en nuestra
<a href="donations.html">p&aacute;gina de Donantes</a>.  Para obtener
m&aacute;s informaci&oacute;n al respecto, contacte con
<a href="mailto:deraadt@openbsd.org">Theo de Raadt</a> o simplemente
env&iacute;e un cheque donativo en fondos canadienses o estadounidenses
a:<p>

OpenBSD<br>
812 23rd Ave SE<br>
Calgary, Alberta<br>
Canad&aacute;<br>
T2G 1N8<br>
(Ponga el cheque a nombre de &quot;Theo de Raadt&quot;, ya que no puedo
cobrar los cheques a nombre de &quot;OpenBSD&quot;)<br>

<p>
Adem&aacute;s, ahora es posible efectuar donaciones de dinero al
proyecto por Internet a trav&eacute;s de
<a href="https://https.openbsd.org/cgi-bin/order">tarjeta de
cr&eacute;dito</a> o
<a href="https://secure.paypal.com/xclick/business=paypal%40openbsd.org&item_name=OpenBSD+Donation&no_shipping=1">PayPal</a>.

<p>
Aunque las contribuciones no son deducibles de los impuestos en los
EE.UU. como contribuciones de caridad, se pueden deducir como gastos
operativos;  si est&aacute; interesado en esto, pida consejo a su asesor
financiero o contable.  El caso se puede aplicar en otros pa&iacute;ses
en los que las corporaciones puedan hacer donaciones deducibles de
impuestos bajo t&eacute;rminos de <em>bona fide</em>.

<p>
Al principio, Theo de Raadt gast&oacute; m&aacute;s de 30.000
d&oacute;lares canadienses para fundar OpenBSD;  la mayor parte del
dinero fue a parar al costoso mantenimiento de la red (debido a la
pol&iacute;tica sobre criptolog&iacute;a en los EE.UU. no es posible
trasladar el proyecto a ese pa&iacute;s).  Hasta el momento, ninguna
compa&ntilde;&iacute;a o instituci&oacute;n educativa ha financiado el
proyecto de un modo serio o pagado parte de los gastos derivados.  Theo
trabaja a jornada completa para mejorar OpenBSD, y gran parte de los
fondos del proyecto se gastan en comprar nuevo hardware para los
desarrolladores, para que puedan continuar mejorando OpenBSD (por
ejemplo, m&aacute;s de 20 nuevas clases de tarjetas Ethernet han
aparecido en el mercado desde que OpenBSD comenz&oacute;).  Por lo
tanto, un flujo de fondos son necesarios en todo momento.  Las
donaciones continuas de nuestros usuarios son las que aseguran que
OpenBSD contin&uacute;e existiendo.

<hr>

<h2><font color="#e00000">&iquest;D&oacute;nde Viven Nuestros
Desarrolladores?</font></h2>

Este mapa ofrece una aproximaci&oacute;n geogr&aacute;fica de los
lugares en donde viven nuestros desarrolladores.  Intentaremos
actualizarlo regularmente, pero por favor no cuente con ello.

<p>
<center>
<img src="../images/map.jpg" height="508" width="950" alt="mapamundi">
</center>

<hr>

<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="openbsd"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: goals.html,v 1.64 ]<br>
$Translation: goals.html,v 1.22 2004/09/02 19:13:51 santana Exp $<br>
$OpenBSD: goals.html,v 1.21 2004/09/02 20:03:07 jufi Exp $
</small>

</body>
</html>
