<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/i386 (Port&aacute;tiles)</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="OpenBSD laptop">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1997,1998 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">
<img alt="[OpenBSD]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Estado del Porte i386 para
Port&aacute;tiles</font><hr></h2>

<p>
&Eacute;sta es una lista de los port&aacute;tiles que sabemos con
certeza que funcionan con OpenBSD 2.6.

<p>
Si su port&aacute;til no se encuentra en la lista de abajo no significa
que no funcione;  lo m&aacute;s seguro es que en la lista exista
alg&uacute;n modelo parecido al suyo.  Desde la versi&oacute;n 2.6 de
OpenBSD no sabemos de ningún port&aacute;til que no funcione con unas
condiciones m&iacute;nimas.  Y de los que han mostrado problemas...
<ul>
<li>Algunos problemas se deben al soporte para APM.<br>
    <strong>apm -S</strong> falla con la suspensi&oacute;n en algunos
    port&aacute;tiles, pero esto no es un problema grave.
<li>A muchos les falta el soporte para sonido.
<li>Algunos tienen peque&ntilde;os errores con el soporte para PCMCIA.
<li>XFree86 no tiene soporte para sus pantallas.
<li>O alg&uacute;n otro dispositivo integrado no funciona...
<li>No hay soporte para Cardbus.
    Sin embargo, pcmcia funciona bien.
<li>Algunos tienen problemas con el interruptor de expulsi&oacute;n de
    la tarjeta pcmcia.
</ul>

<p>
Si su port&aacute;til funciona (o si no funciona) y no est&aacute; en
la lista que sigue a continuaci&oacute;n, por favor env&iacute;e un
mensaje a <a href="mailto:chris@openbsd.org">chris@openbsd.org</a> para
que lo a&ntilde;ada a la lista.  Por favor, adjunte tanta
informaci&oacute;n como le sea posible.

<p>
Cualquier informe sobre problemas relacionados con APM debe ser enviado
a nuestros desarrolladores de APM 
<a href="mailto:mickey@openbsd.org">Michael Shalayeff</a> y 
<a href="mailto:weingart@openbsd.org">Tobias Weingartner</a>.

<p>
<table border="1">
<tr>
	<th>Port&aacute;til</th>
	<th>Notas</th>
</tr>
</tr><tr>
    <td>
       Sony VAIO F430
     </td><td>
       A partir de OpenBSD 2.6-Current (17/02/00)<p> APM: la
       suspensi&oacute;n &quot;<strong>zzz</strong>&quot; funciona, y
       también la suspensi&oacute;n por teclado.  &quot;<strong>halt
       -p</strong>&quot; y &quot;<strong>apm -S</strong>&quot; no
       funcionan (pero a&uacute;n tengo que buscar utilidades
       phdisk).<p>
       
       El dispositivo de DVD y la disquetera funcionan.  La tarjeta de
       Ethernet funciona despu&eacute;s de despertar con la que estoy
       usando (3Com 3c589).<p>
       
       Contacte con <a href=mailto:beck@openbsd.org>Bob Beck</a>.
     </td>
 </tr><tr>
     <td>
	Sony VAIO z505r
    </td><td>
	Soporte APM: &quot;<strong>zzz</strong>&quot;, la
	suspensi&oacute;n por medio del teclado, la hibernaci&oacute;n
	por medio del teclado, y &quot;<strong>halt -p</strong>&quot;
	funcionan bien.  &quot;<strong>apm -S</strong>&quot; funciona
	inmediatamente.  El estado de hibernaci&oacute;n usa un bloque
	del final del disco, aproximadamente entre 3 y 5 MB m&aacute;s
	grande que la memoria de la m&aacute;quina.  Para repararlo use
	&quot;<strong>phdisk.exe /create /partition</strong>&quot;, y
	configure la partici&oacute;n.  El programa phdisk se encuentra
	disponible en la imagen del disco de arranque que se encuentra
	en el primer CD de recuperaci&oacute;n.<p>

	La ethernet integrada funciona bien, pero tiene que ser
	reiniciada despu&eacute;s del estado de suspensi&oacute;n con
	&quot;<strong>ifconfig fxp0 down; ifconfig fxp0
	up</strong>&quot;.<p>

	Despu&eacute;s de una suspensi&oacute;n el reloj de
	perfilaci&oacute;n no funciona.  Se est&aacute;n creando unos
	parches.<p>

	No hay soporte para sonido.  Desde mediados de abril de 2.000,
	hay soporte para sonido por medio de un controlador dispositivo
	neomagic.<p>

	Cuando el z&oacute;calo de la pastilla de la memoria
	est&aacute; vac&iacute;o puede causar errores que producen un
	desbordamiento en la antememoria de dmesg, y confundir
	as&iacute; al programa de instalaci&oacute;n de OpenBSD.  El
	programa de configuraci&oacute;n de la BIOS, al que se accede
	pulsando F2, tiene una opci&oacute;n para desactivar la
	pastilla de la memoria.<p>

	Se puede encontrar un fichero para su uso con XFree86 3.3.x 
	<a href="../xf86configs/vaioz505r">aqu&iacute;</a>.<p>

	Contactar con 
	<a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO z505s
    </td><td>
	Parecido a VAIO z505r excepto en que el dispositivo de
	disquetes USB que incluye, tiene algunos problemas.<p>

	Contactar con 
	<a href="mailto:provos@openbsd.org">Niels Provos</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO 747</td>
    </td><td>
	XFree86 y APM funcionan desde OpenBSD 2.6.<p>

	Este modelo incluye una tarjeta de modem PCMCIA (COM One MCC220
	Platinium Card) que funciona sin problemas.<p>

	Funciona el sonido (s&oacute;lo 8 bits).<p>

	APM se comporta de un modo similar al de VAIO z505r, con la
	diferencia de que la hibernaci&oacute;n no ha sido probada.<p>

	USB no funciona.<p>

	Se puede encontrar un fichero de configuraci&oacute;n
	XF86Config <a href="../xf86configs/vaio747">aqu&iacute;</a>.<p>

	Contactar con 
	<a href="mailto:markus@openbsd.org">Markus Friedl</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO PCG 505-FX
    </td><td>
	No existe informaci&oacute;n.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 701C
    </td><td>
	Todas las caracter&iacute;sticas, incluida hibernaci&oacute;n y
	APM, funcionan.<p>

	Contactar con 
	<a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 770Z
    </td><td>
	XFree86 y APM no funcionan en OpenBSD 2.6.<p>

	Las versiones m&aacute;s actuales de XFree86 tienen soporte
	para X, y hay parches disponibles.<p>

	APM tambi&eacute;n se ha arreglado en las revisiones de 2.6, y
	se dispondr&aacute; de parches.<p>

	El sonido funciona bien.<p>

	Contactar con 
	<a href="mailto:angelos@openbsd.org">Angelos Keromytis</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 760
    </td><td>
	XFree86 y APM no funcionan en OpenBSD 2.6.<p>

	Las versiones m&aacute;s actuales de XFree86 tienen soporte
	para X, y hay parches disponibles.<p>

	MWave modem/sound no funciona.<p>

	APM tambi&eacute;n se ha arreglado en las revisiones de 2.6, y
	se dispondr&aacute; de parches.<p>

	Contactar con 
	<a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad T20
    </td><td>
	apm funciona en su mayor parte con OpenBSD 2.7 y posterior.  La
	&uacute;nica parte que ha fallado hasta ahora es halt -p (no
	apaga el sistema).  Cuando se cierra la tapa se queda en modo
	de suspensi&oacute;n.  Cuando se abre la tapa lo restablece
	bien.<p>

	El m&oacute;dem integrado es un winmodem... ign&oacute;relo.
	En realidad es una tarjeta `mini-pci', as&iacute; que es
	posible quitarla.<p>

	El sistema de audio NO funciona.  Hay un controlador que se
	puede activar, pero hasta ahora todo lo que he conseguido ha
	sido un poco de ruido de los altavoces/auriculares.

	Nota:  arranqu&eacute; con Windows una vez y una de las tareas
	que llev&oacute; a cabo fue `preparar el &aacute;rea de
	suspensi&oacute;n'.  No s&eacute; si era necesario.  Tal vez
	s&iacute;.  El sistema es ahora OpenBSD al 100%.

	Ver <a href="http://www.snafu.org/t20/">http://www.snafu.org/t20/</a>
	para la informaci&oacute;n referente al soporte de X11.

	Contactar con
	<a href="mailto:marc@snafu.org">Marco S Hyman</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 50CT
    </td><td>
	APM funciona pero debe tener cuidado y no hacer uso de los
	&uacute;ltimos 32MB del disco ya que en &eacute;stos es donde
	la BIOS vuelca la imagen de hibernaci&oacute;n de largo
	temporada.  Puede mirar la geometr&iacute;a de la BIOS en la
	etiqueta del disco duro para saber con exactitud cu&aacute;ntos
	sectores requiere.  Si no lleva esto a cabo, le
	corromper&aacute; oacute;n en el sistema de archivos durante el
	periodo de suspensi&oacute;n.
	
	<p>
	libretto usa un &uacute;nico IRQ para <strong>sb</strong> y
	<strong>wss</strong>, por lo que lo mejor que puede hacer es
	escoger uno y desactivar el otro en el n&uacute;cleo del
	sistema.  El dispositivo externo de disquete no tiene soporte
	en OpenBSD en la actualidad, pero se puede usar durante el
	proceso de instalaci&oacute;n.
	
	<p>
	La instalaci&oacute;n con una sola ranura pcmcia puede ser un
	poco complicada.  La mejor manera para llevarla a cabo es hacer
	una instalaci&oacute;n en red.  Para ello, cargue el disquete
	de arranque y desde el &laquo;punto de pedido&raquo;
	(&quot;prompt&quot;) de arranque, introduzca la orden <em>boot
	-c</em>.  En cuanto vea el punto de pedido <em>UKC</em>,
	desenchufe el dispositivo de disquete, conecte la tarjeta de
	red, y escriba exit.  El n&uacute;cleo del sistema
	realizar&aacute; una prueba sobre la tarjeta de red y a partir
	de ah&iacute; deber&iacute;a poder realizar una
	instalaci&oacute;n por red.  Es posible que sea necesario
	desactivar los dispositivos de sonido desde la BIOS para que el
	disquete de arranque lleve a cabo una correcta detecci&oacute;n
	de la tarjeta de red.<p>

	Se puede encontrar un fichero de configuración XF86Config para
	XFree86 3.3.x 
	<a href="../xf86configs/libretto50ct">aqu&iacute;</a><p>
	
	<p>
	Contactar con 
	<a href="mailto:millert@openbsd.org">Todd Miller</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 100CT
    </td><td>
	La mayor parte de la informaci&oacute;n en la lista para
	Libreto 50CT tambien es v&aacute;lida para el 100CT.<p>

	X11 funciona en modo 800x400.<p>

	Se puede encontrar un fichero de configuraci&oacute;n
	XF86Config para XFree86 3.3.x 
	<a href="../xf86configs/libretto100ct">aqu&iacute;</a><p>

	Contactar con 
        <a href=mailto:millert@openbsd.org>Todd Miller</a>.
    </td>
</tr><tr>
    <td>

	Toshiba Portege 660CDT
    </td><td>
	APM no funciona en absoluto.<p>

	El hardware de sonido mixto <strong>sb</strong> y
	<strong>wss</strong> puede causar algunos da&ntilde;os.  Las
	versiones actuales de la BIOS flash son peores, ya que son
	m&aacute;s inflexibles con las interrupciones que permiten.<p>

	Contactar con 
	<a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr><tr>
    <td>
	Digital HiNote VP735
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	Todo lo dem&aacute;s funciona.<p>

	Se aconseja que se activen las opciones PCIBIOS, BIOS32,
	PCIBIOS_INTR_FIXUP en el n&uacute;cleo del sistema, para que
	asigne el irq al controlador de USB.<p>

	Se puede encontrar un fichero de configuraci&oacute;n
	XF86Config para XFree86 3.3.x 
	<a href="../xf86configs/hinotevp700">aqu&iacute;</a><p>

	Contactar con 
	<a href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</tr><tr>
    <td>
	Fujitsu Lifebook C325
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	El sonido funciona cuando se activa el modo de emulaci&oacute;n
	SB en la BIOS.  Todo lo dem&aacute;s funciona.<p>

	Contactar con 
	<a href="mailto:tom@knienieder.com">Tom Knienieder</a>.
    </td>
</tr><tr>
    <td>
        Fujitsu Stylistic 500
     </td><td>
        APM funciona.<p>

        El puerto serie no fuciona.<p>

	Se necesitan algunos retoques para peque&ntilde;a memoria del
	n&uacute;cleo (4MB).<p>

	X ``funciona'' (pero se vuelve loca).<p>

        Contacte con 
	<a href=mailto:d@openbsd.org>David Leonard</a>.
     </td>
 </tr><tr>
     <td>
	Siemens SCENIC Mobile 360
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	El sonido funciona usando OSS.<p>

	Contactar con 
	<a href="mailto:b1000@softhome.net">Dan Carlsson</a>.
    </td>
</tr><tr>
    <td>
	Dell Inspiron 3200 D233XT (Bios release: A10)
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	La suspensi&oacute;n (de RAM o del disco) no funciona con X (el
	servidor de X no repone la pantalla al reanudar), pero DPMS
	s&iacute; funciona (la pantalla se apaga despu&eacute;s de un
	tiempo si no se usa la m&aacute;quina).  La
	configuraci&oacute;n de APM en la BIOS (para la
	suspensi&oacute;n autom&aacute;tica) interfiere con el servidor
	de X, y debe estar desactivada.<p>

	La suspensi&oacute;n del disco necesita una partici&oacute;n
	DOS (FAT16) que contenga un fichero llamado
	&quot;SAVE2DSK.BIN&quot;.  A este fichero, que se genera con
	las herramientas de Dell en Windows 98 (viene predefinido de
	f&aacute;brica), se le debe dar tama&ntilde;o (tama&ntilde;o de
	ram +2 &oacute; 3MB).  Por tanto se requiere una
	partici&oacute;n DOS presente (debe ser la primera
	partici&oacute;n en el disco).<p>

	PCMCIA: funciona excepto la tarjeta &quot;live&quot; de
	expulsi&oacute;n o introducci&oacute;n (que bloquea la
	m&aacute;quina;  es necesario reiniciar con la tecla de
	reinicio).<p>

	USB: no funciona;  si se activa, el n&uacute;cleo del sistema
	se cuelga en la fase de inicio durante la detecci&oacute;n del
	controlador de USB.<p>

	Contactar con 
	<a href="mailto:b1000@softhome.net">Dan Carlsson</a>.
    </td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CS
	</td><td>
	APM no funciona;  sin embargo, <b>halt -p</b> s&iacute; que
	funciona.<p>
	
	El sonido funciona por definici&oacute;n con el n&uacute;cleo
	GENERIC, pero los altavoces no valen la pena.  X tambi&eacute;n
	funciona bien.<p>

	Contactar con 
	<a href="mailto:ericj@monkey.org">Eric Jackson</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CDT
	</td><td>
	APM no funciona en absoluto (y puede da&ntilde;ar su disco).<p>

	XFree86 s&iacute; funciona (800x600 16bpp).<p>

	El sonido funciona (21739 Hz, medio d&uacute;plex
	est&eacute;reo).<p>

        <!-- Serial IR is said to work, needs verification. -->

	Contactar con <a href="mailto:brad@openbsd.org">Brad Smith</a>,
	o con <a href=mailto:d@openbsd.org>David Leonard</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 550CDT
	</td><td>
	La suspensi&oacute;n profunda (<b>zzz</b>) funciona, pero
	<b>-S</b> lo reactiva de inmediato.<p>

	XFree86 funciona de maravilla.<p>

	El sonido funciona despu&eacute;s de algunos cambios de IRQs en
	la BIOS.<p>

	USB funciona;  al menos yo, he enchufado una c&aacute;mara
	digital y el dispositivo <b>ugen</b> la detect&oacute; y la
	configur&oacute;.<p>

	El modem integrado no funciona ya que requiere de un software
	s&oacute;lo disponible para Windows;  o sea, no implementa un
	puerto de comunicaciones RS232 aut&eacute;ntico.<p>

	pcic no funciona en esta m&aacute;quina, as&iacute; que no
	puedo hacer ning&uacute;n comentario preciso sobre PCMCIA
	attact/detach.<p>

	Contactar con 
	<a href="mailto:aaron@openbsd.org">Aaron Campbell</a>.
	</td>
</tr><tr>
    <td>
	NEC Versa 2000
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	Todo lo dem&aacute;s funciona.<p>

	Contactar con 
	<a href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</table>

<hr>
<a href="plat.html"><img height=24 width=24 src="../back.gif" border=0 alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: i386-laptop.html,v 1.28 2000/07/14 16:48:04 marc Exp ]<br>
$Translation: i386-laptop.html,v 1.8 2000/06/15 17:54:40 horacio Exp $<br>
$OpenBSD: i386-laptop.html,v 1.10 2000/07/30 22:48:15 horacio Exp $
</small>

</body>
</html>
