<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenBSD/i386 (Port&aacute;tiles)</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="OpenBSD portátil">
<meta name="keywords" content="openbsd,portátiles,mobile">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1997-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Estado del Porte i386 para
Port&aacute;tiles</font></h2>
<hr>

<p>
&Eacute;sta es una lista de los port&aacute;tiles que sabemos con
certeza que funcionan con OpenBSD 2.9.

<p>
Si su port&aacute;til no se encuentra en la lista de abajo no significa
que no funcione;  lo m&aacute;s seguro es que en la lista exista
alg&uacute;n modelo parecido al suyo.  Desde la versi&oacute;n 2.6 de
OpenBSD casi todos los port&aacute;tiles funcionan muy bien, y tan
s&oacute;lo quedan unos peque&ntilde;os detalles por resolver.  Las
&uacute;ltimas versiones de OpenBSD ofrecen un mejor rendimiento.

<p>
Y de los que han mostrado problemas...
<ul>
<li>Algunos problemas se deben al soporte para APM.<br> <strong>apm
-S</strong> falla con la suspensi&oacute;n en algunos port&aacute;tiles,
pero esto no es un problema grave.
<li>A algunos les falta el soporte para sonido.
<li>Unos pocos tienen peque&ntilde;os errores en el soporte para PCMCIA
y Cardbus.
<li>El soporte para XFree86 en algunas pantallas no es bueno.  A veces,
instalar XFree86 4.x puede solucionarlo.
<li>O alg&uacute;n otro dispositivo integrado no funciona...
<li>Algunos tienen problemas con el interruptor de expulsi&oacute;n de
la tarjeta pcmcia.
</ul>

<p>
Si su port&aacute;til funciona (o si no funciona) y no est&aacute; en la
lista que sigue a continuaci&oacute;n, por favor env&iacute;e un mensaje
a <a href="mailto:www@openbsd.org">www@openbsd.org</a> para que lo
a&ntilde;adan a la lista.  Por favor, adjunte tanta informaci&oacute;n
como le sea posible.

<p>
Cualquier informe sobre problemas relacionados con APM debe ser enviado
a nuestros desarrolladores de APM 
<a href="mailto:mickey@openbsd.org">Michael Shalayeff</a> y 
<a href="mailto:weingart@openbsd.org">Tobias Weingartner</a>.

<p>
<table border="1">
<tr>
	<th>Port&aacute;til</th>
	<th>Notas</th>
</tr><tr>
    <td>
        Acer TravelMate 345
    </td><td>
         APM funciona a partir de OpenBSD 2.7-CURRENT.
	 <p>

	 XFree86 funciona (800x600 16bpp).
	 <p>

	 El sonido funciona.
	 <p>

	 El m&oacute;dem Lucent no funciona.
	 <p>

	 Contacte con
	 <a href="mailto:kevlo@openbsd.org">Kevin Lo</a>.
    </td>
 </tr>
 	<td>
		Acer Travelmate 524TEV Laptop
	</td>
	<td>
	<p>El soporte de APM funciona al completo (en consola y X)
	<p>El soporte para PCMCIA Card (ne0) funciona bien
	<p>Intel Ethernet Express Pro 10/100 interna funciona
	<p>XFree86 con ATI Rage Mobility AGP funciona (1024x768, 16bpp)
	<p>El sonido y los winmodem no funcionan
	<p>Contacte con Matthias Schmidt &lt;xhr@gmx.net&gt;
	</td>
</tr>

<tr>
	<td>
		Asus L8400<p>
	</td>
	<td>
	APM y la suspensi&oacute;n funcionan completamente (tanto en X
	como en consola).<br>
	La tarjeta Ethernet 10/100 interna tambi&eacute;n funciona,
	as&iacute; como el <em>chip</em> de gr&aacute;ficos S3 Savage
	MX-MV en XFree86 4.1.0.
	<p>
	La tarjeta de sonido (ESS ES1989) funciona, pero el winmodem no
	funciona.
	<p>
	El resto (PCMCIA, Infrarrojos, USB) no ha sido verificado.
	<p>
	Contacte con <a href="mailto:jufi@openbsd.org">Jan-Uwe
	Finck</a>.
</tr>
 <tr>
    <td>
        Compaq Armada M700<p>
    </td><td>
	APM funciona bien, pero no la suspensi&oacute;n en X.  La
	suspensi&oacute;n funciona desde la consola.  CardBus
	funciona.<p>

	La Ethernet 10/100 interna (para los modelos que la tienen),
	funciona muy bien con el controlador
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fxp&amp;sektion=4">fxp(4)</a>.<p>

	Todav&iacute;a no hay soporte para sonido.  Hay gente trabajando
	en esto.<p>

	Todav&iacute;a no hay soporte para el modem interno (es un
	winmodem).  Hay un controlador s&oacute;lo para binarios para
	Linux.  Tambi&eacute;n est&aacute; el
	<a href="http://linmodems.org">proyecto linmodem</a>, que
	est&aacute; intentando codificar un controlador de c&oacute;digo
	abierto para los winmodem.<p>

	Puede encontrar un fichero de configuraci&oacute;n XF86Config
	<a href="../xf86configs/armadam700">aqu&iacute;</a>.<p>

	Contacte con <a href="mailto:nate@openbsd.org">Nathan
	Binkert</a>.
    </td>
 </tr><tr>
    <td>
	Dell Inspiron 3200 D233XT (Bios release: A10)
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	La suspensi&oacute;n (de RAM o del disco) no funciona con X (el
	servidor de X no repone la pantalla al reanudar), pero DPMS
	s&iacute; funciona (la pantalla se apaga despu&eacute;s de un
	tiempo si no se usa la m&aacute;quina).  La configuraci&oacute;n
	de APM en la BIOS (para la suspensi&oacute;n autom&aacute;tica)
	interfiere con el servidor de X, y debe estar desactivada.<p>

	La suspensi&oacute;n del disco necesita una partici&oacute;n DOS
	(FAT16) que contenga un fichero llamado
	&quot;SAVE2DSK.BIN&quot;.  A este fichero, que se genera con las
	herramientas de Dell en Windows 98 (viene predefinido de
	f&aacute;brica), se le debe dar tama&ntilde;o (tama&ntilde;o de
	ram +2 &oacute; 3MB).  Por tanto se requiere una
	partici&oacute;n DOS presente (debe ser la primera
	partici&oacute;n en el disco).<p>

	PCMCIA: funciona excepto la tarjeta &quot;live&quot; de
	expulsi&oacute;n o introducci&oacute;n (que bloquea la
	m&aacute;quina;  es necesario reiniciar con la tecla de
	reinicio).<p>

	USB: no funciona;  si se activa, el n&uacute;cleo del sistema se
	cuelga en la fase de inicio durante la detecci&oacute;n del
	controlador de USB.<p>

	Contactar con <a href="mailto:b1000@softhome.net">Dan
	Carlsson</a>.
    </td>
</tr><tr>
    <td>
	Dell Latitude CPt<p>
    </td><td>
	apm -z y -S funcionan.<p>

	El sonido funciona.<p>

	XFree86 v3 funciona en 1024x768x24bpp.  XF4 se ve mejor en
	16bpp.<p>

	Las dos ranuras PCMCIA funcionan.<p>

	Detecta USB, pero no ha sido comprobado.  Despu&eacute;s de
	entrar en suspensi&oacute;n no parece funcionar.<p>

	Se puede encontrar un fichero de configuraci&oacute;n para XF4
	<a href="../xf86configs/latitudecpt">aqu&iacute;</a>.<p>

	Contacte con <a href="mailto:op21@squish.org">Paul Wang</a>.
    </td>
</tr><tr>
     <td>
	Dell Lattitude LMP-133ST
    </td><td>
	El n&uacute;cleo (<em>kernel</em>) <code>GENERIC</code>
	funciona.  APM funciona.  XFree86 v3 funciona bien (s&oacute;lo
	8 bits).  XF4.0 funciona con varios problemas, las consolas
	virtuales alternativas eran ilegibles (esto parece que ha sido
	solucionado en la versi&oacute;n actual de XF4;  no se ha
	verificado en esta m&aacute;quina).
	<p>
	Puede encontrar un fichero de configuraci&oacute;n para XF4
	<a href="../xf86configs/latitudelmp">aqu&iacute;</a> y otro para
	XFree86 R3
	<a href="../xf86configs/latitudelmp-xf3">aqu&iacute;</a>.
	<p>
	Contacte con Ian Darwin.
	</td>
</tr><tr>
    <td>
	Digital HiNote VP735
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	Todo lo dem&aacute;s funciona.<p>

	Se puede encontrar un fichero de configuraci&oacute;n XF86Config
	para XFree86 3.3.x 
	<a href="../xf86configs/hinotevp700">aqu&iacute;</a><p>

	Contactar con <a href="mailto:mickey@openbsd.org">Michael
	Shalayeff</a>.
    </td>
</tr><tr>
    <td>
	Fujitsu Lifebook C325
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	El sonido funciona cuando se activa el modo de emulaci&oacute;n
	SB en la BIOS.  Todo lo dem&aacute;s funciona.<p>

	Contactar con <a href="mailto:tom@knienieder.com">Tom
	Knienieder</a>.
    </td>
</tr><tr>
    <td>
        Fujitsu Stylistic 500
     </td><td>
        APM funciona.<p>

        El puerto serie no fuciona.<p>

	Se necesitan algunos retoques para peque&ntilde;a memoria del
	n&uacute;cleo (4MB).<p>

	X ``funciona'' (pero se vuelve loca).<p>

	Contacte con <a href="mailto:d@openbsd.org">David Leonard</a>.
     </td>
 </tr><tr>
    <td>
	IBM Thinkpad 701C
    </td><td>
	Todas las caracter&iacute;sticas, incluida hibernaci&oacute;n y
	APM, funcionan.<p>

	Contactar con <a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 770Z
    </td><td>
	<p>
	Desde OpenBSD 2.8, casi todo funciona bien.
	</p>

	<p>
	En realidad este port&aacute;til no tiene BIOS;  la
	mayor&iacute;a de las configuraciones de los dispositivos, como
	las asignaciones de IRQ, se tienen que hacer con Windows.
	</p>

	<p>
	Puede conseguir que los puertos de serie e infrarojos sean
	reconocidos como dispositivos com* cambiando las asignaciones de
	las IRQ en Windows.  Lo mismo para el puerto paralelo (es lpt2).
	</p>

	<p>
	Para que APM funcione necesitar&aacute; a&ntilde;adir esta
	l&iacute;nea en la configuraci&oacute;n de su n&uacute;cleo:
	</p>

<pre>
option         APM_DISABLE_INTERRUPTS=0
</pre>

         <p>
	 La hibernaci&oacute;n (guardar en disco) funciona bien siempre
	 que tenga una partici&oacute;n de Windows con suficiente
	 espacio en el disco (algo m&aacute;s que la memoria del
	 sistema).  Las funciones de suspensi&oacute;n/resumir/apagar
	 funcionan bien todas;  sin embargo, si usa la
	 hibernaci&oacute;n desde el X Window System (comprobado con
	 XFree86 3.3.6) corrompe la memoria de imagen y s&oacute;lo
	 parece recuperarse despu&eacute;s de reiniciar el servidor de
	 X; cambiar entre terminales virtuales no lo soluciona.  Se ha
	 sugerido que el cambiar a diferentes resoluciones podr&iacute;a
	 solucionarlo.  En XFree86 4.0 este problema est&aacute;
	 solucionado, pero la &uacute;ltima vez que lo comprob&eacute;
	 no dispon&iacute;a de soporte de aceleraci&oacute;n para el
	 controlador.  La mejor soluci&oacute;n es cambiar al modo de
	 texto antes de pasar a la hibernaci&oacute;n.
	 </p>

	 <p>
	 Si activa el monitor externo (Fn+F7), XFree86 3.3.6 muestra un
	 extra&ntilde;o arco iris de colores y acaba colgando el sistema
	 (a menos que cambie a modo de texto o que mate el servidor en
	 unos pocos segundos);  si cambia a modo de texto tendr&aacute;
	 que matar el servidor de X (si vuelve al modo gr&aacute;fico el
	 sistema caer&aacute;).  Activar el monitor externo mientras se
	 est&aacute; en modo de v&iacute;deo no tiene ning&uacute;n
	 efecto colateral;  puede iniciar X o cambiar a X si estaba
	 funcionando previamente.
	 </p>
	 
	 <p>
	 El controlador
	 <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=clcs&amp;sektion=4">clcs(4)</a>
	 no funciona bien, y lo mejor es que lo desactive.  No es
	 importante ya que el de soundblaster
         (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Curren&amp;arch=i386">sb(4)</a>)
	 lo a&ntilde;adir&aacute; y funcionar&aacute; bien.  Es probable
	 que tenga que modificar las asignaciones de IRQ para que
	 funcione.
	 </p>

	<p>
	Puede encontrar un fichero de configuraci&oacute;n XF86Config
	<a href="../xf86configs/thinkpad770z">aqu&iacute;</a>.
	</p>

	<p>
	Contacte con <a href="mailto:angelos@openbsd.org">Angelos
	Keromytis</a>.
	</p>
    </td>
</tr><tr>
    <td>
	IBM Thinkpad A21p
    </td><td>
	Vea la informaci&oacute;n sobre el T21.  Todo es igual a
	excepci&oacute;n de la tarjeta de v&iacute;deo, que es una ATI
	Rage 128 Mobility LF.  Con las versiones de OpenBSD 2.8
	posteriores a mediados de diciembre con XFree86 4.0.2, funciona
	muy bien a 1600x1200 24bpp.  Debe ejecutar la siguiente
	l&iacute;nea:
	<pre>
		sysctl -w machdep.allowaperture=2
	</pre>
	e introducir los rangos de frecuencia correctos en la
	secci&oacute;n Monitor de XF86Config.  Aqu&iacute; tiene un
	ejemplo: <a href="../xf86configs/thinkpada21p">XF86Config.</a>
    </td>
</tr><tr>
    <td>
	IBM Thinkpad A30p
    </td><td>
	<p>
	En mi modelo, la mayor&iacute;a de partes funcionan bien con
	OpenBSD 3.1.
	</p>

	<p>
	Hay que tener en cuenta que IBM no vende variantes del modelo
	b&aacute;sico.
	</p>

	<p>
	Se requieren los mismos pasos que en otros modelos de Thinkpad
	si se desea conservar Windows.  El multiarranque con Windows NT
	funciona.  Hasta ahora siempre he conservadfo la
	partici&oacute;n de restauraci&oacute;n, y sugiero que se copie
	la partici&oacute;n de restauraci&oacute;n a un CD, como copia
	de seguridad.
	</p>

	<p>
	Es necesario indicarle de forma expl&iacute;cita a la tarjeta de
	v&iacute;deo (ATI Radeon Mobility) que se ejecute en 1600x1200
	(para lo que s&oacute;lo es necesario a&ntilde;adir dos
	l&iacute;neas a XF86Config).  Algunas veces X no se inicia
	correctamente, y hay que matar el proceso y reiniciarlo.  La
	extensi&oacute;n XVideo funciona, por lo que los DVD se pueden
	ejecutar en pantalla completa con ogle.  En la versi&oacute;n de
	desarrollo (OpenBSD<em>-current</em>), mplayer tambi&eacute;n
	puede mostrar otros tipos de v&iacute;deo.
	</p>

	<p>
	El sonido funciona.  La tarjeta Ethernet integrada funciona.  La
	Prim WiFi integrada funciona.  La suspensi&oacute;n funciona.
	Las teclas especiales (volumen de sonido, intensidad de luz,
	...) se manejan mediante el <em>hardware</em> y tambi&eacute;n
	funcionan.  El grabador de CD funciona.
	</p>

	<p>
	En OpenBSD 3.1 no reconoce IDE DMA, ya que el <em>chipset</em>
	es una nueva revisi&oacute;n del Intel 82801.  Esto se ha
	solucionado antes de que tuviera el port&aacute;til.  Ni
	siquiera he intentado hacer funcionar el m&oacute;dem ni el
	puerto de infrarrojos.
	</p>
	Contacte con <a href="mailto:espie@openbsd.org">Marc Espie</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad T21
    </td><td>
	<p>
	Desde OpenBSD 2.8, todo funcion bien.
	</p>

	<p>
	A continuaci&oacute;n puede ver la salida de la orden fdisk; la
	forma m&aacute;s f&aacute;cil de instalar es cambiar el
	tama&ntilde;o de la partici&oacute;n de Windows (yo uso
	PartitionMagic) y moverla al final del disco, y entonces crear
	una partici&oacute;n de OpenBSD (ignorando el cambio de
	tama&ntilde;o hecho por fdisk... contin&uacute;e y cree todos
	los sistemas de archivos que necesite con disklabel).
	</p>

<pre>
         Starting        Ending
 #: id  cyl  hd sec -   cyl  hd sec [     start -       size]
-------------------------------------------------------------------------
 0: 1C 1023   1   1 -  1023 239  63 [  42003423 -   20502657] &lt;Unknown ID&gt;
*1: A6    0   1   1 -  1021 239  63 [        63 -   15452577] OpenBSD     
 2: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
 3: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
</pre>

        <p>
	Para que pueda ver los puertos de serie e infrarojos (ambos como
	dispositivos com*), tendr&aacute; que modificar las asignaciones
	de IRQ en su BIOS;  config&uacute;relos con los valores
	predefinidos que encuentre en el fichero de configuraci&oacute;n
	del n&uacute;cleo <em>GENERIC</em>.  Lo mismo para el puerto
	paralelo (OpenBSD puede ver lpt2).  Es probable que tenga que
	modificar las asignaciones desde Windows para que esto funcione
	bien.
	</p>

	<p>
	Como m&iacute;nimo hay dos tarjetas miniPCI disponibles:  una de
	ellas es un WinModem (sin soporte), y la otra es una tarjeta
	combinada de ethernet y modem.  La ethernet funciona bien (la
	detecta como una tarjeta fxp/inphy);  el modem da la
	impresi&oacute;n de ser uno real, pero todav&iacute;a no hay
	soporte.
	</p>

	<p>
	El sonido (CS4614) funciona bien.  Para evitar cuelgues del
	sistema cuando use Cardbus y audio a la vez, *es probable* que
	tenga que configurar desde la BIOS un m&iacute;nimo de dos IRQs
	para que sean usadas por los dispositivos PCI;  yo uso el 9 y el
	11.  Tambi&eacute;n ser&aacute; necesario que desactive el PCI
	Power Management desde el men&uacute; de configuraci&oacute;n de
	Power de la BIOS (es el &uacute;nico men&uacute; en el que las
	opciones no se ven completas en la pantalla, as&iacute; que
	aseg&uacute;rese de mirar al final del todo.
	</p>

	<p>
	APM funciona, excepto la hibernaci&oacute;n (falta el soporte en
	el sistema operativo).  Para que funcione ´halt -p´, debe
	configurar la variable de sysctl, machdep.apmhalt a 1
	(necesitar&aacute; OpenBSD 2.8-current de mediados de diciembre
	o posterior).  Para que APM funcione tendr&aacute; que
	a&ntilde;adir esta l&iacute;nea al fichero de
	configuraci&oacute;n del n&uacute;cleo:
	</p>

<pre>
option         APM_DISABLE_INTERRUPTS=0
</pre>

        <p>
	Aunque se supone que la tarjeta de v&iacute;deo deber&iacute;a
	funcionar con XFree86 3.3.6pl8, s&oacute;lo he podido hacer que
	funcione con XFree86 4.0.1 con unos parches que puede encontrar
	<a href="http://www.probo.com/timr/savagemx.html">aqu&iacute;</a>,
	(en este sitio tambi&eacute;n puede encontrar los binarios del
	controlador para OpenBSD 2.8).  Necesita tener un n&uacute;cleo
	con la opci&oacute;n &quot;option INSECURE&quot; y configurar el
	nivel de seguridad a -1 en <em>/etc/rc.securelevel</em> (de este
	modo el servidor de X podr&aacute; abrir <em>/dev/mem</em>, y
	mmap() la BIOS).  Con esta configuraci&oacute;n puede usar
	1400x1050 a 16bpp (la versi&oacute;n 1.1.13 del controlador
	savage tambi&eacute;n funciona bien a 24bpp).
	</p>

	<p>
	<strong>ACTUALIZACI&Oacute;N:</strong>  Los parches que se
	mencionan arriba han sido incluidos en XFree86 4.0.2, y
	funcionan sin necesidad de cambios.  No necesita un
	n&uacute;cleo con la opci&oacute;n INSECURE activada,
	simplemente configure la variable de sysctl,
	machdep.allowaperture a 2 en /etc/sysctl.conf, si tiene OpenBSD
	2.8 (o posterior) compilado con el c&oacute;digo fuente
	actualizado posterior al 15 de diciembre de 2.000.
	</p>

	<p>
	Note que algunos modelos s&oacute;lo pueden usar resoluciones de
	1024x768.  Aqu&eacute;llos que puedan usar 1400x1050
	tambi&eacute;n podr&aacute;n usar 1600x1200 en pantalla virtual;
	yo no lo he probado personalmente.
	</p>

	<p>
	Si cierra la tapa del port&aacute;til, el sistema entra en modo
	de suspensi&oacute;n;  el resumen funciona bien en XFree 4.0 en
	lo que concierne a la pantalla (es probable que XFree86 3.3.6 no
	pueda aguantarlo;  el ThinkPad 770Z no pudo).
	</p>

	<p>
	Puede encontrar un fichero de configuraci&oacute;n para XFree86
	4.0 <a href="../xf86configs/thinkpadt21">aqu&iacute;</a>.
	</p>

	<p>
	<strong>ACTUALIZACI&Oacute;N</strong>: aparentemente, los T21
	m&aacute;s recientes tienen la ATI Rage 3D Mobility.
	<a href="../xf86configs/thinkpadt21-2">Aqu&iacute;</a> hay un
	ficheros XF86Config para XFree86 4.0 para esta
	configuraci&oacute;n.
	</p>

	<p>
	Cuando se extrae uno de los dispositivos UltraBay 2000, el
	sistema comienza a emitir pitidos.  El &uacute;nico modo de
	pararlo es mediante la suspensi&oacute;n, y a
	continuaci&oacute;n conectando un dispositivo en el UltraBay (no
	tiene porqu&eacute; ser el mismo).  El cambio en caliente
	(&quot;hot-swap&quot;) de los dispositivos UltraBay 2000 no
	tiene soporte en la actualidad en OpenBSD, por lo que
	s&oacute;lo es seguro cambiar en caliente las bater&iacute;as.
	</p>

	<p>
	Contacte con <a href="mailto:angelos@openbsd.org">Angelos
	Keromytis</a>.</p>
    </td>
</tr><tr>
    <td>
	IBM Thinkpad 760
    </td><td>
	XFree86 y APM no funcionan en OpenBSD 2.6.<p>

	Las versiones m&aacute;s actuales de XFree86 tienen soporte para
	X, y hay parches disponibles.<p>

	MWave modem/sound no funciona.<p>

	APM tambi&eacute;n se ha arreglado en las revisiones de 2.6, y
	se dispondr&aacute; de parches.<p>

	Contactar con <a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad T20
   </td><td>
       En OpenBSD 2.7 (y versiones posteriores) apm funciona
       pr&aacute;cticamente en su totalidad.  Para que funcione ´halt
       -p´, debe configurar la variable de sysctl, machdep.apmhalt a 1
       (necesitar&aacute; OpenBSD 2.8-current compilado con
       c&oacute;digo fuente de mediados de enero o posterior).  Al
       cerrar la tapa, el sistema pasa al modo de suspensi&oacute;n.
       Cuando se abre la tapa, el sistema se restablece bien.
       <p>

       El m&oacute;dem integrado en un `winmodem'... ign&oacute;relo.
       En realidad es una tarjeta `mini-pci', as&iacute; pues es
       probable que se pueda extraer.
       <p>

       El sonido funciona, pero es necesario desactivar el modo
       <i>sleep</i> PCI en la BIOS.
       <p>

       OpenBSD 2.8 incluye soporte para esta m&aacute;quina, pero a
       32bpp produce mucha nieve.  A 16bpp la imagen se ve bien.  El
       fichero de configuraci&oacute;n para OpenBSD 2.9 se encuentra
       <a href="../xf86configs/thinkpadt20">aqu&iacute;</a>
       <p>

       Para obtener informaci&oacute;n, vea
       <a href="http://www.snafu.org/t20/">http://www.snafu.org/t20/</a>.
       <p>

       Para m&aacute;s informaci&oacute;n contacte con
       <a href="mailto:marc@snafu.org">Marco S Hyman</a>.
    </td>
</tr><tr>
    <td>
	IBM Thinkpad T23
    </td><td>
	Verificado con OpenBSD 3.1-beta y posteriores.  Problemas con el
	disquete de arranque:  debe arrancar con -c y desactivar ahc o
	la m&aacute;quina se colgar&aacute; durante el arranque.  Esto
	no es un problema con el n&uacute;cleo GENERIC.<p>

	la mayor parte de apm funciona - suspensi&oacute;n OK, no
	hiberna (necesita soporte del sistema operativo).  Intentos de
	hibernaci&oacute;n s&oacute;lo dan como resultado un pitido del
	teclado.  El <em>chipset</em> de audio se supone que tiene
	soporte (auich).  Nota: hay 16 sonidos mudos y la mayoría de
	ellos activados.  La mejor funcionalidad: 802.11b y ethernet fxp
	integrados.  La funcionalidad sin cable usa PRISM 2.5
	ISL3874A(PCI), Firmware 1.0.7 (primario), 1.3.6
	(estaci&oacute;n).<p>

	X funciona (XF4).  Se puede encontrar un fichero de
	configuraci&oacute;n de XF4 para OpenBSD
	<a href="../xf86configs/thinkpadt23">aqu&iacute;</a>.  Todas las
	aplicaciones de X probadas hasta ahora funcionan.  <em>Ogle</em>
	(lector de DVD) no funciona a 24 bpp.  Funciona bien a 16
	bpp.<p>

	V&eacute;ase
	<a href="http://www.snafu.org/t23/">http://www.snafu.org/t23/</a>
	para m&aacute;s informaci&oacute;n.<p>

	Contacte con <a href="mailto:marc@snafu.org">Marco S Hyman</a>.
    </td>
</tr><tr>

    <td>
	NEC Versa 2000
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	Todo lo dem&aacute;s funciona.<p>

	Contactar con <a href="mailto:mickey@openbsd.org">Michael
	Shalayeff</a>.
    </td>
</tr><tr>
     <td>
	Siemens SCENIC Mobile 360
    </td><td>
	APM funciona a la perfecci&oacute;n.<p>

	El sonido funciona usando OSS.<p>

	Contactar con <a href="mailto:b1000@softhome.net">Dan
	Carlsson</a>.
    </td>
</tr><tr>
    <td>
       Sony VAIO F430
     </td><td>
       A partir de OpenBSD 2.6-Current (17/02/00)<p> APM: la
       suspensi&oacute;n &quot;<strong>zzz</strong>&quot; funciona, y
       también la suspensi&oacute;n por teclado.  &quot;<strong>halt
       -p</strong>&quot; y &quot;<strong>apm -S</strong>&quot; no
       funcionan (pero a&uacute;n tengo que buscar utilidades
       phdisk).<p>
       
       El dispositivo de DVD y la disquetera funcionan.  La tarjeta de
       Ethernet funciona despu&eacute;s de despertar con la que estoy
       usando (3Com 3c589).<p>
       
       Contacte con <a href="mailto:beck@openbsd.org">Bob Beck</a>.
     </td>
 </tr><tr>
     <td>
	Sony VAIO z505r
    </td><td>
	Soporte APM: &quot;<strong>zzz</strong>&quot;, la
	suspensi&oacute;n por medio del teclado, la hibernaci&oacute;n
	por medio del teclado, y &quot;<strong>halt -p</strong>&quot;
	funcionan bien.  &quot;<strong>apm -S</strong>&quot; funciona
	inmediatamente.  El estado de hibernaci&oacute;n usa un bloque
	del final del disco, aproximadamente entre 3 y 5 MB m&aacute;s
	grande que la memoria de la m&aacute;quina.  Para repararlo use
	&quot;<strong>phdisk.exe /create /partition</strong>&quot;, y
	configure la partici&oacute;n.  El programa phdisk se encuentra
	disponible en la imagen del disco de arranque que se encuentra
	en el primer CD de recuperaci&oacute;n.<p>

	La ethernet integrada funciona bien, pero en alguna
	ocasi&oacute;n tiene que ser reiniciada despu&eacute;s del
	estado de suspensi&oacute;n con &quot;<strong>ifconfig fxp0
	down; ifconfig fxp0 up</strong>&quot;.<p>

	Despu&eacute;s de una suspensi&oacute;n el reloj de
	perfilaci&oacute;n no funciona.  Se est&aacute;n creando unos
	parches.<p>

	Hay soporte para sonido usando el controlador del dispositivo
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=neo&amp;sektion=4">neo(4)</a>.
	A veces, al arrancar, se cuelga cuando intenta determinar el
	tipo del mezclador AC97.<p>

	Cuando el z&oacute;calo de la pastilla de la memoria est&aacute;
	vac&iacute;o puede causar errores que producen un desbordamiento
	en la antememoria de dmesg, y confundir as&iacute; al programa
	de instalaci&oacute;n de OpenBSD.  El programa de
	configuraci&oacute;n de la BIOS, al que se accede pulsando F2,
	tiene una opci&oacute;n para desactivar la pastilla de la
	memoria.<p>

	Se puede encontrar un fichero para su uso con XFree86 3.3.x 
	<a href="../xf86configs/vaioz505r">aqu&iacute;</a>.<p>

	Contactar con <a href="mailto:deraadt@openbsd.org">Theo de
	Raadt</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Satellite 320CDS
    </td><td>
    	<p>
	Un viejo modelo.  Se recomienda mantener Windows (por lo menos
	el m&iacute;nimo indispensable) debido a que la
	configuraci&oacute;n de la BIOS se hace por <em>software</em>,
	mediante el programa <code>TSETUP</code>.
	</p>

	<p>
	X funciona bien en 800x600, 16 bits.
	</p>

	<p>
	El <em>chip</em> de sonido se puede manejar como un
	cl&oacute;nico del <em>windows sound system</em> (wss).  Esto
	permite desactivar el reconocimiento de cl&oacute;nicos de
	soundblaster.  La configuraci&oacute;n de la BIOS tambi&eacute;n
	se puede hacer para canales separados para juegos y grabaciones.
	No he intentado grabar.
	</p>

	<p>
	Las tarjetas PCMCIA funcionan.  Los modelos Cardbus
	tambi&eacute;n funcionan, siempre que en la BIOS est&eacute;
	activado el modo cardbus, y no el de auto-detecci&oacute;n.
	</p>
	Contacte con <a href="mailto:espie@openbsd.org">Marc Espie</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO z505s
    </td><td>
	Parecido a VAIO z505r excepto en que el dispositivo de disquetes
	USB que incluye, tiene algunos problemas.<p>

	Contactar con <a href="mailto:provos@openbsd.org">Niels
	Provos</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO 747</td>
    <td>
	XFree86 y APM funcionan desde OpenBSD 2.6.<p>

	Este modelo incluye una tarjeta de modem PCMCIA (COM One MCC220
	Platinum Card) que funciona sin problemas.<p>

	Funciona el sonido (s&oacute;lo 8 bits).<p>

	APM se comporta de un modo similar al de VAIO z505r, con la
	diferencia de que la hibernaci&oacute;n no ha sido probada.<p>

	USB no funciona.<p>

	Se puede encontrar un fichero de configuraci&oacute;n XF86Config
	<a href="../xf86configs/vaio747">aqu&iacute;</a>.<p>

	Contactar con <a href="mailto:markus@openbsd.org">Markus
	Friedl</a>.
    </td>
</tr><tr>
    <td>
	Sony VAIO PCG 505-FX
    </td><td>
	No existe informaci&oacute;n.
    </td>
</tr>
<tr>
	<td>Sony VAIO PCG XG700K</td>
	<td>
	<p>OpenBSD 2.9 funciona, pero existen algunos problemas con
	disklabel/fdisk, parecidos a los que existen para Thinkpad T21.

	<p>Requiere <code>sysctl machdep.apmhalt=1</code> para apagar.

	<p>apm -z s&oacute;lo deja el sistema durmiendo (tal vez se
	pueda corregir con phdisk); apm -s no hace nada.

	<p>XFree86 con el controlador S3 savage funciona bien con
	resoluci&oacute;n 1024x768.  La resoluci&oacute;n 1200x1024
	deber&iacute;a funcionar, pero no lo he verificado.  Mi fichero
	de configuraci&oacute;n para XFree86 4.0, <em>XF86Config</em> se
	puede encontrar
        <a href="../xf86configs/vaioxg700k">aqu&iacute;</a>.

	<p>El sonido y USB funcionan perfectamente.

	<p>Todas las ranuras de cardbus se configuran al montarlas (dos
	de ellas sin montarlas).  Algunas veces se bloquea al extraer mi
	tarjeta NE de baja calidad.

	<p>El m&oacute;dem interno WinModem no tiene soporte, ni tampoco
	hay soporte todav&iacute;a para Firewire ni el &quot;Jog
	Dialer&quot;.

	<p>Contacte con Ian Darwin.
	</td>
</tr><tr>
       <td>Sony VAIO PCG-SRX77</td>
       <td>
       <p>
	   OpenBSD 3.3 funciona, pero hay algunos problemas.
       <ul>
       <li>XFree86 funciona, uso la siguiente
       <a href="../xf86configs/sonysrx77">XF86Config</a>.
       <li>Audio funciona usando el controlador
       <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=auich&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">auich(4)</a>.
       <li>La ethernet integrada funciona usando el controlador
       <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fxp&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">fxp(4)</a>.
       <li>El cardbus y la wireless integrada <strong>no</strong>
	   funcionan sin un
       <a href="ftp://ftp.courtesan.com/pub/millert/OpenBSD/srx77/cardbus.diff">hack nada elegante</a>.
	   <li>USB y el puerto de la pastilla de memoria funcionan.
	   <li>Firewire no ha sido probado.
	   <li>No hay soporte para el dial jog.
	   <li>El mode integrado no funciona.
	   <li>APM no funciona;  el port&aacute;til entra en modo sleep pero
	   no despierta.
       <li>&quot;halt -p&quot; para el sistema.
       </ul>

	   Contactar con <a href="mailto:millert@openbsd.org">Todd
	   Miller</a>.
       </td>
</tr>
<tr>
    <td>
	Toshiba Libretto 50CT
    </td><td>
	APM funciona pero debe tener cuidado y no hacer uso de los
	&uacute;ltimos 32MB del disco ya que en &eacute;stos es donde la
	BIOS vuelca la imagen de hibernaci&oacute;n de largo temporada.
	Puede mirar la geometr&iacute;a de la BIOS en la etiqueta del
	disco duro para saber con exactitud cu&aacute;ntos sectores
	requiere.  Si no lleva esto a cabo, le corromper&aacute;
	oacute;n en el sistema de archivos durante el periodo de
	suspensi&oacute;n.
	
	<p>
	libretto usa un &uacute;nico IRQ para
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">sb(4)</a> y
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wss&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">wss(4)</a>,
	por lo que lo mejor que puede hacer es escoger uno y desactivar
	el otro en el n&uacute;cleo del sistema.  El dispositivo externo
	de disquete no tiene soporte en OpenBSD en la actualidad, pero
	se puede usar durante el proceso de instalaci&oacute;n.
	
	<p>
	La instalaci&oacute;n con una sola ranura pcmcia puede ser un
	poco complicada.  La mejor manera para llevarla a cabo es hacer
	una instalaci&oacute;n en red.  Para ello, cargue el disquete de
	arranque y desde el &laquo;punto de pedido&raquo;
	(&quot;prompt&quot;) de arranque, introduzca la orden <em>boot
	-c</em>.  En cuanto vea el punto de pedido <em>UKC</em>,
	desenchufe el dispositivo de disquete, conecte la tarjeta de
	red, y escriba exit.  El n&uacute;cleo del sistema
	realizar&aacute; una prueba sobre la tarjeta de red y a partir
	de ah&iacute; deber&iacute;a poder realizar una
	instalaci&oacute;n por red.  Es posible que sea necesario
	desactivar los dispositivos de sonido desde la BIOS para que el
	disquete de arranque lleve a cabo una correcta detecci&oacute;n
	de la tarjeta de red.<p>

	Hay ficheros XF86Config de muestra para
	<a href="../xf86configs/libretto50ct">XFree86 4.X</a> y
	<a href="../xf86configs/libretto50ct-xf3">XFree86 3.3.X</a>.
	<p>
	N&oacute;tese que el controlador de transistores no funcionaba
	en XFree86 4.1 (se ha reparado en XFree86 4.2), y por lo tanto
	la versi&oacute;n de XFree86 que viene con OpenBSD 3.0 no
	funciona en libretto.  He compilado el controlador para XFree86
	4.01 (que s&iacute; funciona).  Lo puede obtener en
        <a href="ftp://ftp.courtesan.com/pub/todd/OpenBSD/chips_drv.o">
	chips_drv.o</a> y copiarlo a
        <pre>
	    /usr/X11R6/lib/modules/drivers/chips_drv.o
	</pre>
	Con esto, XFree86 4.1 funcionar&aacute; en los 50CT y 70CT.
	<p>
	Contactar con <a href="mailto:millert@openbsd.org">Todd
	Miller</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Libretto 100CT
    </td><td>
	La mayor parte de la informaci&oacute;n en la lista para Libreto
	50CT tambien es v&aacute;lida para el 100CT.<p>

	X11 funciona en modo 800x400.  Hay ficheros XF86Config de
	muestra para <a href="../xf86configs/libretto100ct">XFree86
	4.X</a> y <a href="../xf86configs/libretto100ct-xf3">XFree86
	3.3.X</a>.

	Contactar con <a href="mailto:millert@openbsd.org">Todd
	Miller</a>.
    </td>
</tr><tr>
    <td>
	Toshiba Portege 2000
    </td><td>
	wavelan y ethernet 10/100 (fxp) integradas funcionan.<p>
	No hay soporte para audio.<p>
	APM funciona (&quot;<strong>zzz</strong>&quot;), y
	tambi&eacute;n &quot;<strong>halt -p</strong>&quot;.  Sin
	embargo, la informaci&oacute;n sobre la carga de bater&iacute;
	restante es incorrecta;  informa siempre que el port&aacute;til
	est&aacute; conectado a A/C.<p>
	USB se reconoce, pero no ha sido comprobado.<p>
	El CD-ROM pcmcia no funciona todav&iacute;a.<p>
	XFree86 4.2 y posteriores funciona.  Hay un fichero de muestra
	de <a href="../xf86configs/portege2000">XF86Config</a>
	disponible.  Sin embargo, el tipo de repetici&oacute;n del
	teclado va demasiado r&aacute;pido.
    </td>
</tr><tr>
    <td>
	Toshiba Portege 660CDT
    </td><td>
	APM no funciona en absoluto.<p>

	El <i>hardware</i> de sonido mixto
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">sb(4)</a> y
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wss&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">wss(4)</a>
	puede causar algunos da&ntilde;os.  Las versiones actuales de la
	BIOS flash son peores, ya que son m&aacute;s inflexibles con las
	interrupciones que permiten.<p>

	Contactar con <a href="mailto:deraadt@openbsd.org">Theo de
	Raadt</a>.
    </td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CS
	</td><td>
	APM no funciona;  sin embargo, <b>halt -p</b> s&iacute; que
	funciona.<p>
	
	El sonido funciona por definici&oacute;n con el n&uacute;cleo
	GENERIC, pero los altavoces no valen la pena.  X tambi&eacute;n
	funciona bien.<p>

	Contactar con <a href="mailto:ericj@monkey.org">Eric
	Jackson</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 500CDT
	</td><td>
	APM no funciona en absoluto (y puede da&ntilde;ar su disco).<p>

	XFree86 s&iacute; funciona (800x600 16bpp).<p>

	El sonido funciona (21739 Hz, medio d&uacute;plex
	est&eacute;reo).<p>

        <!-- Serial IR is said to work, needs verification. -->

	Contacte con <a href="mailto:d@openbsd.org">David Leonard</a>.
	</td>
</tr><tr>
	<td>
	   Toshiba Tecra 550CDT
	</td><td>
	La suspensi&oacute;n profunda (<b>zzz</b>) funciona, pero
	<b>-S</b> lo reactiva de inmediato.<p>

	XFree86 funciona de maravilla.<p>

	El sonido funciona despu&eacute;s de algunos cambios de IRQs en
	la BIOS.<p>

	USB funciona;  al menos yo, he enchufado una c&aacute;mara
	digital y el dispositivo
	<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ugen&amp;sektion=4">ugen(4)</a>
	la detect&oacute; y la configur&oacute;.<p>

	El modem integrado no funciona ya que requiere de un
	<i>software</i> s&oacute;lo disponible para Windows;  o sea, no
	implementa un puerto de comunicaciones RS232
	aut&eacute;ntico.<p>

	pcic no funciona en esta m&aacute;quina, as&iacute; que no puedo
	hacer ning&uacute;n comentario preciso sobre PCMCIA
	attact/detach.<p>

	Contactar con <a href="mailto:aaron@openbsd.org">Aaron
	Campbell</a>.
    </td></tr>
</table>

<hr>
<a href="i386.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: i386-laptop.html,v 1.79 2003/05/17 04:52:36 millert Exp ]<br>
$Translation: i386-laptop.html,v 1.37 2003/05/18 20:35:17 horacio Exp $<br>
$OpenBSD: i386-laptop.html,v 1.38 2003/05/19 19:13:43 jufi Exp $
</small>

</body>
</html>
