<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/mac68k</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de OpenBSD/mac68k">
<meta name="keywords" content="openbsd,mac68k">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<h2>OpenBSD/mac68k</h2>

<hr>

<p>
OpenBSD/mac68k funciona en muchas de las m&aacute;quinas de Macintosh
basadas en los procesadores 680x0 de Motorola.  Para ello requiere de un
procesador Motorola 68020, 68030, &oacute; 68040.  Si tiene un 68020,
tambi&eacute;n necesitar&aacute; un PMMU Motorola 68851 (&eacute;ste es
diferente del 68881, que es un FPU).  Aunque el sistema es bastante
funcional y de utilidad (se utiliza con frecuencia como servidor de
Internet y como enrutador), todav&iacute;a queda mucho trabajo por
hacer.  &iexcl;&Uacute;nase y forme parte de la acci&oacute;n!
</p>

<h3><font color="#0000e0"><strong>Cronolog&iacute;a y estado
actual:</strong></font></h3>

<p>
El porte para mac68k de OpenBSD proviene de NetBSD/mac68k, y existe
soporte para la mayor&iacute;a de equipos y componentes para los que
existe soporte en el porte de NetBSD.  Esto no quiere decir que el de
OpenBSD sea el mismo porte que el de NetBSD.  Nada m&aacute;s lejos.  El
n&uacute;cleo del sistema representa tan s&oacute;lo a una
peque&ntilde;a parte del sistema completo.
</p>

<p>
<h3><font color="#0000e0"><em>Hardware</em> con soporte:</font></h3>

<p>
OpenBSD/mac68k ya funciona en la mayor&iacute;a de Macintosh 680x0 en
general.  En particular, deber&iacute;a funcionar en:
<ul>
  <li>68020 con PMMU 68851 y FPU 68881
  <li>68030 con FPU 68882 (es el que tienen la mayor&iacute;a de los
  Mac)
  <li>68040 (excluyendo el 68LC040)
</ul>
</p>

<p> 
Los siguientes modelos de Macintosh disponen de soporte
&laquo;completo&raquo;.  Esto significa que, como m&iacute;nimo, el
controlador SCSI, el ADB (teclado y rat&oacute;n), y alg&uacute;n tipo
de monitores funcionar&aacute;n en estos modelos.  Algunas de estas
m&aacute;quinas requieren de la instalaci&oacute;n de un PMMU y/o un FPU
si no vienen ya preinstalados con la m&aacute;quina.
<ul>
  <li>Mac II, Mac IIx, Mac IIcx, Mac IIci, Mac SE/30,
  <li>Mac IIsi, Mac IIvx, Mac IIvi, Performa 600, Centris 650,
  <li>Color Classic, Classic II, LC520, LC550, Performa 4xx, LCII,
  <li>LCIII, MacTV, Quadra 610, Quadra 700, Quadra 650, Quadra 800,
  <li>Quadra 840AV, algunas de la serie Duo,
  <li>Powerbook 180 y 180c, PB140, PB145, PB145B, PB160, PB170, PB165,
  <li>PB165c.
</ul>
</p>

<p>Dispositivos con soporte en todos los sistemas anteriores:
<ul>
  <li>Bus SCSI interno y la mayor&iacute;a de dispositivos de
  almacenamiento, discos duros, y CD-ROM SCSI.
  <li>Sonido interno.
  <li>La mayor&iacute;a de tarjetas de v&iacute;deo NuBus (algunas
  tarjetas con color de 24 bits han dado algunos problemas).
  <li>Ambos puertos serie internos.
  <li>Teclados y ratones ADB.
  <li>Tarjetas ethernet basadas en National Semiconductor 8390 (Asante,
  Apple, y unas pocas m&aacute;s).
  <li>Algunas tarjetas ethernet basadas en el chip SONIC, incluidas las
  Ethernet internas de muchos de las series no AV de Quadra/Centris de
  Apple y los PowerBook de la serie 500.
</ul>

<p>
Algunos sistemas arrancan y se pueden usar desde un terminal externo
(tty serie o SL/IP):
<ul>
<li>LC475, Performa 475, Quadra 605, Quadra 950
<li>probablemente otros
</ul>

<p>
Hay informes que indican que algunos sistemas casi tienen soporte:
<ul>
<li>LC/Performa575 (si 68LC040 reemplazado por un 68040).
<li>LC/Performa630 (si 68LC040 reemplazado con un 68040 y arrancando
desde un dispositivo SCSI externo).
<li>PowerBook 550c (pero a&uacute;n no hay soporte para el disco duro
SCSI interno).
</ul>

<p> 
No tienen soporte pero nos lo piden con frecuencia:
<ul>
<li>Macs PowerPC.  Algunos de &eacute;stos tienen soporte en el porte
<a href="macppc.html">OpenBSD/macppc</a>.
<li>M&aacute;quinas basadas en la tecnolog&iacute;a IOP de Apple,
incluida la Mac IIfx.
<li>M&aacute;quinas basadas en el procesador 68LC040.
Desafortunadamente, este procesador contiene un error importante sobre
el que se est&aacute; trabajando.  Sin embargo, m&aacute;quinas como la
Centris 605 no funcionan en este momento.
<li>Tarjetas ethernet LCPDS.
<li>Tarjetas ethernet Apple Communication Slot (CS).
<li>Ethernet MACE integrada en las series AV de Quadra/Centris.
</ul>
</p>

<p>
Se puede encontrar informaci&oacute;n actualizada y ayuda para la
instalaci&oacute;n en el documento 
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/3.1/mac68k/INSTALL.mac68k">
INSTALL.mac68k</a>, que se distribuye con la revisi&oacute;n m&aacute;s
reciente de OpenBSD.  Tambi&eacute;n se recomienda revisar la 
<a href="errata.html#mac68k">p&aacute;gina de errores y parches de
OpenBSD</a>, que contiene informaci&oacute;n de <em>vital
importancia</em> para la correcta instalaci&oacute;n del sistema desde
los CDROM.
</p>

<p>
Existe una lista de <a href="plus.html">cambios</a> en el sistema de
partes independientes de la plataforma.
</p>

<p>
Tambi&eacute;n existe una lista de correo dedicada a OpenBSD/mac68k en
<a href="mailto:mac68k@openbsd.org">mac68k@openbsd.org</a>.  Para darse
de alta en esta lista hay que enviar un mensaje con la orden <b>help</b>
en el contexto del mensaje a 
<a href="mailto:majordomo@openbsd.org">majordomo@openbsd.org</a>, y el
sistema de gesti&oacute;n de correo enviar&aacute; una respuesta con
todas las opciones de subscripci&oacute;n.
</p>

<p>
En las p&aacute;ginas que tratan sobre c&oacute;mo
<a href="ftp.html">conseguir OpenBSD por FTP</a> se puede encontrar informaci&oacute;n
sobre c&oacute;mo obtener la revisi&oacute;n m&aacute;s actualizada de
la versi&oacute;n de OpenBSD/mac68k.
</p>

<p>
En la actualidad no existe un mantenedor oficial para la plataforma
mac68k.
</p>

<hr>
<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: mac68k.html,v 1.40 2002/05/26 22:55:33 miod Exp ]<br>
$Translation: mac68k.html,v 1.17 2002/10/21 18:56:39 horacio Exp $<br>
$OpenBSD: mac68k.html,v 1.17 2002/10/21 21:26:10 jufi Exp $
</small>

</body>
</html>
