<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Listas de Correo de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="listas de correo de OpenBSD">
<meta name="keywords"      content="openbsd,correo">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1996-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<p>
<h1><font color="#e00000">Listas de Correo</font></h1>
<hr>

<p>
Las listas de correo son un medio importante de comunicaci&oacute;n
entre usuarios y desarrolladores de OpenBSD.  Las listas no est&aacute;n
moderadas, con la excepci&oacute;n de <b>announce</b> y de
<b>security-announce</b>.  Hemos restringido a prop&oacute;sito el
n&uacute;mero de listas de correo diferentes. Esto lo hemos hecho con el
prop&oacute;sito de reducir la cantidad de mensajes cruzados entre las
listas y para asegurarnos de que la informaci&oacute;n sea distribuida
entre una audiencia m&aacute;s amplia.

<p>
<em><strong>N. del T.:</strong> la lengua usada en las listas bajo el
dominio <strong>openbsd.org</strong> es el ingl&eacute;s.  Existen
listas de distribuci&oacute;n en <a href="#castellano">lengua castellana
(espa&ntilde;ol)</a> en los dominios <strong>openbsd.org.AR</strong> y
<strong>openbsd.org.MX</strong>.</em>

<p>
<a name="Netiquette"></a>
<h2><font color="#e00000">Normas de comportamiento</font></h2>

<p>
Ser considerado con el resto de suscriptores de las listas.

<dl>
<dt><b>Texto simple (no html), 72 car&aacute;cteres por l&iacute;nea</b>
<dd>Muchos suscriptores leen sus correo desde programas de correo de
l&iacute;nea de texto (mail(1), mutt, emacs, ...) y para ellos los
mensajes en formato de HTML o las l&iacute;neas que superan los 72
car&aacute;cteres son ilegibles.  La mayor&iacute;a de listas de
distribuci&oacute;n por correo de OpenBSD eliminan el contenido
<i>MIME</i> de los mensajes antes de enviarlos al resto de suscriptores.
Si se env&iacute;a un mensaje en un formato que no sea de texto simple
(<i>ASCII</i>), se cambiar&aacute; el formato del mensaje o, si no se
puede cambiar el mensaje, se rechazar&aacute; sin mediar palabra.  La
&uacute;nica lista que permite el env&iacute;o de adjuntos al mensaje es
la lista <b>ports</b>, pero en el resto de las listas ser&aacute;n
eliminados.

<dt><b>Hay que hacer &laquo;los deberes&raquo; antes de formular una
pregunta</b>
<dd>Si se tiene alguna pregunta sobre la instalaci&oacute;n, hay que
estar seguro de haber le&iacute;do antes la documentaci&oacute;n
relevante, como los ficheros de texto <em>INSTALL.*</em> que se
encuentran en los directorios de instalaci&oacute;n por FTP, las 
<a href="../faq/es/index.html">preguntas frecuentes (FAQ)</a>, y las
p&aacute;ginas del manual ('<em>man man</em>') relacionadas con la
pregunta (se recomienda empezar leyendo
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8">afterboot(8)</a>
y repasar los <a href="#Archives">archivos</a> de las listas.  Queremos
ayudar, pero no queremos privar a nadie de la valiosa experiencia que
supone aprender mediante la experimentaci&oacute;n, y nadie desea ver la
misma pregunta repetida una y otra vez en las listas.

<dt><b>Hay que incluir una descripci&oacute;n relevante en la
l&iacute;nea de ``Asunto:´´</b>
<dd>Los mensajes con una l&iacute;nea de ``Asunto´´ (<i>Subject</i>) en
blanco rebotar&aacute;n al gestor de la lista, por lo que
tardar&aacute;n m&aacute;s en aparecer.  Adem&aacute;s, de este modo se
asegurar&aacute; que su mensaje sea le&iacute;do por m&aacute;s gente.
Asimismo debe evitarse el uso excesivo de las may&uacute;sculas en las
l&iacute;neas del asunto.  &quot;Help!&quot; o &quot;I can't get it to
work!&quot; no son l&iacute;neas de asunto apropiadas.  No hay que
cambiar la l&iacute;nea de asunto cuando se sigue un mismo tema.

<dt><b>Recortar las firmas</b>
<dd>Las l&iacute;neas correspondientes a la firma personal deben ir al
final del mensaje, y deben limitarse a un n&uacute;mero razonable de
l&iacute;neas.  Los mensajes a las listas rara vez son lo
suficientemente cr&iacute;ticos como para requerir una firma digital, y
esas tarjetas de visita autom&aacute;ticas son simplemente una molestia
innecesaria.  Los descargos y avisos de tipo legal son muy molestos, y
no son apropiados para una lista p&uacute;blica.

<dt><b>No salirse del contexto</b>
<dd>Se debe mantener el asunto del mensaje relevante para los usuarios
de OpenBSD.

<dt><b>Incluir informaci&oacute;n relevante</b>
<dd>Una pregunta incompleta es una p&eacute;rdida de tiempo.  Es mejor
incluir m&aacute;s informaci&oacute;n de la necesaria que quedarse corto
con los detalles.  Cualquier duda que se plantee deber&iacute;a incluir,
como m&iacute;nimo, la
<a href="../faq/es/faq5.html#Flavors">versi&oacute;n</a> de OpenBSD (o
sea, &quot;3.2-stable&quot;, &quot;3.3-current as of July 20,
2003&quot;).  Cualquier problema relacionado con <i>hardware</i>
deber&iacute;a mencionar adem&aacute;s la plataforma (sparc, alpha,
etc.) y una salida completa de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>.
Desafortunadamente, los n&uacute;meros del modelo del componente no
dicen mucho sobre &eacute;ste, y son in&uacute;tiles para alguien que no
est&eacute; sentado delante de la misma m&aacute;quina para poder
reconocerla.  La salida de dmesg(8) indica con precisi&oacute;n lo que
hay DENTRO de la m&aacute;quina, y no lo que dicen las etiquetas.

<dt><b>Respetar las diferencias de opini&oacute;n</b>
<dd>Dos personas pueden mirar a unos mismos hechos y llegar a
conclusiones muy distintas.  Insistir sobre los mismos puntos que no
convencieron a alguien anteriormente no suele cambiar su opini&oacute;n,
y es irritable para el resto de los lectores.

<dt><b>No enviar mensajes cruzados ni repetirlos</b>
<dd>El env&iacute;o de un mismo mensaje a varias listas, o enviarlo
varias veces a la misma, no aumenta la probabilidad de obtener una
respuesta adecuada, y s&iacute; es probable que acabe irritando a
aquellas personas que quieran ayudarnos.  Si no se ha obtenido una
respuesta satisfactoria la primera vez, suele ser por que la
informaci&oacute;n que se ha enviado no es suficiente o lo bastante
clara.

</dl>

<p>
<a name="spam"></a>
<h2><font color="#e00000">Correo no solictado
(<i>&quot;spam&quot;</i>)</font></h2>

<p>
Las listas de OpenBSD usan
<a href="http://www.spamassassin.org">SpamAssassin</a> para controlar el
volumen de correo no solicitado, pero a veces se cuelan algunos.
Adem&aacute;s, el servidor de listas tambi&eacute;n usa reglas basadas
en expresiones regulares para rechazar algunos env&iacute;os no
solicitados comunes.  Si alguien recibe este tipo de correo a
trav&eacute;s de una de las listas de correo de OpenBSD, puede
reenviarlo a <a href="http://spamcop.net">spamcop</a>.  Por regla
general, no se debe enviar una copia al propietario de la lista (lo
m&aacute;s probable es que &eacute;l ya lo haya visto).  Por favor,
quejarse en la lista a causa del correo no solicitado o enviar
comentarios al respecto es contraproducente, ya que s&oacute;lo sirve
para generar m&aacute;s tr&aacute;fico.

<p>
<a name="Lists"></a>
<h2><font color="#e00000">Las listas de correo</font></h2>

<h3>Listas de inter&eacute;s general</h3>
<p>
Las siguientes listas son de inter&eacute;s para la mayor&iacute;a de
usuarios de OpenBSD.

<dl>
<dt><b>misc</b>
<dd>Preguntas y respuestas de los usuarios, dudas gen&eacute;ricas.
&Eacute;sta es la lista m&aacute;s activa.  Por favor,
<a href="../faq/es/index.html">lee las preguntas frecuentes</a> y los
documentos de instalaci&oacute;n, y antes de enviar una pregunta mira
<a href="report.html">c&oacute;mo informar sobre un problema</a>.

<dt><b>advocacy</b>
<dd>Promoci&oacute;n del uso de OpenBSD.  Las discusiones de
car&aacute;cter no t&eacute;cnico se suelen enviar aqu&iacute;.

<dt><b>announce</b>
<dd>Anuncios importantes.  Esta lista de bajo volumen es excelente para
los que s&oacute;lo quieran recibir noticias importantes sobre el
proyecto.

<dt><b>security-announce</b>
<dd>Anuncios de seguridad.  Esta lista tiene poco tr&aacute;fico y en
ella se reciben los avisos de seguridad de OpenBSD y las direcciones en
las que se pueden encontrar los parches de seguridad tan pronto como
est&eacute;n disponibles.

<dt><b>ports</b>
<dd>Discusiones sobre el uso de los portes y contribuciones al
&aacute;rbol de portes.

<dt><b>www</b>
<dd>Discusiones sobre el sitio <i>web</i> de OpenBSD.
</dl>

<h3>Listas de desarrolladores</h3>

<p>
Estas listas son para discusiones de car&aacute;cter t&eacute;cnico
sobre los aspectos de OpenBSD.  NO son para usuarios noveles, ni para
informar sobre problemas (a menos que se incluya una buena
soluci&oacute;n), ni para problemas de instalaci&oacute;n.  Ante la duda
sobre si se debe enviar un mensaje a estas listas, es casi seguro que no
se debe enviar.  En este caso es mejor enviarlo a <b>misc</b>.

<dl>
<dt><b>bugs</b>
<dd><a href="report.html">Informes sobre errores</a> enviados a
trav&eacute;s de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a>
y discusiones sobre &eacute;stos.  Si alguien quiere que su respuesta se
registre en el sitema de seguimiento de errores de
<a href="query-pr.html">GNATS</a>, debe enviarla a
<i>gnats@openbsd.org</i>, y <i>gnats@</i> se encargar&aacute; de
reenviarla a <i>bugs@</i>.

<dt><b>ipv6</b>
<dd>Discusiones sobre IPv6 y IPsec en OpenBSD.

<dt><b>ports-bugs</b>
<dd>Discusiones sobre errores en el &aacute;rbol de portes de OpenBSD.

<dt><b>smp</b>
<dd>Desarrollo del soporte para
<a href="../faq/es/faq8.html#SMP">multiprocesadores</a> en OpenBSD.  En
este momento todav&iacute;a no son necesarios voluntarios para probar el
c&oacute;digo, y s&iacute; lo es el env&iacute;o de c&oacute;digo.

<dt><b>tech</b>
<dd>Discusiones t&eacute;cnicas entre desarrolladores de OpenBSD y
usuarios avanzados.  &Eacute;ste <b>no</b> es un foro de soporte
t&eacute;cnico.

<dt><b>x11</b>
<dd>Discusiones sobre el desarrollo de X11 en OpenBSD.
</dl>

<h3>Listas espec&iacute;ficas de plataformas</h3>

<p>
Estas listas se centran en problemas de los usuarios y en el desarrollo
sobre plataformas individuales.

<dl>
<dt><b>alpha</b>
<dd>Porte de OpenBSD/alpha.

<dt><b>hppa</b>
<dd>Porte de OpenBSD/hppa.

<dt><b>mac68k</b>
<dd>Porte de OpenBSD/mac68k (no es para sistemas PowerPC de Macintosh).

<dt><b>ppc</b>
<dd>Porte de OpenBSD/macppc y otros intentos de portar OpenBSD a
plataformas PowerPC.

<dt><b>sparc</b>
<dd>Portes de OpenBSD/sparc y OpenBSD/sparc64.

<dt><b>vax</b>
<dd>Porte de OpenBSD/vax.
</dl>

<h3>Listas de cambios en CVS</h3>

<p>
Cada vez que un desarrollador env&iacute;a un cambio al
<a href="why-cvs.html">&aacute;rbol de CVS</a> de OpenBSD, se
env&iacute;a un mensaje a los suscriptores con los comentarios sobre el
cambio.

<dl>
<dt><b>source-changes</b>
<dd>Lista automatizada sobre cambios en el &aacute;rbol de fuentes de
CVS en todos los repositorios excepto el de <i>ports</i>.

<dt><b>ports-changes</b>
<dd>Lista automatizada sobre cambios en el &aacute;rbol de portes de
CVS.
</dl>

<h3>Listas de CTM</h3>
<p>
Existen varias listas que se usan para <a href="ctm.html">CTM</a>, un
sistema de distribuci&oacute;n de los cambios en el c&oacute;digo
fuente.  V&eacute;ase la <a href="ctm.html">p&aacute;gina de CTM</a>
para m&aacute;s detalles.


<a name="Majordomo"></a>
<h2><font color="#e00000">Majordomo, el gestor de suscripci&oacute;n a
las listas de correo</font></h2>

<p>
Si se desea recibir un listado completo con todas las listas de correo
disponibles desde openbsd.org, basta con enviar la orden
&quot;<tt>lists</tt>&quot; en el contexto del mensaje a la
direcci&oacute;n
<a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a>.

<p>
Para suscribirse a una lista, hay que enviar un mensaje a
<a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> con la
l&iacute;nea &quot;<b>subscribe mailing-list-name</b>&quot; en el
contexto.

<p>
Para obtener m&aacute;s ayuda hay que enviar un mensaje con la palabra
<b>help</b> en el contexto a 
<a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> y se
recibir&aacute; un mensaje de respuesta con todas las opciones para la
utilizaci&oacute;n de la lista.  &iexcl;El dominio <b>DEBE</b> estar
correctamente resuelto, o el correo no llegar&aacute;!

<a name="Web"></a>
<h2><font color="#e00000">Gesti&oacute;n de suscripciones a las lista a
trav&eacute;s de la <i>Web</i></font></h2>

<p>
Tambi&eacute;n se puede gestionar la suscripci&oacute;n a las listas de
OpenBSD a trav&eacute;s de una interfaz de <i>web</i> que se encuentra
en:
<blockquote>
<a href="http://lists.openbsd.org/">http://lists.openbsd.org/</a>
</blockquote>


<a name="Tricks"></a>
<h2><font color="#e00000">Opciones de las listas de correo</font></h2>

<p>
Existe una gran selecci&oacute;n de opciones para las listas de correo,
bien a trav&eacute;s de la <a href="http://lists.openbsd.org">interfaz
de <i>web</i></a>  o a trav&eacute;s de
<a href="mailto:majordomo@openbsd.org">Majordomo</a>.  Se puede cambiar
la direcci&oacute;n de suscripci&oacute;n sin tener que darse de baja y
volver a suscribirse, o se puede desactivar de forma temporal el
env&iacute;o de mensajes durante unos cuantos d&iacute;as mientras se
est&aacute; de vacaciones.  Para ver &eacute;stas y muchas otras
opciones hay que enviar un mensaje con la palabra
&quot;<tt>help</tt>&quot; en el contexto a
<a href="mailto:majordomo@openbsd.org">Majordomo</a>, o pulsando sobre
el enlace &quot;<tt>Help</tt>&quot; desde la
<a href="http://lists.openbsd.org">interfaz de <i>web</i></a>.

<p>
A modo de ejemplo, si nos fu&eacute;ramos de vacaciones durante dos
semanas y no quisi&eacute;ramos encontrarnos con miles de mensajes
almacenados a la vuelta, podr&iacute;amos desactivar el env&iacute;o de
mensajes a trav&eacute;s del servidor de correo durante ese periodo de
tiempo de catorce d&iacute;as, y que se reactivara
autom&aacute;ticamente a nuestra vuelta mediante la orden:
<pre>
     set all nomail-14d
</pre>
Mediante esta orden suspender&iacute;amos la suscripci&oacute;n a todas
las listas de correo durante 14 d&iacute;as (<tt>-14d</tt>).  Pueden
verse m&aacute;s detalles y opciones en la
<a href="http://lists.openbsd.org/cgi-bin/mj_wwwusr?&user=&passw=&list=GLOBAL&func=help&extra=overview">p&aacute;gina sobre Majordomo</a>.

<h3>Res&uacute;menes</h3>
<p>
Si se prefiere ver una versi&oacute;n resumida (una lista compactada de
todos los mensajes enviados en un periodo de tiempo), en lugar de ver
los mensajes individualmente y en tiempo real, se puede usar las
&oacute;rdenes:
<pre>
     set misc digest-daily
     set source-changes digest-weekly
</pre>
para un resumen diario de la lista <b>misc</b>, y un resumen semanal de
la lista <b>source-changes</b>.


<a name="OtherLists"></a>
<h2><font color="#e00000">Otras listas de correo</font></h2>
<p>
Los chicos de <a href="http://www.squish.net/openbsd/">squish.net</a>
gestionan listas de correo con res&uacute;menes diarios y semanales de
la lista <b>source-changes</b> y <b>ports-changes</b> de OpenBSD.  Muy
&uacute;til para quienes no quieran recibir el alto volumen producido
por esas listas.

<p>
Los listos primates de
<a href="http://www.monkey.org/openbsd-mobile/">monkey.org</a> mantienen
la lista <b>openbsd-mobile</b> para los usuarios de OpenBSD en
ordenadores port&aacute;tiles.  Para suscribirse:
<br> echo subscribe | mail openbsd-mobile-request@monkey.org 

<p>
El noct&aacute;mbulo de
<a href="http://www.benzedrine.cx/pf/">benzedrine.cx</a> mantiene la
lista de <b>pf</b> para los usuarios del paquete de filtros de OpenBSD.
Para suscribirse:<br>
echo subscribe | mail pf-request@benzedrine.cx

<p>
Hay una lista de distribuci&oacute;n para gestores de r&eacute;plicas de
FTP, HTTP, AnonCVS y CVSup de OpenBSD en
<a href="http://rt.fm/openbsd-mirrors/">rt.fm</a>.

<p>
<a name="castellano"></a>
<h2><font color="#e00000">Listas en castellano</font></h2>

<p>
<b>misc@openbsd.org.mx</b> es una lista de correo en <b>castellano</b>
relacionada con OpenBSD, y ubicada en M&eacute;xico.<br>
Para suscribirse hay que enviar un mensaje en blanco a
<a href="mailto:misc-subscribe@openbsd.org.mx">misc-subscribe@openbsd.org.mx</a>. 


<p>
<a name="nonEnglish"></a>
<h2><font color="#e00000">Listas en otras lenguas</font></h2>

<p>
Existen varias listas de correo relacionadas con OpenBSD que
est&aacute;n disponibles desde otros servidores.  Aqu&iacute; puede
verse un listado de las listas sobre las que nos han informado:

<p>
Alem&aacute;n:
<b>liste@openbsd.de</b>
<br>Para suscribirse, v&eacute;ase la URL en:
<a href="https://www.openbsd.de/listen/listinfo/liste">https://www.openbsd.de/listen/listinfo/liste</a>.

<p>
Checo:
<b>users@openbsd.cz</b>
<br>Informaci&oacute;n sobre la suscripci&oacute;n en:
<a href="http://openbsd.cz/mailman/listinfo/users/">http://openbsd.cz/mailman/listinfo/users/</a>.

<!-- 
<p>
Chino:
<b>openbsd@shellhung.org</b>
<br>Informaci&oacute;n sobre la suscripci&oacute;n en:
<a href="http://www.shellhung.org/mailman/listinfo/openbsd/">http://www.shellhung.org/mailman/listinfo/openbsd/</a>.
 -->

<p>
Esloveno:
para suscribirse, v&eacute;ase la URL en
<a href="http://obsd.17slon.org/mailinglist.php">http://obsd.17slon.org/mailinglist.php</a>

<p>
Franc&eacute;s
<b>openbsd-france-misc@openbsd-france.org</b>
<br>Para suscribirse, visitar la p&aacute;gina:
<a href="http://www.openbsd-france.org/mailing-list.php">http://www.openbsd-france.org/mailing-list.php</a>.

<p>
Griego:
<b>openbsd@bsd.gr</b>
<br>Para suscribirse, enviar un mensaje a
<a href="mailto:majordomo@bsd.gr">majordomo@bsd.gr</a>
con la orden &quot;<b>subscribe openbsd</b>&quot; en el contexto.

<p>
Italiano: <a href="http://www.sikurezza.org/">sikurezza.org</a> es un
portal de seguridad no comercial, en italiano, en el que se hospeda la
lista <b>openbsd@sikurezza.org</b>.
<br>Para suscribirse hay que enviar un mensaje en blanco a
<a href="mailto:openbsd-subscribe@sikurezza.org">openbsd-subscribe@sikurezza.org</a>.

<p>
Japon&eacute;s:
<br>Por favor, v&eacute;ase
<a href="http://www.openbsd.ics.nara-wu.ac.jp/wakakusa">http://www.openbsd.ics.nara-wu.ac.jp/wakakus</a>
para m&aacute;s informaci&oacute;n.

<p>
Polaco:
<br>Para suscribirse, enviar un mensaje a
<a href="mailto:OpenBSD-request@bsdzine.org">OpenBSD-request@bsdzine.org</a>.

<p>
Portugu&eacute;s:
<b>openbsd@neei.uevora.pt</b>
<br>Informaci&oacute;n sobre la suscripci&oacute;n en:
<a href="http://neei.uevora.pt/mailman/listinfo/openbsd/">http://neei.uevora.pt/mailman/listinfo/openbsd/</a>.

<p>
Ruso: 
<b>openbsd@openbsd.ru</b>
<br>Para suscribirse hay que enviar un mensaje a
<a href="mailto:minimalist@openbsd.ru">minimalist@openbsd.ru</a> con la
orden &quot;<b>subscribe openbsd</b>&quot; en la l&iacute;nea del
asunto.

<p>
<a name="Archives"></a>
<h2><font color="#e00000">Archivos de las Listas:</font></h2>

<p>
Estos archivos no los gestiona el proyecto OpenBSD.  Es aconsejable
probar m&aacute;s de uno, ya que son diferentes y tienen opciones
diferentes de b&uacute;squeda.  Si no se encuentra la respuesta en uno
de ellos, se puede encontrar en otro.

<p>
Los motores de b&uacute;squeda como
<a href="http://www.google.com">Google</a> tambi&eacute;n son muy
efectivos para encontrar respuesta a preguntas de OpenBSD.

<ul>
<li><a href="http://www.sigmasoft.com/~openbsd/">EE.UU.</a>
<!-- seemingly not working any longer
<li><a href="http://www.geocrawler.com/lists/4/OpenBSD">Geocrawler
Archive</a>
-->
<li><a href="http://www.monkey.org/openbsd/">The primates at
monkey.org</a>
<li><a href="http://marc.theaimsgroup.com/">MARC</a>
<li><a href="http://bsdsearch.com/eao/phorum/index.php?f=2">BSDSearch.com</a>
<li><a href="http://www.netsys.com/archives.html">@netsys.com</a>
<li>Neohapsis dispone de un
<a href="http://archives.neohapsis.com/archives/openbsd/">archivo mixto
para tech@, misc@ y ports@</a>, y de un
<a href="http://archives.neohapsis.com/archives/openbsd/cvs/">archivo
mixto para los mensajes de CVS</a>
</ul>

<hr>

<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: mail.html,v 1.73 ]<br>
$Translation: mail.html,v 1.36 2003/11/09 21:23:32 horacio Exp $<br>
$OpenBSD: mail.html,v 1.36 2003/11/10 00:05:32 horacio Exp $
</small>

</body>
</html>
