<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Listas de Correo de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="listas de correo de OpenBSD">
<meta name="keywords"      content="openbsd,correo">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 1996-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Listas de Correo</font></h2>
<hr>

<p>
Las listas de correo son un medio importante de comunicaci&oacute;n
entre usuarios y desarrolladores de OpenBSD.  Las listas no est&aacute;n
moderadas, con la excepci&oacute;n de <em>announce</em>.  Hemos
restringido a prop&oacute;sito el n&uacute;mero de listas de correo
diferentes, con el prop&oacute;sito de reducir la cantidad de mensajes
cruzados entre las listas y para asegurarnos de que la
informaci&oacute;n sea distribuida entre una audiencia m&aacute;s
amplia.

<p>
<em><strong>N. del T.:</strong> la lengua usada en las listas bajo el
dominio <strong>openbsd.org</strong> es el ingl&eacute;s.  Existen
listas de distribuci&oacute;n en <a href="#castellano">lengua castellana
(espa&ntilde;ol)</a> en los dominios <strong>openbsd.org.AR</strong> y
<strong>openbsd.org.MX</strong>.</em>

<p>
<h3><font color="#e00000">Normas de comportamiento</font></h3>

<p>
Ser considerado con el resto de suscriptores de las listas.

<dl>
<dt><u>Texto simple (no html), 72 car&aacute;cteres por l&iacute;nea</u>
<dd>Muchos suscriptores leen sus correo desde programas de correo de
l&iacute;nea de texto (mail(1), mutt, emacs, ...) y para ellos los
mensajes en formato de HTML o las l&iacute;neas que superan los 72
car&aacute;cteres son ilegibles.  La mayor&iacute;a de listas de
distribuci&oacute;n por correo de OpenBSD eliminan el contenido
<em>MIME</em> de los mensajes antes de enviarlos al resto de
suscriptores.  Si se env&iacute;a un mensaje en un formato que no sea de
texto simple (<em>ASCII</em>), se cambiar&aacute; el formato del mensaje
o, si no se puede cambiar el mensaje, se rechazar&aacute; sin mediar
palabra.  La &uacute;nica lista que permite el env&iacute;o de adjuntos
al mensaje es la lista <em>ports</em>, pero en el resto de las listas
ser&aacute;n eliminados.

<dt><u>Hay que hacer &laquo;los deberes&raquo; antes de formular una
pregunta</u>
<dd>Si se tiene alguna pregunta sobre la instalaci&oacute;n, hay que
estar seguro de haber le&iacute;do antes la documentaci&oacute;n
relevante, como los ficheros de texto <em>INSTALL.*</em> que se
encuentran en los directorios de instalaci&oacute;n por FTP, las 
<a href="../faq/es/index.html">preguntas frecuentes (FAQ)</a>, y las
p&aacute;ginas del manual ('<em>man man</em>') relacionadas con la
pregunta (se recomienda empezar leyendo
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8">afterboot(8)</a>).
Tambi&eacute;n hay que asegurarse de que se incluye detalles relevantes
(versi&oacute;n, equipo y componentes, 
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>)
que puedan ayudar a resolver el problema.  Queremos ayudar, pero no
querr&iacute;amos privar a nadie de la valiosa experiencia que supone
aprender mediante la propia experiencia.

<dt><u>Hay que incluir una descripci&oacute;n relevante en la
l&iacute;nea de ``Asunto:´´</u>
<dd>Los mensajes con una l&iacute;nea de ``Asunto´´ (<em>Subject</em>)
en blanco rebotar&aacute;n al gestor de la lista, por lo que
tardar&aacute;n m&aacute;s en aparecer.  Adem&aacute;s, de este modo se
asegurar&aacute; que su mensaje sea le&iacute;do por m&aacute;s gente.
Asimismo debe evitarse el uso excesivo de las may&uacute;sculas en las
l&iacute;neas del asunto.

<dt><u>Recortar las firmas</u>
<dd>Las l&iacute;neas correspondientes a la firma personal deben ir al
final del mensaje, y deben limitarse a un n&uacute;mero razonable de
l&iacute;neas.  A ser posible se recomienda el uso el delimitador de
firmas, dos guiones y un espacio (<strong>-- </strong>) precediendo a la
firma.  Los mensajes a las listas rara vez son lo suficientemente
cr&iacute;ticos como para requerir una firma digital, y esas tarjetas de
visita autom&aacute;ticas son simplemente una molestia innecesaria.

<dt><u>No salirse del contexto</u>
<dd>Se debe mantener el asunto del mensaje relevante para los usuarios
de OpenBSD.
</dl>

<p>
<h3><font color="#e00000">Correo no solictado
(<em>&quot;spam&quot;</em>)</font></h3>

<p>
El env&iacute;o de correo con contenido no relacionado con la
tem&aacute;tica de la lista est&aacute; terminantemente prohibido, pero
a veces se cuela.  Si alguien recibe este tipo de correo a trav&eacute;s
de una de las listas de correo de OpenBSD, puede reenviarlo a
<a href="http://spamcop.net">spamcop</a>.  Por regla general, no se debe
enviar una copia al propietario de la lista (lo m&aacute;s probable es
que &eacute;l ya lo haya visto).  Por favor, quejarse en la lista a
causa del correo no solicitado es contraproducente, ya que s&oacute;lo
sirve para generar m&aacute;s tr&aacute;fico.<br>
Las listas de correo de OpenBSD denegar&aacute;n el paso al correo
recibido desde cualquier anfitri&oacute;n que se ecuentre en las listas
negras de <a href="http://www.mail-abuse.org/dul/">MAPS Dialup</a> o
<a href="http://www.mail-abuse.org/rss/">MAPS RSS</a>.  Adem&aacute;s,
el servidor de la lista tambi&eacute;n tiene unas reglas de filtrado
basadas en expresiones regulares para algunos tipos de correo no
solicitado.

<p>
<h3><font color="#e00000">Las listas de correo</font></h3>

<p>
Para suscribirse a alguna lista de OpenBSD hay que enviar un mensaje a
<a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> y
escribir la orden <strong>subscribe [nombre-de-la-lista]</strong> en el
contexto del mensaje (no en la l&iacute;nea de asunto, subject:); Hay
que sustituir &quot;[nombre-de-la-lista]&quot; por uno de los
mencionados a continuaci&oacute;n.

<dl>
<dt><strong>announce</strong>
<dd>Anuncios importantes.  Esta lista tiene poco tr&aacute;fico y es
excelente para los usuarios que s&oacute;lo quieran recibir noticias
importantes sobre el proyecto.
<dt><strong>security-announce</strong>
<dd>Anuncios de seguridad.  Esta lista tiene poco tr&aacute;fico y en
ella se reciben los avisos de seguridad de OpenBSD y las direcciones en
las que se pueden encontrar los parches de seguridad tan pronto como
est&eacute;n disponibles.
<dt><strong>misc</strong>
<dd>Preguntas y respuestas de usuario, y dudas en general.  Esta lista
es la m&aacute;s activa.  Es necesario
<a href="../faq/es/index.html">leer las preguntas frecuentes (FAQ)</a> y
la documentaci&oacute;n sobre instalaci&oacute;n antes de enviar
cualquier pregunta.
<dt><strong>tech</strong>
<dd>T&oacute;picos t&eacute;cnicos para desarrolladores de OpenBSD y
usuarios avanzados.  <strong>Por favor,</strong> las preguntas de
&laquo;nuevo usuario&raquo; y las relacionadas con la instalaci&oacute;n
deben dirigirse a <em>misc</em>.  <strong>Pero NO</strong> se debe
enviar mensajes cruzados a <em>misc</em> y <em>tech</em>.
<dt><strong>bugs</strong>
<dd><a href="report.html">Informes sobre errores</a> que se deben enviar
por medio de la utilidad
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a>,
y discusiones relacionadas con &eacute;stos.
<dt><strong>source-changes</strong>
<dd>Env&iacute;o de mensajes automatizado sobre cambios en el
&aacute;rbol de fuentes del CVS.
<dt><strong>ports</strong>
<dd>Discusiones sobre el uso de los portes y contribuciones al
&aacute;rbol de portes.
<dt><strong>ports-changes</strong>
<dd>Env&iacute;o de mensajes automatizado sobre cambios en el
&aacute;rbol de portes del CVS.
<dt><strong>ipv6</strong>
<dd>Discusiones sobre la versi&oacute;n 6 de IP de OpenBSD.
<dt><strong>advocacy</strong>
<dd>Promoci&oacute;n del uso de OpenBSD.  Las discusiones de
car&aacute;cter no t&eacute;cnico en <em>misc</em> son generalmente
desviadas a esta lista.
<dt><strong>smp</strong>
<dd>Discusiones sobre el dise&ntilde;o e implementaci&oacute;n de
multiprocesadores sim&eacute;tricos (<em>Symmetric
Multi-Processing</em>, SMP) en OpenBSD.
</dl>

<p>
OpenBSD tambi&eacute;n mantiene varias listas espec&iacute;ficas para
distintas arquitecturas y proyectos especiales.  Estas listas son
p&uacute;blicas ya que cualquiera se puede dar de alta en ellas, pero se
deber&iacute;an considerar reservadas para desarrolladores y usuarios
que realizan pruebas sobre el sistema.  Para ser consecuentes con el
principio de transparencia de OpenBSD, no tenemos listas de correo
privadas.<br>
Si se quiere recibir un listado completo con todas las listas de correo
disponibles desde openbsd.org, basta con enviar la orden
&quot;<strong>lists</strong>&quot; en el contexto del mensaje a la
direcci&oacute;n
<a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a>.

<p>
Para obtener m&aacute;s ayuda hay que enviar un mensaje con la palabra
<strong>help</strong> en el contexto a 
<a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> y
se recibir&aacute; un mensaje de respuesta con todas las opciones para
la utilizaci&oacute;n de la lista.  &iexcl;El dominio
<strong>DEBE</strong> estar correctamente resuelto, o el correo no
llegar&aacute;!

<p>
Los chicos de <a href="http://www.squish.net/openbsd/">squish.net</a>
gestionan listas de correo con res&uacute;menes diarios y semanales de
la lista <strong>source-changes</strong> de OpenBSD.  De gran utilidad
para quienes no quieran recibir el alto volumen producido por esa lista.

<p>
Los listos primates de
<a href="http://www.monkey.org/openbsd-mobile/">monkey.org</a> mantienen
la lista <strong>openbsd-mobile</strong> para los usuarios de OpenBSD en
ordenadores port&aacute;tiles.  Para suscribirse:<br>
echo subscribe | mail openbsd-mobile-request@monkey.org 

<p>
El noct&aacute;mbulo de
<a href="http://www.benzedrine.cx/pf/">benzedrine.cx</a>
mantiene la lista de <strong>pf</strong> para los usuarios del paquete
de filtros de OpenBSD.  Para suscribirse:<br>
echo subscribe | mail pf-request@benzedrine.cx

<p>
Hay una lista de distribuci&oacute;n para gestores de r&eacute;plicas de
FTP, HTTP, AnonCVS y CVSup de OpenBSD en
<a href="http://rt.fm/openbsd-mirrors/">rt.fm</a>.

<p>
<a name="castellano"></a>
<h3><font color="#e00000">Listas en castellano</font></h3>

<p>
<strong>misc@openbsd.org.mx</strong> es una lista de correo en
<strong>castellano</strong> relacionada con OpenBSD, y ubicada en
M&eacute;xico.<br>
Para suscribirse hay que enviar un mensaje en blanco a
<a href="mailto:misc-subscribe@openbsd.org.mx">misc-subscribe@openbsd.org.mx</a>. 

<!-- p>
<strong>general@openbsd.org.ar</strong> es una lista de correo en
<strong>castellano</strong> relacionada con OpenBSD, y ubicada en
Argentina.<br>
Para suscribirse, hay que enviar mensaje a
<a href="mailto:majordomo@openbsd.org.ar">majordomo@openbsd.org.ar</a>
con la orden &quot;<strong>subscribe general</strong>&quot; en el
contexto del mensaje. -->

<p>
<h3><font color="#e00000">Listas en otras lenguas</font></h3>

<p>
Existen varias listas de correo relacionadas con OpenBSD que
est&aacute;n disponibles desde otros servidores.  Aqu&iacute; puede
verse un listado de las listas sobre las que nos han informado:

<p>
Alem&aacute;n:
<strong>liste@openbsd.de</strong>
<br>Para suscribirse, v&eacute;ase la URL en:
<a href="https://www.openbsd.de/listen/listinfo/liste">https://www.openbsd.de/listen/listinfo/liste</a>.

<p>
Checo:
<strong>users@openbsd.cz</strong>
<br>Informaci&oacute;n sobre la suscripci&oacute;n en:
<a href="http://openbsd.cz/mailman/listinfo/users/">http://openbsd.cz/mailman/listinfo/users/</a>.

<!-- 
<p>
Chino:
<strong>openbsd@shellhung.org</strong>
<br>Informaci&oacute;n sobre la suscripci&oacute;n en:
<a href="http://www.shellhung.org/mailman/listinfo/openbsd/">http://www.shellhung.org/mailman/listinfo/openbsd/</a>.
 -->

<p>
Griego:
<strong>openbsd@bsd.gr</strong>
<br>Para suscribirse, enviar un mensaje a
<a href="mailto:majordomo@bsd.gr">majordomo@bsd.gr</a>
con la orden &quot;<strong>subscribe openbsd</strong>&quot; en el
contexto.

<p>
Italiano: <a href="http://www.sikurezza.org/">sikurezza.org</a> es un
portal de seguridad no comercial, en italiano, en el que se hospeda la
lista <strong>openbsd@sikurezza.org</strong>.
<br>Para suscribirse hay que enviar un mensaje en blanco a
<a href="mailto:openbsd-subscribe@sikurezza.org">openbsd-subscribe@sikurezza.org</a>.

<p>
Japon&eacute;s:
<br>Por favor, v&eacute;ase
<a href="http://www.openbsd.ics.nara-wu.ac.jp/wakakusa">http://www.openbsd.ics.nara-wu.ac.jp/wakakus</a>
para m&aacute;s informaci&oacute;n.

<p>
Polaco:
<br>Para suscribirse, enviar un mensaje a
<a href="mailto:OpenBSD-request@bsdzine.org">OpenBSD-request@bsdzine.org</a>.

<p>
Portugu&eacute;s:
<strong>openbsd@neei.uevora.pt</strong>
<br>Informaci&oacute;n sobre la suscripci&oacute;n en:
<a href="http://neei.uevora.pt/mailman/listinfo/openbsd/">http://neei.uevora.pt/mailman/listinfo/openbsd/</a>.

<p>
Ruso: 
<strong>openbsd@openbsd.ru</strong>
<br>Para suscribirse hay que enviar un mensaje a
<a href="mailto:minimalist@openbsd.ru">minimalist@openbsd.ru</a> con la
orden &quot;<strong>subscribe openbsd</strong>&quot; en la l&iacute;nea
del asunto.

<p>
<h3><font color="#e00000">Archivos de las Listas:</font></h3>
<ul>
<li><a href="http://www.sigmasoft.com/~openbsd/">EE.UU.</a>
<!-- 404
<li><a href="http://www.tryc.on.ca/obsd-lists.html">Canad&aacute;</a>
 -->
<li><a href="http://www.geocrawler.com/lists/4/OpenBSD">Geocrawler
Archive</a>
<!-- unknown server
<li><a href="http://lists.openresources.com/OpenBSD/">Open Resources</a>
 -->
<li><a href="http://lists.openresources.com/OpenBSD/">Open Resources</a>
<li><a href="http://www.monkey.org/openbsd/">The primates at
monkey.org</a>
<li><a href="http://marc.theaimsgroup.com/">MARC</a>
<li><a href="http://bsdsearch.com/eao/phorum/index.php?f=2">BSDSearch.com</a>
<li><a href="http://www.netsys.com/archives.html">@netsys.com</a>
<li>Neohapsis dispone de un
<a href="http://archives.neohapsis.com/archives/openbsd/">archivo mixto
para tech@, misc@ y ports@</a>, y de un
<a href="http://archives.neohapsis.com/archives/openbsd/cvs/">archivo
mixto para los mensajes de CVS</a>
</ul>

<hr>

<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: mail.html,v 1.65 2003/07/22 18:14:15 nick Exp ]<br>
$Translation: mail.html,v 1.31 2003/07/26 16:48:56 horacio Exp $<br>
$OpenBSD: mail.html,v 1.31 2003/07/27 15:28:24 jufi Exp $
</small>

</body>
</html>
