<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenBSD y los derechos de autor</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="página de política sobre copyright de OpenBSD">
<meta name="keywords" content="openbsd,copyright">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Pol&iacute;tica sobre derechos de autor
(<i>&quot;copyright&quot;</i>)</font></h2>
<hr>

<ul>
<li><h3><font color="#e00000">Objetivos</font></h3><p>

Las leyes sobre derechos de autor (<i>&quot;copyright&quot;</i> &copy;)
son complejas, mientras que la pol&iacute;tica de OpenBSD es simple:
OpenBSD se esfuerza por mantener el esp&iacute;ritu original de los
derechos de autor de Berkeley Unix.
<p>

OpenBSD existe en su forma actual gracias a la ejemplaridad del
&laquo;Grupo de Investigaci&oacute;n de Sistemas
Inform&aacute;ticos&raquo; (&quot;Computer Systems Research Group&quot;)
de Berkeley, y las constantes luchas que &eacute;stos y otros han
mantenido para crear una distribuci&oacute;n fuente de Unix sin
grav&aacute;menes.
<p>

La capacidad de un Unix &quot;Berkeley&quot; de <strong>libre
distribuci&oacute;n</strong> para avanzar sobre una base competitiva con
otros sistemas operativos, depende de la voluntad de los distintos
grupos de desarrollo por intercambiar c&oacute;digo entre ellos mismos y
entre otros proyectos.  Es fundamental poder entender los entramados
legales que competen a los derechos de autor para poder tener la
capacidad de intercambiar y redistribuir c&oacute;digo;  cumplir con el
esp&iacute;ritu de los derechos de autor y el concepto de autor&iacute;a
es fundamental para promover la cooperaci&oacute;n de las personas
involucradas.
<p>

<li><h3><font color="#e00000">Los Derechos de Autor de
Berkeley</font></h3><p>

Los derechos de autor de Berkeley no imponen restricciones sobre el uso
privado o comercial del <i>software</i>, y s&oacute;lo imponen unos
requisitos simples y uniformes para el mantenimiento de las notas sobre
derechos de autor en las versiones redistribuidas, as&iacute; como el
cr&eacute;dito debido al autor del material <strong>s&oacute;lo</strong>
en publicidad.
<p>

Por ejemplo:
<p>
<pre>
 * Copyright (c) 1982, 1986, 1990, 1991, 1993
 *	The Regents of the University of California.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. All advertising materials mentioning features or use of this software
 *    must display the following acknowledgement:
 *	This product includes software developed by the University of
 *	California, Berkeley and its contributors.
 * 4. Neither the name of the University nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
</pre>

<p>
Berkeley rescindi&oacute; la tercera cl&aacute;usula (sobre publicidad)
el 22 de julio de 1999.  Las copias verbatim de la licencia de Berkeley
en el &aacute;rbol de OpenBSD han eliminado esa cl&aacute;usula.
Adem&aacute;s, muchas licencias de terceras partes del estilo BSD
consisten solamente de las dos primeras cl&aacute;usulas.

<p>
Como los derechos de autor de OpenBSD no imponen condiciones m&aacute;s
all&aacute; de las impuestas por los derechos de autor de Berkeley,
OpenBSD espera compartir el mismo campo de distribuci&oacute;n y
aplicabilidad que el resto de las distribuciones Berkeley.  Sin embargo,
OpenBSD no puede incluir material que incluya derechos de autor que sean
m&aacute;s restrictivos que los de Berkeley, o debe relegar este
material a un estado secundario;  o sea, OpenBSD en su totalidad es de
libre distribuci&oacute;n, pero algunos componentes opcionales pueden no
serlo.

<p>
<li><h3><font color="#e00000">Leyes sobre Derechos de
Autor</font></h3><p>

Aunque el conjunto de las leyes sobre derechos de autor sobrepasa el
&aacute;mbito de este documento, hay algunos puntos b&aacute;sicos que
deben ser recordardos.  Bajo las leyes de derechos de autor actuales,
los derechos de autor implican la creaci&oacute;n de un nuevo trabajo
que reside en su creador, a menos que se indique lo contrario.  En
general los derechos de autor se refieren s&oacute;lo al nuevo trabajo,
no al material incluido en &eacute;ste.
<p>

Las leyes sobre derechos de autor admiten tres categor&iacute;as
generales de trabajos:
<dl>
<dt>Trabajo original
<dd>Un trabajo nuevo que no derive de otro ya existente.
<dt>Trabajo Derivado
<dd>Un trabajo que deriva de, incluye o modifica trabajos ya existentes.
<dt>Recopilaciones
<dd>Un trabajo que sea una recopilaci&oacute;n de trabajos nuevos y
derivados.
</dl>
<p>

El concepto fundamental en los derechos de autor es el de la
primac&iacute;a;  unos derechos de autor sobre un trabajo derivado no
afectan a los derechos del propietario de los derechos de autor del
trabajo original, sino que afecta s&oacute;lo a la parte a&ntilde;adida.
Del mismo modo, los derechos de autor de una recopilaci&oacute;n no
afectan a los derechos del propietario de los trabajos incluidos,
s&oacute;lo a la recopilaci&oacute;n en bloque.
<p>

Es muy importante entender que los derechos de autor son protecciones
definidas por las leyes internacionales y nacionales sobre derechos de
autor.  Las &laquo;notas sobre los derechos del autor&raquo; que suelen
ir incluidas en los ficheros de fuentes no son derechos de autor, sino
notas en las que una parte afirma poseer los derechos de autor sobre el
material o parte de &eacute;ste.  Generalmente estas notas se asocian
con t&eacute;rminos de licencias que conceden permisos sujetos a las
leyes sobre derechos de autor, y con notas de descargo de
responsabilidad que informan sobre la posici&oacute;n del propietario de
los derechos de autor con respecto a las responsabilidades derivadas del
uso del material referido.
<p>

<li><h3><font color="#e00000">Permisos:  la otra cara</font></h3><p>

Debido a que el origen de los derechos de autor est&aacute; en la
consecuci&oacute;n de un trabajo y no en su proceso de registro, es
necesario que exista una v&iacute;a pr&aacute;ctica para hacer el
permiso extensivo a la utilizaci&oacute;n y uso del susodicho trabajo,
m&aacute;s all&aacute; de lo permitido por las provisiones de &laquo;uso
justo&raquo; en las leyes sobre derechos de autor.
<p>

Este permiso suele tomar la forma de una &laquo;versi&oacute;n&raquo; o
&laquo;licencia&raquo; incluida con el trabajo que concede un uso
adicional al permitido por las leyes sobre derechos de autor, sujeto,
por regla general, a unas condiciones.  En un extremo est&aacute; el
&laquo;dominio p&uacute;blico&raquo;, por el que el autor afirma no
imponer restricciones sobre el uso del material;  en el otro extremo
est&aacute;n las cl&aacute;usulas restrictivas que no suelen conceder
ning&uacute;n derecho adicional o que imponen condiciones restrictivas,
discriminatorias o nada pr&aacute;cticas sobre el uso del trabajo.
<p>

Otro punto importante a tener en cuenta es que la licencia y condiciones
s&oacute;lo se pueden aplicar a la parte del trabajo que proviene del
propietario de los derechos de autor;  el propietario de unos derechos
de autor sobre un trabajo derivado de otro no puede conceder permisos
adicionales para el uso del trabajo original, ni puede imponer
condiciones restrictivas para el mismo.
<p>

Debido a que los derechos de autor provienen de la consecuci&oacute;n de
un trabajo y no del proceso de registro o del texto, eliminar o alterar
una nota sobre derechos de autor o los t&eacute;rminos asociados a una
licencia, no es relevante para la existencia de los derechos de autor
sino que, por el contrario, se lleva a cabo de acuerdo con los derechos
que la persona que efect&uacute;e los cambios tenga originariamente
sobre el uso del material.  Del mismo modo, a&ntilde;adir
t&eacute;rminos y condiciones en conflicto con los t&eacute;rminos y
condiciones originales no anula estos &uacute;ltimos, sino que eleva
dudas sobre los derechos que pueda poseer sobre el uso del material la
persona que realice las modificaciones, y crea confusi&oacute;n sobre el
uso de la versi&oacute;n modificada o cualquier derivado de &eacute;sta.
<p>

Finalmente, las versiones van generalmente ligadas al material con el
que son distribuidas.  Esto quiere decir que si el autor original de un
trabajo distribuye &eacute;ste con una licencia que concede ciertos
permisos, &eacute;stos se deben aplicar tal y como vienen definidos, sin
discriminaciones, a todas aquellas personas que posean una copia
leg&iacute;tima del trabajo.  Esto implica que si se ha concedido un
permiso, el propietario de los derechos de autor no puede aplicar la
retroactividad y pretender que un individuo o grupo de individuos no
puedan hacer uso de los permisos previamente concedidos.  Del mismo
modo, si el propietario de los derechos de autor decidiera
comercializarlo, no podr&iacute;a revocar los permisos anteriormente
concedidos para el uso y distribuci&oacute;n del trabajo, aunque
podr&iacute;a imponer permisos m&aacute;s restrictivos en sus futuras
distribuciones.
<p>

<li><h3><font color="#e00000">Tipos espec&iacute;ficos</font></h3><p>

Esta secci&oacute;n es un sumario de la posici&oacute;n de OpenBSD en
relaci&oacute;n con algunos derechos de autor com&uacute;nmente
conocidos.
<p>

<dl>
<dt>Berkeley<dd><p>
Los derechos de autor de Berkeley son el modelo para los derechos de
autor de OpenBSD.  Preservan los derechos de autor del propietario, al
tiempo que impone unas condiciones m&iacute;nimas sobre el uso del
material sujeto a estos derechos.  Todo material con derechos de autor
de Berkeley, o derechos de autor que se aproximen al modelo de Berkeley,
puede ser, por regla general, incluido en OpenBSD.
<p>

<dt>AT&amp;T<dd><p>
Como parte de su trato con AT&amp;T, Berkeley incluy&oacute; una nota de
<i>copyright</i> en algunos de los archivos de 4.4BSD lite y lite2.  Los
t&eacute;rminos de esta licencia son id&eacute;nticos a los de la
licencia est&aacute;ndar de Berkeley.
<p>
Adem&aacute;s, OpenBSD incluye otras partes de c&oacute;digo de AT&amp;T
con <i>copyright</i> no restrictivo, como la referencia a la
implementaci&oacute;n de
<a href="http://cm.bell-labs.com/cm/cs/who/bwk/awk.tar.gz">awk</a>.
<p>

<dt>Caldera<dd><p>
Caldera (ahora grupo SCO) es la propietaria actual del <i>copyright</i>
del c&oacute;digo de Unix.  El 23 de enero de 2002, Caldera
liber&oacute; el c&oacute;digo original de Unix (versiones 1 a 7,
incluida 32V).  Este c&oacute;digo est&aacute; ahora disponible bajo una
<a href="http://www.tuhs.org/Archive/Caldera-license.pdf">licencia de 4
t&eacute;rminos del estilo BSD</a>.  Como resultado de esto, ahora se
puede incorporar c&oacute;digo real de Unix en OpenBSD (aunque es
bastante viejo y suele requerir de bastantes cambios para actualizarlo).

<dt>DEC, Sun, y otras firmas de <i>software</i>.<dd><p>
Por regla general, OpenBSD no incluye material con derechos de autor de
firmas dise&ntilde;adoras de <i>software</i>.  Este material puede ser
incluido all&iacute; donde el propietario de los derechos de autor haya
concedido un permiso generalizado para su reutilizaci&oacute;n sin
condiciones, con t&eacute;rminos similares a los que tienen los derechos
de autor de Berkeley, o all&iacute; donde el material sea el producto de
un empleado y la nota sobre derechos de autor del empresario lo libere
de cualquier derecho que pueda tener sobre el trabajo.
<p>

<dt>Carnegie-Mellon (CMU, Mach)<dd><p>
Los derechos de autor de Carnegie-Mellon son parecidos a los de
Berkeley, con la diferencia de que aqu&eacute;llos requieren que los
trabajos derivados del original sean puestos a disposici&oacute;n de
Carnegie-Mellon.  Debido a que esto es s&oacute;lo un requerimiento y no
una condici&oacute;n &laquo;sine qua non&raquo;, el material de este
tipo puede ser incluido en OpenBSD.  N&oacute;tese que algunas versiones
de Mach todav&iacute;a est&aacute;n sujetas a los derechos de autor de
AT&amp;T, los cuales imposibilitan la distribuci&oacute;n general de los
fuentes de Mach.
<p>

<dt>Apache<dd><p>
Los derechos de autor de Apache son parecidos a los de Berkeley, con la
diferencia de que estipulan que los productos derivados del
c&oacute;digo no pueden llevar &laquo;Apache&raquo; como parte del
nombre.  El prop&oacute;sito de esta cl&aacute;usula es el de evitar
cualquier situaci&oacute;n en la que una tercera parte lance una
versi&oacute;n modificada del c&oacute;digo con ese nombre, de tal modo
que hiciera creer a los usuarios que es la versi&oacute;n oficial.  Esto
no es problema para OpenBSD por que en OpenBSD es una
<strong>Compilaci&oacute;n</strong>, no un <strong>Trabajo
Derivado</strong>.
<p>

<dt>ISC<dd><p>
El <i>copyright</i> de ISC es en la pr&aacute;ctica equivalente al
<i>copyright</i> de dos t&eacute;rminos de BSD con una parte eliminada
que la convenci&oacute;n de Berne ha hecho innecesaria.  &Eacute;sta es
la licencia preferida para el nuevo c&oacute;digo incorporado en
OpenBSD.  En el &aacute;rbol de fuentes se incluye un modelo de la
licencia como <tt>/usr/src/share/misc/license.template</tt>.
<p>

<dt><i>GNU General Public License, GPL, LGPL, copyleft</i>, etc.<dd><p>
La Licencia P&uacute;blica GNU y las licencias con este modelo imponen
la restricci&oacute;n de que el c&oacute;digo fuente debe ser
distribuido o puesto a disposici&oacute;n para todos los trabajos que
deriven de c&oacute;digo bajo los derechos de autor de GNU.
<p>

Aunque &eacute;sta pueda ser una estrategia noble en t&eacute;rminos de
intercambio de <i>software</i>, es una condici&oacute;n generalmente
inaceptable para el uso de <i>software</i> comercial.  Su consecuencia
es que el <i>software</i> ligado por los t&eacute;rminos de la GPL no se
puede incluir en el n&uacute;cleo del sistema o en los procesos de
inicio de OpenBSD, aunque el <i>software</i> sujeto a los
t&eacute;rminos de la GPL s&iacute; pueda ser incluido como herramientas
de desarrollo o como parte opcional del sistema, siempre y cuando el
resultado de su uso no tenga como consecuencia que OpenBSD quede sujeto
a los t&eacute;rminos de la GPL.
<p>

Como ejemplo, algunos portes incluyen la emulaci&oacute;n del punto
flotante de GNU (GNU Floating Point Emulation);  esto es opcional y el
sistema se puede compilar sin ello o con un paquete de emulaci&oacute;n
alternativo.  Otro ejemplo es el uso de GCC y otras herramientas de GNU
en la cadena de herramientas de OpenBSD;  es posible distribuir un
sistema para muchas aplicaciones sin una cadena de herramientas, o el
distribuidor puede escoger incluir una cadena de herramientas como un
paquete opcional conforme con los t&eacute;rminos de la GPL.
<p>

<dt>NetBSD<dd><p>
La mayor parte de OpenBSD est&aacute; originariamente basado en, y
evolucionado desde, NetBSD, debido a que algunos de los desarrolladores
de OpenBSD formaban parte del proyecto NetBSD.  Los t&eacute;rminos
generales de la licencia de NetBSD son compatibles con la licencia de
Berkeley, y permiten su utilizaci&oacute;n.  Aquel material que
est&eacute; sujeto <strong>s&oacute;lo</strong> a la licencia general de
NetBSD puede ser incluido en OpenBSD.
<p>

En el pasado, NetBSD ha incluido material con derechos de autor de
varias personas que hab&iacute;an impuesto condiciones a la licencia
m&aacute;s all&aacute; de la licencia general de NetBSD, pero que
conced&iacute;an a la Fundaci&oacute;n NetBSD la licencia para
distribuir el material.  Este material no se puede incluir en OpenBSD
mientras las condiciones impuestas est&eacute;n en conflicto con los
t&eacute;rminos de la licencia de OpenBSD o mientras las versiones de
esos t&eacute;rminos sean ofrecidos con bases discriminatorias.
<p>

<dt>FreeBSD<dd><p>
Tambi&eacute;n la mayor parte de FreeBSD est&aacute; basado en material
bajo la licencia de Berkeley o incluye notas de sobre los derechos de
autor basadas en el modelo de Berkeley.  Este material se puede incluir
en OpenBSD, mientras que aquellas partes sujetas a la GPL u otras
licencias en conflicto con la licencia OpenBSD no pueden ser incluidas.
<p>

<dt>Linux<dd><p>
La mayor parte de Linux se encuentra bajo la GPL o licencias similares y
por tanto no puede ser incluido en OpenBSD.  Los componentes
individuales pueden ser incluidos dependiendo de los t&eacute;rminos en
las notas sobre derechos de autor originales.  N&oacute;tese que las
&laquo;distribuciones&raquo; de Linux tambi&eacute;n pueden estar
sujetas a derechos de autor adicionales de la organizaci&oacute;n
distribuidora, como en una compilaci&oacute;n o en material incluido que
no forme parte de la distribuci&oacute;n b&aacute;sica de Linux.
<p>

<dt>X, XFree86<dd><p>
X y XFree86 no son parte de OpenBSD sino que se distribuyen con muchos
de los portes de OpenBSD para conveniencia del usuario, sujeto a los
t&eacute;rminos de la licencia.
<p>

<dt><i>&quot;Shareware, Charityware, Freeware&quot;,</i> etc.<dd><p>
La mayor&iacute;a de notas sobre los derechos de autor de
<i>shareware</i> imponen condiciones a la redistribuci&oacute;n o uso
que suponen un conflicto con los objetivos del proyecto OpenBSD.  Se
requiere una revisi&oacute;n caso por caso para poder determinar si las
condiciones son aceptables en t&eacute;rminos de &laquo;condiciones
requeridas frente a exigidas&raquo;, y si el trasfondo de las
condiciones es compatible con los objetivos del proyecto OpenBSD.
<p>

<dt>Dominio P&uacute;blico<dd><p>
Mientras que el material que en realidad entra dentro del &laquo;Dominio
P&uacute;blico&raquo; se puede incluir en OpenBSD, se requiere que
&eacute;ste sea revisado caso por caso.  A menudo, la afirmaci&oacute;n
&laquo;dominio p&uacute;blico&raquo; es hecha por alguien que no posee
realmente todos los derechos de acuerdo con las leyes sobre derechos de
autor como para conceder ese status.  Para que un trabajo sea realmente
de &laquo;Dominio P&uacute;blico&raquo;, todos los derechos sobre
&eacute;ste deben ser cedidos y el material se debe ofrecer sin
restricci&oacute;n alguna.
<p>

</dl>

</ul>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: policy.html,v 1.19 2003/08/04 01:05:05 millert Exp ]<br>
$Translation: policy.html,v 1.11 2003/08/05 12:44:47 horacio Exp $<br>
$OpenBSD: policy.html,v 1.11 2003/08/09 05:50:48 jufi Exp $
</small>

</body>
</html>
