<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="documento">
<meta name="description" content="La colección de Portes y Paquetes de OpenBSD">
<meta name="keywords" content="openbsd,portes,paquetes">
<meta name="distribution" content="global">
<meta name="copyright" content="copyright 1997-2001 del proyecto OpenBSD">

<title>Portes y Paquetes de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
</head>

<body text="#000000" bgcolor="#ffffff" link="#23238e">

<img height="30" width="141" src="../images/smalltitle.gif" alt="[OpenBSD]" >

<h2><font color="#e00000">La Colecci&oacute;n de Portes y
Paquetes</font></h2>
<hr>

<h3><font color="#0000e0">Motivaciones</font></h3>

OpenBSD es un sistema bastante completo por s&iacute; solo, pero hay
grandes cantidades de software que a algunos usuarios les
gustar&iacute;a ver a&ntilde;adido.  Sin embargo existe un dilema sobre
hasta d&oacute;nde llega el l&iacute;mite de lo que se puede incluir,
as&iacute; como problemas ocasionales con las licencias y las
restricciones a la exportaci&oacute;n.  Partiendo de la base de que
OpenBSD es un sistema operativo de tipo Unix, hay algunas cosas que no
se pueden incluir en la distribuci&oacute;n del sistema.

<p>
<strong><font color="#e00000">
La colecci&oacute;n de portes y paquetes NO recibe la misma
auditor&iacute;a de seguridad que sigue OpenBSD.  Aunque nos esforzamos
en mantener la gran calidad de la colecci&oacute;n de paquetes, no
disponemos de los suficientes recursos humanos como para poder asegurar
el mismo nivel de estabilidad y fiabilidad.
</font></strong>

<p>
La colecci&oacute;n de portes, que al principio se tom&oacute; de la
colecci&oacute;n de <a href="http://www.freebsd.org/es/">FreeBSD</a>,
rellena este vac&iacute;o.  El concepto es el de disponer, para cada
software proveniente de terceras partes, un fichero Makefile que
controle
<ul>
<li>de d&oacute;nde cogerlo,
<li>c&oacute;mo llevar a cabo la recogida,
<li>de qu&eacute; depende (si hay dependencias),
<li>c&oacute;mo aplicar cambios en los fuentes (si fuera necesario),
<li>y c&oacute;mo configurarlo, compilarlo e instalarlo.
</ul>

Esta informaci&oacute;n se mantiene en una jerarqu&iacute;a de
directorios bajo el directorio /usr/ports.

<p>
Los paquetes son los equivalentes binarios de los portes.  Un porte
compilado se convierte en un paquete que se puede registrar en el
sistema usando pkg_add(1).

<p>
<strong><font color="#e00000">
Los paquetes parecen simples archivos <code>.tgz</code>, pero se
deben a&ntilde;adir siempre usando 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&format=html">pkg_add(1)</a>, 
ya que puede haber informaci&oacute;n adicional que s&oacute;lo 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&format=html">pkg_add(1)</a>
sabe c&oacute;mo gestionar.
</font></strong>
Una pista:  puede distinguir entre los paquetes y los archivos .tgz
usando <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1&format=html">pkg_info(1)</a>.

<h3><font color="#0000e0">C&oacute;mo Obtener los Paquetes</font></h3>

Existe una gran colecci&oacute;n de paquetes precompilados disponibles
para las arquitecturas m&aacute;s comunes.

<ul>
<li>En el CDROM (que puede pedir
    <a href="orders.html">aqu&iacute;</a>),
<li>En las <a href="ftp.html">r&eacute;plicas de ftp</a>.
<li>O los puede buscar y obtener desde las listas de paquetes de la
    web:
<ul>
<li><a href="http://www.openbsd.org/2.8_packages/">Paquetes para
    OpenBSD 2.8</a>
<li><a href="http://www.openbsd.org/2.7_packages/">Paquetes para
    OpenBSD 2.7</a>
</ul>
</ul>

<p>
A&ntilde;adir un paquete es tan sencillo como hacer
<code>pkg_add pkgname.tgz</code>.  Si va a obtener los paquetes de una
&uacute;nica fuente (un repositorio de paquetes), configure PKG_PATH
para que se&ntilde;ale la URL de ese repositorio para obtener las
dependencias.
</p>

<p>
Por ejemplo, para instalar el paquete gimp para la versi&oacute;n 2.8
en una m&aacute;quina i386 desde el sitio de ftp (incluyendo las
dependencias), haga lo siguiente:
</p>

<pre>
    # setenv PKG_PATH ftp://ftp.openbsd.org/pub/OpenBSD/2.8/packages/i386/
    # pkg_add ${PKG_PATH}gimp-1.1.27.tgz
</pre>

<h3><a name="stable"><font color="#0000e0">Actualizaci&oacute;n de
portes y paquetes con la versi&oacute;n oficial de
OpenBSD</font></a></h3>

<p>
Con la versi&oacute;n 2.7 se introdujo la rama <em>-stable</em> al
&aacute;rbol de portes.
</p>

<p>
Por ejemplo, para bajarse la rama <em>-stable</em> para la
versi&oacute;n 2.8 har&iacute;amos lo siguiente:
</p>

<pre>
    $ cd /usr/ports
    $ cvs -q -d anoncvs@some.anon.server:/cvs up -r OPENBSD_2_8 -Pd
</pre>

<p>
A partir de la versi&oacute;n 2.8, tambi&eacute;n se encuentran
disponible una selecci&oacute;n de paquetes binarios.  Gracias a
<a href="mailto:naddy@openbsd.org">Christian Weisgerber</a> por
encargarse de la dura tarea de coordinar los camios en la rama
<em>stable</em>.  Por favor, la la p&aacute;gina de los
<a href="../pkg-stable.html">paquetes estables</a> para saber
qu&eacute; paquetes son importantes y cu&aacute;les han sido
actualizados en la rama <em>stable</em>.
</p>

<p>
A fin de evitar cualquier riesgo de confusi&oacute;n entre un paquete
de la versi&oacute;n oficial y un mismo paquete con alg&uacute;n error
solucionado, los nombres de los paquetes <strong>siempre</strong>
cambian cuando el paquete ha sido actualizado.
</p>


<h3><font color="#0000e0">Gesti&oacute;n de paquetes
instalados</font></h3>
 
La p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=packages&amp;sektion=7&format=html">packages(7)</a>
contiene informaci&oacute;n de utilidad sobre las forma de gestionar
paquetes instalados, resolver conflictos (ficheros que ya existan) y
gestionar las dependencias.

<p>
A partir de OpenBSD 2.8, para actualizar un paquete debe:
<ul>
<li>Eliminar el paquete viejo usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete&amp;sektion=1&format=html">pkg_delete(1)</a>
<li>A&ntilde;adir el paquete nuevo usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&format=html">pkg_add(1)</a>
</ul>

Esto no es muy conveniente, ya que los paquetes podr&iacute;an accionar
las dependencias, y entonces tendr&iacute;a que eliminar un subgrupo de
paquetes grande para una actualizaci&oacute;n.


<h3><font color="#0000e0">C&oacute;mo usar los portes</font></h3>

Si un paquete dado no existe para su arquitectura, a&uacute;n es
posible compilar el porte.  Adem&aacute;s, algunos usuarios
querr&aacute;n compilarlo todo desde el c&oacute;digo fuente por varios
motivos.

<p>
Puede bajarse por ftp la versi&oacute;n oficial correspondiente desde
el directorio pub/OpenBSD/[versi&oacute;n] (en donde [versi&oacute;n]
es el n&uacute;mero de la versi&oacute;n) de cualquiera de las 
<a href="ftp.html">r&eacute;plicas de ftp</a>.  Las versiones oficiales
(&quot;releases&quot;) son las que vienen en el CDROM, y han pasado
m&aacute;s pruebas que cualquier versi&oacute;n de prueba
(&quot;snapshots&quot;).  Puede encontrar m&aacute;s informaci&oacute;n
al respecto en la p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&amp;sektion=7&format=html">ports(7)</a>.

<h3><font color="#0000e0">Ciclo de vida del &aacute;rbol de
portes</font></h3>

<p>
El &aacute;rbol de portes, como el resto del &aacute;rbol de OpenBSD,
est&aacute; cambiando constantemente.  El ciclo de vida normal del
&aacute;rbol de portes es de este modo:
<ul>
<li>Seguir tras la &uacute;ltima versi&oacute;n de OpenBSD durante unos
    pocos meses despu&eacute;s del lanzamiento oficial.
<li>Empezar a seguir tras OpenBSD-current unos dos meses antes del
    lanzamiento de la pr&oacute;xima versi&oacute;n.
</ul>

<p>
El cambio de estado se publicar&aacute; en las 
<a href="mail.html">listas de correo</a>.
</p>

<p>
El &aacute;rbol actual de los portes, <em>ports-current</em>,
<strong>no puede ser utilizado</strong> con la versi&oacute;n anterior
una vez que el cambio para el seguimiento de <em>OpenBSD-current</em>
tenga lugar.  Esto se debe a cambios, sobre todo en el proceso de
compilaci&oacute;n de los portes, que requieren de c&oacute;digo basado
en el &aacute;rbol de fuentes de <em>OpenBSD-current</em>.
</p>

<p>
El &aacute;rbol de portes funciona como una entidad &uacute;nica.
Actualizar un solo directorio no garantiza que vaya a funcionar, ya que
las dependencias de un paquete puede forzarle a actualizar y recompilar
una amplia parte del &aacute;rbol de portes.  Se recomienda que los
usuarios no sigan los portes de current a menos que est&eacute;n
preparados para los consiguientes problemas.  Por ejemplo, algunas
versiones del paquete de portes podr&iacute;a haber dejado de estar
disponible.  Por tanto, tendr&iacute;a que obtener y usar una
versi&oacute;n m&aacute;s nueva del &aacute;rbol de portes.
N&oacute;tese que el &aacute;rbol de ports-current se comprueba con el
de OpenBSD-current, y <strong>NO</strong> est&aacute; garantizado que
funcione con la versi&oacute;n estable anterior.  Se recomienda
encarecidamente a los usuarios que no hagan seguimientos de
ports-current a menos que est&eacute;n dispuestos a hacer un
seguimiento completo de OpenBSD-current, incluidos los fuentes.  Las 
<a href="mail.html">listas de correo</a> como la de
<code>ports-changes@openbsd.org</code> o <code>tech@openbsd.org</code>
ser&aacute;n probablemente de gran ayuda.
</p>

<p>
Tambi&eacute;n se encuentra disponible un listado de <a
href="../portsplus/index.html">cambios diarios</a> en los
&aacute;rboles de <em>ports</em> y <em>ports-current</em>.
</p>


<p>
El &aacute;rbol de <em>ports-current</em> se puede obtener por medio
de:
<ul>
<li><a href="anoncvs.html">CVS An&oacute;nimo</a> (ver enlace).
La orden es, esencialmente, <strong>cvs get ports</strong>.
<li>FTP An&oacute;nimo en 
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz">ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz</a>.
Este archivo se actualiza cada noche.
<li><a href="cvsup.html">CVSup</a>.  Vea el ejemplo de c&oacute;mo usar
CVSup en <a href="cvsup.html#checkout">modo checkout</a>.
<li>su navegador de http, mediante la 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/ports/">interfaz de web
de CVS</a>.
</ul>

<p>
<h3><font color="#0000e0">Portes y XFree</font></h3>

<p>
Hay algo de magia en los ficheros de configuraci&oacute;n de XFree para
OpenBSD que permite que el &aacute;rbol de portes instale en /usr/local
aplicaciones basadas en <em>imake</em>.

<p>
Desde la versi&oacute;n 2.9, OpenBSD incluye XFree 4.0.3.  Si
est&aacute; usando una versi&oacute;n anterior junto con los binarios
para XFree del proyecto XFree, es probable que tenga que aplicar el
parche <code>/usr/ports/infrastructure/patches/patch-xfree-4.0</code> a
la distribuci&oacute;n binaria de XFree 4.0.x.

<p>
<h3><font color="#0000e0">Ejemplo del uso del &aacute;rbol de
Portes</font></h3>

<p>
Suponiendo que hubiera conseguido obtener un &aacute;rbol de portes y
que quisiera compilar e instalar la herramienta de descompresi&oacute;n
de archivos <strong>unzip</strong>, podr&iacute;a hacer algo parecido a
esto:

<pre>
    % cd /usr/ports/archivers/unzip
    % su
    # make
    # make install
    # exit
</pre>

F&aacute;cil, &iquest;no es cierto?  Especialmente si consideramos todo
lo que ha ocurrido en un plano de fondo:
<ul>
<li>Bajar los fuentes de unzip desde un sito de ftp,
<li>Comprobar la integridad del archivo de fuentes,
<li>Extraer los fuentes de unzip,
<li>Aplicar parches espec&iacute;ficos de OpenBSD,
<li>Configurar y compilar el programa,
<li>Crear un paquete binario en /usr/ports/packages,
<li>Instalar ese paquete.
</ul>

<p>
Con OpenBSD 2.8, casi todos los portes compilar&aacute;n paquetes de
forma autom&aacute;tica cuando se instalen.

<p>
Seg&uacute;n se van compilando portes, el directorio
/usr/ports/distfiles se va llenando con fuentes de programas, y
/usr/ports/packages se va llenando con paquetes de binarios.  Los
usuarios con mala conexi&oacute;n pueden ver en la p&aacute;gina de
manual de mirror-distfiles(7) una buena referencia sobre un modo
eficiente de bajarse todos los distfiles de una vez.  En
OpenBSD-current, puede usar el gui&oacute;n
/usr/ports/infrastructure/fetch/clean-old para llevar un seguimiento de
los viejos programas en <em>distfiles</em>.  Note que el CD de OpenBSD
s&oacute;lo incluye el &aacute;rbol de fuentes y los paquetes
seleccionados.  Si quiere tener los fuentes de los programas en
distfiles, tendr&aacute; que obtenerlos por un medio distinto.


<h3><font color="#0000e0">Crear nuevos portes</font></h3>

<p>
Si est&aacute; interesado en ayudar a expandir el &aacute;rbol de
portes de OpenBSD, antes que nada deber&iacute;a leer 
<a href="porting.html">porting.html</a>.  Esa p&aacute;gina hace
referencia a la secci&oacute;n de portes del 
<a href="http://www.freebsd.org/handbook/">FreeBSD handbook</a>
as&iacute; como a la pol&iacute;tica de OpenBSD al respecto y algunas
pistas que le servir&aacute;n de ayuda.

<h3><font color="#0000e0">Problemas y Direcci&oacute;n de
Contacto</font></h3>

<p>
Si tiene alg&uacute;n problema con los portes, o si necesita
informaci&oacute;n sobre c&oacute;mo crear nuevos portes, por favor
env&iacute;e un mensaje a la lista de correo sobre portes de OpenBSD
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a>.
Las correcciones siempre se agradecen pero en cualquier caso, por favor
incluya:

<ul>
<li>La salida de <code>uname -a</code>,
<li>Su versi&oacute;n de OpenBSD, incluido cualquier parche que haya
    instalado,
<li>Una descripci&oacute;n completa del problema.
</ul>

Para aquellos portes que no compilen correctamente, casi siempre se
requiere una transcripci&oacute;n completa del proceso de
compilaci&oacute;n e instalaci&oacute;n.  Algunos portes pueden tener
problemas de configuraci&oacute;n relacionados con otras instalaciones
en su m&aacute;quina.

<ul>
<li>Use <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=script&amp;sektion=1&format=html">script(1)</a>
    para crear una transcripci&oacute;n completa del proceso.  No
    elemine la informaci&oacute;n sobre la configuraci&oacute;n.
<li>Env&iacute;e la salida de
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1&format=html">pkg_info(1)</a>
    adjunta al mensaje si cree que tiene alguna relevancia (por poca
    que pueda ser).
<li>Los errores del compilador interno
    <li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gcc&amp;sektion=1&format=html">gcc(1)</a>
    le indicar&aacute;n que informe sobre el error a la lista de correo
    de gcc.  Ahorrar&aacute; tiempo si sigue esta indicaci&oacute;n,
    para la que debe incluir, por lo menos, los distintos ficheros
    producidos por <tt>gcc -save-temps</tt>.
</ul>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ports.html,v 1.49 2001/05/03 15:29:27 espie Exp ]<br>
$Translation: ports.html,v 1.19 2001/05/04 23:19:58 horacio Exp $<br>
$OpenBSD: ports.html,v 1.20 2001/05/05 17:04:02 jufi Exp $
</small>
</body>
</html>
