<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="document">
<meta name="description" CONTENT="How OpenBSD can make use of the FreeBSD ports">
<meta name="keywords" content="openbsd,ports">
<meta name="distribution" content="global">
<meta name="copyright" content="copyright 1997-1999 by the OpenBSD project">

<title>Portes y Paquetes de OpenBSD</title>
<link rev="made" HREF="mailto:www@openbsd.org">

<body text="#000000" bgcolor="#FFFFFF" link="#23238E">

<img height="30" width="141" src="../images/smalltitle.gif" alt="[OpenBSD]" >

<center><h2><font color="#e00000">
El &aacute;rbol de portes de OpenBSD est&aacute; actualmente en
seguimiento de OpenBSD 2.7 (versi&oacute;n oficial)
</font></h2></center>

<hr>

<h2><font color="#e00000">Portes y Paquetes</font><hr></h2>

<h3><font color="#0000e0">Historia</font></h3>

<p>
OpenBSD es un sistema bastante completo por sí solo, pero hay grandes
cantidades de software que a algunos usuarios les gustaría ver añadido.
Sin embargo existe un problema sobre hasta dónde llega el límite de lo que se
puede incluir, así como problemas ocasionales con las licencias y las
restricciones a la exportación.
Ya que se supone que OpenBSD es un sistema operativo de tipo Unix, hay
algunas cosas que no se pueden incluir en la distribución del sistema.

<p>
Queríamos encontrar un modo para que los usuarios pudieran conseguir con
facilidad software que nosotros no distribuíamos, y comenzamos a mirar a 
nuestro alrededor.
No tuvimos que mirar lejos, ya que el proyecto hermano 
<a href="http://www.freebsd.org/es/">FreeBSD</a> disponía ya de un mecanismo
excelente que se correspondía con exactitud con nuestro propósito, llamado 
<a href="http://www.freebsd.org/es/ports/">&laquo;la colección de portes&raquo;</a>.
<p>
Al principio intentamos usar su colección tal cual, pero debido a problemas
de incompatibilidad entre FreeBSD y OpenBSD decidimos extenderlo y crear
nuestro propio Proyecto de Portes de OpenBSD, usando los de FreeBSD como línea
de salida.
Esto también nos permitió sintonizar mucho mejor los portes con nuestro
sistema.

<h3><font color="#0000e0">Breve descripción y configuración</font></h3>

<p>
La idea de los portes es tener, para cada pieza de software, un fichero
Makefile que controle
<ul>
<li>de dónde cogerlo,
<li>cómo llevar a cabo la recogida,
<li>de qué depende (si hay dependencias),
<li>cómo aplicar cambios en los fuentes (si fuera necesario),
<li>y cómo configurarlo, compilarlo e instalarlo.
</ul>
<p>
Esta información se mantiene en una jerarquía de directorios bajo el
directorio /usr/ports.

<h3><font color="#0000e0">Obtener el árbol de Portes</font></h3>

<p>
Se puede bajar la revisión de la última versión por ftp desde el directorio 
pub/OpenBSD/[versión] (en donde [versión] es el número correspondiente al
lanzamiento de la versión final) en cualquiera de las 
<a href="ftp.html">réplicas de ftp</a>.
Los versiones finales son las que vienen con nuestro CDROM, y han sido 
comprobadas en mucha más profundidad que cualquier &laquo;versión de 
prueba&raquo; (&quot;snapshot&quot;).

<p>
M&aacute;s informaci&oacute;n disponible en la p&aacute;gina de manual
de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&sektion=7&format=html">ports(7)</a>.

<h3><font color="#0000e0">Portes versus Paquetes</font></h3>

<p>
En las arquitecturas m&aacute;s comunes no es necesario compilar nada
en el &aacute;rbol de portes.  Con la llegada de OpenBSD 2.7,
estar&aacute; disponible un gran juego de paquetes precompilados:

<ul>
<li>En el CDROM (que puede reservar <a href="orders.html">here</a>),
<li>En las r&eacute;plicas de ftp.
</ul>
La documentaci&oacute;n de OpenBSD incluye m&aacute;s
informaci&oacute;n sobre el uso correcto de los
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=packages&sektion=7&format=html">paquetes</a>.

<h3><font color="#0000e0">Actualizaci&oacute;n de portes para una
versi&oacute;n de OpenBSD</font></h3>

<p>
El &aacute;rbol de portes, como el resto de OpenBSD, est&aacute; sujeto
a cambios cont&iacute;nuos.  Algunas veces, mientras intentamos
mantener la compatibilidad de los portes durante el tiempo de vida de
una particular versi&oacute;n, cosas m&aacute;s all&aacute; de nuestro
control pueden suceder.  Por ejemplo, podr&iacute;a ser que las
versiones portadas de un paquete ya no estuvieran disponibles (pero
este problema espec&iacute;fico se deber&iacute;a resolver a partir de
ahora).

<p>
El ciclo de vida normal del &aacute;rbol de portes es de este modo:
<ul>
<li>Seguir tras la &uacute;ltima versi&oacute;n de OpenBSD durante unos
    pocos meses despu&eacute;s del lanzamiento oficial.
<li>Empezar a seguir tras OpenBSD-current unos dos meses antes del
    lanzamiento de la pr&oacute;xima versi&oacute;n.
</ul>

<p>
El cambio de estado se publicar&aacute; en las 
<a href="mail.html">listas de correo</a>.

<p>
El &aacute;rbol de portes funciona como una entidad &uacute;nica.
Actualizar un solo directorio no garantiza que vaya a funcionar, ya que
las dependencias de un paquete puede forzarle a actualizar y recompilar
una amplia parte del &aacute;rbol de portes.

<p>
Se recomienda que los usuarios no sigan los portes de current a menos
que est&eacute;n preparados para los consiguientes problemas.  Por
ejemplo, algunas versiones del paquete de portes podr&iacute;a haber
dejado de estar disponible.  Por tanto, tendr&iacute;a que obtener y
usar una versi&oacute;n m&aacute;s nueva del &aacute;rbol de portes.
N&oacute;tese que el &aacute;rbol de ports-current se comprueba con el
de OpenBSD-current, y <strong>NO</strong> est&aacute; garantizado que
funcione con la versi&oacute;n estable anterior.  Se recomienda
encarecidamente a los usuarios que no hagan seguimientos de
ports-current a menos que est&eacute;n dispuestos a hacer un
seguimiento completo de OpenBSD-current, incluidos los fuentes.
Las <a href="mail.html">listas de correo</a> como la de
&quot;source-changes&quot; o &quot;tech&quot; ser&aacute;n
probablemente de gran ayuda.

<p>
El árbol ports-current se puede obtener por medio de:
<ul>
<li><a href="anoncvs.html">CVS Anónimo</a> (ver enlace).
La orden es, esencialmente, <strong>cvs get ports</strong>.
<li>FTP Anónimo en 
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz">ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz</a>.
Este archivo se actualiza cada noche.
<li>su navegador de http, mediante la 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/ports/">interfaz de web de CVS</a>.
</ul>

<h3><font color="#0000e0">Ejemplo del uso del árbol de Portes</font></h3>

<p>
Suponiendo que hubiera conseguido obtener un árbol de portes y que quisiera
compilar e instalar la herramienta de descompresión de archivos 
<code>unzip</code>, podría hacer algo parecido a esto:
<pre>
% cd /usr/ports/archivers/unzip
% su
# make
# make install
# exit
</pre>
Fácil, ¿verdad?

<!-- 
<h3><font color="#0000e0">Información sobre el estado de los portes</font></h3>

<p>
La <a href="portstat.html">página sobre el estado actual de los portes</a> se 
actualiza cada vez que los miembros del equipo añaden nuevos portes y 
verifican los ya existentes.
Los portes existentes se verifican con frecuente continuidad con el fin de 
validar los fuentes disponibles y su correcta operación con OpenBSD-current.
En la página se notifica la fecha de la última comprobación y la naturaleza
del cambio.
Este recurso es nuevo y todavía no está acabado.
Si tiene alguna información que añadir a la página sobre el estado actual de
los portes, por favor enviéla a 
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a>.
 -->

<h3><font color="#0000e0">Crear nuevos portes</font></h3>

<p>
Si está interesado en ayudar a expandir el árbol de portes de OpenBSD,
antes que nada debería leer <a href="porting.html">porting.html</a>.
Esa página hace referencia a la sección de portes del 
<a href="http://www.freebsd.org/handbook/">FreeBSD handbook</a> así como a la
política de OpenBSD al respecto y algunas pistas que le servirán de ayuda.

<h3><font color="#0000e0">Problemas y Dirección de Contacto</font></h3>

<p>
Si tiene algún problema con los portes, por favor envíe un mensaje a la lista
de portes de OpenBSD, 
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a>.
Las correcciones siempre se agradecen pero en cualquier caso, por favor
incluya:
<ul>
<li>La salida de <code>uname -a</code>,
<li>Su versión de OpenBSD, incluido cualquier parche que haya instalado,
<li>Una descripción completa del problema.

</ul>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ports.html,v 1.30 2000/05/27 14:51:26 espie Exp ]<br>
$Translation: ports.html,v 1.4 2000/06/02 01:21:13 horacio Exp $<br>
$OpenBSD: ports.html,v 1.4 2000/06/02 22:46:37 wvdputte Exp $
</small>
</body>
</html>
