<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="portes y paquetes de OpenBSD">
<meta name="keywords" content="openbsd,portes,paquetes">
<meta name="distribution" content="global">
<meta name="copyright" content="copyright 1997-2002 de OpenBSD">

<title>Portes y paquetes de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
</head>

<body text="#000000" bgcolor="#ffffff" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<h2><font color="#e00000">La Colecci&oacute;n de portes y
paquetes</font></h2>
<hr>

<h3><font color="#0000e0">&Iacute;ndice</font></h3>
<ul>
<li><a href="#Motivation">Motivaciones</a>
<li><a href="#Get">C&oacute;mo obtener los paquetes</a>
<li><a href="#stable">Actualizaci&oacute;n de portes y paquetes para una
versi&oacute;n final de OpenBSD</a>
<li><a href="#Manage">Gesti&oacute;n de paquetes instalados</a>
<li><a href="#Use">C&oacute;mo usar los portes</a>
<li><a href="#Life">Ciclo de vida del &aacute;rbol de portes</a>
<li><a href="#XFree86">Los portes y XFree86</a>
<li><a href="#Example">Ejemplo de utilizaci&oacute;n del &aacute;rbol de
portes</a>
<li><a href="#Advanced">Uso avanzado del &aacute;rbol de portes</a>
<li><a href="#Create">C&oacute;mo crear nuevos portes</a>
<li><a href="#Lag">Por qu&eacute; un porte est&aacute; desfasado con
respecto a su versi&oacute;n actual</a>
<li><a href="#Help">Problemas y direcciones de contacto</a>
</ul>

<hr>

<p>
<a name="Motivation"></a>
<h3><font color="#0000e0">Motivaciones</font></h3>

<p>
OpenBSD es un sistema bastante completo por s&iacute; solo, pero hay
grandes cantidades de software que a algunos usuarios les
gustar&iacute;a ver a&ntilde;adido.  Sin embargo existe un dilema sobre
hasta d&oacute;nde llega el l&iacute;mite de lo que se puede incluir,
as&iacute; como problemas ocasionales con las licencias y las
restricciones a la exportaci&oacute;n.  Partiendo de la base de que
OpenBSD es un sistema operativo tipo Unix, hay algunas cosas que no se
pueden incluir en la distribuci&oacute;n del sistema.

<p>
<strong><font color="#e00000">
La colecci&oacute;n de portes y paquetes NO recibe la misma
auditor&iacute;a de seguridad que sigue OpenBSD.  Aunque nos esforzamos
en mantener la gran calidad de la colecci&oacute;n de paquetes, no
disponemos de los suficientes recursos humanos como para poder asegurar
el mismo nivel de estabilidad y fiabilidad.
</font></strong>

<p>
La colecci&oacute;n de portes, que al principio se tom&oacute; de la
colecci&oacute;n de <a href="http://www.freebsd.org/es/">FreeBSD</a>,
rellena este vac&iacute;o.  El concepto es el de disponer, para cada
software proveniente de terceras partes, un fichero Makefile que
controle

<ul>
<li>de d&oacute;nde cogerlo,
<li>c&oacute;mo llevar a cabo la recogida,
<li>de qu&eacute; depende (si hay dependencias),
<li>c&oacute;mo aplicar cambios en los fuentes (si fuera necesario),
<li>y c&oacute;mo configurarlo, compilarlo e instalarlo.
</ul>

Esta informaci&oacute;n se mantiene en una jerarqu&iacute;a de
directorios bajo el directorio /usr/ports.

<p>
Los paquetes son los equivalentes binarios de los portes.  Un porte
compilado se convierte en un paquete que se puede registrar en el
sistema usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1">pkg_add(1)</a>.

<p>
<strong><font color="#e00000">
Los paquetes parecen simples archivos <code>.tgz</code>, pero se deben
a&ntilde;adir siempre usando 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1">pkg_add(1)</a>, 
ya que puede haber informaci&oacute;n adicional que s&oacute;lo 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1">pkg_add(1)</a>
sabe c&oacute;mo gestionar.
</font></strong>
Una pista:  puede distinguir entre los paquetes y los archivos .tgz
usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1">pkg_info(1)</a>.

<p>
<a name="Get"></a>
<h3><font color="#0000e0">C&oacute;mo obtener los paquetes</font></h3>

<p>
Existe una gran colecci&oacute;n de paquetes precompilados disponibles
para las arquitecturas m&aacute;s comunes.

<ul>
<li>En el CDROM (que puede pedir <a href="orders.html">aqu&iacute;</a>),
<li>En las <a href="ftp.html">r&eacute;plicas de ftp</a>.
<li>O los puede buscar y obtener desde las listas de paquetes de la web:
  <ul>
  <li><a href="http://www.openbsd.org/3.2_packages/">Paquetes para
  OpenBSD 3.2</a>
  <li><a href="http://www.openbsd.org/3.1_packages/">Paquetes para
  OpenBSD 3.1</a>
  <li><a href="http://www.openbsd.org/3.0_packages/">Paquetes para
  OpenBSD 3.0</a>
  <li><a href="http://www.openbsd.org/2.9_packages/">Paquetes para
  OpenBSD 2.9</a>
  <li><a href="http://www.openbsd.org/2.8_packages/">Paquetes para
  OpenBSD 2.8</a>
  <li><a href="http://www.openbsd.org/2.7_packages/">Paquetes para
  OpenBSD 2.7</a>
  </ul>
</ul>

<p>
A&ntilde;adir un paquete es tan sencillo como hacer <code>pkg_add
pkgname.tgz</code>.  Si va a obtener los paquetes desde una &uacute;nica
fuente (un repositorio de paquetes), configure PKG_PATH para que
se&ntilde;ale la URL de ese repositorio para obtener las dependencias.

<p>
Por ejemplo, para instalar el paquete Gimp para la versi&oacute;n 3.4 en
una m&aacute;quina i386 desde el sitio de ftp (incluyendo las
dependencias), haga lo siguiente:

<pre>
    # setenv PKG_PATH ftp://ftp.openbsd.org/pub/OpenBSD/3.4/packages/i386/
    # pkg_add ${PKG_PATH}gimp-1.2.3.tgz
</pre>

<p>
<a name="stable"></a>
<h3><font color="#0000e0">Actualizaci&oacute;n de portes y paquetes para
una versi&oacute;n final de OpenBSD</font></h3>

<p>
A partir de la versi&oacute;n final 2.7 (<em>-release</em>) se introdujo
la rama de parches o versi&oacute;n parcheada (<em>-stable</em>) al
&aacute;rbol de portes.

<p>
Por ejemplo, para bajarse la versi&oacute;n parcheada de la
versi&oacute;n 3.4 har&iacute;amos lo siguiente:

<pre>
    $ cd /usr/ports
    $ cvs -q -d anoncvs@some.anon.server:/cvs up -r OPENBSD_3_4 -Pd
</pre>

<p>
A partir de la versi&oacute;n 2.8, tambi&eacute;n se introdujo una
selecci&oacute;n de paquetes binarios.  Por favor, la la p&aacute;gina
sobre los <a href="../pkg-stable.html">paquetes estables</a> para
conocer qu&eacute; paquetes son importantes y cu&aacute;les han sido
actualizados en la versi&oacute;n parcheada.

<p>
A fin de evitar cualquier riesgo de confusi&oacute;n entre un paquete de
la versi&oacute;n oficial y un mismo paquete con alg&uacute;n error
solucionado, los nombres de los paquetes <strong>siempre</strong>
cambian cuando el paquete ha sido actualizado.

<p>
<a name="Manage"></a>
<h3><font color="#0000e0">Gesti&oacute;n de paquetes
instalados</font></h3>
 
<p>
La p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=packages&amp;sektion=7">packages(7)</a>
contiene informaci&oacute;n de utilidad sobre las forma de administrar
paquetes instalados, resolver conflictos (ficheros que ya existan) y
gestionar las dependencias.

<p>
A partir de OpenBSD 2.8, para actualizar un paquete debe:
<ul>
<li>Eliminar el paquete viejo usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete&amp;sektion=1">pkg_delete(1)</a>
<li>A&ntilde;adir el paquete nuevo usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1">pkg_add(1)</a>
</ul>

<p>
Esto no es muy conveniente, ya que los paquetes podr&iacute;an accionar
las dependencias, y entonces tendr&iacute;a que eliminar un subgrupo de
paquetes grande para una actualizaci&oacute;n.

<p>
<a name="Use"></a>
<h3><font color="#0000e0">C&oacute;mo usar los portes</font></h3>

<p>
Si un paquete dado no existe para su arquitectura, a&uacute;n es posible
compilar el porte.  Adem&aacute;s, algunos usuarios querr&aacute;n
compilarlo todo desde el c&oacute;digo fuente por varios motivos.

<p>
Puede bajarse por ftp la versi&oacute;n final (<em>-release</em>)
correspondiente desde el directorio
<tt>pub/OpenBSD/[versi&oacute;n]</tt> (en donde
<tt>[versi&oacute;n]</tt> es el n&uacute;mero de la versi&oacute;n
correspondiente) de cualquiera de las <a href="ftp.html">r&eacute;plicas
de ftp</a>.  Las versiones finales son las que vienen en el CDROM, y han
pasado m&aacute;s pruebas que cualquier versi&oacute;n preliminar
(<em>snapshot</em>).  Puede encontrar m&aacute;s informaci&oacute;n al
respecto en la p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&amp;sektion=7">ports(7)</a>.

<p>
<a name="Life"></a>
<h3><font color="#0000e0">Ciclo de vida del &aacute;rbol de
portes</font></h3>

<p>
El &aacute;rbol de portes, como el resto del &aacute;rbol de OpenBSD,
est&aacute; cambiando constantemente.

<p>
El &aacute;rbol de desarrollo de los portes (<em>ports-current</em>),
<strong>no puede ser utilizado</strong> con la versi&oacute;n anterior.
Esto se debe a causa de cambios, sobre todo de cambios en el proceso de
compilaci&oacute;n e instalaci&oacute;n de los portes que requieren
c&oacute;digo basado en el &aacute;rbol de desarrollo del sistema
(OpenBSD<em>-current</em>).

<p>
El &aacute;rbol de portes funciona como una entidad &uacute;nica.
Actualizar un solo directorio no garantiza que vaya a funcionar, ya que
las dependencias de un paquete puede forzarle a actualizar y recompilar
una amplia parte del &aacute;rbol de portes.  Se recomienda que los
usuarios no sigan los portes de current a menos que est&eacute;n
preparados para los consiguientes problemas.  Por ejemplo, algunas
versiones del paquete de portes podr&iacute;a haber dejado de estar
disponible.  Por tanto, tendr&iacute;a que obtener y usar una
versi&oacute;n m&aacute;s nueva del &aacute;rbol de portes.
N&oacute;tese que el &aacute;rbol de ports-current se comprueba con el
de OpenBSD-<em>current</em>, y <strong>NO</strong> est&aacute;
garantizado que funcione con la versi&oacute;n estable anterior.  Se
recomienda encarecidamente a los usuarios que no hagan seguimientos de
<em>ports-current</em> a menos que est&eacute;n dispuestos a hacer un
seguimiento completo de OpenBSD-current, incluidos los fuentes.  Las <a
href="mail.html">listas de correo</a> como la de
<code>ports-changes@openbsd.org</code> o <code>tech@openbsd.org</code>
ser&aacute;n probablemente de gran ayuda.

<p>
Se recomienda que se utilicen ports<em>-stable</em> en una
m&aacute;quina funcional;  intentaremos mantener el &aacute;rbol de
ports</em>-stable</em> en condiciones con respecto a los problemas,
as&iacute; como lanzar actualizaciones binarias peri&oacute;dicamente.

<p>
N&oacute;tese que los archivos de distribuci&oacute;n que se borren no
representan ning&uacute;n problema, ya que ftp.openbsd.org contiene el
repositorio completo.  Aun en el caso en que cambien las sumas de
distribuci&oacute;n se puede ejecutar la orden

<pre>
	make checksum REFETCH=true 
</pre>

<p>
para asegurarse de que se est&eacute; bajando el archivo de
distribuci&oacute;n correcto para su &aacute;rbol de portes.  Puede ver
las definiciones de <em>-current</em> y <em>-stable</em> en las
<a href="../faq/es/upgrade-minifaq.html#1.1">preguntas frecuentes sobre
actualizaci&oacute;n</a>.

<p>
Tambi&eacute;n se encuentra disponible un listado de
<a href="../portsplus/index.html">cambios diarios</a> en los
&aacute;rboles de <em>ports</em> y <em>ports-current</em>.


<p>
El &aacute;rbol de <em>ports-current</em> se puede obtener por medio de:
<ul>
<li><a href="anoncvs.html">CVS An&oacute;nimo</a> (ver enlace).  La
orden es, esencialmente, <strong>cvs get ports</strong>.
<li>FTP An&oacute;nimo en 
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz">
ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz</a>.
Este archivo se actualiza cada noche.
<li><a href="cvsup.html">CVSup</a>.  Vea el ejemplo de c&oacute;mo usar
CVSup en <a href="cvsup.html#checkout">modo checkout</a>.
<li>su navegador de http, mediante la 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/ports/">interfaz de web
de CVS</a>.
</ul>

<p>
<a name="XFree86"></a>
<h3><font color="#0000e0">Los portes y XFree86</font></h3>

<p>
Hay algo de magia en los ficheros de configuraci&oacute;n de XFree86
para OpenBSD que permite que el &aacute;rbol de portes instale en
<em>/usr/local</em> las aplicaciones basadas en <em>imake</em>.

<p>
Desde la versi&oacute;n 2.9, OpenBSD incluye XFree86 4.0.3.  Si
est&aacute; usando una versi&oacute;n anterior junto con los binarios
para XFree86 del proyecto XFree86, es probable que tenga que aplicar el
parche <code>/usr/ports/infrastructure/patches/patch-xfree-4.0</code> a
la distribuci&oacute;n binaria de XFree86 4.0.x.

<p>
<a name="Example"></a>
<h3><font color="#0000e0">Ejemplo de utilizaci&oacute;n del &aacute;rbol
de portes</font></h3>

<p>
Suponiendo que hubiera conseguido obtener un &aacute;rbol de portes y
que quisiera compilar e instalar la herramienta de descompresi&oacute;n
de archivos <strong>unzip</strong>, podr&iacute;a hacer algo parecido a
esto:

<pre>
    % cd /usr/ports/archivers/unzip
    % su
    # make
    # make install
    # exit
</pre>

<p>
F&aacute;cil, &iquest;no es as&iacute;?  Especialmente si consideramos
todo lo que ha ocurrido en un plano de fondo:
<ul>
<li>Bajar los fuentes de unzip desde un sito de ftp,
<li>Comprobar la integridad del archivo de fuentes,
<li>Extraer los fuentes de unzip,
<li>Aplicar parches espec&iacute;ficos de OpenBSD,
<li>Configurar y compilar el programa,
<li>Crear un paquete binario en /usr/ports/packages,
<li>Instalar ese paquete.
</ul>

<p>
Con OpenBSD 3.0, casi todos los portes compilar&aacute;n paquetes de
forma autom&aacute;tica cuando se instalen.

<p>
Seg&uacute;n se van compilando portes, el directorio
<tt>/usr/ports/distfiles</tt> se va llenando con fuentes de programas, y
<tt>/usr/ports/packages</tt> se va llenando con paquetes de binarios.
Los usuarios con mala conexi&oacute;n pueden ver en la p&aacute;gina del
manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mirroring-ports&amp;sektion=7">mirroring-ports(7)</a>
una buena referencia sobre un modo eficiente de bajarse todos los
distfiles de una vez.  En OpenBSD-current, puede usar el gui&oacute;n
<em>/usr/ports/infrastructure/fetch/clean-old</em> para llevar un
seguimiento de los viejos programas en <em>distfiles</em>.  Note que el
CD de OpenBSD s&oacute;lo incluye el &aacute;rbol de fuentes y los
paquetes seleccionados.  Si quiere tener los fuentes de los programas en
distfiles, tendr&aacute; que obtenerlos por un medio distinto.

<p>
<a name="Advanced"></a>
<h3><font color="#0000e0">Uso avanzado del &aacute;rbol de
portes</font></h3>

<p>
El &aacute;rbol de portes tiene muchas funcionalidades para el usuario
avanzado que lo convierten en una herramienta que va m&aacute;s
all&aacute; de la simple instalaci&oacute;n.  Los usuarios avanzados es
posible que quieran cambiar los ficheros <em>makefile</em> (antes
deber&iacute;an leer la p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&amp;sektion=1">
make(1)</a>), o configurar varias variables para la l&iacute;nea de
&oacute;rdenes de <tt>make</tt> o en <em>/etc/mk.conf</em>.  Estas
variables se describen con todo lujo de detalles en la p&aacute;gina de
manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=bsd.port.mk&amp;sektion=5">bsd.port.mk(5)</a>
y en los documentos sobre portes que siguen.

<p>
<a name="Create"></a>
<h3><font color="#0000e0">C&oacute;mo crear nuevos portes</font></h3>

<p>
Si est&aacute; interesado en ayudar a expandir el &aacute;rbol de portes
de OpenBSD, antes que nada deber&iacute;a leer 
<a href="porting.html">porting.html</a>.  Esa p&aacute;gina hace
referencia a la
<a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/porters-handbook/index.html">Gu&iacute;a de Portadores de FreeBSD</a>,
as&iacute; como a la pol&iacute;tica de OpenBSD al respecto y a algunas
pistas que le servir&aacute;n de ayuda.

<p>
<a name="Lag"></a>
<h3><font color="#0000e0">Por qu&eacute; un porte est&aacute; desfasado
con respecto a su versi&oacute;n actual</font></h3>

<p>
La colecci&oacute;n de portes es un proyecto llevado a cabo por
voluntarios.  A veces, el proyecto no dispone de suficientes
desarrolladores para mantenerlo todo actualizado.  Los desarrolladores
suelen escoger aquello que consideran interesante y que pueden comprobar
en sus sistemas.  Cuantas m&aacute;s
<a href="goals.html#funding">donaciones</a> hayan, m&aacute;s sistemas
habr&aacute;n para la comprobaci&oacute;n de portes.

<p>
Debido a esto, algunos portes en concreto pueden estar desfasados con
respecto a sus versiones actuales.  En la colecci&oacute;n de portes
puede haber una versi&oacute;n de enero de un programa mientras que la
nueva versi&oacute;n del programa fue lanzada por sus desarrolladores en
mayo, varios meses despu&eacute;s.  A menudo, &eacute;sta puede ser una
decisi&oacute;n tomada a conciencia;  la nueva versi&oacute;n puede dar
alg&uacute;n problema en OpenBSD que el mantenedor del porte est&aacute;
intentando resolver, o alg&uacute;n problema que haga que la nueva
vresi&oacute;n sea peor que la antigua:  OpenBSD puede tener
<a href="goals.html">objetivos</a> diferentes que los desarrolladores
del programa en cuesti&oacute;n, lo que a veces da como resultado unas
funcionalidades y un dise&ntilde;o o implementaci&oacute;n que no son
deseables bajo el punto de vista de los desarrolladores de OpenBSD.  La
actualizaci&oacute;n tambi&eacute;n se puede postponer debido a que la
nueva versi&oacute;n no sea considerada como crucial.

<p>
Si de verdad necesita una nueva versi&oacute;n de un porte, puede
preguntar al <tt>MANTENEDOR</tt> del porte si puede actualizarlo (vea
<a href="#Help">abajo</a> c&oacute;mo descubrir qui&eacute;n es el
mantenedor);  si puede enviar parches Vd. mismo, mucho mejor.  Para
crear parches apropiados debe leer la
<a href="porting.html">documentaci&oacute;n sobre c&oacute;mo portar
programas</a>.

<p>
<a name="Help"></a>
<h3><font color="#0000e0">Problemas y direcciones de
contacto</font></h3>

<p>
Si tiene problemas con un porte de la colecci&oacute;n, por favor
escriba al mantenedor del porte.  Para saber qui&eacute;n es el
mantendor del porte puede hacer como en este ejemplo:

<pre>
       % cd /usr/ports/archivers/unzip
       % make show VARNAME=MAINTAINER
</pre>

<p>
De forma alternativa, si no existiera un mantenedor, o si no pudiera
contactar con &eacute;l, por favor env&iacute;e un mensaje a la lista de
correo de portes de OpenBSD,
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a>.  Por favor, no
use misc@openbsd.org para preguntas relacionadas con los portes.  Las
correcciones siempre se agradecen pero en cualquier caso, por favor
incluya:

<ul>
<li>La salida de <code>uname -a</code>,
<li>Su versi&oacute;n de OpenBSD, incluido cualquier parche que haya
instalado,
<li>Una descripci&oacute;n completa del problema.
</ul>

<p>
Para aquellos portes que no compilen correctamente, casi siempre se
requiere una transcripci&oacute;n completa del proceso de
compilaci&oacute;n e instalaci&oacute;n.  Para esto puede usar el
gui&oacute;n (<em>script</em>) <em>portslogger</em>, que se encuentra en
<tt>/usr/ports/infrastructure/build</tt>.  Un ejemplo de c&oacute;mo
funciona <em>portslogger</em>:

<pre>
       % cd /usr/ports/archivers/unzip
       % su
       # mkdir -p ~/portslogs
       # make clean install 2&gt;&amp;1 | /usr/ports/infrastructure/build/portslogger \
               ~/portslogs
</pre>

<p>
Despu&eacute;s de esto deber&iacute;a tener un fichero de registro
(<em>logfile</em>) en su directorio <em>~/portslogs</em>, que puede
enviar al mantenedor del porte.  Aseg&uacute;rese de que no est&eacute;
usando ninguna opci&oacute;n especial para compilar el porte, como por
ejemplo en <tt>/etc/mk.conf</tt>.

<p>
De forma alternativa puede
<ul>
<li>Usar
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=script&amp;sektion=1">script(1)</a>
para crear una transcripci&oacute;n completa del proceso.  No elemine la
informaci&oacute;n sobre la configuraci&oacute;n.
<li>Enviar la salida de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1">pkg_info(1)</a>
adjunta al mensaje si cree que tiene alguna relevancia (por poca que
pueda ser).
<li>Los errores del compilador interno
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gcc&amp;sektion=1">gcc(1)</a>
le indicar&aacute;n que informe sobre el error a la lista de correo de
gcc.  Ahorrar&aacute; tiempo si sigue esta indicaci&oacute;n, para la
que debe incluir, por lo menos, los distintos ficheros producidos por
<tt>gcc -save-temps</tt>.
</ul>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ports.html,v 1.73 ]<br>
$Translation: ports.html,v 1.38 2003/12/16 22:35:07 horacio Exp $<br>
$OpenBSD: ports.html,v 1.39 2003/12/16 22:42:11 horacio Exp $
</small>
</body>
</html>
