<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" CONTENT="Cómo crear un porte para OpenBSD">
<meta name="keywords" content="openbsd,portes,ports">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1997-2002 de OpenBSD">
<title>C&oacute;mo crear un porte para OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
</head>

<body text="#000000" bgcolor="#ffffff" link="#23238e">
<!-- máx. 72 caracteres por línea -->
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<h2><font color="#e00000">C&oacute;mo crear un porte para
OpenBSD</font></h2>

Suponiendo que ya hubiera compilado su programa favorito en su sistema
OpenBSD y que quisiera compartir su esfuerzo convirti&eacute;ndolo en un
porte, &iquest;c&oacute;mo podr&iacute;a hacerlo?

<p>
Lo m&aacute;s importante que debe hacer es <strong>comunicarlo</strong>.
Pregunte en <a href="mailto:ports@openbsd.org">ports@openbsd.org</a> por
si alguien ya estuviera trabajando en lo mismo.
<em>Comun&iacute;queselo al autor original del programa</em>, e incluya
los problemas que pueda encontrar.  Si aparece alg&uacute;n error en la
informaci&oacute;n sobre la licencia h&aacute;gaselo saber.  Si tuvo que
evitar bucles para crear el porte, d&iacute;gale qu&eacute; es lo que
debe solucionar.  Si s&oacute;lo est&aacute;n desarrollando para Linux y
da la impresi&oacute;n de que les trae sin cuidado el resto del mundo
Unix, intente hacer que cambien de opini&oacute;n.

<p>
La <strong>COMUNICACI&Oacute;N</strong> es lo que marca la diferencia
entre un porte con &eacute;xito y un porte que tarde o temprano
ser&aacute; abandonado por todos.

<p>
Antes que nada eche un vistazo a la informaci&oacute;n sobre portes en
esta p&aacute;gina y luego lea los documentos a los que se hace
referencia, especialmente a la <a href="checklist.html">lista de
comprobaci&oacute;n</a> de portes de OpenBSD.

<p>
&iexcl;Haga pruebas una y otra vez! &nbsp;&nbsp;y, finalmente...
&iexcl;vuelva a repasarlas!

<p>
Env&iacute;e el porte.  Haga un archivo comprimido con tar y gzip del
directorio del porte.  Lo puede poner en un servidor p&uacute;blico de
FTP o HTTP y enviar la direcci&oacute;n de &eacute;ste a 
<a href="mailto:ports@openbsd.org">ports@openbsd.org</a>, o enviarlo
directamente a esta direcci&oacute;n con codificado MIME.  Elija el
m&eacute;todo que m&aacute;s le convenga.

<h3><font color="#0000e0">&Iacute;ndice de documentaci&oacute;n para
portar programas</font></h3>
<ul>
<li><a href="#Avail">Informaci&oacute;n disponible para portar
programas</a></li>
<li><a href="#Policy">Pol&iacute;tica sobre portes de OpenBSD</a></li>
<li><a href="#Security">Recomendaciones de seguridad</a></li>
<li><a href="#Generic">Consejos generales para portar</a></li>
<li><a href="#Other">Otros consejos de ayuda</a></li>
</ul>

<h3><font color="#0000e0"><a name="Avail">Informaci&oacute;n
disponible</a></font></h3>

<ul>
<li><a href="checklist.html">Lista de comprobaci&oacute;n</a> de portes
de OpenBSD.
<li>La p&aacute;gina del manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=bsd.port.mk&amp;sektion=5">bsd.port.mk(5)</a>.
Contiene la informaci&oacute;n sobre la infraestructura de los portes
que se incluye al final de los ficheros <em>Makefile</em> de cada porte.
Todav&iacute;a hay algunos comentarios al inicio del mismo fichero, pero
la mayor parte de la informaci&oacute;n &uacute;til est&aacute;
documentada.
<li>Algunas diferencias con otros sistemas de portes de BSD, sobre todo
un sumario de las <a href="../porting/es/diffs.html">diferencias de
infraestructura</a>.
<li><a href="../porting/es/libraries.html">C&oacute;mo usar las
bibliotecas compartidas en el sistema de portes de OpenBSD</a>.  Las
reglas que contiene son <strong>muy importantes</strong> si se usan
bibliotecas compartidas, en especial si pkg_update funciona alg&uacute;n
d&iacute;a...
<li><a href="audio-port.html">C&oacute;mo portar aplicaciones de audio a
OpenBSD</a>
<li>La documentaci&oacute;n 
<a href="http://www.netbsd.org/Documentation/software/packages.html">NetBSD Package System</a>
describe la versi&oacute;n de NetBSD del sistema de portes de FreeBSD, y
es muy &uacute;til.
<li>La <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/porters-handbook/index.html">Gu&iacute;a de Portadores de FreeBSD</a>.
Es la biblia para los portes en FreeBSD.
<li>La lista de correo para los portes de OpenBSD 
<a href="mailto:ports@openbsd.org">ports@OpenBSD.org</a>.
</ul>

<p>
<h3><font color="#0000e0"><a name="Policy">Pol&iacute;tica sobre portes
de OpenBSD</a></font></h3>

<ul>
<li>Debido a que <code>/usr/local</code> es un sistema de archivo con
frecuencia compartido entre varias m&aacute;quinas mediante NFS, OpenBSD
NO usa <code>/usr/local/etc/rc.d</code>.  Por este motivo los ficheros
de configuraci&oacute;n espec&iacute;ficos de cada m&aacute;quina no se
pueden guardar en <code>/usr/local</code>, y por tanto <code>/etc</code>
es el repositorio central para los ficheros de configuraci&oacute;n
espec&iacute;ficos de cada m&aacute;quina.  M&aacute;s a&uacute;n, la
pol&iacute;tica de OpenBSD es la de no actualizar nunca de forma
autom&aacute;tica los ficheros en <code>/etc</code>.  Los portes que
necesitan alg&uacute;n tipo de configuraci&oacute;n de arranque deben
avisar al administrador del sistema de lo que &eacute;ste debe hacer en
lugar de instalar ficheros a ciegas.

<li>Las p&aacute;ginas de manual en OpenBSD NO est&aacute;n comprimidas.

<li>OpenBSD NO requiere <code>-lcrypt</code>.<br> El cifrado con DES es
parte del <code>libc</code> t&iacute;pico.

<li>OpenBSD tiene un espacio de nombre separado para los usuarios y
grupos creados por los portes.  V&eacute;se
<code>/usr/ports/infrastructure/db/user.list</code> para m&aacute;s
detalles.

<li>OpenBSD tiene una fuerte orientaci&oacute;n hacia la seguridad.  Se
aconseja leer y asimilar la <a href="#Security">secci&oacute;n sobre
seguridad</a> en esta p&aacute;gina.

<li>Aseg&uacute;rese de que a&ntilde;ade la marca de CVS
<code>&#36;OpenBSD&#36;</code> al fichero de Makefile.  Si importa un
porte desde otro sistema, aseg&uacute;rese de que tambi&eacute;n
conserva la marca en el fichero Makefile.  En el caso de que el porte se
haga desde FreeBSD substituya la marca de FreeBSD
<code>&#36;Id&#36;</code> por la marca <code>&#36;FreeBSD&#36;</code>.

<li>El objetivo a alcanzar es que todas las aplicaciones portadas tengan
soporte en OpenBSD.  Para conseguirlo <strong>debe</strong> informar
ampliamente sobre cualquier parche para OpenBSD al mantenedor de la
aplicaci&oacute;n.
</ul>

<p>
<h3><font color="#0000e0"><a name="Security">Recomendaciones de
seguridad</a></font></h3>

Existen muchos problemas de seguridad a los que debemos prestar una
atenci&oacute;n especial.  Si no se est&aacute; absolutamente seguro de
lo que se est&aacute; haciendo, por favor pida ayuda a la lista de
correo de <a href="mailto:ports@openbsd.org">portes</a>.

<ul>
<li><em>NO</em> use c&oacute;digo en estado alpha o beta cuando
est&eacute; creando un porte.  Use la revisi&oacute;n o versi&oacute;n
m&aacute;s actual.

<li>Cualquier programa que vaya a ser instalado como servidor
deber&iacute;a ser escaneado en busca de desbordamientos en la memoria
intermedia (&quot;buffer overflows&quot;), especialmente en el caso de
utilizaci&oacute;n insegura de
<code>strcat/strcpy/strcmp/sprintf</code>.  Como regla general,
<code>sprintf</code> se debe substituir siempre con
<code>snprintf</code>.

<li>No use nunca nombres de ficheros en lugar de seguridad real.
Existen numerosas condiciones de carrera para las que no se tiene un
debido control.  Por ejemplo, un atacante que ya haya obtenido
privilegios de usuario en sus m&aacute;quinas puede substituir ficheros
en <code>/tmp</code> con enlaces simb&oacute;licos a ficheros m&aacute;s
estrat&eacute;gicos, como <code>/etc/master.passwd</code>.

<li>Tambi&eacute;n, un ejemplo a tener en cuenta es que tanto
<code>fopen</code> como <code>freopen</code> <strong>generan un nuevo
fichero o abren ficheros ya existentes</strong> con permisos para
escritura.  Un atacante puede crear un enlace simb&oacute;lico desde
<code>/etc/master.passwd</code> a <code>/tmp/addrpool_dump</code>.  En
cuanto Vd. lo abra, el fichero de su contrase&ntilde;a ser&aacute;
filtrado.  S&iacute;, incluso con un <code>unlink</code> antes, que tan
s&oacute;lo minimizar&iacute;a el riesgo.  Use <code>open</code> con
<code>O_CREATIO_EXCL</code> y <code>fdopen</code> en lugar de lo
anterior.

<li>Otro problema muy com&uacute;n es el de la funci&oacute;n
<code>mktemp</code>.  Haga caso a los avisos del enlazador de bsd sobre
su uso.  <strong>Se deben solucionar</strong>.  Esto no es tan sencillo
como <code>s/mktemp/mkstemp/g</code>.  <br> Para m&aacute;s indicaciones
sobre este respecto vaya a la p&aacute;gina de manual de
<code>mktemp(3)</code> en OpenBSD-current.  Un ejemplo de c&oacute;digo
correcto que use <code>mkstemp</code> puede ser el de los fuentes de
<code>ed</code> o <code>mail</code>.  Se puede encontrar un tipo poco
usual de c&oacute;digo que use correctamente <code>mktemp</code> en el
porte <code>rsync</code>.

<li>Que lo pueda leer no implica que lo deba leer.  Un agujero muy
conocido de esta naturaleza era el del problema con <code>startx</code>.
Al ser un programa setuid, se pod&iacute;a ejecutar con cualquier
fichero como gui&oacute;n (&quot;script&quot;).  Si el fichero no era un
gui&oacute;n v&aacute;lido del int&eacute;rprete de &oacute;rdenes
(&quot;shell&quot;), le segu&iacute;a un mensaje de error junto con la
primera l&iacute;nea de error del fichero, sin comprobar m&aacute;s
permisos.  Considerando que los ficheros shadow passwd a menudo
comienzan con una entrada de root, obtener esta primera l&iacute;nea era
bastante &uacute;til para un atacante.  No abra un fichero y a
continuaci&oacute;n ejecute <code>fstat</code> en el descriptor abierto
para comprobar lo podr&iacute;a haber abierto (o el atacante
jugar&aacute; con <code>/dev/rst0</code> y rebobinar&aacute; su cinta);
&aacute;bralo con el uid/gid/grouplist correcto.

<li>No use nada que cree un proceso hijo de una shell en programas
setuid antes de haber eliminado sus privilegios.  Esto incluye
<code>popen</code> y <code>system</code>.  En su lugar use
<code>fork</code>, <code>pipe</code> y <code>execve</code>.

<li>Pase descriptores abiertos en lugar de nombres de archivos a otros
programas para evitar condiciones de carrera.  Aun en el caso de que un
programa no acepte descriptores de ficheros, puede usar
<code>/dev/fd/0</code>.

<li>Los derechos de acceso van adjuntos a los descriptores de ficheros.
Si necesita derechos setuid para abrir un fichero, abra ese fichero y
elimine sus privilegios.  Esto es un arma de doble filo:  incluso
despu&eacute;s de haber eliminado sus privilegios, deber&aacute;
observar esos descriptores.

<li>Evite root setuid siempre que pueda.  En principio puede hacer
cualquier cosa, pero los derechos de root se necesitan en raras
ocasiones, tal vez excepto para crear portes de &quot;socket&quot; con
un n&uacute;mero por debajo de 1024.  En este caso tal vez sea mejor
controlarlo con <code>inetd</code> y simplemente a&ntilde;adir las
entradas relevantes a <code>inetd.conf</code>.  Debe conocer el
&quot;magic&quot; apropiado requerido para poder codificar
&quot;d&aelig;mons&quot;.  Se podr&iacute;a decir que no se tienen
programas setuid comerciales si no se sabe c&oacute;mo hacerlo.

<li>Use setgid en lugar de setuid.  Aparte de los ficheros
espec&iacute;ficos que necesitan los programas setgid, la mayor&iacute;a
de ficheros no tienen permisos de escritura para grupo.  Por tanto, un
problema de seguridad en un programa setgid no comprometer&aacute; tanto
su sistema;  con s&oacute;lo derechos de grupo, lo peor que podr&aacute;
hacer un atacante es cambiar la tabla de puntuaci&oacute;n de un juego o
algo parecido.  Vea el porte <code>xkobo</code> como un ejemplo de un
cambio de este tipo.

<li>No conf&iacute;e en ficheros con permisos de escritura para grupo.
Aunque hayan pasado una auditor&iacute;a, los programas setgid no se
perciben como un agujero de seguridad en potencia.  Por lo tanto,
cualquier cosa que pueda ser falsificada no deber&iacute;a ser
considerarada como informaci&oacute;n reservada.

<li>&iexcl;No conf&iacute;e en su entorno!  Esto incluye cosas tan
sencillas como su <code>PATH</code> (nunca use <code>system</code> con
un nombre no cualificado y evite <code>execvp</code>), pero tampoco de
entornos menos obvios como su <code>locale</code>,
<code>timezone</code>, <code>termcap</code> y otros.
<strong>Nunca</strong> use <code>system</code> en programas
privilegiados;  en su lugar cree su propia orden de l&iacute;nea, un
entorno controlado, y una llamada directa a <code>execve</code>.  La
p&aacute;gina de manual de <code>perlsec</code> es una buena tutorial
sobre estos problemas.

<li>Nunca use guiones de ejecuci&oacute;n del int&eacute;rprete de
&oacute;rdenes (&quot;shell scripts&quot;) setuid.  &Eacute;stos son
inseguros por definici&oacute;n.  Envu&eacute;lvalos dentro de
c&oacute;digo C que asegure un entorno apropiado.  Por otra parte, las
caracter&iacute;sticas de OpenBSD incluyen guiones de perl seguros.

<li>Tenga cuidado con el cargador din&aacute;mico.  Si est&aacute;
ejecutando setuid s&oacute;lo ejecutar&aacute; bibliotecas que hayan
sido escaneadas con <code>ldconfig</code>.  Setgid no basta.

<li>Las bibliotecas din&aacute;micas son complicadas.  El c&oacute;digo
C++ presenta un problema parecido.  B&aacute;sicamente, las bibliotecas
pueden tomar alguna acci&oacute;n bas&aacute;ndose en su entorno antes
incluso de que su programa principal haya podido comprobar su estado
setuid.  OpenBSD <code>issetugid</code> trata este problema desde el
punto de vista del escritor de bibliotecas.  No intente portar
bibliotecas a menos que conozca este tema a la perfecci&oacute;n.
</ul>

<p>
<h3><font color="#0000e0"><a name="Generic">Consejos
generales</a></font></h3>

<ul>
<li><code>__OpenBSD__</code> se deber&iacute;a usar con cuentagotas o
mejor no usarlo en absoluto.  Construcciones como
    
    <pre>
        #if defined(__NetBSD__) || defined(__FreeBSD__)
    </pre>
    
son a menudo inapropiadas.  No a&ntilde;ada <code>__OpenBSD__</code> a
&eacute;stas a ciegas.  En lugar de esto, intente imaginar qu&eacute; es
lo que est&aacute; ocurriendo y qu&eacute; es lo que se necesita.  Las
p&aacute;ginas de manual son de gran utilidad para estos casos, ya que
incluyen comentarios de tipo historial en los que se menciona
cu&aacute;ndo una caracter&iacute;stica particular se integr&oacute; en
<code>BSD</code>.  Contrastar el valor num&eacute;rico de
<code>BSD</code> con el de las versiones conocidas es por lo general la
forma correcta de hacerlo.  V&eacute;ase
<a href="ftp://ftp.netbsd.org/pub/NetBSD/packages/pkgsrc/Packages.txt">
the NetBSD package guide</a> para obtener m&aacute;s informaci&oacute;n
al respecto.

<li>Definir <code>BSD</code> no es una buena idea, al contrario.
Intente incluir <code>sys/parm.h</code>.  Esto no s&oacute;lo define
<code>BSD</code>, sino que tambi&eacute;n le da un valor apropiado.  El
fragmento de c&oacute;digo correcto deber&iacute;a ser as&iacute;:
    
    <pre>
        #if (defined(__unix__) || defined(unix)) &amp;&amp; !defined(USG)
        #include &lt;sys/param.h&gt;
	#endif
    </pre>
    
<li>Base sus comprobaciones en las caracter&iacute;sticas, no en
sistemas operativos espec&iacute;ficos.  A la larga es mucho mejor
comprobar si <code>tcgetattr</code> funciona que si est&aacute;
funcionando en BSD 4.3 o posterior, o en SystemVR4.  Este tipo de
pruebas s&oacute;lo confunden.  La manera de hacerlas es, por ejemplo,
comprob&aacute;ndolo para un sistema en particular, configurar los
ficheros <code>define</code> con <code>HAVE_TCGETATTR</code>, y a
continuaci&oacute;n proceder con el sistema siguiente.  Esta
t&eacute;cnica separa las comprobaciones de caracter&iacute;sticas de
los sistemas operativos espec&iacute;ficos.  De forma r&aacute;pida,
otro portado puede as&iacute; simplemente a&ntilde;adir todas las
definiciones <code>-DHAVE_XXX</code> en el fichero Makefile.
Tambi&eacute;n es posible escribirlo o a&ntilde;adirlo a un gui&oacute;n
de configuraci&oacute;n para comprobar esa caracter&iacute;stica y
a&ntilde;adirla de modo autom&aacute;tico.  Como un ejemplo de lo que no
se debe hacer, compruebe los fuentes de nethack 3.2.2: asume un
mont&oacute;n de cosas basadas en el tipo del sistema.  La
mayor&iacute;a de éstas est&aacute;n obsoletas y ya no reflejan la
realidad:  las funciones POSIX son m&aacute;s &uacute;tiles que las
viejas diferencias entre BSD y SystemV, hasta el punto que algunas
funciones bsd tradicionales s&oacute;lo conservan el soporte mediante
bibliotecas de compatibilidad.

<li>Evite incluir ficheros que incluyan otras inclusiones que...
Primero, porque no es eficiente.  Su proyecto acabar&aacute; incluyendo
un fichero que incluya todo.  Tambi&eacute;n, porque hace que algunos
problemas sean dif&iacute;ciles de solucionar.  Se hace m&aacute;s
dif&iacute;cil <em>no</em> incluir un fichero particular en un momento
dado.

<li>Evite macros estrafalarias.  No definir una macro que fue definida
por un fichero de cabecera es una mala idea.  Definir macros para
obtener un comportamiento espec&iacute;fico de un fichero
<code>include</code> tambi&eacute;n es una mala idea: los modos de
compilaci&oacute;n deber&iacute;an ser globales.  Si quiere obtener un
comportamiento POSIX d&iacute;galo, y a&ntilde;ada <code>#define
POSIX_C_SOURCE</code> en todo el proyecto, no s&oacute;lo cuando lo crea
conveniente.

<li>Nunca escriba prototipos de funciones de sistema.  Todos los
sistemas modernos, incluido OpenBSD, tienen una localizaci&oacute;n
t&iacute;pica para estos prototipos.  Dichas localizaciones es probable
que sean <code>unistd.h</code>, <code>fcntl.h</code>, o
<code>termios.h</code> entre otras.  La p&aacute;gina de manual suele
indicar d&oacute;nde se puede encontrar el prototipo.  Es posible que
necesite otras cuantas macros de <code>HAVE_XXX</code> para conseguir el
fichero correcto.  No se preocupe por incluir el mismo fichero dos
veces, los ficheros <code>include</code> tienen m&eacute;todos de
prevenci&oacute;n contra esto.
<br>
Si alg&uacute;n sistema defectuoso necesita que escriba el prototipo, no
lo imponga en otros sistemas.  El uso de prototipos propios no
funcionar&aacute; porque pueden usar tipos que son equivalentes en su
sistema, pero no son portables a otros sistemas (<code>unsigned
long</code> en lugar de <code>size_t</code>), o resultar&aacute;n en
estados incorrectos de <code>const</code>.  Adem&aacute;s, algunos
compiladores como el gcc propio de OpenBSD, pueden hacer un trabajo
mejor como algunas funciones muy frecuentes como <code>strlen</code> si
incluye el fichero de cabecera correcto.

<li>No use el nombre de una funci&oacute;n de sistema t&iacute;pica para
nada m&aacute;s.  Si quiere escribir su propia funci&oacute;n,
d&eacute;le su propio nombre, y llame a esa funci&oacute;n en todas
partes.  Si desea volver a la funci&oacute;n de sistema por
definici&oacute;n, s&oacute;lo tiene que comentar su c&oacute;digo y
definir su propio nombre en la funci&oacute;n del sistema.  No lo haga
de otro modo.  El c&oacute;digo deber&iacute;a ser del siguiente modo

<pre>
       /* prototype part */
       #ifdef USE_OWN_GCVT
       char *foo_gcvt(double number, size_t ndigit, char *buf);
       #else
       /* include correct file */
       #include &lt;stdlib.h&gt;
       /* use system function */
       #define foo_gcvt  gcvt
       #endif

       /* definition part */
       #ifdef USE_OWN_GCVT
       char *foo_gcvt(double number, size_t ndigit, char *buf)
          {
          /* proper definition */
          }

       /* typical use */
       s = foo_gcvt(n, 15, b);
       </pre>

</ul>

<p>
<h3><font color="#0000e0"><a name="Other">Otros consejos</a></font></h3>

<ul>
<li>Las versiones recientes de <code>bsd.port.mk</code> definen el
camino de los instaladores.  En particular, definen que se busque en
<code>/usr/bin</code> y <code>/bin</code> <em>antes que</em>
<code>/usr/local/bin</code> y <code>/usr/X11R6/bin</code>.

<li><em>NO</em> genere bibliotecas compartidas si se encuentra definido
<code>${NO_SHARED_LIBS}</code> (cuidado, s&oacute;lo se puede definir
despu&eacute;s de incluir <code>bsd.port.mk</code>).  Si su porte tiene
un GNU configure, a&ntilde;ada la l&iacute;nea <code>CONFIGURE_ARGS +=
${CONFIGURE_SHARED}</code> al fichero Makefile.

<li>El uso de una funcionalidad que haya aparecido en una versi&oacute;n
reciente de <code>bsd.port.mk</code> es aceptable, ya que se supone que
los usuarios deben actualizar sus &aacute;rboles de portes al completo,
incluido <code>bsd.port.mk</code>.  Ahora NEED_VERSION est&aacute;
obsoleto.

<li>En OpenBSD <code>curses.h/libcurses/libtermlib</code> es el
&laquo;nuevo curses&raquo;.  Cambio:<br>
<code>ncurses.h ==&gt; curses.h</code><br>
El &laquo;viejo (BSD) curses&raquo; est&aacute; disponible definiendo
<code>_USE_OLD_CURSES_</code> antes de incluir <code>curses.h</code>
(por lo general en un fichero Makefile) y enlaz&aacute;ndolo con
<code>-locurses</code>.

<li>En OpenBSD el terminal se ha actualizado del viejo
<code>sgtty</code> de BSD al nuevo <code>tcgetattr</code> de POSIX.
Evite el viejo estilo en c&oacute;digo nuevo.  Algo de c&oacute;digo es
posible que defina <code>tcgetattr</code> como sin&oacute;nimo del viejo
<code>sgtty</code>, pero esto es como mucho una medida temporal en
OpenBSD.  El c&oacute;digo fuente de <code>xterm</code> es un buen
ejemplo de lo que no hay que hacer.  Intente obtener la funcionalidad de
su sistema correctamente:  lo que quiere es un tipo que recuerde el
estado de su terminal (probablemente typedef), una funci&oacute;n que
extraiga el estado actual, y una funci&oacute;n que configure un nuevo
estado.  Las funciones que modifican este estado son m&aacute;s
dif&iacute;ciles, ya que tienden a variar seg&uacute;n el sistema.
Tampoco olvide que tendr&aacute; que manejar casos en los que no
est&eacute; conectado a un terminal, y en los que se necesita poder
manejar se&ntilde;ales:  no s&oacute;lo de terminaci&oacute;n, sino
tambi&eacute;n de fondo (<code>SIGTSTP</code>).  Deber&iacute;a dejar
siempre el terminal en un buen estado.  Lleve a cabo verificaciones en
int&eacute;rpretes de &oacute;rdenes (&quot;shells&quot;) m&aacute;s
viejos como sh, que no reconfiguren el terminal de ning&uacute;n modo al
terminar un programa.

<li>Los termcap/terminfo y curses m&aacute;s modernos, como los que se
incluyen con OpenBSD, incluyen secuencias t&iacute;picas para el control
de terminales de color.  Si es posible deber&iacute;a usar &eacute;stas,
volviendo a las secuencias de color t&iacute;picas de ANSI en otros
sistemas.  Sin embargo, las descripciones de algunos terminales
todav&iacute;a no se han actualizado, y es posible que necesite poder
especificar estas secuencias de modo manual.  &Eacute;ste es el modo en
que lo hace vim.  Esto no es estrictamente necesario.  Excepto en casos
de programas privilegiados, por lo general es posible anular una
definici&oacute;n termcap mediante la variable <code>TERMCAP</code> y
hacer que funcione correctamente.

<li>La sem&aacute;ntica de se&ntilde;ales es complicada, y var&iacute;a
de un sistema a otro.  Use <code>sigaction</code> para asegurarse
sem&aacute;nticas espec&iacute;ficas, junto con otras llmadas al sistema
cuya referencia puede encontrar en las p&aacute;ginas de manual.

</ul>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: porting.html,v 1.46 2003/06/22 13:24:32 sturm Exp ]<br>
$Translation: porting.html,v 1.22 2003/06/22 21:38:08 horacio Exp $<br>
$OpenBSD: porting.html,v 1.21 2003/06/27 20:42:46 jufi Exp $
</small>
</body>
</html>
