<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
    <meta name="resource-type" content="documento">
    <meta name="description" content="Guía de pruebas de los portes de OpenBSD">
    <meta name="keywords" content="openbsd,ports,test">
    <meta name="distribution" content="global">
    <meta name="copyright" content="copyright 2002-2004 de OpenBSD.">
    <title>Gu&iacute;a de comprobaciones para los Portes de
    OpenBSD</title>
  </head>

  <body text="#000000" bgcolor="#ffffff" link="#23238e">
  <!-- máx. 72 caracteres por línea -->

    <a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a> 

    <h2><font color="#e00000">Gu&iacute;a de comprobaciones para los
    Portes</font></h2>
    <hr>

    <h2><font color="#0000e0">Index</font></h2>

    <ul>
      <li><a href="#Introduction">Introducci&oacute;n</a>

      <li><a href="#How">C&oacute;mo</a>

      <li><a href="#First">Primeros pasos</a>

      <li><a href="#Testing">Pruebas</a>

      <li><a href="#Commenting">Comentarios</a>

      <li><a href="#More">M&aacute;s verificaciones</a>
    </ul>
    <hr>

    <h2><a name="Introduction"><font color="#0000e0">
    Introducci&oacute;n</font></a></h2>

    <p>
    El <a href="ports.html">&aacute;rbol de portes</a> es una gran pieza
    de trabajo que permite que los usuarios de OpenBSD puedan utilizar
    programas de terceros sin tener que aplicar parches, configurarlos,
    ni instalar cada uno de ellos de forma individual.  Esta tarea la
    realiza un grupo de voluntarios que pasan su tiempo portando,
    comprobando y verificando aplicaciones en todo el abanico de
    plataformas de OpenBSD.  Muchas personas creen que no pueden ayudar
    en este proceso debido a que no disponen de los conocimientos
    necesarios;  esto no es cierto, pueden ayudar a que la tarea de los
    portadores se realice de forma m&aacute;s r&aacute;pida y eficiente.

    <h2><a name="How"><font color="#0000e0">
    C&oacute;mo</font></a></h2>

    <p>
    Comprobando y verificando el funcionamiento de los nuevos portes que
    se env&iacute;en a la <a href="mail.html">lista de correo de
    portes</a>.  De este modo se puede reducir el tiempo de entrega e
    incrementar la cantidad de portes que se entreguen (&iexcl;muchos
    portes no llegan a entregarse porque no han sido comprobados!).

    <h2><a name="First"><font color="#0000e0">
    Primeros pasos</font></a></h2>

    <p>
    La creaci&oacute;n de nuevos portes se lleva a cabo sobre la
    <a href="../plus.html">versi&oacute;n de desarrollo</a> del sistema
    (OpenBSD-<em>current</em>);  no es posible garantizar el correcto
    funcionamiento de estos nuevos portes en otras versiones.  Esto
    implica que para poder realizar pruebas antes es necesario
    actualizar el &aacute;rbol del sistema y de los portes a la
    versi&oacute;n de desarrollo (las instrucciones para hacerlo se
    encuentran en la p&aacute;gina de <a href="anoncvs.html">anoncvs</a>
    y en el documento sobre
    <a href="../faq/es/upgrade-minifaq.html">Actualizaci&oacute;n</a> de
    las preguntas frecuentes de OpenBSD).  Tambi&eacute;n es
    recomendable estar suscrito en la <a href="mail.html">lista de
    correo <em>ports-changes</em></a>.  En esta lista se notifican los
    nuevos portes o los actualizados, y cualquier otro cambio en el
    &aacute;rbol de portes.
    
    <h2><a name="Testing"><font color="#0000e0">
    Pruebas</font></a></h2>

    <p>
    Los env&iacute;os de portes a las listas de correo son de dos tipos:
    portes nuevos y actualizaciones.  Los nuevos suelen enviarse como
    archivos comprimidos adjuntos al mensaje o simplemente indicando una
    direcci&oacute;n de Internet en la que se encuentren.  Una buena
    pr&aacute;ctica es la de extraerlos en un directorio
    <tt>/usr/ports/misportes/</tt> y probarlos desde ese directorio.
    Las actualizaciones suelen ser un fichero tipo <tt>diff</tt> que
    contiene las diferencias entre el porte actualizado y el que hay en
    el &aacute;rbol de portes de desarrollo (ports<em>-current</em>).
    En este caso es recomendable copiar el porte en el directorio
    <tt>misportes/</tt> y aplicarle el fichero <tt>.diff</tt> para
    evitar errores en el &aacute;rbol de portes.

    <p>
    Es necesario componer el porte paso a paso para verificar que todos
    los objetivos se alcancen de forma correcta (v&eacute;ase
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&amp;sektion=7&amp;">ports(7)</a>):

    <ul>
      <li><i>fetch</i>
        <ul>
	 <li>Verifica que los ficheros de distribuci&oacute;n
	 (<em>distfile</em>) que se hayan bajado sean correctos.  Hay
	 que comprobar que todos los <tt>MASTER_SITES</tt> que se
	 especifican sean v&aacute;lidos.
        </ul>

      <li><i>checksum</i>
        <ul>
	 <li>Verifica que los ficheros de distribuci&oacute;n
	 (<em>distfile</em>) concuerden con las sumas de
	 comprobaci&oacute;n registradas en el fichero
	 <tt>distinfo</tt>.
        </ul>

      <li><i>extract</i>
        <ul>
	<li>Cada uno de los ficheros de distribuci&oacute;n
	deber&iacute;a instalar cualquier programa del que dependan
	(como bzip2) de antemano.
	</ul>

      <li><i>patch</i>
        <ul>
        <li>El resultado de aplicar un parche debe ser limpio, sin que
	produzca ning&uacute;n error ni aviso.
        <li>No debe quedar ning&uacute;n fichero <tt>.orig</tt> en el
	directorio <tt>patches</tt>.
	<li>Otro error com&uacute;n es el de incluir etiquetas de RCS en
	un parche;  esto produce un error cuando se env&iacute;a el
	porte al repositorio y se expande la etiqueta de RCS.
        </ul>

      <li><i>configure</i>
        <ul>
        <li>Comprueba que los guiones <tt>configure</tt> detecten
	correctamente las funcionalidades en la plataforma
	correspondiente.
        <li>GNU libtool es notable por sus 'funcionalidades' no
	deseables en OpenBSD;  hay que asegurarse de que el porte
	utiliza una versi&oacute;n reciente que genere las bibliotecas
	correctas para la arquitectura de la que se trate.
        <li>El gui&oacute;n <tt>configure</tt> no deber&iacute;a
	detectar aplicaciones que ya se encuentren en el sistema sin que
	se hayan indicado de modo expl&iacute;cito como dependencias en
	el porte.
        </ul>

      <li><i>build</i>
        <ul>
	<li>Comprueba errores de compilaci&oacute;n y avisos
	sospechosos.
        <li>Alerta sobre problemas con
	<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=tmpnam&amp;sektion=3&amp;">tmpnam(3)</a>
	que deber&iacute;an ser resueltos usando
      <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mkstemp&amp;sektion=3&amp;"> mkstemp(3)</a>.
        <li>Intenta configurar la variable <tt>SEPARATE_BUILD</tt> con
	el valor 'concurrent' y comprueba que la compilaci&oacute;n
	a&uacute;n funcione.
        <li>Se asegura que las dependencias de GNU make sean realmente
	necesarias.
        </ul>

      <li><i>regress</i>
        <ul>
          <li>Verifica errores (los resultados en blanco significan que
	  est&aacute;n bien).
        </ul>

      <li><i>fake</i>
        <ul>
         <li>Este objetivo instala la aplicaci&oacute;n en un directorio
	 de trabajo falso, para asegurarse de que todos los ficheros se
	 puedan empaquetar f&aacute;cilmente sin que afecten al sistema
	 base.
         <li>El porte <b>nunca</b> debe instalar ficheros fueras del
	 directorio falso (como puede ser <tt>/usr/local</tt>).
         <li>En algunas ocasiones, GNU libtool tiene problemas
	 re-enlazando bibliotecas durante el proceso falso en algunas
	 arquitecturas.
        </ul>

      <li><i>package</i>
        <ul>
         <li>La creaci&oacute;n del paquete puede romperse si pkg/PLIST*
	 y/o pkg/PFRAG* son err&oacute;neos.
        </ul>

      <li><i>install</i>
        <ul>
         <li>Los paquetes deber&iacute;an instalar todos los ficheros
	 que aparecen en sus listas de empaquetamiento y con los
	 permisos correctos.  Hay que tener un cuidado especial con los
	 ficheros que tengan activados los bits <em>setuid</em>.
         <li>Es importante asegurarse de que el gui&oacute;n de
	 ejecuci&oacute;n <tt>INSTALL</tt> funcione correctamente, y que
	 no sobreescriba ning&uacute;n fichero de <tt>/etc</tt>.
        </ul>

      <li><i>deinstall</i>
        <ul>
         <li>Esto deber&iacute;a eliminar todos los ficheros instalados
	 por el paquete, excepto los que se instalen en <tt>/etc</tt>.
	 <li>Es importante asegurarse de que el gui&oacute;n de
	 ejecuci&oacute;n <tt>DEINSTALL</tt> funcione correctamente.
        </ul>
    </ul>

    <p>
    Los ficheros <tt>pkg/</tt> sobrantes, como DESCR y MESSAGE,
    deber&iacute;an pasar una comprobaci&oacute;n para la
    correcci&oacute;n de errores gramaticales y de estilo.  Los
    p&aacute;rrafos se deben formatear usando
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fmt&amp;sektion=1&amp;format=html">fmt(1)</a>
    y envolver a un m&aacute;ximo de 70 caracteres por l&iacute;nea.

    <h2><a name="Commenting"><font color="#0000e0">
    Comentarios</font></a></h2>

    <p>
    Lo m&aacute;s importante viene a continuaci&oacute;n de las
    comprobaciones:  los comentarios.  Hay que a&ntilde;adir comentarios
    al porte aunque &eacute;ste funcione bien.  Si recibimos diez
    mensajes en los que los usuarios nos confirman que el porte funciona
    bien en varias arquitecturas diferentes, entonces el proceso de
    entrega ser&aacute; m&aacute;s r&aacute;pido.  Si no funcionara
    bien, entonces hay que dar algo de informaci&oacute;n sobre los
    errores.  Hay algunas herramientas que pueden ayudar en esta tarea,
    como
    <a href="http://www.openbsd.org/cgi-bin/cvsweb/ports/infrastructure/build/portslogger">portslogger</a>,
    que redirecciona la salida a un fichero de registro (<em>log
    file</em>).

    <p>
    Ejemplo:<br>

    <div style="margin-left: 2em">
      <table border="0" cellpadding="3" width="90%">
        <tr>
          <td nowrap bgcolor="#eeeeee">
<pre>
    # make install 2&gt;&amp;1 | /usr/ports/infrastructure/build/portslogger .
</pre>
          </td>
        </tr>
      </table>
    </div>
    <br>
     <br>
     
    <p>
    Esto redireccionar&aacute; la salida a un fichero de registro
    ubicado en el directorio actual.

    <h2><a name="More"><font color="#0000e0">M&aacute;s
    verificaciones</font></a></h2>

    <p>
    Buscar errores de escritura, enlaces incorrectos, variables
    in&uacute;tiles o no existentes, licencias correctas, etc. en el
    fichero <tt>Makefile</tt> del porte.  Quienes tengan m&aacute;s
    experiencia pueden comprobar otros objetivos como
    <i>lib-depends-check</i>, examinando parches y produciendo ficheros
    diferenciales (<em>diff files</em>) para la correcci&oacute;n de
    errores, a&ntilde;adiendo &laquo;sabores&raquo;, u otras mejoras.
    
    <p>
    Estos ficheros <tt>.diff</tt> se deben crear con las opciones
    <tt>-uNr --exclude=CVS</tt>.  Tambi&eacute;n se puede usar <tt>cvs
    diff -uN</tt> para generar parches contra el repositorio de CVS.


<hr>
<a href="index.html"><img src="back.gif" height="24" width="24" alt="OpenBSD" border="0"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a><br>
<small>
Originally [OpenBSD: porttest.html,v 1.18 ]<br>
$Translation: porttest.html,v 1.8 2004/01/04 20:17:32 horacio Exp $<br>
$OpenBSD: porttest.html,v 1.8 2004/01/04 22:14:14 horacio Exp $
</small>

</body>
</html>
