<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD/powerpc</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD/powerpc page">
<meta name="keywords" content="openbsd,ppc,powerpc">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-1999 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<h2>OpenBSD/powerpc</h2>

<hr>
<h3><strong>Estado Actual:</strong></h3>

<p>
Este porte es bastante nuevo.  Tiene soporte para algunos tipos de
m&aacute;quinas con procesadores PowerPC, <strong>pero no
todos</strong>.  Aunque existen comit&eacute;s para la creaci&oacute;n
de normas que traten de resolver este problema, hay diferencias
importantes entre las m&aacute;quinas PowerPC...  &iexcl;a pesar de
estar hechas por el mismo fabricante!
<br>
Este porte funciona en algunas m&aacute;quinas, pero en otras no.
Compruebe la lista que sigue m&aacute;s abajo.

<p>
&iexcl;Para que funcione, la m&aacute;quina DEBE tener alguna variante
del software OpenBoot de Firmware!

<p>
El soporte para el procesador es bastante estable en este momento.  El
soporte para los controladores es algo limitado, debido a que la
mayor&iacute;a de dispositivos PCI s&oacute;lo han sido verificados en
m&aacute;quinas &quot;little-endian&quot;.  Estamos desarrollando
soporte para dispositivos adicionales para el hardware de los sistemas
Macintosh;  cualquier informaci&oacute;n sobre programaci&oacute;n para
cualquier tipo reciente de hardware de Mac ayudar&iacute;a a mejorar
esta situaci&oacute;n.

<p>
Existe soporte para los siguientes procesadores: 603, 603e, 604, 604ev,
750.

<p>
El porte todav&iacute;a no usa controles de dispositivos reales.  De
momento usa OpenFirmware para todas las necesidades de los
controladores de dispositivos de consola, disco, o ethernet.  Se puede
instalar por arranque en red, disquete y red, o cdrom.  Existe soporte
para Netroot, pero poco verificado.

<p>
Hay dos versiones del n&uacute;cleo para este porte, una que
s&oacute;lo usa openfirmware para todos los dispositivos, y una
versi&oacute;n que ha sido codificada con soporte para algunas
m&aacute;quinas de las series PowerSTack y VI.
</p>

<p>
<strong>Hardware con Soporte (o funcional):</strong>
<ul>
  <li>M&aacute;quinas Motorola con OpenFirmware
      (PPC1bug firmware no funciona, y las m&aacute;quinas con
      procesadores 603* y algunas versiones de Motorola openfirmware
      tampoco):
  <ul>
    <li>Series E
    <li>RiscPC
    <li>Pro2000
    <li>Pro3000
    <li>Pro4000 
  </ul>
  <li>V-I
  <ul>
    <li>Placas Power4e.
  </ul>
</ul>

<p>
<strong>Hardware con Soporte en Desarrollo:</strong>
<ul>
  <li>Sistemas Apple PowerMac con un m&iacute;nimo de un procesador 603
      y OpenFirmware.
  <ul>
    <li>Actualmente s&oacute;lo el Apple imac (333Mhz) tiene soporte
        para los controladores.
    <li>Otros sistemas tendr&aacute;n soporte seg&uacute;n
	disponibilidad de hardware e informaci&oacute;n sobre
	dispositivos.  Se dar&aacute; prioridad a los sistemas
	m&aacute;s recientes sobre los sistemas m&aacute;s viejos y
	lentos.
  </ul>
</ul>

<p>
<strong>M&aacute;quinas que NO FUNCIONAN:</strong>.
<ul>
  <li>M&aacute;quinas IBM.
  <li>M&aacute;quinas de la clase PPCP.
  <li>Sistemas Apple PowerMac con un procesador 601 o sin OpenFirmware
      no funcionar&aacute;n nunca.
  <li>La implementaci&oacute;n de Apple de OpenFirmware no tiene
      soporte para cargar los ejecutables ELF (como los bloques de
      arranque para este porte).  Esto necesita alg&uacute;n tipo de
      soluci&oacute;n alternativa.
</ul>
</p>

<h3><strong>Cronolog&iacute;a:</strong></h3>

<p>
La porciones del n&uacute;cleo del sistema espec&iacute;ficas para
powerpc vinieron del porte de NetBSD de Wolfgang Solfrank.  El modo
usuario y las herramientas de compilaci&oacute;n vinieron de un porte
independiente e incompleto de Dale Rahn.  Esperamos poder fusionar
piezas de c&oacute;digo de otro porte, soporte para controladores de
dispositivos para interrupciones del sistema, y algo de soporte real
para dispositivos.  La conversi&oacute;n al porte de Wolfgang se
llev&oacute; a cabo debido a que este &uacute;ltimo funcionaba en modo
multiusuario, mientras que el anterior todav&iacute;a estaba
funcionando en modo monousuario sin memoria de ramdisk (los
controladores de dispositivos no funcionaban del todo).

<p>
Despu&eacute;s de llevar a cabo ese trabajo, Per Fogelstrom
a&ntilde;adi&oacute; soporte para la placa vme VI Power4e, eliminando
el soporte openfirmware para dispositivos durante el proceso
(versi&oacute;n 2.3).

<p>
Para la versi&oacute;n 2.4 se a&ntilde;adi&oacute; soporte para los
dispositivos openfirmware, con retrocompatibilidad, de modo que
dispositivos de hardware y dispositivos ofw tuvieran un soporte mixto.
Despu&eacute;s de esto se adapt&oacute; el soporte para power4e con el
fin de que funcionara en m&aacute;quinas MCG PowerStack.  Se
a&ntilde;adi&oacute; algo de soporte para dec 21040 y vga;  vga
todav&iacute;a no se puede usar en consola, pero s&iacute; como
terminal.  A&uacute;n no hay soporte para servidores de X, pero el
mecanismo para acceder a vga por medio de mmap existe.

<p>
Para la versi&oacute;n 2.5 el soporte se mantuvo a los niveles de la
versi&oacute;n 2.4.

<p>
Para la versi&oacute;n 2.6 no hubo un lanzamiento oficial del porte
para powerpc.  El trabajo en el iMac hab&iacute;a apenas comenzado y no
se hab&iacute;an resuelto problemas con el compilador que evitaban que
el sistema compilara desde el &aacute;rbol.

<p>
A partir de la versi&oacute;n 2.6, se ha a&ntilde;adido soporte para
iMac, existe m&aacute;s desarrollo en progreso para crear mejor soporte
para dispositivos imac, y para otros sistemas.  Al principio, con el
soporte para los dispositivos de imac, se perdi&aacute; la
compatibilidad con sistemas m&aacute;s antiguos.  Esto se debi&aacute;
principalmente a una falta de verificaciones, pero estos sistemas
tendr&aacute;n soporte una vez que los cambios al sistema sean
retroportados.

<p>

Contacte con 
<a href="mailto:deraadt@theos.com">Theo de Raadt</a> o
<a href="mailto:rahnds@openbsd.org">Dale Rahn</a> 
si est&aacute; interesado en trabajar en este porte con otras personas,
o si necesita m&aacute;s informaci&oacute;n.
</p>

<hr>
<a href="plat.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: powerpc.html,v 1.22 1999/11/09 05:32:30 rahnds Exp ]<br>
$Translation: powerpc.html,v 1.4 2000/07/01 15:27:37 horacio Exp $<br>
$OpenBSD: powerpc.html,v 1.3 2000/07/15 17:35:36 wvdputte Exp $
</small>

</body>
</html>
