<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Informes de problemas en OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="informes sobre problemas de OpenBSD">
<meta name="keywords" content="openbsd,problemas,informes">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1998-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">C&oacute;mo enviar un informe sobre un
problema</font></h2>
<hr>

<h3><font color="#0000e0">Informes de problemas en versiones
estables.</font></h3>

Antes de informar sobre errores o problemas sobre las versiones de
lanzamiento, mirar la siguiente lista de comprobaci&oacute;n:

<ol>
<li>Comprobar y verificar si existen <a href="errata.html">parches y
avisos correspondientes a la versi&oacute;n.</a>
<li>A continuaci&oacute;n comprobar si hay una 
<a href="orders.html">versi&oacute;n m&aacute;s nueva</a> disponible.
<li>Finalmente, comprobar los <a href="../plus.html">cambios entre las
versiones de OpenBSD.</a>
</ol>

<p>
Si nada de lo que ve soluciona el problema, por favor lea detenidamente
la p&aacute;gina de manual de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1&amp;format=html">sendbug(1)</a>
antes de enviar un informe de error.

<p>
Busque m&aacute;s abajo los <a href="#bugtypes">tipos de informes de
errores</a> que existen.

<h3><font color="#0000e0">Informe de problemas en la versi&oacute;n de
desarrollo (<i>-current</i>).</font></h3>

Si su problema radica en el &aacute;rbol de fuentes de la versi&oacute;n
de desarrollo (<i>-current</i>) y no en el de la versi&oacute;n final
(<i>-release</i>) o la versi&oacute;n estable (<i>-stable</i>):

<ol>
<li>Verifique el problema dos veces como m&iacute;nimo, con los fuentes
actualizados con una diferencia de un par de d&iacute;as.
<li>No env&iacute;e informes sobre problemas de compilaci&oacute;n del
&aacute;rbol de fuentes, a menos que &eacute;stos sean persistentes.  La
mayor&iacute;a de las veces se deben a fallos del usuario, o
est&aacute;n siendo solucionados en ese momento.  Las personas que
trabajan en el proyecto ejecutan un <u>make build</u> un m&iacute;nimo
de una vez al d&iacute;a, y por lo general varias veces al d&iacute;a
con diferentes arquitecturas.
<li>Recuerde que los servidores de <a href="anoncvs.html">anoncvs</a> se
actualizan con una demora significante sobre el &aacute;rbol de fuentes
principal sobre el que se aplican los cambios.
<li>Compruebe los <a href="plus.html">cambios realizados entre versiones
de OpenBSD</a> para ver si el problema ha sido solucionado.
<li>Se pone mucho cuidado al crear las versiones preliminares
(<i>snapshots</i>).  Algunas veces se cometen errores, y por ello
pedimos disculpas.  Leer y enviar mensajes a las listas de correo es
mejor que enviar un informe de error.
</ol>

<br>


<h3><font color="#0000e0">C&oacute;mo crear un informe sobre un
problema</font></h3>
 
 <p>
<b>Env&iacute;e siempre tanta informaci&oacute;n como le sea
posible</b>.  Trate de puntualizar sobre el problema exacto.  No divague
ni d&eacute; detalles sobre problemas nimios como &laquo;se
cuelga&raquo; o &laquo;me da interrupciones raras en esta m&aacute;quina
que he montado...&raquo;.  Hable con otros usuarios en los canales de
IRC o en alg&uacute;n otro foro para verificar que sea un problema
nuevo, repetido, etc... y aseg&uacute;rese de que no es un problema de
su sistema.

<p>
Por favor, no empiece a solucionar problemas que requieren de un trabajo
laborioso hasta que no est&eacute; seguro de que lo haya entendido bien,
especialmente durante nuestros periodos previos al lanzamiento en los
que no debemos cambiar ninguna parte importante del c&oacute;digo.  Si
va a escribir una cantidad considerable de c&oacute;digo,
ent&eacute;rese en varios foros si alguien m&aacute;s est&aacute;
trabajando en ese problema (evitando un doble esfuerzo).

<p>
Los siguientes elementos de informaci&oacute;n se deber&iacute;an
incluir en todos los informes de errores:

<ol>
  <li>Los pasos exactos que se han seguido desde el principio para poder
  reproducir el problema.  No es suficiente con enviar una simple orden
  sin los argumentos ni otros datos que se hayan usado.  Si un error
  requiere una secuencia concreta de sucesos, por favor env&iacute;e una
  lista de &eacute;stos.  Al mismo tiempo tambi&eacute;n deber&iacute;a
  minimizar el tama&ntilde;o de su ejemplo, pero esto no es
  absolutamente necesario.  Si se puede reproducir el error, lo
  encontraremos de cualquier modo.
<p>
  <li>La salida en pantalla que obtuvo.  Por favor, no se limite a decir
  que &laquo;no ha funcionado&raquo; o que &laquo;ha fallado&raquo;.  Si
  hay alg&uacute;n mensaje de error, env&iacute;elo, aunque no entienda
  lo que dice.  Si se provoca un &laquo;p&aacute;nico&raquo; en el
  sistema por un error en concreto, diga cu&aacute;l.  Si nada de esto
  ocurre, d&iacute;galo.  Aun cuando el resultado obvio de su
  comprobaci&oacute;n sea la ca&iacute;da de un programa, es posible que
  no ocurra en su caso.  La forma m&aacute;s f&aacute;cil es copiar la
  salida en pantalla del error siempre que sea posible.

<p>
      Nota: En caso de errores fatales, el mensaje de error que vea es
      probable que no contenga toda la informaci&oacute;n disponible.
      En ese caso tambi&eacute;n debe mirar en la salida que aparece en
      los ficheros de mensaje del sistema (ficheros <i>log</i>), como
      los que encontrar&aacute; en /var/log.  Si la aplicaci&oacute;n
      tiene sus propios ficheros de mensaje, como en el caso de httpd,
      compruebe los errores en el lugar en donde guarde estos ficheros
      (en el caso concreto de httpd este sitio es /var/www/logs).
 
<p>
  <li>La salida del n&uacute;cleo de OpenBSD.  &Eacute;sta se obtiene
  con la orden 'dmesg', pero es posible que la salida que ofrezca
  'dmesg' no contenga toda la informaci&oacute;n que haya sido capturada
  en /var/run/dmesg.boot.  Comp&aacute;relo, y en caso de existir
  diferencias env&iacute;e la informaci&oacute;n de ambos.  <b>Por
  favor, incluya esto en todos los informes sobre errores.</b>

<p>
  <li>Si se est&aacute; ejecutando <i>software</i> de terceros que tenga
  algo que ver con el error, d&iacute;galo e incluya cualquier
  sub-versi&oacute;n que pueda tener dicho <i>software</i>.  Si se trata
  de alguna versi&oacute;n preliminar (<i>snapshot</i>) obtenida por CVS
  o FTP, d&iacute;galo e incluya su fecha y hora.

<p>
  <li>Un informe de ´traceback´ con el p&aacute;nico del n&uacute;cleo.
  Si fue un p&aacute;nico en el n&uacute;cleo y se encuentra en el punto
  de inserci&oacute;n de
  <tt><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ddb&amp;sektion=4&amp;format=html">ddb</a>&gt;</tt>,
  por favor env&iacute;e el mensaje de p&aacute;nico, as&iacute; como la
  salida de las &oacute;rdenes <tt>trace</tt> y <tt>ps</tt> junto con el
  informe sobre el error.<br>
  Si, por alg&uacute;n motivo, el mensaje de p&aacute;nico no fuera
  visible, puede volverlo a obtener con la orden
  <tt>x/s *panicstr</tt>.<br>
  <strong>Esto es esencial siempre que sea posible.  Los informes sobre
  p&aacute;nicos sin un mensaje del p&aacute;nico, y sin una salida de
  <tt>traceback</tt> y <tt>ps</tt>, son in&uacute;tiles.</strong><br>
  La salida de la orden <tt>show registers</tt> tambi&eacute;n puede ser
  de inter&eacute;s.  Despu&eacute;s de esto puede reiniciar con la
  orden <tt>boot dump</tt>, y de este modo
  <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=savecore&amp;sektion=8&amp;format=html">savecore(8)</a>
  guardar&aacute; una imagen del n&uacute;cleo para un depurado
  <em>post-mortem</em>.
</ol>

<p>
  <li>Si se env&iacute;a un informe sobre un problema relacionado con el
  sistema gr&aacute;fico X window system en una arquitectura que utilice
  el servidor XFree86, hay que incluir el fichero completo
  <tt>/var/log/XFree86.0.log</tt> en el informe adem&aacute;s de la
  informaci&oacute;n de <tt>dmesg.boot</tt>.

<p>
No se preocupe si el informe es demasiado largo.  Son cosas de la vida.
Es mejor informar sobre todo la primera vez a que le tengamos que ir
sonsacando los datos.  Por otra parte, si los ficheros que adjunte son
enormes, lo justo ser&iacute;a que preguntara antes si hay alguien
interesado en investigarlo.

<p>
Para terminar, cuando escriba un informe, aseg&uacute;rese de escoger
una terminolog&iacute;a que no se preste a confusiones.


<a name="bugtypes"></a>
<h3><font color="#0000e0">Env&iacute;o de informes sobre
errores</font></h3>

<p>
Si es posible, use la orden
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1&amp;format=html">sendbug(1)</a>
para incluir el error a nuestro sistema de seguimiento de errores.
Puede seguir el desarrollo del sistema de seguimiento desde
<a href="query-pr.html">esta p&aacute;gina</a>.  Sendbug requiere que su
sistema sea capaz de enviar correctamente correo por Internet.  Si no
puede usar sendbug en una m&aacute;quina funcional de OpenBSD, por favor
env&iacute;e su informe a
<a href="mailto:bugs@openbsd.org">bugs@openbsd.org</a>.  Es posible que
lo que env&iacute;e sea la petici&oacute;n de una funcionalidad, y no
necesariamente un error.

<p>
Aceptamos las sugerencias para a&ntilde;adir nuevas funcionalidades,
especialmente si van acompa&ntilde;adas de c&oacute;digo que implementen
sus sugerencias.  Si alguien m&aacute;s programa el c&oacute;digo para
su sugerencia, es posible que sea confuso y que no lo pueda reconocer.

<p>
Para depurar algunos problemas debemos tener el <i>hardware</i> que
tiene el problema.  Por favor, recuerde que los recursos del proyecto
OpenBSD son limitados.  <a href="want.html">Puede hacer donativos de
<i>hardware</i>.</a>

<p>
Tipos de informes de errores seg&uacute;n su importancia:

<ol>
<li>Los mejores son problemas repetidos acompa&ntilde;ados de soluciones
para el c&oacute;digo fuente.
<li>Problemas repetidos que no sean espec&iacute;ficos de la
configuraci&oacute;n de su <i>hardware</i> o <i>software</i>.
<li>Problemas repetidos espec&iacute;ficos de la configuraci&oacute;n de
su <i>software</i>.
<li>Problemas repetidos espec&iacute;ficos de la configuraci&oacute;n de
su <i>hardware</i>.
<li>Problemas no repetidos.
</ol>

<hr>
<img align="right" alt="OpenBSDPower" height="46" width="201" src="../images/openbsdpower.gif">
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>

<br><small>
Originally [OpenBSD: report.html,v 1.24 2003/06/10 22:32:47 tedu Exp ]<br>
$Translation: report.html,v 1.23 2003/06/12 17:24:51 horacio Exp $<br>
$OpenBSD: report.html,v 1.20 2003/06/12 20:56:57 jufi Exp $
</small>

</body>
</html>
