<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>Seguridad en OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="alertas de OpenBSD">
<meta name="keywords" content="openbsd,seguridad">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1997-2002 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Seguridad</font><hr></h2>

<table width="100%">
<tr>
<td colspan="2">
<strong>&Iacute;ndice</strong>
</td>
</tr>
<tr>
<td valign="top">
<a href="#goals">Objetivos de seguridad del proyecto</a>.<br> 
<a href="#disclosure">Pol&iacute;tica de transparencia absoluta</a>.<br> 
<a href="#process">Proceso de auditor&iacute;a del c&oacute;digo
fuente</a>.<br> 
<a href="#default">&laquo;Seguridad predeterminada&raquo;</a>.<br> 
<a href="#crypto">Uso de criptograf&iacute;a</a>.<br> 
<p>
<a href="#watching">Monitorizaci&oacute;n de cambios</a>.<br> 
<a href="#reporting">Informes sobre asuntos de seguridad</a>.<br> 
<a href="#papers">Otros textos</a>.<br>
<p>
</td>
<td valign="top">
Avisos de seguridad para todas las versiones de OpenBSD:<br>
<a href="#20">2.0</a>,
<a href="#21">2.1</a>,
<a href="#22">2.2</a>,
<a href="#23">2.3</a>,
<a href="#24">2.4</a>,
<a href="#25">2.5</a>,
<a href="#26">2.6</a>,
<a href="#27">2.7</a>,
<a href="#28">2.8</a>,
<a href="#29">2.9</a>,
<a href="#30">3.0</a>,
<a href="#31">3.1</a>,
<a href="#32">3.2</a>,
<a href="#33">3.3</a>.
</td>
</tr>
</table>
<hr>

<dl>
<a name="goals"></a>
<li><h3><font color="#e00000">Objetivos</font></h3>

<p>
OpenBSD cree en la seguridad reforzada.  Nuestra aspiraci&oacute;n es
llegar a ser el N&Uacute;MERO UNO de la industria en seguridad (si es
que no lo somos ya).  Nuestro modelo de desarrollo abierto nos permite
tomar unas decisiones sobre qu&eacute; incrementos podemos implementar
en cuanto a seguridad, que otros sistemas comerciales como Sun, SGI, IBM
o HP no podr&iacute;an tomar por estar sujetos a ciertos compromisos.
Podemos aplicar cambios que los sistemas comerciales no podr&iacute;an.
Y puesto que OpenBSD se exporta con
<a href="crypto.html">criptograf&iacute;a</a> integrada, tambi&eacute;n
podemos tomar decisiones criptogr&aacute;ficas a la hora de solucionar
problemas en la seguridad.

<p>
<a name="disclosure"></a>
<li><h3><font color="#e00000">Transparencia absoluta</font></h3>

<p>
Como muchos de los participantes en la
<a href="http://online.securityfocus.com/archive/1">lista de correo de
BUGTRAQ</a>, creemos en la completa transparencia de los problemas de
seguridad.  En el campo de los sistemas operativos hemos sido,
probablemente, los primeros en hacer nuestro este concepto.  Muchos
sistemas comerciales, incluidos los de <i>software</i> libre,
todav&iacute;a intentan esconder muchas cuestiones a sus usuarios.

<p>
La informaci&oacute;n sobre seguridad se mueve a gran velocidad en los
c&iacute;rculos de <i>crackers</i>.  Por otra parte, nuestra experiencia
nos dice que programar y hacer p&uacute;blicas soluciones correctas a
problemas de seguridad requiere promedios de una hora de trabajo;  la
rapidez en las reparaciones es posible.  En consecuencia, pensamos que
una total transparencia ayuda a aquellos usuarios a quienes de verdad
les preocupe la seguridad.

<p>
<a name="process"></a>
<li><h3><font color="#e00000">Procesos de auditor&iacute;a</font></h3>

<p>
Nuestro equipo de auditor&iacute;as de seguridad se compone de entre
seis y doce miembros, cuya labor es la de estar cont&iacute;nuamente
buscando y reparando nuevos agujeros de seguridad.  Hemos estado
haciendo auditor&iacute;as desde el Verano de 1996.  El proceso que
seguimos para incrementar la seguridad se basa simplemente en un
exhaustivo an&aacute;lisis, fichero por fichero, de todo componente
cr&iacute;tico de <i>software</i>.  En nuestras auditor&iacute;as no
buscamos agujeros de seguridad, sino errores de programaci&oacute;n;  si
a&ntilde;os m&aacute;s tarde alguien descubre que el error solucionado
por nosotros constitu&iacute;a un problema de seguridad, bueno ...
m&aacute;s a nuestro favor.  Se han descubierto defectos en casi todas
las &aacute;reas del sistema.  Durante nuestras auditor&iacute;as han
sido encontradas clases de seguridad totalmente nuevas, y a menudo ha
sido necesario volver a auditar c&oacute;digo fuente que hab&iacute;a
sido auditado previamente, con estos nuevos defectos como objetivo.  Con
frecuencia el c&oacute;digo se audita m&uacute;ltiples veces y por
distintas personas con conocimientos y experiencia en auditor&iacute;as
diferentes.

<p>
Algunos miembros de nuestro equipo de auditor&iacute;as de seguridad
sol&iacute;an trabajar para Secure Networks, la compa&ntilde;&iacute;a
que cre&oacute; Ballista, el paquete de barrido de seguridad
(<i>security scanner</i>) de redes n&uacute;mero uno en el mercado
(Secure Networks fue adquirida por Network Associates, Ballista
cambi&oacute; el nombre por Cybercop Scanner, y bueno, el resto es
historia... ).  Dicha compa&ntilde;&iacute;a llevaba a cabo mucha
investigaci&oacute;n en el campo de la seguridad, y por lo tanto nos
vino bien para la postura de OpenBSD.  OpenBSD pas&oacute; las pruebas
de Ballista a la perfecci&oacute;n desde el primer d&iacute;a.

<p>
Otra faceta de nuestros procesos de auditor&iacute;as de seguridad es la
&laquo;proactividad&raquo;.  En la mayor&iacute;a de los casos hemos
visto que lo importante no es determinar si algo puede llegar a ser un
<i>exploit</i>.  Durante nuestros continuados procesos de
auditor&iacute;a encontramos numerosos errores, y nos esforzamos en
solucinarlos aun cuando no est&eacute; probado que exista la posibilidad
de un <i>exploit</i>.  Reparamos el error y continuamos buscando otros
errores que reparar.  Hemos reparado muchos errores debidos a unas
pr&aacute;cticas de programaci&oacute;n descuidadas en el c&oacute;digo
simples y obvias, y s&oacute;lo meses m&aacute;s tarde hemos descubierto
que los problemas eran en realidad <i>exploits</i> (o incluso, con
m&aacute;s frecuencia, alguien en
<a href="http://online.securityfocus.com/archive/1">BUGTRAQ</a> ha
informado que otros sistemas operativos eran vulnerables a un
&laquo;nuevo problema descubierto&raquo;, y s&oacute;lo entonces se ha
sabido que OpenBSD lo hab&iacute;a reparado ya en una versi&oacute;n
anterior).  Otras veces nos hemos librado de sufrir los efectos
completos de <i>exploits</i> por complejos ataques con un sistema de
ataque paso a paso, porque ya hab&iacute;amos reparado alguno de los
pasos intermedios.  Un ejemplo en el que tuvimos un &eacute;xito de este
tipo fue el del aviso sobre <code>lpd</code> que lanz&oacute; Secure
Networks.

<p>
<li><h3><font color="#e00000">La recompensa</font></h3>

<p>
Nuestro proceso de auditor&iacute;a proactiva nos ha reportado
beneficios.  Afirmaciones tales como &laquo;este problema fue reparado
en OpenBSD unos 6 meses atr&aacute;s&raquo;, se est&aacute;n
convirtiendo en algo com&uacute;n en foros como 
<a href="http://online.securityfocus.com/archive/1">BUGTRAQ</a>.

<p>
La parte m&aacute;s intensa de nuestras auditor&iacute;as de seguridad
ocurri&oacute; justo antes del lanzamiento de OpenBSD 2.0, y durante la
transici&oacute;n entre la versi&oacute;n 2.0 y la 2.1, en el periodo de
tiempo comprendido entre el &uacute;ltimo tercio de 1996 y la primera
mitad de 1997.  Miles (s&iacute;, miles) de asuntos relacionados con la
seguridad fueron reparados r&aacute;pidamente durante este periodo de un
a&ntilde;o de duraci&oacute;n;  errores como los t&iacute;picos de
desbordamiento de la memoria intermedia (<i>buffer overflow</i>),
d&eacute;biles implementaciones en protocolos, recolecci&oacute;n de
informaci&oacute;n, y condiciones de carrera en sistemas de archivos
(<i>filesytem races</i>).  De este modo se repararon la mayor&iacute;a
de los problemas de seguridad que encontramos antes del lanzamiento de
la versi&oacute;n 2.1, y s&oacute;lo fue necesario reparar un
n&uacute;mero mucho m&aacute;s peque&ntilde;o de errores para el
lanzamiento de la versi&oacute;n 2.2.  Hoy en d&iacute;a ya no
encontramos tantos problemas, es un simple caso de resultados
decrecientes.  Los problemas de seguridad que encontramos
&uacute;ltimamente suelen ser significativamente m&aacute;s opacos y
complejos.  Aun as&iacute; continuaremos perseverando por las siguientes
razones:

<p>
<ul>
<li>En algunas ocasiones encontramos un simple problema del que no nos
hab&iacute;amos percatado en ocasiones anteriores.
<li>La seguridad es como la carrera armament&iacute;stica: los mejores
atacantes continuar&aacute;n buscando <i>exploits</i> m&aacute;s
complejos, y por lo tanto nosotros tambi&eacute;n.
<li>Encontrar y reparar defectos sutiles en programas complejos es muy
divertido.
</ul>

<p>
El proceso de auditor&iacute;as no ha acabado todav&iacute;a y, como
puede ver, continuamos trabajando con el fin de encontrar y solucionar
nuevos defectos de seguridad.

<p>
<a name="default"></a>
<li><h3><font color="#e00000">&laquo;Seguridad
predeterminada&raquo;</font></h3>

<p>
Para asegurarnos de que los usuarios nuevos de OpenBSD no necesiten
convertirse en expertos en seguridad de la noche al d&iacute;a (un punto
de vista que otros sistemas parecen compartir), sacamos nuestros
sistemas operativos con un sistema de <strong>&laquo;seguridad
predeterminada&raquo;</strong>.  Todos los servicios no esenciales son
desactivados.  A medida que el usuario/administrador se familiarice con
el sistema, descubrir&aacute; que tiene que ir activando servicios y
procesos, como los <i>d&aelig;mon</i>, y otras partes del sistema.
Durante el proceso de aprendizaje de activaci&oacute;n de un nuevo
servicio, el nuevo usuario puede aprender mucho m&aacute;s sobre las
consideraciones y los aspectos de la seguridad.

<p>
Esta austeridad contrasta con la creciente cantidad de sistemas que
vienen con NFS, <code>mountd</code>, servidores de <i>web</i> y varios
otros servicios activados de forma predeterminada, creando al instante
problemas de seguridad para sus usuarios, apenas unos minutos
despu&eacute;s de la primera instalaci&oacute;n.

<p>
<a name="crypto"></a>
<li><h3><font color="#e00000">Criptograf&iacute;a</font></h3>

<p>
Y, por supuesto, ya que la base del proyecto OpenBSD es Canad&aacute;,
ser&iacute;a imposible que no integr&aacute;ramos criptograf&iacute;a.
Para obtener m&aacute;s informaci&oacute;n a este respecto, lea la
p&aacute;gina que trata sobre lo <a href="crypto.html">que hemos hecho
con criptograf&iacute;a</a>.

<p>
<li><h3><font color="#e00000">Avisos</font></h3>

<p>
<dl>

<li>
<a name="33"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 3.3</font></h3>
&Eacute;stos son los avisos de OpenBSD 3.2;  todos estos problemas
est&aacute;n resueltos en
<a href="anoncvs.html">OpenBSD-<i>current</i></a> y en
<a href="stable.html">OpenBSD-<i>stable</i></a>.

<p>
<ul>
<li><a href="errata.html#asn1">1 de octubre de 2003:
	   El uso de ciertas codificaciones ASN.1 o de claves
	   p&uacute;blicas con malformaciones puede permitir a un atacante
	   montar un ataque por denegaci&oacute;n de servicio contra
	   aplicaciones enlazadas a ssl(3).</a>
<li><a href="errata.html#pfnorm">24 de septiembre de 2003:
	   El acceso a memoria liberada en pf(4) podr&iacute;a ser utilizado
	   para causar un p&aacute;nico de forma remota en una
	   m&aacute;quina usand reglas de <i>scrub</i>.</a>
<li><a href="errata.html#sendmail">17 de septiembre de 2003:
	   Un desbordamiento de la memoria en el an&aacute;lisis de
	   direcciones en sendmail(8) puede permitir que un atacante obtenga
	   privilegios del usuario <i>root</i>.</a>
<li><a href="errata.html#sshbuffer">16 de septiembre de 2003:
	   Las versiones de OpenSSH anteriores a la 3.7 contienen un error
	   de gesti&oacute;n de memoria intermedia que se podr&iacute;a
	   explotar.</a>
<li><a href="errata.html#sysvsem">10 de septiembre de 2003:
	   El usuario <i>root</i> podr&iacute;a reducir el nivel de
	   seguridad a trav&eacute;s de un desbordamiento de un
	   n&uacute;mero entero cuando los l&iacute;mites del
	   sem&aacute;foro son muy grandes.
<li><a href="errata.html#semget">20 de agosto de 2003:
	   Una comprobaci&oacute;n de l&iacute;mites incorrecta puede
	   permitir que un usuario local cause p&aacute;nico en el
	   n&uacute;cleo del sistema.</a>
<li><a href="errata.html#realpath">4 de agosto de 2003:
	   Existe un error <i>off-by-one</i> en la funci&oacute;n
	   realpath(3) de las bibliotecas de C que pueden resultar en que un
	   atacante obtenga privilegios de escala.</a>
</ul>

<p>
<li>
<a name="32"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 3.2</font></h3>
&Eacute;stos son los avisos de OpenBSD 3.2;  todos estos problemas
est&aacute;n resueltos en
<a href="anoncvs.html">OpenBSD-<i>current</i></a> y en
<a href="stable.html">OpenBSD-<i>stable</i></a>.

<p>
<ul>
<li><a href="errata32.html#asn1">1 de octubre de 2003:
	   El uso de ciertas codificaciones ASN.1 o de claves
	   p&uacute;blicas con malformaciones puede permitir a un atacante
	   montar un ataque por denegaci&oacute;n de servicio contra
	   aplicaciones enlazadas a ssl(3).  Esto no afecta a OpenSSH.</a>
<li><a href=errata32.html#pfnorm>24 de septiembre de 2003:
       El acceso a memoria liberada en pf(4) podr&iacute;a ser utilizado
	   para causar un p&aacute;nico de forma remota en una
	   m&aacute;quina usand reglas de <i>scrub</i>.</a>
<li><a href="errata32.html#sendmail4">17 de septiembre de 2003:
	   Un desbordamiento de la memoria en el an&aacute;lisis de
	   direcciones en sendmail(8) puede permitir que un atacante obtenga
	   privilegios del usuario <i>root</i>.</a>
<li><a href="errata32.html#sshbuffer">16 de septiembre de 2003:
	   Las versiones de OpenSSH anteriores a la 3.7 contienen un error
	   de gesti&oacute;n de memoria intermedia que se podr&iacute;a
	   explotar.</a>
<li><a href="errata32.html#sendmail3">25 de agosto de 2003:
		Reparaci&oacute;n de un posible problema de seguridad en
		sendmail relacionado con las asignaciones de DNS.</a>
<li><a href="errata32.html#realpath">4 de agosto de 2003:
	   Existe un error <i>off-by-one</i> en la funci&oacute;n
	   realpath(3) de las bibliotecas de C que pueden resultar en que un
	   atacante obtenga privilegios de escala.</a>
<li><a href="errata32.html#sendmail2">31 de marzo de 2003:
	   Un desbordamiento de memoria en el an&aacute;lisis de direcciones
	   en sendmail(8) puede permitir que un atacante obtenga privilegios
	   del usuario <i>root</i>.</a>
<li><a href="errata32.html#kerberos">24 de marzo de 2003:
	   Una debilidad criptogr&aacute;fica en el protocolo de Kerberos v4
	   tambi&eacute;n puede ser explotada en Kerberos v5.</a>
<li><a href="errata32.html#kpr">19 de marzo de 2003:
	   OpenSSL es vulnerable a una extensi&oacute;n del ataque
	   ``Bleichenbacher'' dise&ntilde;ado por los investigadores checos
	   Klima, Pokorny y Rosa.</a>
<li><a href="errata32.html#blinding">18 de marzo de 2003:
	   Varias operaciones de SSL y TLS en OpenSSL son vulnerables a
	   ataques de tiempo (<i>timing attacks</i>).</a>
<li><a href="errata32.html#lprm">5 de marzo de 2003:
	   Un desbordamiento de memoria en lprm(1) puede permitir que un
	   atacante obtenga los privilegios del usuario <i>daemon</i>.</a>
<li><a href="errata32.html#sendmail">3 de marzo de 2003:
	   Un desbordamiento de memoria en el procesamiento de comentarios
	   de <i>envelope</i> en sendmail(8) puede permitir a un atacante
	   obtener privilegios de superusuario.</a>
<li><a href="errata32.html#httpd">25 de febrero de 2003:
	   Una fuga en httpd(8) de ficheros de n&uacute;meros de nodos-i a
	   trav&eacute;s de la cabecera de ETag adem&aacute;s de PIDs de
	   procesos hijo en la generaci&oacute;n de l&iacute;mites de MIME
	   multiparte.  Esto podr&iacute;a permitir, por ejemplo, la
	   explotaci&oacute;n de NFS debido a que usa n&uacute;meros de
	   nodo-i com parte del manejo del fichero.</a>
<li><a href="errata32.html#ssl">22 de febrero de 2003:
	   Puede haber una fuga de informaci&oacute;n en ssl(8) al realizar
	   una computaci&oacute;n de MAC aunque haya encontrado el cifrado
	   de bloque incorrecto;  esto es una contramedida.  Tambi&eacute;n
	   se comprueban los tama&ntilde;os negativos en las rutinas de
	   ubicaci&oacute;n de memoria.</a>
<li><a href="errata32.html#cvs">20 de enero de 2003:
	   Existe una doble llamada a free(3) en cvs(1) que podr&iacute;a
	   llevar a una escalada de privilegios en configuraciones de cvs en
	   las que la orden cvs se ejecute como usuario con privilegios.</a>
<li><a href="errata32.html#named">14 de noviembre de 2002:
	   Existe un desbordamiento de memorio en named(8) que podr&iacute;a
	   permitir una ca&iacute;da remota o la ejecuci&oacute;n de
	   c&oacute;digo como usuario named en una entorno cerrado chroot
	   (<i>chroot jail</i>).</a>
<li><a href="errata32.html#pool">6 de noviembre de 2002:
	   Un error l&oacute;gico en la ubicaci&oacute;n de memoria del
	   n&uacute;cleo podr&iacute;a causar corrupci&oacute;n de la
	   memoria en situaciones con baja memoria, provocando una
	   ca&iacute;da del sistema.</a>
<li><a href="errata32.html#smrsh">6 de noviembre de 2002:
	   Un atacante puede circunvalar las restricciones de smrsh(8) y
	   ejecutar &oacute;rdenes arbitrarias con los privilegios de su
	   propia cuenta.</a>
<li><a href="errata32.html#pfbridge">6 de noviembre de 2002:
	   Los puentes de red (<i>bridges</i>) con pf que tienen
	   <i>scrubbing</i> activado podr&iacute;an producir una
	   corrupci&oacute;n de mbuf, provocando una ca&iacute;da del
	   sistema.</a>
<li><a href="errata32.html#kadmin">21 de octubre de 2002:
	   Puede ocurrir un desbordamiento de la memoria intermedia en el
	   d&aelig;mon de kadmind(8), provocando una posible ca&iacute;da
	   remota o siendo explotable de forma remota.</a>
</ul>

</dl>
<p>
Ya no hay soporte para OpenBSD 3.1 y versiones anteriores.  En los
siguientes p&aacute;rrafos s&oacute;lo se encuentran la lista de avisos
lanzados mientras hab&iacute;a soporte para estas versiones.  Estas
versiones antiguas pueden estar afectadas por los avisos
correspondientes a las versiones m&aacute;s recientes.
<br>

<p>
<dl>

<li>
<a name="31"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 3.1</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 3.1;  todos estos problemas
est&aacute;n resueltos en
<a href="anoncvs.html">OpenBSD-<i>current</i></a>.
<a href="stable.html">OpenBSD-<i>stable</i></a> para 3.1 ya no
est&aacute; siendo mantenido, por lo que es necesario actualizar el
sistema.

<p>
<ul>
<li><a href="errata31.html#sendmail2">31 de marzo de 2003:
	   Un desbordamiento de memoria en el an&aacute;lisis de direcciones
	   en sendmail(8) puede permitir que un atacante obtenga privilegios
	   del usuario <i>root</i>.</a>
<li><a href="errata31.html#kerberos">24 de marzo de 2003:
	   Una debilidad criptogr&aacute;fica en el protocolo de Kerberos v4
	   tambi&eacute;n puede ser explotada en Kerberos v5.</a>
<li><a href="errata31.html#kpr">19 de marzo de 2003:
	   OpenSSL es vulnerable a una extensi&oacute;n del ataque
	   ``Bleichenbacher'' dise&ntilde;ado por los investigadores checos
	   Klima, Pokorny y Rosa.</a>
<li><a href="errata31.html#blinding">18 de marzo de 2003:
	   Varias operaciones de SSL y TLS en OpenSSL son vulnerables a
	   ataques de tiempo (<i>timing attacks</i>).</a>
<li><a href="errata31.html#lprm">4 de marzo de 2003:
       Un desbordamiento de memoria en lprm(1) puede permitir que un
       atacante obtenga los privilegios del usuario <i>root</i>.</a>
<li><a href="errata31.html#sendmail">3 de marzo de 2003:
	   Un desbordamiento de memoria en el procesamiento de comentarios
	   de <i>envelope</i> en sendmail(8) puede permitir a un atacante
	   obtener privilegios de superusuario.</a>
<li><a href="errata31.html#ssl2">23 de febrero de 2003:
	   Puede haber una fuga de informaci&oacute;n en ssl(8) al realizar
	   una computaci&oacute;n de MAC aunque se haya encontrado el
	   cifrado de bloque incorrecto;  esto es una contramedida.  Hay que
	   comprobar tambi&eacute;n los tama&ntilde;os negativos en las
	   rutinas de ubicaci&oacute;n de memoria.</a>
<li><a href="errata31.html#cvs">20 de enero de 2003:
	   Existe una doble llamada a free(3) en cvs(1) que podr&iacute;a
	   llevar a una escalada de privilegios en configuraciones de cvs en
	   las que la orden cvs se ejecute como usuario con privilegios.
<li><a href="errata31.html#named">14 de noviembre de 2002:
	   Existe un desbordamiento de memorio en named(8) que podr&iacute;a
	   permitir una ca&iacute;da remota o la ejecuci&oacute;n de
	   c&oacute;digo como usuario named en una entorno cerrado chroot
	   (<i>chroot jail</i>).</a>
<li><a href="errata31.html#kernresource">6 de noviembre de 2002:
	   Una comprobaci&oacute;n de argumentos incorrecta en la llamada al
	   sistema de getitimer(2) puede permitir que una atacante pueda
	   provocar una ca&iacute;da del sistema.</a>
<li><a href="errata31.html#smrsh">6 de noviembre de 2002:
	   Un atacante puede circunvalar las restricciones de smrsh(8) y
	   ejecutar &oacute;rdenes arbitrarias con los privilegios de su
	   propia cuenta.</a>
<li><a href="errata31.html#kadmin">21 de octubre de 2002:
	   Puede ocurrir un desbordamiento de memoria en el d&aelig;mon de
	   kadmind(8), provocando una posible ca&iacute;da o ser explotable
	   de forma remota.</a>
<li><a href="errata31.html#kerntime">2 de octubre de 2002:
	   Una comprobaci&oacute;n incorrecta del argumento en la llamada al
	   sistema de setitimer(2) puede permitir a un atacante escribir en
	   la memoria del n&uacute;cleo del sistema.</a>
<li><a href="errata31.html#scarg">11 de agosto de 2002:
	   Una comprobaci&oacute;n insuficiente de los l&iacute;mites en la
	   llamada al sistema select permite a un atacante sobreescribir la
	   memoria del n&uacute;cleo del sistema y ejecutar c&oacute;digo
	   arbitrario en el contexto del n&uacute;cleo.</a>
<li><a href="errata31.html#ssl">30 de julio de 2002:
	   Pueden ocurrir varios desbordamientos de la memoria intermedia en
	   el servidor de SSL2 y en el cliente de SSL3 de la biblioteca
	   ssl(8), as&iacute; como en el c&oacute;digo de an&aacute;lisis
	   ASN.1 en la biblioteca crypto(3), que pueden ser potencialmente
	   un <i>exploit</i> remoto.</a>
<li><a href="errata31.html#xdr"> 29 de julio de 2002:
	   Puede ocurrir un desbordamiento de la memoria intermedia en el
	   coacute;digo RPC de xdr_array(3), produciendo una posible
	   ca&iacute;da remota.</a>
<li><a href="errata31.html#pppd">29 de julio de 2002:
	   Existe una condici&oacute;n de carrera en el d&aelig;mon pppd(8)
	   que puede alterar los permisos de archivo de un fichero
	   arbitrario.</a>
<li><a href="errata31.html#isakmpd">5 de julio de 2002:
	   La recepci&oacute;n de cargas &uacute;tiles de IKE fuera de
	   secuencia puede provocar una ca&iacute;da de isakmpd(8).</a>
<li><a href="errata31.html#ktrace">27 de junio de 2002:
	   El n&uacute;cleo del sistema permite que cualquier usuario pueda
	   rastrear procesos setuid y setgid con ktrace(1).</a>
<li><a href="errata31.html#modssl">26 de junio de 2002:
	   Puede ocurrir un desbordamiento de memoria en el c&oacute;digo de
	   an&aacute;lisis de .htaccess en el m&oacute;dulo mod_ssl de
	   httpd, provocando una posible ca&iacute;da remota o un
	   <i>exploit</i>.</a>
<li><a href="errata31.html#resolver">25 de junio de 2002:
	   Se ha encontrado un desbordamiento de memoria en potencia en el
	   resolucionador de DNS.</a>
<li><a href="errata31.html#sshd">24 de junio de 2002:
	   Todas la versiones de OpenSSH desde la 2.3.1 hasta la 3.3
	   contienen un error de validaci&oacute;n de entrada que puede dar
	   como resultado un desbordamiento de entero y una escalada de
	   privilegios.</a>
<li><a href="errata31.html#httpd">19 de junio de 2002:
	   Puede ocurrir un desbordamiento de memoria durante la
	   interpretaci&oacute;n de cierto c&oacute;digo en httpd(8),
	   provocando una posible ca&iacute;da remota.</a>
<li><a href="errata31.html#sshbsdauth">22 de mayo de 2002:
	   En los sistemas que usan YP con <i>netgroups</i> en la base de
	   datos de contrase&ntilde;as y bajo ciertas condiciones, es
	   posible que sshd(8) lleve a cabo comprobaciones ACL del nombre de
	   usuario requerido, y que use la entrada de la base de datos de
	   contrase&ntilde;as de un usuario diferente para la
	   autenticaci&oacute;n.  Esto quiere decir que los usuarios con
	   acceso denegado podr&iacute;an autenticarse con &eacute;xito,
	   mientras que podr&iacute;a fallar la autenticaci&oacute;n de los
	   usuarios con acceso autorizado.</a>
<li><a href="errata31.html#fdalloc2">8 de mayo de 2002:
	   Existe una condici&oacute;n de carrera que podría derrotar la
	   protección del núcleo de los zócalos fd 0-2 para procesos
	   setuid.</a>
<li><a href="errata31.html#sudo">25 de abril de 2002:
	   Un error en sudo puede permitir a un atacante corromper la
	   tabla.</a>
<li><a href="errata31.html#sshafs">22 de abril de 2002:
	   Un usuario local puede obtener privilegios de superusuario debido
	   a un desbordamiento de la memoria en sshd(8), si AFS ha sido
	   configurado en el sistema o si KerberosTgtPassing o
	   AFSTokenPassing han sido activados en el fichero sshd_config.</a>
</ul>


<p>
<li>
<a name="30"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 3.0</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 3.0;  todos estos problemas
est&aacute;n resueltos en
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.
<a href="stable.html">OpenBSD<i>-stable</i></a> para 3.0 ya no
est&aacute; siendo mantenido, por lo que es necesario actualizar el
sistema.

<p>
<ul>
<li><a href="errata30.html#named">14 de noviembre de 2002:
	Existe un desbordamiento de memorio en named(8) que podr&iacute;a
	permitir una ca&iacute;da remota o la ejecuci&oacute;n de
	c&oacute;digo como usuario named en una entorno cerrado chroot
	(<i>chroot jail</i>).</a>
<li><a href="errata30.html#kernresource">6 de noviembre de 2002:
	Una comprobaci&oacute;n de argumentos incorrecta en la llamada al
	sistema de getitimer(2) puede permitir que una atacante pueda
	provocar una ca&iacute;da del sistema.</a>
<li><a href="errata30.html#smrsh">6 de noviembre de 2002:
	Un atacante puede circunvalar las restricciones de smrsh(8) y
	ejecutar &oacute;rdenes arbitrarias con los privilegios de su propia
	cuenta.</a>
<li><a href="errata30.html#kadmin">21 de octubre de 2002:
	Puede ocurrir un desbordamiento de memoria en el d&aelig;mon de
	kadmind(8), provocando una posible ca&iacute;da o ser explotable de
	forma remota.</a>
<li><a href="errata30.html#kerntime">7 de octubre de 2002:
	Una comprobaci&oacute;n de argumentos incorrecta en la llamada al
	sistema de setitimer(2) puede permitir a un atacante sobreescribir
	en la memoria del n&uacute;cleo del sistema.</a>
<li><a href="errata30.html#scarg">11 de agosto de 2002:
	Una comprobaci&oacute;n insuficiente de los l&iacute;mites en la
	llamada al sistema select permite a un atacante sobreescribir la
	memoria del n&uacute;cleo del sistema y ejecutar c&oacute;digo
	arbitrario en el contexto del n&uacute;cleo.</a>
<li><a href="errata30.html#ssl">30 de julio de 2002:
	Pueden ocurrir varios desbordamientos de la memoria intermedia en el
	servidor de SSL2 y en el cliente de SSL3 de la biblioteca ssl(8),
	as&iacute; como en el c&oacute;digo de an&aacute;lisis ASN.1 en la
	biblioteca crypto(3), que pueden ser potencialmente un
	<i>exploit</i> remoto.</a>
<li><a href="errata30.html#xdr"> 29 de julio de 2002:
	Puede ocurrir un desbordamiento de la memoria intermedia en el
	coacute;digo RPC de xdr_array(3), produciendo una posible
	ca&iacute;da remota.</a>
<li><a href="errata30.html#pppd">29 de julio de 2002:
	Existe una condici&oacute;n de carrera en el d&aelig;mon pppd(8) que
	puede alterar los permisos de archivo de un fichero arbitrario.</a>
<li><a href="errata30.html#isakmpd">5 de julio de 2002:
	La recepci&oacute;n de cargas &uacute;tiles de IKE fuera de
	secuencia puede provocar una ca&iacute;da de isakmpd(8).</a>
<li><a href="errata30.html#ktrace">27 de junio de 2002:
	El n&uacute;cleo del sistema permite que cualquier usuario pueda
	rastrear procesos setuid y setgid con ktrace(1).</a>
<li><a href="errata30.html#resolver">25 de junio de 2002:
	Se ha encontrado un desbordamiento de memoria en potencia en el
	resolucionador de DNS.</a>
<li><a href="errata30.html#sshdauth">24 de junio de 2002:
	Todas la versiones de OpenSSH desde la 2.3.1 hasta la 3.3 contienen
	un error de validaci&oacute;n de entrada que puede dar como
	resultado un desbordamiento de entero y una escalada de
	privilegios.</a>
<li><a href="errata30.html#modssl">24 de junio de 2002:
	Puede ocurrir un desbordamiento de memoria en el c&oacute;digo de
	an&aacute;lisis de .htaccess en el m&oacute;dulo mod_ssl de httpd,
	provocando una posible ca&iacute;da remota o un <i>exploit</i>.</a>
<li><a href="errata30.html#httpd">19 de junio de 2002:
	Puede ocurrir un desbordamiento de memoria durante la
	interpretaci&oacute;n de cierto c&oacute;digo en httpd(8),
	provocando una posible ca&iacute;da remota.</a>
<li><a href="errata30.html#fdalloc2">8 de mayo de 2002:
	Existe una condici&oacute;n de carrera que podría derrotar la
	protección del núcleo de los zócalos fd 0-2 para procesos
	setuid.</a>
<li><a href="errata30.html#sudo2">25 de abril de 2002:
	Un error en sudo puede permitir a un atacante corromper la
	tabla.</a>
<li><a href="errata30.html#sshafs">22 de abril de 2002:
	Un usuario local puede obtener privilegios de superusuario debido a
	un desbordamiento de la memoria en sshd(8), si AFS ha sido
	configurado en el sistema o si KerberosTgtPassing o AFSTokenPassing
	han sido activados en el fichero sshd_config.</a>
<li><a href="errata30.html#mail">11 de abril de 2002:
	mail(1) procesa los escapes con virgulilla (<kbd>~</kbd>) aun cuando
	son en modo no interactivo.  Como mail(1) es invocado como
	<i>root</i> desde cron(8), esto puede derivar en un compromiso local
	de <i>root</i>.</a>
<li><a href="errata30.html#approval">19 de marzo de 2002:
	Bajo ciertas condiciones, en sistemas que usan YP con netgroups en
	la base de datos de contrase&ntilde;as, es posible que los daemons
	rexecd(8) y rshd(8) ejecuten el int&eacute;rprete (<i>shell</i>)
	desde una entrada de contrase&ntilde;a de otro usuario.  Debido a un
	problema parecido, atrun(8) puede cambiar al directorio de usuario
	err&oacute;neo cuando ejecuta tareas at(1).</a>
<li><a href="errata30.html#zlib">13 de marzo de 2002:
	Existe un peligro de doble liberaci&oacute;n de memoria asignada en
	la biblioteca <i>zlib</i>; no se puede explotar en OpenBSD.  El
	n&uacute;cleo del sistema tambi&eacute;n contiene una copia de
	<i>zlib</i>;  se desconoce si el <i>zlib</i> del n&uacute;cleo puede
	ser explotable.</a>
<li><a href="errata30.html#openssh">8 de marzo de 2002:
	Una comprobaci&oacute;n <i>off-by-one</i> en el c&oacute;digo de
	reenv&iacute;o de canal de OpenSSH puede hacer que un usuario local
	obtenga privilegios de superusuario.</a>
<li><a href="errata30.html#ptrace">21 de enero de 2002:
	Una condic&oacute;n de carrera entre las llamadas al sistema
	ptrace(2) y execve(2) pueden permitir que un atacante modifique el
	contenido de la memoria de procesos suid/sgid, lo que
	comprometer&iacute;a la cuenta del superusuario.</a>
<li><a href="errata30.html#sudo">17 de enero de 2002:
	Existe un agujero de seguridad en sudo(8) que puede ser aprovechado
	si est&aacute; instalado Postfix como substituto de sendmail, y que
	puede permitir a un atacante obtener privilegios de superusuario en
	el anfitri&oacute;n local.</a>
<li><a href="errata30.html#lpd">28 de Noviembre de 2001:
	Un atacante puede enga&ntilde;ar a una m&aacute;quina con el
	d&aelig;mon lpd ejecutado, para crear nuevos ficheros en el
	directorio ra&iacute;z desde una m&aacute;quina con acceso a la
	impresora de l&iacute;nea.</a>
<li><a href="errata30.html#vi.recover">13 de noviembre de 2001:
	El gui&oacute;n vi.recover puede utilizarse para eliminar
	arbitrariamente fichero de tama&ntilde;o cero.</a>
<li><a href="errata30.html#pf">13 de noviembre de 2001:
	pf(4) no era capaz de tratar con ciertos paquetes icmp de ipv6, lo
	que provocaba una ca&iacute;da.</a>
<li><a href="errata30.html#sshd">12 de noviembre de 2001:
	Un agujero de seguridad que puede permitir que un atacante
	autentique parcialmente s&oacute;lo si el administrador ha activado
	KerberosV.</a>
</ul>

<p>
<li>
<a name="29"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 2.9</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.9;  todos estos problemas
est&aacute;n resueltos en 
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.
<a href="stable.html">OpenBSD<i>-stable</i></a> para 2.9 ya no
est&aacute; siendo mantenido, por lo que es necesario actualizar el
sistema.

<p>
<ul>
<li><a href="errata29.html#resolver">25 de junio de 2002:
	Se ha encontrado un desbordamiento de memoria en potencia en el
	resolucionador de DNS.</a>
<li><a href="errata29.html#fdalloc2">8 de mayo de 2002:
	Existe una condici&oacute;n de carrera que podría derrotar la
	protección del núcleo de los zócalos fd 0-2 para procesos
	setuid.</a>
<li><a href="errata29.html#sudo2">25 de abril de 2002:
	Un error en sudo puede permitir a un atacante corromper la
	tabla.</a>
<li><a href="errata29.html#sshafs">22 de abril de 2002:
	Un usuario local puede obtener privilegios de superusuario debido a
	un desbordamiento de la memoria en sshd(8), si AFS ha sido
	configurado en el sistema o si KerberosTgtPassing o AFSTokenPassing
	han sido activados en el fichero sshd_config.</a>
<li><a href="errata29.html#mail">11 de abril de 2002:
	mail(1) procesa los escapes con virgulilla (&tilde;) aun cuando sean
	en modo no interactivo.  Como mail(1) es invocado como <i>root</i>
	desde cron(8), esto puede derivar en un compromiso local de
	<i>root</i>.</a>
<li><a href="errata29.html#zlib">13 de marzo de 2002:
	Existe un peligro de doble liberaci&oacute;n de memoria asignada en
	la biblioteca <i>zlib</i>; no se puede explotar en OpenBSD.  El
	n&uacute;cleo del sistema tambi&eacute;n contiene una copia de
	<i>zlib</i>;  se desconoce si el <i>zlib</i> del n&uacute;cleo puede
	ser explotable.</a>
<li><a href="errata29.html#openssh">8 de marzo de 2002:
	Una comprobaci&oacute;n <i>off-by-one</i> en el c&oacute;digo de
	reenv&iacute;o de canal de OpenSSH puede hacer que un usuario local
	obtenga privilegios de superusuario.</a>
<li><a href="errata29.html#ptrace">21 de enero de 2002:
	Una condic&oacute;n de carrera entre las llamadas al sistema
	ptrace(2) y execve(2) pueden permitir que un atacante modifique el
	contenido de la memoria de procesos suid/sgid, lo que
	comprometer&iacute;a la cuenta del superusuario.</a>
<li><a href="errata29.html#sudo">17 de enero de 2002:
	Existe un agujero de seguridad en sudo(8) que puede ser aprovechado
	si est&aacute; instalado Postfix como substituto de sendmail, y que
	puede permitir a un atacante obtener privilegios de superusuario en
	el anfitri&oacute;n local.</a>
<li><a href="errata29.html#lpd2">28 de Noviembre de 2001:
	Un atacante puede enga&ntilde;ar a una m&aacute;quina con el
	d&aelig;mon lpd ejecutado, para crear nuevos ficheros en el
	directorio ra&iacute;z desde una m&aacute;quina con acceso a la
	impresora de l&iacute;nea.</a>
<li><a href="errata29.html#vi.recover">13 de noviembre de 2001:
	El gui&oacute;n vi.recover puede utilizarse para eliminar
	arbitrariamente fichero de tama&ntilde;o cero.</a>
<li><a href="errata29.html#uucp">11 de septiembre de 2001:
	Existe un agujero de seguridad en uuxqt(8) que permite a un atacante
	obtener privilegios de root.</a>
<li><a href="errata29.html#lpd">29 de agosto de 2001:
	Existe un agujero de seguridad en lpd(8) que permite a un atacante
	obtener privilegios de root si el d&aelig;mon lpd est&aacute;
	iniciado.</a>
<li><a href="errata29.html#sendmail2">21 de agosto de 2001:
	Existe un agujero de seguridad en sendmail(8) que puede permitir que
	un atacante en la m&aacute;quina local obtenga privilegios de
	superusuario.</a>
<li><a href="errata29.html#nfs">30 de julio de 2001:
	Un desbordamiento de la memoria intermedia en el c&oacute;digo de
	NFS puede ser usado por usuarios con privilegio para montar
	particiones (la configuraci&oacute;n predeterminada s&oacute;lo
	permite esto al usuario <i>root</i> para ejecutar c&oacute;digo
	arbitrario.</a>
<li><a href="errata29.html#kernexec">15 de junio de 2001:
	Una condici&oacute;n de carrera en el n&uacute;cleo del sistema
	puede llegar a compremeter root en el sistema local.</a>
<li><a href="errata29.html#sshcookie">12 de junio de 2001:
	sshd(8) permite que los usuarios puedan borrar de forma arbitraria
	ficheros con el nombre &quot;cookies&quot; si est&aacute; activado
	el reenv&iacute;o por X11 (<i>X11 forwarding</i>).  El modo
	predeterminado en OpenBSD para el reenv&iacute;o por X11 es el de
	desactivado.
<li><a href="errata29.html#fts">30 de mayo de 2001:
	Los programas que usen las rutinas fts pueden ser enga&ntilde;ados
	para cambiar al directorio err&oacute;neo.</a>
<li><a href="errata29.html#sendmail">29 de mayo de 2001:
	Los manejadores de se&ntilde;ales de sendmail contienen
	c&oacute;digo no seguro, lo que puede provocar numerosas condiciones
	de carrera.</a>
</ul>


<p>
<li>
<a name="28"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 2.8</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.8;  todos estos problemas
est&aacute;n resueltos en
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.
<a href="stable.html">OpenBSD<i>-stable</i></a> para 2.8 ya no
est&aacute; siendo mantenido, por lo que es necesario actualizar el
sistema.

<p>
<ul>
<li><a href="errata28.html#uucp">11 de septiembre de 2001:
	Existe un agujero de seguridad en uuxqt(8) que permite a un atacante
	obtener privilegios de root.</a>
<li><a href="errata28.html#lpd">29 de agosto de 2001:
	Existe un agujero de seguridad en lpd(8) que permite a un atacante
	obtener privilegios de root si el d&aelig;mon lpd est&aacute;
	iniciado.</a>
<li><a href="errata28.html#sendmail2">21 de agosto de 2001:
	Existe un agujero de seguridad en sendmail(8) que puede permitir que
	un atacante en la m&aacute;quina local obtenga privilegios de
	superusuario.</a>
<li><a href="errata28.html#kernexec">15 de junio de 2001:
	Una condici&oacute;n de carrera en el n&uacute;cleo del sistema
	puede llegar a compremeter root en el sistema local.</a>
<li><a href="errata28.html#fts">30 de mayo de 2001:
	Los programas que usen las rutinas fts pueden ser enga&ntilde;ados
	para cambiar al directorio err&oacute;neo.</a>
<li><a href="errata28.html#sendmail">29 de mayo de 2001:
	Los manejadore de se&ntilde;ales de sendmail contienen c&oacute;digo
	no seguro, lo que puede provocar numerosas condiciones de
	carrera.</a>
<li><a href="errata28.html#ipf_frag">23 de abril 2001:
	IPF contiene un grave error con su manejo de cach&eacute; de
	fragmento.</a>
<li><a href="errata28.html#glob_limit">23 de abril 2001:
	ftpd(8) contiene una denegaci&oacute;n de servicio (DoS) en potencia
	relacionada con glob(3).</a>
<li><a href="errata28.html#glob">10 de abril de 2001:
	La llamada de la biblioteca glob(3) contiene m&uacute;ltiples
	desbordamientos de la memoria intermedia.</a>
<li><a href="errata28.html#readline">18 de marzo de 2001:
	La biblioteca readline crea ficheros de historial con modos
	permisivos basados en el <i>umask</i> del usuario.</a>
<li><a href="errata28.html#ipsec_ah">2 de marzo de 2001:
	Comprobaciones insuficientes en la opci&oacute;n del manejo del
	c&oacute;digo de IPSEC AH IPv4 pueden causar que se rebase el
	l&iacute;mite de la memoria del n&uacute;cleo.</a>
<li><a href="errata28.html#userldt">2 de marzo de 2001:
	La opci&oacute;n <strong>USER_LDT</strong> del n&uacute;cleo permite
	que un atacante pueda ganar acceso a zonas privilegiadas de la
	memoria del n&uacute;cleo.</a>
<li><a href="errata28.html#sudo">22 de febrero de 2001:
	Solucionado un desbordamiento en la memoria intermedia que no
	constitu&iacute;a un <i>exploit</i> en sudo(8).</a>
<li><a href="errata28.html#named">29 de enero de 2001:
	Fusionado named(8) con ISC BIND 4.9.8-REL, lo que soluciona algunas
	vulnerabilidades de la memoria intermedia.</a>
<li><a href="errata28.html#rnd">22 de enerod de 2001:
	Cuando se le enviaban datos, rnd(4) no usaba toda las entradas.</a>
<li><a href="errata28.html#xlock">22 de diciembre de 2000:
	Se ha vuelto a escribir la autenticaci&oacute;n de xlock(1) para que
	autentique por medio de una tuber&iacute;a determinada (incluye
	parche y nuevos binarios para xlock).</a>
<li><a href="errata28.html#procfs">18 de diciembre de 2000:
	Procfs contiene muchos desbordamientos.  Procfs no se usa de forma
	predefinida en OpenBSD (incluye parche).</a>
<li><a href="errata28.html#kerberos2">10 de diciembre de 2000:
	Hay otro problema en las bibliotecas de KerberosIV (incluye
	parche).</a>
<li><a href="errata28.html#kerberos">7 de diciembre de 2000:
	Hay un par de problemas en KerberosIV (incluye parche).</a>
<li><a href="errata28.html#ftpd">4 de diciembre de 2000:
	Hay un desbordamiento de la memoria intermedia en ftpd (incluye
	parche).</a>
</ul>

<p>
<li>
<a name="27"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 2.7</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.7;  todos estos problemas
est&aacute;n resueltos en
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.  Obviamente, todos
los avisos de OpenBSD 2.6 en la lista correspondiente a 2.6 est&aacute;n
solucionados en OpenBSD 2.7.

<p>
<ul>
<li><a href="errata27.html#readline">18 de marzo de 2001:
	La biblioteca readline crea ficheros de historial con modos
	permisivos basados en el <i>umask</i> del usuario.</a>
<li><a href="errata27.html#sudo">22 de febrero de 2001:
	Reparado un desbordamiento de la memoria intermedia en sudo(8).</a>
<li><a href="errata27.html#ftpd">4 de diciembre de 2000:
	Existe un desbordamiento de la memoria en ftpd (incluye parche).</a>
<li><a href="errata27.html#sshforwarding">10 de noviembre de 2000:
	Servidores hostiles pueden forzar a clientes de OpenSSH a hacer
	reenv&iacute;os por agente o X11.  (incluye parche)</a>
<li><a href="errata27.html#xtrans">26 de octubre de 2000:
	Posibilidad de desbordamientos en el c&oacute;digo de xtrans en las
	bibliotecas de X11.  (incluye parche)</a>
<li><a href="errata27.html#httpd">18 de octubre de 2000:
	Los m&oacute;dulos mod_rewrite y mod_vhost_alias de Apache
	podr&iacute;n exponer los ficheros en el servidor en ciertos tipos
	de configuraci&oacute;n si se usan.  (incluye parche)</a>
<li><a href="errata27.html#telnetd">10 de octubre de 2000:
	El d&aelig;mon de telnet no elimina las variables de entorno
	TERMINFO, TERMINFO_DIRS, TERMPATH y TERMCAP como debiera.  (incluye
	parche)</a>
<li><a href="errata27.html#format_strings">6 de octubre de 2000:
	Errores en cadenas de formato tipo printf en varios programas con
	privilegios.  (incluye parche)</a>
<li><a href="errata27.html#curses">6 de octubre de 2000:
	libcurses hac&iacute;a honor a las descripciones de terminal en el
	directorio $HOME/.terminfo as&iacute; como en la variable de entorno
	TERMCAP en aplicaciones setuid y setgid.  (incluye parche)</a>
<li><a href="errata27.html#talkd">6 de octubre de 2000:
	Existe una vulnerabilidad de cadena de formato en talkd(8).
	(incluye parche)</a>
<li><a href="errata27.html#pw_error">3 de octubre de 2000:
	Existe una vulnerabilidad en la cadena de formato de la
	funci&oacute;n pw_error() de la biblioteca libutil, que da como
	resultado un agujero de root en anfitriones locales a trav&eacute;s
	de chpass(1).  (incluye parche)</a>
<li><a href="errata27.html#ipsec">18 de septiembre de 2000:
	Paquetes ESP/AH malignos podr&iacute;an causar una ca&iacute;da bajo
	ciertas condiciones.  (incluye parche)</a>
<li><a href="errata27.html#xlock">16 de agosto de 2000:
	Existe una vulnerabilidad en una cadena de formato (localhost root)
	en xlock(1).  (incluye parche)</a>
<li><a href="errata27.html#X11_libs">14 de julio de 2000:
	Varios errores encontrados en bibliotecas de X11 que tienen varios
	efectos colaterales, casi una denegaci&oacute;n de servicio total en
	OpenBSD.  (incluye parche)</a>
<li><a href="errata27.html#ftpd">5 de julio de 2000:
	Como la mayor&iacute;a de d&aelig;mons de ftp en otros unix, ftpd
	conten&iacute;a un agujero de seguridad remoto en root.  Por suerte,
	la opci&oacute;n predefinida de ftpd viene desactivada.  El problema
	existe si se activa ftp an&oacute;nimo.  (incluye parche)</a>
<li><a href="errata27.html#mopd">5 de julio de 2000:
	Mopd, que se usa rara vez, conten&iacute;a algunos desbordamientos
	de memoria intermedia.  (incluye parche)</a>
<li><a href="errata27.html#libedit">28 de junio de 2000:
	libedit busca un fichero <i>.editrc</i> en el directorio actual.
	Aun cuando esto no supone un problema de seguridad real, es un
	comportamiento extra&ntilde;o y hemos creado un parche.  (incluye
	parche)</a>
<li><a href="errata27.html#dhclient">24 de junio de 2000:
	Un error grave en dhclient(8) que permit&iacute;a que se pudieran
	ejecutar cadenas en la shell como usuario root, desde un servidor de
	dhcp con mala idea.  (incluye parche)</a>
<li><a href="errata27.html#isakmpd">9 de junio de 2000:
	Un grave error en el manejo de policy de isakmpd(8) por el cual la
	verficaci&oacute;n de policy se pod&iacute;a circunvalar
	completamente en isakmpd.  (incluye parche)</a>
<li><a href="errata27.html#uselogin">6 de junio de 2000:
	El indicador UseLogin (no activado de forma predeterminada) en
	<i>/etc/sshd_config</i> no funciona y no se deber&iacute;a usar; su
	utilizaci&oacute;n da como resultado problemas de seguridad en otros
	sistemas operativos.</a>
<li><a href="errata27.html#bridge">26 de mayo de 2000:
	El indicador <strong>learning</strong> de bridge(4) puede ser
	circunvalado.  (incluye parche)</a>
<li><a href="errata27.html#ipf">25 de mayo de 2000:
	El uso incorrecto de las reglas <strong>keep-state</strong> puede
	dar como resultado que se circunvalen la reglas en el cortafuegos.
	(incluye parche)</a>
</ul>

<p>
<li>
<a name="26"></a>

<h3><font color="#e00000">Avisos de Seguridad de OpenBSD 2.6</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.6;  todos estos problemas
est&aacute;n solucionados en
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.  Obviamente, todos
los avisos de OpenBSD 2.5 que aparecen en la lista correspondiente a 2.5
est&aacute;n solucionados en OpenBSD 2.6.

<p>
<ul>
<li><a href="errata26.html#semconfig">26 de mayo de 2000:
	El soporte para sem&aacute;foro de SYSV conten&iacute;a una llamada
	del sistema no documentada que pod&iacute;a impedir la salida a los
	procesos que usan sem&aacute;foros.  (incluye parche)</a>
<li><a href="errata26.html#ipf">25 de mayo de 2000:
	El uso incorrecto de las reglas <strong>keep-state</strong> puede
	dar como resultado que se circunvalen la reglas en el cortafuegos.
	(incluye parche)</a>
<li><a href="errata26.html#xlockmore">25 de mayo de 2000:
	xlockmore tiene un error por el que un atacante local puede ganar
	acceso al resumen criptogr&aacute;fico de la contrase&ntilde;a de
	root (que normalmente est&aacute; codificada con blowfish</a>
	(v&eacute;ase
	<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crypt&sektion=3">crypt(3)</a>))
	(incluye parche).
<li><a href="errata26.html#procfs">20 de enero de 2000:
	Los sistemas que funcionen con procfs activado y montado son
	vulnerables a un complicado <i>exploit</i>.  procfs no se monta de
	forma de predeterminada (incluye parche).</a>
<li><a href="errata26.html#sendmail">4 de diciembre de 1999:
	Sendmail permite que cualquier usuario que haga que un fichero de
	aliases sea envuelto, exponiendo de este modo al sistema a una
	condici&oacute;n de carrera en donde el fichero de aliases no
	exsiste (incluye parche).</a>
<li><a href="errata26.html#poll">4 de diciembre de 1999:
	Varios errores en poll(2) pueden provocar un ca&iacute;da del
	n&uacute;cleo del sistema.</a>
<li><a href="errata26.html#sslUSA">2 de diciembre de 1999:
	Un desbordamiento en la memoria intermedia en el c&oacute;digo de
	RSAREF incluido en la versi&oacute;n para los EE.UU. de libssl,
	puede ser un <i>exploit</i>en httpd, ssh, o isakmpd si est&aacute;n
	activadas las caracter&iacute;sticas SSL/RSA (incluye
	parche).</a><br>
	<strong>Actualizaci&oacute;n:</strong> Esto no ten&iacute;a
	ning&uacute;n efecto en ning&uacute;n programa incluido en OpenBSD
	2.6.
<li><a href="errata26.html#ifmedia">9 de noviembre de 1999: 
	Cualquier usuario podr&iacute;a cambiar las configuraciones de la
	interfaz de medios, dando como resultado un ataque de
	denegaci&oacute;n de servicio sobre el localhost.  (incluye
	parche).</a>
</ul>

<p>
<li>
<a name="25"></a>

<h3><font color="#e00000">Avisos de Seguridad de OpenBSD 2.5</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.5;  todos estos problemas
est&aacute;n solucionados en
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.  Obviamente, todos
los avisos de OpenBSD 2.4 que aparecen el la lista correspondiente a 2.4
est&aacute;n solucionados en OpenBSD 2.5.

<p>
<ul>
<li><a href="errata25.html#cron">30 de agosto de 1999: 
	En cron(8), aseg&uacute;rese de que argv[] se finaliza con NULL en
	el popen() falso y que ejecuta sendmail como usuario, no como root
	(incluye parche).</a>
<li><a href="errata25.html#miscfs">12 de agosto de 1999: 
	Los sistemas de archivos procfs y fdescfs tienen un exceso en su
	gesti&oacute;n de uio_offset en sus rutinas readdir().  Estos
	sistemas de archivos no est&aacute;n activados de forma
	predeterminada (incluye parche).</a>
<li><a href="errata25.html#profil">9 de agosto de 1999:
	El proceso de perfilaci&oacute;n (ver profil(2)) se para cuando
	execve() un nuevo proceso (incluye parche).</a>
<li><a href="errata25.html#ipsec_in_use">6 de agosto de 1999:
	Paquetes que deber&iacute;an ser gestionados por IPsec pueden ser
	transmitidos como texto legible.  La caducidad en PF_KEY SA puede
	hacer perder recursos al n&uacute;cleo del sistema (incluye
	parche).</a>
<li><a href="errata25.html#rc">5 de agosto de 1999:
	En <i>/etc/rc</i>, usa mktemp(1) para reescribir motd y cambia el
	find(1) para usar -execdir (incluye parche).</a>
<li><a href="errata25.html#chflags">30 de julio de 1999:
	No permite a usuarios normales el uso de chflags(2) o fchflags(2) en
	dispositivos de bloque o car&aacute;cter de los que puedan ser
	propietarios (incluye parche).</a>
<li><a href="errata25.html#nroff">27 de julio de 1999:
	Causa que groff(1) sea invocado con el indicador -S cuando es
	llamado por nroff(1) (incluye parche).</a>
</ul>

<p>
<li>
<a name="24"></a>

<h3><font color="#e00000">Avisos de Seguridad de OpenBSD 2.4</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.4;  todos estos problemas
est&aacute;n solucionados en
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.  Obviamente, todos
los avisos de OpenBSD 2.3 que aparecen en la lista correspondiente a 2.3
est&aacute;n solucionados en OpenBSD 2.4.

<p>
<ul>
<li><a href="errata24.html#poll">22 de marzo de 1999:
	El argumento de nfds para poll(2) necesita ser forzado para evitar
	la inanici&oacute;n de kvm <!-- se muere de hambre? --> (incluye
	parche).</a>
<li><a href="errata24.html#tss">21 de marzo de 1999:
	Un cambio en el manejo de TSS provoca otra ca&iacute;da del
	n&uacute;cleo causada por el programa <strong>crashme</strong>
	(incluye parche).</a>
<li><a href="errata24.html#nlink">25 de febrero de 1999:
	Un incremento ilimitado sobre el valor nlink en los sistemas de
	archivos FFS y EXT2FS puede provocar una ca&iacute;da del sistema
	(incluye parche).</a>
<li><a href="errata24.html#ping">23 de febrero de 1999:
	Otro desbordamiento m&aacute;s en la memoria intermedia en ping(8)
	(incluye parche).</a>
<li><a href="errata24.html#ipqrace">19 de febrero de 1999:
	iprintr() tuvo una condici&oacute;n de carrera en el uso del ipq que
	permit&iacute;a que un atacante pudiera provocar una ca&iacute;da
	del sistema (incluye parche).</a>
<li><a href="errata24.html#accept">17 de febrero de 1999:
	Una condici&oacute;n de carrera en el n&uacute;cleo entre accept(2)
	y select(2) permit&iacute;a que un atacante pudiera colgar <!--
	sockets --><i>sockets</i> de forma remota (incluye parche).</a>
<li><a href="errata24.html#maxqueue">17 de febrero de 1999:
	El ensamblaje del fragmento IP puede atascar la m&aacute;quina en
	exceso y causar problemas (incluye parche).</a>
<li><a href="errata24.html#trctrap">12 de febrero de 1999:
	El gestor T_TRCTRAP en i386 y DDB interaccionan para, probablemente,
	causar una ca&iacute;da (incluye parche).</a>
<li><a href="errata24.html#rst">11 de febrero de 1999:
	El gestor RST de TCP/IP estaba descuidado (incluye parche).</a>
<li><a href="errata24.html#bootpd">27 de noviembre de 1998:
	<i>exploit</i> remoto en bootpd(8) (incluye parche).</a>
<li><a href="errata24.html#termcap">19 de noviembre de 1998:
	Existe la posibilidad de que haya un <i>exploit</i> local
	relacionado con las variable de entorno en termcap y curses (incluye
	parche).</a>
<li><a href="errata24.html#tcpfix">13 de noviembre de 1998:
	Hay un error de bloqueo remoto de m&aacute;quina en el n&uacute;cleo
	de descodificaci&oacute;n de TCP (incluye parche).</a>
</ul>

<p>
<li>
<a name="23"></a>

<h3><font color="#e00000">Avisos de Seguridad de OpenBSD 2.3</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.3;  todos estos problemas
est&aacute;n solucionados en
<a href="anoncvs.html">OpenBSD<i>-current</i></a>.  Obviamente, todos
los avisos de OpenBSD 2.2 que aparecen en la lista correspondiente a 2.2
est&aacute;n solucionados en OpenBSD 2.3.

<p>
<ul>
<li><a href="../errata23.html#bootpd">27 de noviembre de 1998:
	Hay un <i>exploit</i> remoto en bootpd(8) (incluye parche).</a>
<li><a href="../errata23.html#tcpfix">13 de noviembre de 1998:
	Hay un error de bloqueo remoto de m&aacute;quina en el n&uacute;cleo
	de descodificaci&oacute;n de TCP (incluye parche).</a>
<li><a href="errata23.html#resolver">31 de agosto de 1998:
	Un error de desbordamiento de memoria en el <i>resolver</i> fue
	reintroducido por accidente (incluye parches).</a>
<li><a href="errata23.html#chpass">2 de agosto de 1998:
	chpass(1) tiene una fuga en el descriptor de fichero que permite que
	un atacante modifique <i>/etc/master.passwd</i>.</a>
<li><a href="errata23.html#inetd">15 de julio de 1998:
	Inetd ten&iacute;a una fuga en el descriptor de fichero.</a>
<li><a href="../errata23.html#fdalloc"> 2 de julio de 1998:
	Los procesos setuid y setgid no deben ejecutarse con las ranuras fd
	0, 1, &oacute; 2 libres (incluye parche).</a>
<li><a href="../errata23.html#xlib">6 de junio de 1998:
	M&aacute;s problemas con las librer&iacute;as de X (incluye
	parches).</a>
<li><a href="../errata23.html#kill">17 de mayo de 1998:
	kill(2) de procesos con objetivos setuid/setgid demasiado permisivo
	(4&ordf; revisi&oacute;n incluye parche).</a>
<li><a href="../errata23.html#immutable">11 de mayo de 1998:
	mmap() permite que se sobrepasen parcialmente indicadores de
	ficheros inmutables y de s&oacute;lo a&ntilde;adido  (incluye
	parche).</a>
<li><a href="../errata23.html#ipsec">5 de mayo de 1998:
	Gesti&oacute;n incorrecta en el manejo de paquetes de IPSEC si IPSEC
	est&oacute; activado (incluye parche).</a>
<li><a href="../errata23.html#xterm-xaw">1 de mayo de 1998:
	Desbordamiento de la memoria intermedia en xterm y Xaw (CERT
	advisory VB-98.04) (incluye parche).</a>
</ul>

<p>
<li>
<a name="22"></a>

<h3><font color="#e00000">Avisos de Seguridad de OpenBSD 2.2</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.2;  todos estos problemas
est&aacute;n solucionados en <a href="../23.html">OpenBSD 2.3</a>.
Algunos de estos problemas todav&iacute;a existen en otros sistemas
operativos (los parches que se proporcionan son para OpenBSD 2.2; pueden
o no funcionar en OpenBSD 2.1).

<p>
<ul>
<li><a href="../errata22.html#ipsec">5 de mayo de 1998:
	Gesti&oacute;n incorrecta de paquetes de IPSEC si IPSEC est&aacute;
	activado (incluye parche).</a>
<li><a href="../errata22.html#xterm-xaw">1 de mayo de 1998:
	Desbordamiento de la memoria intermedia en xterm y Xaw (CERT
	advisory VB-98.04) (incluye parche).</a>
<li><a href="../errata22.html#uucpd">22 de abril de 1998:
	Desbordamiento en la memoria intermedia en uucpd (incluye
	parche).</a>
<li><a href="../errata22.html#rmjob">22 de abril de 1998:
	Mala gesti&oacute;n de la memoria intermedia en lprm (incluye
	parche).</a>
<li><a href="../errata22.html#ping">31 de marzo de 1998:
	Desbordamiento en ping -R (incluye parche).</a>
<li><a href="../errata22.html#named">30 de marzo de 1998:
	Desbordamiento en fake-iquery (incluye parche).</a>
<li><a href="../errata22.html#mountd">2 de marzo de 1998:
	Exportaci&oacute;n accidental del sistema de archivos NFS (incluye
	parche).</a>
<li><a href="../advisories/mmap.txt">26 de febrero de 1998:
	Defecto de lectura/escritura de mmap().</a> La revisi&oacute;n 3 del
	parche est&aacute; disponible
	<a href="../errata22.html#mmap">aqu&iacute;</a>.
<li><a href="../advisories/sourceroute.txt">19 de febrero de 1998:
	Aceptaci&oacute;n de paquetes <!-- sourcerouted -->de fuentes
	enrutados.</a> Hay un parche disponible 
	<a href="../errata22.html#sourceroute">aqu&iacute;</a>.
<li><a href="../errata22.html#ruserok">13 de febrero de 1998:
	Defecto de <!-- coredump -->volcado de Setuid y Ruserok() (incluye
	parche).</a>
<li><a href="../errata22.html#ldso">9 de febrero de 1998:
	Defecto de ld.so en MIPS (incluye parche).</a>
</ul>

<p>
<li>
<a name="21"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 2.1</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.1;  todos estos problemas
est&aacute;n solucionados en <a href="../22.html">OpenBSD 2.2</a>.
Algunos de estos problemas todav&iacute;a existen en otros sistemas
operativos (si usa OpenBSD 2.1 le recomendamos que lo actualice con la
versi&oacute;n m&oacute;s nueva, ya que esta lista de parches
s&oacute;lo intenta eliminar los problemas m&aacute;s importantes de
seguridad.  En particular, en OpenBSD 2.2 se resuelven muchos problemas
de seguridad en el anfitri&oacute;n local.  Muchos de estos problemas
fueron solucionados de un modo en que nos result&oacute; dif&iacute;cil
crear parches).

<p>
<ul>
<li><a href="../advisories/signals.txt">15 de septiembre de 1997:
	Se&ntilde;ales de desv&iacute;o (incluye parche).</a>
<li><a href="../advisories/rfork.txt">2 de agosto de 1997:
	Defecto en la llamada del sistema de Rfork() (incluye parche).</a>
<li><a href="../advisories/procfs.txt">24 de junio de 1997:
	Defectos en procfs (incluye parche).</a>
</ul>

<p>
<li>
<a name="20"></a>

<h3><font color="#e00000">Avisos de seguridad de OpenBSD 2.0</font></h3>

<p>
&Eacute;stos son los avisos de OpenBSD 2.0;  todos estos problemas
est&aacute;n solucionados en <a href="../21.html">OpenBSD 2.1</a>.
Algunos de estos problemas todav&iacute;a existen en otros sistemas
operativos (si usa OpenBSD 2.0 le felicitamos por seguir resistiendo al
avance del tiempo, pero se est&aacute; perdiendo mucho si no instala una
versi&oacute;n nueva).

<p>
<ul>
<li><a href="../advisories/res_random.txt">22 de abril de 1997: IDs
predecibles (incluye parche).</a>
<li>Muchos otros... si alguien los puede encontrar que me lo haga saber
y los pondr&eacute; aqu&iacute;.
</ul>

</dl>

<p>
<a name="watching"></a>
<li><h3><font color="#e00000">Monitorizaci&oacute;n de
cambios</font></h3>

<p>
Puesto que adoptamos una postura proactiva con respecto a la seguridad,
estamos cont&iacute;nuamente encontrando y solucionando nuevos problemas
de seguridad.  No se informa sobre todos estos problemas en profundidad
debido a que, como ya se ha dicho anteriormente, en muchos de ellos no
existe la confirmaci&oacute;n de que sean <i>exploits</i>; muchos
errores simples que solucionamos resultan tener consecuencias que no
podr&iacute;amos predecir.  No disponemos del tiempo que ser&iacute;a
necesario para hacer esos cambios disponibles en este formato.

<p>
As&iacute; pues, hay generalmente peque&ntilde;as reparaciones de
seguridad en el c&oacute;digo fuente de la versi&oacute;n de desarrollo
que van m&aacute;s all&aacute; de las hechas en la versi&oacute;n final
previa de OpenBSD.  Garantizamos hasta un l&iacute;mite que estos
problemas tienen un m&iacute;nimo impacto y no est&aacute;n verificados
como <i>exploits</i>.  Si descubrimos que un problema es de una
importancia crucial para la seguridad, los parches aparecer&aacute;n
aqu&iacute; <strong>MUY</strong> r&aacute;pido.

<p>
Aquellos usuarios a quien realmente les preocupe la seguridad, pueden
hacer varias cosas:

<p>
<ul>
   <li>Si entiende sobre asuntos de seguridad, observe nuestra 
   <a href="mail.html">lista de correo &quot;source-changes&quot;</a> y
   preste atenci&oacute;n a todo lo que aparezca relacionado con la
   seguridad.  Ya que no se puede probar que muchas de las reparaciones
   que hacemos sean <i>exploits</i>, no espere que el mensaje que busca
   diga algo como &quot;SECURITY FIX&quot;.  Si un problema est&aacute;
   probado y es serio, habr&aacute; un parche disponible aqu&iacute;
   poco tiempo despu&eacute;s.
      
   <li>Adem&aacute;s de los cambios en el c&oacute;digo fuente,
   tambi&eacute;n puede subscribirse a nuestra <a href="mail.html">lista
   de correo de avisos de seguridad</a>, en donde se notificar&aacute;
   cualquier asunto relacionado con la seguridad que el equipo de
   OpenBSD crea que pueda ser una posible amenaza, y en donde se
   dar&aacute;n instrucciones sobre c&oacute;mo paliar el problema.

   <li>Siga nuestro &aacute;rbol del c&oacute;digo fuente en desarrollo
   (<i>current</i>) y aprenda Vd. mismo c&oacute;mo construir un sistema
   completo de vez en cuando (lea <i>/usr/src/Makefile</i> con
   atenci&oacute;n).  Los usuarios pueden asumir que el &aacute;rbol de
   fuentes en desarrollo siempre tiene implementaciones de seguridad
   m&aacute;s robustas que la revisi&oacute;n anterior.  Sin embargo,
   construir su propio sistema desde el c&oacute;digo fuente no es una
   tarea trivial; son casi 300MB de c&oacute;digo fuente, y mientras nos
   encontramos en la transici&oacute;n entre versiones ocurren
   problemas.

   <li>Instale una versi&oacute;n preliminar (<i>snapshot</i>) binaria
   para su arquitectura; &eacute;stas se ponen a disposici&oacute;n con
   bastante frecuencia.  Por ejemplo, un <i>snapshot</i> para i386 suele
   salir semanalmente.
</ul>

<p>
<a name="reporting"></a>
<li><h3><font color="#e00000">Informes sobre problemas</font></h3><p>

<p>
Si encuentra alg&uacute;n nuevo problema de seguridad, puede enviarlo
por correo electr&oacute;nico a
<a href="mailto:deraadt@openbsd.org">deraadt@openbsd.org</a>.
<br>
Si desea cifrarlo con PGP (pero por favor, s&oacute;lo si la privacidad
es un tema muy urgente, ya que esto no es conveniente), use esta 
<a href="../advisories/pgpkey.txt">clave pgp</a>.

<p>
<a name="papers"></a>
<li><h3><font color="#e00000">Otros textos</font></h3><p>

<p>
Los miembros del equipo de OpenBSD han escrito una cantidad de
documentos sobre cambios relacionados con la seguridad que han llevado a
cabo en OpenBSD.  Las versiones postscript de estos documentos se
encuentran disponibles como sigue:

<p>
<ul>
<li>A Future-Adaptable Password Scheme.<br>
	<a href="../events.html#usenix99">Usenix 1999</a>,
	por <a href="mailto:provos@openbsd.org">Niels Provos</a>,
	<a href="mailto:dm@openbsd.org">David Mazieres</a>.<br>
	<a href="../papers/bcrypt-paper.ps">ponencia</a> y 
	<a href="../papers/bcrypt-slides.ps">diapositivas</a>.
<p>
<li>Cryptography in OpenBSD: An Overview.<br>
	<a href="../events.html#usenix99">Usenix 1999</a>,
	por <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>,
	<a href="mailto:niklas@openbsd.org">Niklas Hallqvist</a>,
	<a href="mailto:art@openbsd.org">Artur Grabowski</a>,
	<a href="mailto:angelos@openbsd.org">Angelos D. Keromytis</a>,
	<a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
	<a href="../papers/crypt-paper.ps">ponencia</a> y 
	<a href="../papers/crypt-slides.ps">diapositivas</a>.
<p>
<li>strlcpy and strlcat -- consistent, safe, string copy and
concatenation.<br>
	<a href="../events.html#usenix99">Usenix 1999</a>,
	por <a href="mailto:millert@openbsd.org">Todd C. Miller</a>,
	<a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.<br>
	<a href="../papers/strlcpy-paper.ps">ponencia</a> y 
	<a href="../papers/strlcpy-slides.ps">diapositivas</a>.
<p>
<li>Dealing with Public Ethernet Jacks-Switches, Gateways, and
Authentication.<br>
	<a href="../events.html#lisa99">LISA 1999</a>,
	por <a href="mailto:beck@openbsd.org">Bob Beck</a>.<br>
	<a href="../papers/authgw-paper.ps">ponencia</a> y 
	<a href="../papers/authgw-slides.ps">diapositivas</a>.
<p>
<li>Encrypting Virtual Memory<br>
	<a href="../events.html#sec2000">Usenix Security 2000</a>,
	por <a href="mailto:provos@openbsd.org">Niels Provos</a>.<br>
	<a href="../papers/swapencrypt.ps">ponencia</a> y
	<a href="../papers/swapencrypt-slides.ps">diapositivas</a>.
<p>
</ul>

</dl>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: security.html,v 1.259 ]<br>
$Translation: security.html,v 1.100 2003/10/05 00:04:38 horacio Exp $<br>
$OpenBSD: security.html,v 1.87 2003/10/05 00:22:05 horacio Exp $
</small>

</body>
</html>
