<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Versi&oacute;n estable de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="stable">
<meta name="keywords" content="openbsd,anoncvs,actualizaciones,stable">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1996-1998 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Versi&oacute;n estable de OpenBSD
(OpenBSD<em>-stable</em>)</font><hr></h2>

<p>
<ul><h3>Tabla de contenidos</h3>
<li><a href="#whatis">&iquest;Qu&eacute; es la versi&oacute;n
estable?</a>
<li><a href="#getting">C&oacute;mo obtener la versi&oacute;n estable</a>
<li><a href="#building">Compilaci&oacute;n del sistema desde la
versi&oacute;n estable</a>
</ul>
</p>
<hr>

<a name="whatis"></a>
<h3><font color="#0000e0">&iquest;Qu&eacute; es la versi&oacute;n
estable?</font></h3>

<p>
La versi&oacute;n estable (<em>-stable</em>) es una versi&oacute;n
actualizada de la versi&oacute;n final (<em>-release</em>) mediante la
aplicaci&oacute;n de ciertos parches.

<p>
A partir de la versi&oacute;n 2.7, OpenBSD ofrece un &aacute;rbol de
fuentes que contiene soluciones y parches importantes (o sea, los de
<a href="errata.html">errata</a> m&aacute;s otros que son obvios y
simples, pero que no merecen una entrada en la p&aacute;gina de
erratas), y que se encuentran disponibles a trav&eacute;s de
<a href="anoncvs.html">CVS</a> junto con el c&oacute;digo fuente de la
versi&oacute;n en desarrollo (<em>-current</em>).  Por tanto, los
usuarios pueden escoger entre tres opciones:

<p>
<ul>
<li>Quedarse con la &uacute;ltima versi&oacute;n final
(<em>-release</em>) y aplicarle los parches a mano.
<li>Usar la <strong>versi&oacute;n estable</strong>, a la que ya se le
han aplicado los parches m&aacute;s importantes.
<li>Usar el <strong>c&oacute;digo fuente de la versi&oacute;n en
desarrollo</strong> (<em>-current</em>), con todas las funcionalidades
de &uacute;ltima hora.
</ul>

<p>
El <a href="../plus.html">tabl&oacute;n de cambios diarios</a> ofrece
una lista detallada de los parches posteriores a la versi&oacute;n final
que han sido aplicados a la versi&oacute;n estable.  En principio, todas
las entradas en <a href="errata.html">errata</a> se fusionar&aacute;n en
la versi&oacute;n estable dentro de las 48 horas siguientes a la
publicaci&oacute;n de la errata.  Otros parches posteriores a la
versi&oacute;n final tambi&eacute;n se fusionar&aacute;n dependiendo de
ciertas condiciones:

<ul>
<li>Los parches deben ser simples, cortos y l&oacute;gicamente,
correctos al 100%.
<li>Las entradas en errata son para errores que afectan a muchos
usuarios.  Otros parches se pueden fusionar en la versi&oacute;n estable
si afectan a unas pocas personas pero de forma dr&aacute;stica.
<li>Por favor, no se debe pedir que se fusionen subsistemas o parches
grandes.  Mantener el &aacute;rbol de parches requiere un gran esfuerzo
que podr&iacute;amos usar en mejorar nuestra pr&oacute;xima
versi&oacute;n final.
<li>Como excepci&oacute;n a las reglas anteriores, las versiones finales
de OpenSSH se fusionar&aacute;n en la versi&oacute;n estable.
</ul>


<p>
<a name="getting"></a>
<h3><font color="#0000e0">C&oacute;mo obtener una versi&oacute;n
estable</font></h3>

<p>
Para obtener una versi&oacute;n estable de una versi&oacute;n final
concreta de OpenBSD, se puede actualizar sobre el &aacute;rbol de
fuentes ya existente (desde <a href="ftp.html">FTP</a> o desde el
<a href="orders.html">CD</a>), o se puede obtener un nuevo &aacute;rbol
de fuentes desde un servidor de <a href="anoncvs.html">AnonCVS</a>.  Las
instrucciones para bajarse la versi&oacute;n estable y permanecer
actualizado se encuentran en la secci&oacute;n <strong>C&oacute;mo
Empezar a Usar CVS An&oacute;nimo</strong> de la
<a href="anoncvs.html#starting">documentaci&oacute;n de AnonCVS</a>.

<p>
Hay que tener en cuenta que las versiones estables no ayudan a
actualizar desde una versi&oacute;n final de OpenBSD a otra, v.g. desde
la 2.5 hasta la 2.8.  S&oacute;lo son un modo para estar al d&iacute;a
con los parches dentro de una versi&oacute;n concreta.  Si se quiere
pasar de una versi&oacute;n a otra mediante el c&oacute;digo fuente, se
debe leer antes el documento
<a href="../faq/es/upgrade-minifaq.html">upgrade-minifaq</a> sobre
c&oacute;mo actualizar una versi&oacute;n, de las preguntas frecuentes.
Adem&aacute;s no es posible retroceder desde <em>-current</em> a
<em>-stable</em> debido a conflictos de versiones en las bibliotecas.


<a name="building"></a>
<h3><font color="#0000e0">Compilaci&oacute;n de una versi&oacute;n
estable de OpenBSD</font></h3>

<p>
Una vez que ya se disponga de un &aacute;rbol de fuentes a trav&eacute;s
de <a href="anoncvs.html">anoncvs</a>, hay que recompilar el sistema.
Los pasos a seguir para ello son:

<ul>
 <li>Recompilar el n&uacute;cleo del sistema
 <li>Reiniciar el sistema con el nuevo n&uacute;cleo
 <li>Recompilar los binarios
</ul>

<h4><font color="#0000e0">Recompilaci&oacute;n del
n&uacute;cleo</font></h4>

<p>
Para recompilar el n&uacute;cleo predeterminado de la versi&oacute;n
estable:

<ul>
<pre>
# <strong>cd /usr/src/sys/arch/i386/conf</strong>
# <strong>/usr/sbin/config GENERIC</strong>
# <strong>cd /usr/src/sys/arch/i386/compile/GENERIC</strong>
# <strong>make clean &amp;&amp; make depend &amp;&amp; make</strong>
</pre>
</ul>

<p>
Hay que sustituir <em>i386</em> con la plataforma correspondiente, v.g.
<em>sparc</em>, <em>alpha</em>, etc&eacute;tera.

<h4><font color="#0000e0">Reinicio con el nuevo
n&uacute;cleo</font></h4>

<p>
Para reiniciar con el n&uacute;cleo que se acaba de compilar:

<ul>
<pre>
# <strong>cd /usr/src/sys/arch/i386/compile/GENERIC</strong>
# <strong>cp /bsd /bsd.old</strong>          <em>(Guardar una copia del viejo n&uacute;cleo)</em>
# <strong>cp bsd /bsd</strong>               <em>(Copiar el nuevo n&uacute;cleo a su ubicaci&oacute;n)</em>
# <strong>reboot</strong>
</pre>
</ul>

<p>
Como en el paso anterior, hay que sustituir la plataforma, en este caso
<em>i386</em> por la plataforma correspondiente.  Si el sistema tiene
problemas con el arranque del nuevo n&uacute;cleo, se puede retroceder y
reiniciar desde el viejo n&uacute;cleo, que ahora se llama
<em>bsd.old</em>.

<h4><font color="#0000e0">Recompilaci&oacute;n de los
binarios</font></h4>

<p>
Para recompilar los binarios del sistema:

<ul>
<pre>
# <strong>cd /usr/src</strong>
# <strong>rm -r /usr/obj/*</strong>
# <strong>make obj &amp;&amp; make build</strong>
</pre>
</ul>

<p>
Esto tardar&aacute; bastante tiempo...

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: stable.html,v 1.12 ]<br>
$Translation: stable.html,v 1.12 2004/08/24 14:59:39 santana Exp $<br>
$OpenBSD: stable.html,v 1.12 2004/08/24 16:46:58 jufi Exp $
</small>
</body>
</html>
