<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>Rama de Parches de OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="stable">
<meta name="keywords" content="openbsd,anoncvs,updates,stable">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-1998 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<img alt="[OpenBSD]" height="30" width="141" SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Ramificaci&oacute;n de Parches</font><hr></h2>

<p>
<ul><h3>Tabla de Contenidos</h3>
<li><a href="#whatis">&iquest;Qu&eacute; es la ramificaci&oacute;n de parches?</a>
<li><a href="#getting">C&oacute;mo obtener la ramificaci&oacute;n de parches</a>
<li><a href="#building">Compilar desde la ramificaci&oacute;n de parches</a>
</ul>
</p>
<hr>

<a name="whatis"></a>
<h3><font color="#0000e0">&iquest;Qu&eacute; es la ramificaci&oacute;n
de parches?</font></h3>

<p>
A partir de la versi&oacute;n 2.7, OpenBSD ofrece un &aacute;rbol de
fuentes que contiene soluciones y parches importantes (o sea, los de 
<a href="errata.html">errata</a> m&aacute;s otros que son obvios y
simples, pero que no merecen una entrada en la p&aacute;gina de
errata), y que se encuentran disponibles a trav&eacute;s de
<a href="anoncvs.html">CVS</a> junto con el c&oacute;digo fuente de
<em>-current</em>.  Por tanto, los usuarios pueden escoger entre tres
opciones:

<p>
<ul>
<li>Quedarse con la &uacute;ltima versi&oacute;n oficial y aplicarle
    parches a mano.
<li>Usar la <b>ramificaci&oacute;n de parches</b>, en la que se han
    aplicado los parches m&aacute;s importantes.
<li>Usar el <b>c&oacute;digo fuente de current</b> con todas las
    funcionalidades de &uacute;ltima hora.
</ul>

<p>
El <a href="plus.html">Tabl&oacute;n de Cambios Diarios</a> ofrece en
detalle qu&eacute; parches posteriores a la versi&oacute;n oficial han
sido aplicados a la ramificaci&oacute;n de parches.  En principio,
todas las entradas en <a href="errata.html">Errata</a> se
fusionar&aacute;n en la ramificaci&oacute;n de parches dentro de las 48
horas siguientes a la publicaci&oacute;n de la errata.  Otros parches
posteriores a la versi&oacute;n oficial tambi&eacute;n se
fusionar&aacute;n dependiendo de ciertas condiciones:

<ul>
<li>Los parches deben ser simples, cortos, y l&oacute;gicamente
    correctos al 100%.
<li>Las entradas en Errata son para errores que afectan a muchos
    usuarios.  Otros parches se pueden fusionar en la
    ramificaci&oacute;n de parches si afectan a unas pocas personas
    pero de forma dr&aacute;stica.
<li>Por favor, no pida que se fusionen subsistemas o parches grandes.
    Mantener el &aacute;rbol de parches requiere un gran esfuerzo que
    podr&iacute;amos usar en mejorar nuestra pr&oacute;xima
    versi&oacute;n oficial.
<li>A modo de excepci&oacute;n de las reglas anteriores, las versiones
    oficiales de OpenSSH se fusionar&aacute;n en la ramificaci&oacute;n
    de parches.
</ul>


<p>
<a name="getting"></a>
<h3><font color="#0000e0">C&oacute;mo obtener una ramificaci&oacute;n
estable</font></h3>

<p>
Para obtener una ramificaci&oacute;n de parches de una versi&oacute;n
particular de OpenBSD, puede actualizar por encima del &aacute;rbol de
fuentes ya existente (desde <a href="ftp.html">FTP</a> o desde el
<a href="orders.html">CD</a>), o puede bajarse un nuevo &aacute;rbol de
fuentes desde un servidor de <a href="anoncvs.html">AnonCVS</a>.  Las
instrucciones para bajarse la ramificaci&oacute;n de parches y
permanecer actualizado se encuentran en la secci&oacute;n
<b>C&oacute;mo Empezar a Usar CVS An&oacute;nimo</b> de la
<a href="anoncvs.html#starting">Documentaci&oacute;n de AnonCVS</a>.

<p>
Tenga en cuenta que las ramificaciones de parches no ayudan a
actualizar de un versi&oacute;n oficial de OpenBSD a otra, v.g. desde
la 2.5 hasta la 2.6.  S&oacute;lo son un modo para estar al d&iacute;a
con los parches dentro de una versi&oacute;n dada.  Si quiere pasar de
una versi&oacute;n a otra mediante el c&oacute;digo fuente, por favor
lea el documento 
<a href="../faq/es/upgrade-minifaq.html">upgrade-minifaq</a> sobre
c&oacute;mo actualizar, de las Preguntas Frecuentes.
Adem&aacute;s no es posible retroceder desde <em>-current</em> a
<em>-stable</em> debido a conflictos de versiones en las bibliotecas.


<a name="building"></a>
<h3><font color="#0000e0">Compilar desde una ramificaci&oacute;n de parches de OpenBSD</font></h3>

<p>
Una vez que ya haya obtenido un &aacute;rbol de fuentes a trav&eacute;s de 
<a href="anoncvs.html">anoncvs</a>, debe recompilar el sistema.  Los pasos a
seguir para ello son:

<ul>
 <li>Recompilar el n&uacute;cleo del sistema
 <li>Reiniciar el sistema con el nuevo n&uacute;cleo
 <li>Recompilar los binarios
</ul>

<h4><font color="#0000e0">Recompilar el n&uacute;cleo</font></h4>

<p>
Para recompilar el n&uacute;cleo predefinido de la versi&oacute;n estable:

<ul>
<pre>
# <strong>cd /usr/src/sys/arch/i386/conf</strong>
# <strong>/usr/sbin/config GENERIC</strong>
# <strong>cd /usr/src/sys/arch/i386/compile/GENERIC</strong>
# <strong>make clean &amp;&amp; make depend &amp;&amp; make</strong>
</pre>
</ul>

<p>
Substituya <i>i386</i> con su plataforma, v.g. <i>sparc</i>, <i>alpha</i>,
etc&eacute;tera.

<h4><font color="#0000e0">Reiniciar con el nuevo n&uacute;cleo</font></h4>

<p>
Para reiniciar con el n&uacute;cleo que acaba de compilar:

<ul>
<pre>
# <strong>cd /usr/src/sys/arch/i386/compile/GENERIC</strong>
# <strong>cp /bsd /bsd.old</strong>          <i>(Guardar una copia del viejo n&uacute;cleo)</i>
# <strong>cp bsd /bsd</strong>               <i>(Copiar el nuevo n&uacute;cleo a su ubicaci&oacute;n)</i>
# <strong>reboot</strong>
</pre>
</ul>

<p>
Como en el paso anterior, substituya su plataforma, en este caso <i>i386</i>
por la plataforma correspondiente.  Si su sistema tiene problemas con el
arranque del nuevo n&uacute;cleo, puede retroceder y reiniciar desde el viejo
n&uacute;cleo, que ahora se llama <i>bsd.old</i>.

<h4><font color="#0000e0">Recompilar los binarios</font></h4>

<p>
Para recompilar los binarios del sistema:

<ul>
<pre>
# <strong>cd /usr/src</strong>
# <strong>rm -r /usr/obj/*</strong>
# <strong>make obj &amp;&amp; make build</strong>
</pre>
</ul>

<p>
Esto tardar&aacute; bastante tiempo...

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: stable.html,v 1.7 2001/02/26 16:19:00 jason Exp ]<br>
$Translation: stable.html,v 1.5 2001/03/01 20:57:29 horacio Exp $<br>
$OpenBSD: stable.html,v 1.5 2001/03/01 22:31:40 jufi Exp $
</small>
</body>
</html>
