<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>OpenBSD visto por sus Usuarios</title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description" content="Comentarios de los usuarios de OpenBSD">
<meta name="keywords" content="openbsd,usuarios">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 2000-2004 de OpenBSD.">
</head>
<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">OpenBSD visto por sus Usuarios</font></h2>
<p>
Muchos usuarios han hecho p&uacute;blico sus experiencias con OpenBSD.
Los siguientes comentarios se han extra&iacute;do de nuestras listas de
correo p&uacute;blicas o, en alguna ocasi&oacute;n, de otras listas de
correo (incluyendo los enlaces al art&iacute;culo original).  Los
mensajes se han acortado y modificado ligeramente, corrigiendo la
gram&aacute;tica y el estilo, pero conserv&aacute;ndo el contexto.

<hr>

<h3><a href="mailto:SKohrman@apu.edu">Shawn Kohrman</a> escribe:</h3>
<p>
Como administrador de redes y de seguridad durante m&aacute;s de diez
a&ntilde;os, debo decir que OpenBSD es el mejor sistema operativo que he
visto nunca tal y como sale de la casa.  He trabajado con MS NT/2000,
Linux (desde sus humildes comienzos), Solaris, etc.  OpenBSD es simple,
limpio, segurio y fiable.  Muchas gracias a los desarrolladores por un
trabajo excelente.

<h3><a href="mailto:kristoff@phatness.net">Kris Wilkinson</a>
escribe:</h3>
<p>
Me he dedicado a seguridad en redes desde hace ya un tiempo y hasta hace
poco, cuando instal&eacute; OpenBSD 3.0, no me hab&iacute;a dado cuenta
de lo mucho que me habr&iacute;a facilitado la vida si lo hubiera
probado antes.  Despu&eacute;n de experimentar todo el
&laquo;resto&raquo; de sistemas operativos disponibles, 3.0 tiene que
ser el m&aacute;s seguro, el paquete m&aacute;s f&aacute;cil de
gestionar y mejor organizado que he visto nunca.  No s&oacute;lo
est&aacute; totalmente a la &uacute;ltima, sino que se centra en los
puntos m&aacute;s peque&ntilde;os de la seguridad que ya estaba cansado
de tener que solucionar por m&iacute; mismo cada vez que instalaba una
m&aacute;quina.
<p>
Estoy instalando redes seguras por toda Alberta usando vuestro
fant&aacute;stica configuraci&oacute;n.  &iexcl;Muchas gracias!
Continuad con esta incre&iacute;ble tarea.

<h3>Matthew Haas afirma:</h3>
<p>
Desde que decid&iacute; instalarlo que he quedado muy impresionado con
OpenBSD.  Es, sin lugar a dudas, un gran sistema, que me recuerda a mis
d&iacute;as con Slackware, pero mejor.
<p>
Gracias.

<h3>
<a href="mailto:webmaster@2600.org.au">Grant Bayley</a>,
Gerente inform&aacute;tico en Australia, escribe:</h3>
<p>
Desde que unos cuantos de nosotros comenzamos a usar OpenBSD en 2600
Australia hace ahora 12 meses, de un modo u otro hemos visto... amigos
que lo han instalado en sus m&aacute;quinas y que han quedado
maravillados por su calidad, en particular por la avanzada mentalidad
que conlleva el asegurarlo todo en el sistema.
<p>
Tambi&eacute;n hemos visto a uno de nuestros chicos que trabaja para un
proveedor de Internet, mantener un pulso con un fan&aacute;tico de SuSE
que trabaja en la misma compa&ntilde;&iacute;a, probando los sistemas
operativos por su compatibilidad, estabilidad y seguridad, antes de
decidirse por uno para sus servidores (que, mientras hab&iacute;an usado
RedHat, les hab&iacute;an robado root al menos una vez).  OpenBSD
pas&oacute; todas la pruebas con sobresaliente, usando en su mayor parte
componentes b&aacute;sicos y programas del &aacute;rbol de portes
(qmail, cucipop, etc... ).

<h3>Jeff Schneier, Administrador de Sistemas y Redes opina:</h3>
<p>
Con un presupuesto restringido puede estar seguro que le sacar&aacute;n
hasta la &uacute;ltima gota de potencia con cualquier equipo del que
disponga... y gracias a OpenBSD, esto precisamente es lo que yo he
hecho.

<h3><a name="sarendal" href="mailto:tony@polarcap.org">Tony Sarendal</a>
comenta:</h3>
<p>
Prob&eacute; OpenBSD por su soporte de IPsec.  La raz&oacute;n por la
que continu&eacute; con &eacute;l es porque te da un sentimiento de
calidad que ning&uacute;n otro sistema operativo puede igualar.
<p>
Tuve que llevar a cabo un poco de programaci&oacute;n en una
m&aacute;quina con OpenBSD, despu&eacute;s de lo cual aprend&iacute; a
apreciar las p&aacute;ginas de manual de OpenBSD.  Otros Unix que he
usado dispon&iacute;an de p&aacute;ginas de manual que no eran ni
remotamente igual de buenas.
<p>
Seguid as&iacute;, chicos.

<h3>Tyler Allison, Ingeniero de Seguridad, escribe:</h3>
<p>
He instalado, asegurado, y mantenido sistemas Linux, WindowsNT y OpenBSD
en entornos con fuertes requisitos de seguridad (s&iacute;, se pueden
asegurar Linux y Windows NT en entornos de este tipo :) ).  Dicho lo
cual, debo reconocer que si se quiere un m&iacute;nimo de
administraci&oacute;n para estar al d&iacute;a con temas de seguridad,
la elecci&oacute;n con diferencia debe recaer en OpenBSD.  No es del
todo inusual que alguien pase a&ntilde;os sin actualizar sus sistemas de
producci&oacute;n de OpenBSD, porque son s&oacute;lidos como una roca y
no tienen vulnerabilidades remotas que se conozcan.  Por lo tanto, no
existen buenas razones para actualizar...
<p>
Me sentir&iacute;a muy tranquilo si uno de mis (novatos) internos
instalara OpenBSD en un PC (sin ning&uacute;n tipo de seguridad
adicional despu&eacute;s de la instalaci&oacute;n) y pusiera los datos
sensibles de las compa&ntilde;&iacute;as en esa m&aacute;quina, y
desapareciera durante un a&ntilde;o entero.  No se puede decir lo mismo
de NT o Linux.  O si lo dice, es obvio que nunca ha usado el producto en
estos entornos :)
<p>
Otra cosa que oigo decir a menudo es la necesidad de comprobar las
listas de correo de alertas sobre vulnerabilidades, para ver si se puede
encontrar un &quot;exploit&quot; a nivel de root &laquo;remoto&raquo;
que afecte a OpenBSD.  Me atrevo a decir que no encontrar&aacute; nada
que tenga menos de 12 meses.

<h3>Jan Johansson en respuesta a la pregunta &laquo;&iquest;c&oacute;mo
puedo montar un servidor para web a buen precio?&laquo;:</h3>
<p>
Hoy por hoy trabajo con Solaris, OpenBSD, NT Server, NT Workstation y
Win 95.
<p>
Despu&eacute;s de leer Bugtraq durante unas semanas, decid&iacute; que
no pondr&iacute;a nada (de importancia) en Internet a menos que
estuviera detr&aacute;s de un cortafuegos, y para el filtrado de
paquetes mi elecci&oacute;n es OpenBSD...
<p>
Para un servidor de web ajustado a un presupuesto yo usar&iacute;a
hardware de una marca fiable, y como software el CD-ROM de OpenBSD y
Apache...


<h3><a href="mailto:wyodlows@nj.devry.edu">William Yodlowsky</a>, de
Devry Institute escribe:</h3>

<p>
Hace ahora unos [cuantos] a&ntilde;os que estaba empezando en
administraci&oacute;n de sistemas.  Primero aprend&iacute; Linux.
Entonces, uno de nuestros viejos servidores con BSDi cay&oacute;, y la
responsabilidad de recomponerlo recay&oacute; sobre m&iacute;.
<p>
Ech&eacute; un vistazo a FreeBSD, NetBSD, OpenBSD y Linux.  Al final, el
que se llev&oacute; el premio fue el &laquo;seguro y estable&raquo;.
Instal&eacute; OpenBSD 2.1.
<p>
Desde entonces, lo he usado desde la versi&oacute;n 2.1 hasta la 2.5
para todo, desde servidores de productividad hasta port&aacute;tiles.  Y
nunca (repito NUNCA) han entrado ilegalmente.
<p>
Un compa&ntilde;ero de trabajo instal&oacute; una m&aacute;quina con
RedHat para probar sus conocimientos configurando SSL y un sitio web
seguro.  Entraron en la m&aacute;quina durante la noche, y durante la
ma&ntilde;ana siguiente el ataque continu&oacute; en otros sitios.
<p>
Nuestros servidores OpenBSD fueron sondeados pero no los tocaron.
<p>
Durante dos a&ntilde;os, el servidor original fue actualizado y
parcheado varias veces, y el sistema operativo nunca nos dio un
s&oacute;lo motivo para cuestionar la fiabilidad o la seguridad de
OpenBSD.
<p>
Tenemos otra m&aacute;quina que hace de enrutador para unas 800
estaciones de trabajo, con NAT y filtrado a un nivel muy b&aacute;sico.
Es un P120 con 32MB de RAM, y por lo general el tiempo de actividad
('uptime') es algo as&iacute;:
<pre>
% uptime
 9:05PM  up 266 days,  4:23, 1 user, load averages: 0.06, 0.06, 0.06
%
</pre>
<p>
Adem&aacute;s, tengo instalado OpenBSD en mi port&aacute;til.  Un
Gateway Solo 2500 con un m&oacute;dem Xircom, y un NIC fast Ethernet de
Linksys.
<p>
Y nunca se cuelga :)
<p>
Hubo otro incidente que me convirti&oacute;... sufrimos un ataque
&quot;pingbomb&quot; (&iquest;tal vez el predecesor de los primeros
ataques DDOS?).  900 anfitriones en diferentes redes enviando una
avalancha de se&ntilde;ales de ping de forma simult&aacute;nea, sobre
una m&aacute;quina OpenBSD 2.3, mientras &eacute;sta procesaba el correo
electr&oacute;nico y las p&aacute;ginas web para 3.500 usuarios.
<p>
Era un P133 con 64MB de RAM.  Y no cay&oacute;.  S&iacute; que se
ralentiz&oacute;, pero no cay&oacute; :-)

<h3>John J. Adelsberger III dijo lo siguiente en el bolet&iacute;n
<a href="http://www.counterpane.com/crypto-gram-0004.html#CommentsfromReaders">Crypto-Gram</a>
de Bruce Schneier:</h3>
(los comentarios a los que responde son de Schneier)
<br>
<br>&gt; Los sistemas de verdad no muestran signos de
<br>&gt; convertirse en menos complejos.  De hecho, se
<br>&gt; hacen cada vez m&aacute;s y m&aacute;s complejos
<br>&gt; con m&aacute;s rapidez.  Microsoft Windows es
<br>&gt; un juego de ni&ntilde;os dentro de esta tendencia
<br>&gt; hacia la complejidad.
<br>...
<br>&gt; La otra elecci&oacute;n es ralentizarlo,
<br>&gt; simplificarlo, e intentar a&ntilde;adir seguridad.
<p>
Esto es lo que hace OpenBSD.  <i>No conozco de ning&uacute;n otro grupo
cuya labor sea p&uacute;blica y que lo haga</i>, lo cual es lamentable
ya que prefererir&iacute;a que esto no pareciera una arenga en favor de
OpenBSD;  lejos de esto, mi prop&oacute;sito es dejar claro que no
s&oacute;lo es posible hacerlo, sino que de hecho se est&aacute;
haciendo.

<h3>Andrew Hermetz dijo lo siguiente:</h3>
<p>
Hola,
<p>
Simplemente quiero aportar unas l&iacute;neas y agradeceros a  todos los
que hab&eacute;is trabajado para hacer de OpenBSD un proyecto tan limpio
como eficiente.
<p>
&iexcl;Felicitaciones a Theo por ser un hombre por delante de su tiempo!
;-)
<p>
Como es frecuente que tenga que explicar a la gente el *porqu&eacute;*
la seguridad es importante (&laquo;si no tienes nada que
esconder...&raquo;, &laquo;nada de lo que hago es lo bastante importante
como para usar un sistema de cifrado...&raquo;, &laquo;s&oacute;lo los
criminales y terroristas necesitan esconderse en el anonimato...&raquo;,
etc... ad nauseam), aparte del *porqu&eacute;* es importante en esta era
de redes personales detr&aacute;s de DSL o incluso T1, me gusta poder
dirigirles a unas p&aacute;ginas que ofrecen una explicaci&oacute;n bien
razonada para tomarse la seguridad inform&aacute;tica con seriedad.
<p>
[... OpenBSD instalado] sin esfuerzos en un Compaq LTE 5100
port&aacute;til Pentium 90;   incluso la tarjeta de LAN de marca
desconocida se configur&oacute; de forma correcta en una
instalaci&oacute;n a trav&eacute;s de una T1 de la oficina de una amigo.
Lo que m&aacute;s parece extra&ntilde;ar a la gente es su imagen tan
espartana, pero a m&iacute; lo que me gusta es saber d&oacute;nde
est&aacute; todo ubicado y no tener una distribuci&oacute;n que meta
cosas en oscuros rincones que nunca encontrar&eacute;...
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: testimonials.html,v 1.16 ]<br>
$Translation: testimonials.html,v 1.9 2004/09/09 02:04:18 santana Exp $<br>
$OpenBSD: testimonials.html,v 1.9 2004/09/09 20:46:31 saad Exp $
</small>
</body>
</html>
