<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenBSD en el trabajo</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="keywords" content="OpenBSD,usuarios,comercial,sistema operativo,Unix,Un*x,BSD,seguro">
<meta name="distribution" content="global">
<meta name="copyright" content="Este documento es copyright 1999-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<!-- máx. 72 caracteres por línea -->

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Usuarios</font></h2>
<hr>

<p>
El t&eacute;rmino &laquo;usuarios&raquo; tiene varias connotaciones.
Los <em>usuarios finales</em> desear conocer a otros usuarios del
sistema, con el prop&oacute;sito de intercambiar ideas, problemas y
soluciones, y para discutir sobre el sistema mientras se toman algo.
Uno de las mejores maneras de hacer esto es mediante uno de nuestros 
<a href="groups.html">Grupos de Usuarios Internacionales</a>.

<p>
Otra connotaci&oacute;n del t&eacute;rmino es la de &laquo;aquellas
entidades que usan el sistema y con qu&eacute; fin lo usan&raquo;, y a
esto es a lo que se refiere el resto de esta p&aacute;gina.  Estas
<a href="#com">compa&ntilde;&iacute;as</a> y organizaciones
conf&iacute;n en el modelo de desarrollo basado en la seguridad y en la
rigurosa auditor&iacute;a de c&oacute;digo de OpenBSD.  Utilizan el
sistema para construir cortafuegos, sistemas de detecci&oacute;n de
intrusos, o servidores con prop&oacute;sitos varios.
<a href="#edu">Investigadores acad&eacute;micos</a> y desarrolladores de
departamentos inform&aacute;ticos suelen necesitar el mismo nivel de
estabilidad y seguridad, y escogen OpenBSD.  Muchos
<a href="#isp">proveedores de servicios de Internet</a> no pueden
resistirse a las funcionalidades y caracter&iacute;sticas de OpenBSD.

<p>
Si quiere estar en la lista de esta p&aacute;gina, env&iacute;e la
informaci&oacute;n correspondiente a 
<a href="mailto:press@openbsd.org">press@openbsd.org</a>.
<br><br>

<em><strong>NOTA:</strong> Por motivos de seguridad, las empresas pueden
pedirnos que ocultemos sus nombres o los de sus clientes.  En tal caso
aparecer&iacute;an como &quot;Undisclosed Company&quot; (Compa&ntilde;ia
no revelada).</em>
<br><br>
<hr>

<h2><font color="#e00000"><a name="edu">Centros de investigaci&oacute;n
y otros usuarios no comerciales</a></font></h2>

<ul>
<p>
<li><a href="http://www.ospedalimantova.it">Azienda Ospedaliera, Mantua,
Italia</a><br>
Azienda Ospedaliera &quot;Carlo Poma&quot; es la instituci&oacute;n
sanitaria m&aacute;s grande de la provincia de Mantua, en la
Lombard&iacute;a, con seis hospitales y otros seis peque&ntilde;os
ambulatorios.  Hemos escogido OpenBSD por su fiabilidad y ahora da
servicio como cortafuegos haciendo de puente entre la WAN y el Hospital
principal de Mantua.  Usamos pf y altq para las aplicaciones de
cortafuegos y QoS, y fwanalog para generar estad&iacute;sticas del
tr&aacute;fico de la WAN.

<p>
<li><a href="http://www.belperschool.co.uk">Belper School, Belper,
Derbyshire, UK</a><br>
Belper School usa m&aacute;quinas con OpenBSD como servidores de
archivos de Samba para unos 1100, adem&aacute;s de para el hospedaje de
<i>web</i> y una pasarela cortafuegos/NAT.

<p>
<li><a href="http://elm.eu.org/">ELM consortium, Biocomputing Unit EMBL,
Heidelberg, Alemania</a><br>
El consorcio ELM, con la base de datos Eukaryotic Linear Motif, usa
OpenBSD para los servidores de comunicaciones del consorcio.

<p>
<li><a href="http://www.iztacala.unam.mx">ENEP Iztacala</a><br>
ENEP Iztacala es una de las escuelas dependientes de la
<a href="http://www.unam.mx">UNAM</a>.  La UNAM es la Universidad
m&aacute;s grande de M&eacute;xico, con m&aacute;s de 250.000
estudiantes, de los cuales algo m&aacute;s de 10.000 se encuentran en
ENEP Iztacala.  Este campus est&aacute; m&aacute;s bien orientado hacia
la Sanidad, por lo que el centro de computaci&oacute;n no es muy grande.
<br>
En la actualidad disponemos de dos servidores con OpenBSD, uno con
Solaris, y dos con Linux.  Gestionamos nuestro sitio web con OpenBSD
(funciona sin problemas en una Sparcstation 5 de 7 a&ntilde;os), parte
de nuestras cuentas de correo y nuestro cortafuegos.
<br>
En nuestro centro de desarrollo hay dos computadoras m&aacute;s con
OpenBSD.  Una de ellas hace las veces de un monitor de red (con Snort) y
en breve la pondremos junto al cortafuegos, y la otra es una
r&eacute;plica del CVS de OpenBSD
(<strong>CVSROOT=anoncvs@anoncvs.mx.openbsd.org:/cvs</strong>).
<br>
No realizamos tareas muy creativas, tan s&oacute;lo usamos OpenBSD para
lo que sabe hacer mejor:  funcionar suavemente, incluso sobre hardware
viejo, dej&aacute;ndonos el tiempo libre para las preocupaciones y
problemas que tenemos con otros sistemas operativos.
<br>
Tambi&eacute;n hospedamos una lista de correo de OpenBSD en castellano
(openbsd@tlali.iztacala.unam.mx).

<p>
<li><a href="http://fortthunder.org/music/ff/index.html">
&quot;Forcefield&quot; art installation</a><br>
Parte del sistema de audio e iluminaci&oacute;n del <i>Forcefield art
installation</i> de la muestra 2002 Biennal en el Whitney Museum of
American Art en Nueva York se controla desde una VAXstation 3100 con
OpenBSD.  Se escogi&oacute; OpenBSD por su simpleza y fiabilidad.

<p>
<li><a href="http://www.hus.fi/group/">Helsinki University Central
Hospital, Finland</a><br>
El Hospital de distrito de Helsinki y Uusimaa (HUS), con un total
aproximado de 18.000 trabajadores, ofrece servicios m&eacute;dicos
especializados para los residentes de la capital y otros miembros de las
autoridades locales.  Utilizamos OpenBSD para DNS, pasarela de correo,
VPN (redes privadas virtuales) y filtros IP (cortafuegos), tanto para la
red interna del campus como para Internet.

<p>
<li><u>INFN Italian Institute of  Nuclear Physics, Florence,
Italia</u><br>
Esta instituci&oacute;n oficial acad&eacute;mica y de
investigaci&oacute;n usa OpenBSD para el servicio de nombres de dominio
y para el filtrado de paquetes con IPF.

<p>
<li><a href="http://www.polyprep.org">Polytechnic Preparatory Country
Day School</a><br>
Poly Prep CDS, un colegio privado en el sur de Brooklyn, NY, ha usado
OpenBSD desde la versi&oacute;n 2.9 para sus cortafuegos (en ambos
campus) y ahora para los servidores de archivos de los estudiantes.  Los
servidores de archivos de los estudiantes, que son parte del club
inform&aacute;tico de estudiantes, tienen instalado OpenBSD 3.2 y los
administran los estudiantes bajo la tutela de un administrador experto
de UNIX.  El objetivo de este programa es ense&ntilde;ar a posibles
profesionales de la inform&aacute;tica la responsabilidad que se
necesita para mantener un sistema tipo UNIX, unas buenas
pr&aacute;cticas de seguridad, y hacer ver a los estudiantes que existen
alternativas a Linux.

<p>
<li><u>Prague Institute of Chemical Technology, Rep&uacute;blica
Checa</u><br>
La universidad usa OpenBSD en PCs para dar acceso de WWW, correo y shell
a sus miembros y estudiantes, y en una SPARC IPX para un servidor de
hora y DNS secundario.  Las estaciones en administraci&oacute;n
tambi&eacute;n tienen PCs con OpenBSD.

<p>
<li><a href="http://www.ceesonora.org.mx">Consejo Electoral del Estado
de Sonora, M&eacute;xico</a><br>
El Consejo Estatal Electoral del Estado de Sonora usa OpenBSD para
proteger sus sistemas;  estas aplicaciones se encuentran disponibles
disponibles a trav&eacute;s de Internet, dando resultados electorales
tanto a usuarios internos como externos.

<p>
<li><a href="http://www.ualberta.ca/">The University of Alberta</a><br>
Usa OpenBSD en hardware SPARC e Intel para servidores proxy, servidores
Kerberos, servidores de impresi&oacute;n, monitorizaci&oacute;n de
servicios, escaneados de seguridad preventivos, y respuestas a
incidentes.  Se usa OpenBSD en procesadores Intel para cortafuegos y
Lan-to-Lan VPN (Redes Privadas Virtuales de red de &aacute;rea local a
red de &aacute;rea local) para las subrredes con implementaciones de
seguridad de la universidad, detr&aacute;s de las cuales residen todos
los nuevos sistemas administrativos de la universidad.  OpenBSD se usa
para <a href="http://www.ualberta.ca/~beck/authgw.html">pasarelas
(<em>gateways</em>) de autenticaci&oacute;n</a> frente a laboratorios
p&uacute;blicos y conexiones p&uacute;blicas ethernet en unos 40 sitios
en todo el campus (150 plazas aproximadamente) para ayudar a hacer el
acceso p&uacute;blico a internet seguro.  El Departamento de Ciencias
Inform&aacute;ticas usa laboratorios OpenBSD de 20 plazas para las
pr&aacute;cticas de los estudiantes.

<p>
<li><a href="http://www.jur.lu.se">Departamento de Leyes</a> de la
Universidad de Lund<br>
El departamento usa OpenBSD para cortafuegos, NAT, proxys squid y
detecci&oacute;n de intrusos.  Sus estudiantes usan la <i>web</i> para
aplicaciones como cursos de Internet y clases en multimedia, y todas
pasan a trav&eacute;s de una o m&aacute;s m&aacute;quinas con OpenBSD.

<p>
<li><a href="http://www.citi.umich.edu/">The Center for Information
Technology Integration (CITI)</a> de la Universidad de Michingan<br>
Este laboratorio en la Universidad de Michigan usa OpenBSD como la base
para muchos proyectos de investigaci&oacute;n intensiva.  OpenBSD se usa
para desarrollar y analizar los protocolos y contenidos de 
<a href="http://www.citi.umich.edu/projects/sinciti/smartcard/">
tarjetas inteligentes</a>, tanto en aislamiento como en aplicaciones
reales.  Existen planes para la expedici&oacute;n de tarjetas que
contengan fichas seguras para la introducci&oacute;n del usuario en el
sistema y adquisici&oacute;n de pase con kerberos.  OpenBSD
tambi&eacute;n se usa como plataforma de pruebas para el programa de 
<a href="http://www.citi.umich.edu/projects/mobile.html">ordenadores
m&oacute;viles</a> en CITI.  Internamente, &laquo;El Cofre del
Paquete&raquo; es un m&aacute;quina OpenBSD que captura y graba en
cd-rom cada paquete en la ethernet de 10Mbps local.  El contenido del
paquete se cifra conforme con los requerimientos de privacidad.  Esta
pr&aacute;ctica se utiliza para la detecci&oacute;n de intrusos.  Aparte
de esto, unas cuantas personas del departamento usan OpenBSD como su
sistema operativo principal.

<p>
<li><a href="http://www.umn.edu/">The University of Minnesota</a><br>
Esta universidad usa OpenBSD en estaciones de trabajo Sun Sparc para
tareas de monitorizaci&oacute;n de redes y planificaci&oacute;n de
capacidad.  Hacen pesquisas en 53.000 interfaces diferentes (mayo de
1.999) por medio de SNMP, registrando ingresos de datos SNMP de
m&aacute;s de 250MB a un disco concatenado para procesarlos cada mes.

<p>
<li><u>Uppsala University Hospital, Department of Infectious
Diseases</u><br>
El Departamento de Enfermedades Infecciosas del Hospital Universtario de
Uppsala usa OpenBSD para servidores de intranet, as&iacute; como para
cortafuegos y pasarelas para Internet.

<p>
<li><a href="http://www.chem.uw.edu.pl/">Departmento de
Qu&iacute;mica</a> de la Universidad de Varsovia<br>
Este departamento usa OpenBSD para cortafuegos, servidores de correo,
servidores de DNS, servidores de <em>web</em>, <em>proxies squid</em>,
servidores de archivos, y otros.  La instalaci&oacute;n da soporte a
m&aacute;s de 1.000 estudiantes.

<p>
<li><a href="http://www.xscanners.org/">Xscanners Information Warfare
Center</a><br>
Xscanners IWC es un sitio orientado hacia varios aspectos de seguridad
inform&aacute;tica que trata sobre asuntos muy relevantes en el mundo
actual posterior al 11 de noviembre.  Xscanners dise&ntilde;a y monta
entornos seguros con OpenBSD para muchas &aacute;reas distintas.
Tambi&eacute;n disponemos de foros de discusi&oacute;n sobre temas de
seguridad.

</ul>

<h2><font color="#e00000"><a name="com">Usuarios
Comerciales</a></font></h2>

<ul>
<p>
<li><a href="http://www.adobe.com/">Adobe Systems</a><br>
Este gigante del software usa OpenBSD en varios de sus cortafuegos para
red y sus sistemas de pruebas de redes.

<p>
<li><a href="http://www.third-net.com/">Third-Net.Com</a><br>
Third-Net.Com es un proveedor de soluciones en Calgary, Canad&aacute;.
Muchos de nuestros clientes han cambiado sus cortafuegos y redes
privadas virtuales a OpenBSD, por su velocidad, estabilidad y seguridad.

<p>
<li><a href="http://www.touchtunes.com/">TouchTunes</a><br>
Actualmente TouchTunes es el &uacute;nico proveedor de
<em>jukeboxes</em> de descarga digital entre las operadoras de
m&aacute;quinas con monedas en los EE.UU.  TouchTunes depende
fuertemente de OpenBSD para sus servidores de FTP de alto nivel de
tr&aacute;fico, cortafuegos seguros y conexiones de redes virtuales
privadas (VPN).  Los servidores de DNS internos tambi&eacute;n funcionan
con OpenBSD.

<p>
<li><a href="http://www.alteon.com">Alteon Networks</a><br>
El manufacturador de ethernet gigabit usa m&aacute;quinas OpenBSD con
fines variados, como campos de prueba y pasarelas.

<p>
<li><a href="http://www.core-sdi.com">CORE SDI S.A.</a><br>
Una compa&ntilde;&iacute;a especializada en la seguridad de la
informaci&oacute;n con sede en Buenos Aires, Argentina, que usa OpenBSD
como plataforma principal para las operaciones y desarrollo de productos
relacionados con la seguridad de informaci&oacute;n.  &laquo;La
fortaleza, portabilidad y el compromiso para con la seguridad de
OpenBSD, as&iacute; como la capacidad de funcionamiento en diferentes
plataformas de hardware, da como resultado un sistema operativo ideal
para entornos en los que la seguridad y alta disponibilidad son
importantes&raquo;, dice Iv&aacute;n Arce, director ejecutivo de CORE
SDI.

<p>
<li><a href="http://www.fscinternet.com">FSC Internet Corp.</a><br>
Una gran firma de desarrollo de Seguridad Inform&aacute;tica e Internet
ubicada en Toronto que ha usado OpenBSD y su soporte de IPsec para
construir una VPN segura y flexible para un cliente multimillonario.
&laquo;Estamos encantados con el funcionamiento y resultados de OpenBSD,
su fiabilidad, y su actitud proactiva hacia la seguridad,&raquo; dice el
portavoz de la compa&ntilde;&iacute;a.  &laquo;Tenemos la
intenci&oacute;n de usar OpenBSD en muchos proyectos en el futuro.
Creemos firmemente que las soluciones de c&oacute;digo abierto como
OpenBSD pueden ofrecer mejor los altos niveles de seguridad que
requieren nuestros clientes -- el software de c&oacute;digo propietario
nunca recibe el nivel de revisi&oacute;n de c&oacute;digo al que
est&aacute; sometido OpenBSD.&raquo;

<p>
<li><a href="http://www.learningtree.com/">Learning Tree
International</a><br>
Esta empresa l&iacute;der de formaci&oacute;n, usa OpenBSD en algunos de
sus cursos sobre seguridad y cortafuegos.

<p>
<li><a href="http://www.netfriend.org/">NetFriend Ltd.</a><br>
NetFriend Ltd. es un proveedor de servicios polaco que ofrece servidores
de OpenBSD, desarrollo y hospedaje de <i>webs</i>, servicios de nombres
de dominio, soluciones de comercio electr&oacute;nico, servidores
dedicados, y servicios de aplicaciones y bases de datos.

<p>
<li><a href="http://www.netsec.net/">Network Security Technologies,
Inc.</a><br>
Esta firma de seguridad inform&aacute;tica y de redes usa OpenBSD para
la detecci&oacute;n de intrusiones de alta velocidad, redes virtuales
privadas (VPN), y aplicaciones de almacenamiento de datos.  Network
Security Technologies Inc.  est&aacute; ubicada dentro del &aacute;rea
metropolitana de Washington DC, y usa OpenBSD para varias agencias
gubernamentales y militares no reveladas.

<p>
<li><a href="http://www.softquad.com/">SoftQuad Software Inc.</a><br>
Este creador de software de edici&oacute;n para HTML y XML usa OpenBSD
para sus pasarelas, FTP, y servicios de web.

<p>
<li><a href="http://www.xtime.com/">Xtime</a><br>
La tecnolog&iacute;a base de Xtime es la &laquo;m&aacute;qina de
gesti&oacute;n del inventorio del tiempo&raquo; (<em>Time Inventory
Management Engine</em>), llamada TIMEngine &reg;.  Esta
tecnolog&iacute;a ofrece los beneficios del comercio electr&oacute;nico
a servicios comerciales en todas partes, haciendo que este inventorio
basado en el tiempo est&eacute; disponible por internet o por
tel&eacute;fono, permitiendo de este modo una fuerte capacidad de
gesti&oacute;n de nuevos clientes.  Xtime aprovecha la potencia de
OpenBSD para un 75% de su infraestructura de redes de misiones
cr&iacute;ticas, lo que incluye servidores de correo, servidores de DNS,
varios cortafuegos y redes privadas virtuales (VPN), servidores de
ingreso seguro, y servidores de producci&oacute;n y
monitorizaci&oacute;n/IDS de web.  OpenBSD es el sistema de facto usado
por el departamento de operaciones de redes de Xtime.

</ul>

<h2><font color="#e00000"><a name="isp">Proveedores de servicios de
Internet</a></font></h2>

<p>
Uno de los objetivos de cualquier proveedor de internet es el de
mantener las cuentas y los sitios de sus clientes a salvo de intrusos.
El historial de seguridad de OpenBSD habla por s&iacute; solo,
raz&oacute;n por la cual muchos proveedores de Internet usan OpenBSD.
Sin embargo, otros usan OpenBSD para muchos otros, sino la
mayor&iacute;a de, sus servicios.

<ul>
<p>
<li><a href="http://www.anonix.net/">Anonix</a><br>
Anonix es un proveedor de Internet que ofrece servicios de correo
electr&oacute;nico an&oacute;nimo y hospedaje de p&aacute;ginas.  Todo
esto, adem&aacute;s de DNS y los cobros, con sistemas OpenBSD.<br>
<em>&laquo;Confiamos en su seguridad, y en el modo en que est&aacute;
dise&ntilde;ado.  La instalaci&oacute;n b&aacute;sica no necesita
demasiado;  estamos seguros de que todo lo que necesitamos para nuestros
sistemas se encuentra aqu&iacute;.&raquo;</em>

<p>
<li><a href="http://www.appws.com/">Appalachian Web Solutions</a><br>
Appalachian Web Solutions es una compa&ntilde;&iacute;a de dise&ntilde;o
y hospedaje de <i>webs</i> de Carolina que usa OpenBSD para sus
cortafuegos de empresa y otras funciones de seguridad.
&laquo;Despu&eacute;s de haber evaluado todas las opciones comerciales y
de c&oacute;digo abierto, fue una decisi&oacute;n f&aacute;cil escoger
OpenBSD para nuestro cortafuegos y otros servicios de seguridad.

<p>
<li><a href="http://www.bsws.de/">BS Web Services</a><br>
BS Web Services, un proveedor alem&aacute;n, usa servidores OpenBSD para
sus DNS primario y secundario (djbdns), hospedaje de web primario
(Apache) y servicios de correo primario (qmail-ldap).  Tambi&eacute;n
usan Autenticaci&oacute;n LDAP con OpenBSD (OpenLDAP), adem&aacute;s de
con bases de datos MySQL.  El <em>hostmaster</em>, Henning Brauner,
escribe:<br>
<em>&laquo;Tuvimos que afinar algo OpenBSD en estas m&aacute;quinas, en
especial maxprocs y maxfiles, pero gestiona cargas enormes con hardware
normal.  Usamos AMD Athlons (sobre todo los nuevos Thunderbirds) y AMD
K6-III.  Tambi&eacute;n tenemos algunas m&aacute;quinas internas con
OpenBSD como campos de prueba y servidores de impresi&oacute;n, y para
todo tipo de prop&oacute;sitos varios.  Vamos a cambiar algunas
m&aacute;quinas m&aacute;s a OpenBSD, en especial nuestros cortafuegos.
Desafortunadamente todav&iacute;a funcionamos con algo de software de
c&oacute;digo cerrado, pero nos gustar&iacute;a probar la
emulaci&oacute;n de Linux.  El comportamiento de OpenBSD bajo fuertes
cargas, en especial bajo ataques de denegaci&oacute;n de servicio, es
incomparable con los Linux que usamos anteriormente.  Linux funcionaba
extremadamente lento, mientras que OpenBSD ni tan siquiera se inmuta
(&iexcl;con el mismo hardware!)&raquo;</em>.

<p>
<li><a href="http://www.calyx.net">Calyx Internet Access Corp.</a><br>
Esta compa&ntilde;&iacute;a usa OpenBSD para la ejecuci&oacute;n de
todos los servicios con misiones cr&iacute;ticas, incluidos WWW, FTP,
correo electr&oacute;nico, tr&aacute;fico de VPN, y
monitorizaci&oacute;n de redes en sus centros de datos en Nueva York,
Los &Aacute;ngeles y Amsterdam.  Sitios a&uacute;n m&aacute;s grandes en
Internet como 
<a href="http://www.mitsubishicars.com">mitsubishicars.com</a>, 
<a href="http://www.snapple.com">snapple.com</a>, 
<a href="http://www.tanqueray.com">tanqueray.com</a> y otros no
representan ning&uacute;n reto para OpenBSD.

<p>
<li><a href="http://c2pro.net/">C2PRO</a><br>
C2PRO es un proveedor de servicios de Internet indonesio que usa OpenBSD
para sus servidores de <em>web</em>, correo, <em>shell</em>, y monitores
de redes.

<p>
<li><a href="http://www.compartment.se/">Compartment</a><br> 
Compartment es un proveedor de servicios de Internet sueco que usa
OpenBSD en muchos de sus servidores de desarrollo y producci&oacute;n,
adem&aacute;s de para enrutadores de correo y <i>web</i>.

<p>
<li><a href="http://www.crown.net">Crown.Net</a><br>
Este proveedor de servicios de Internet funciona casi totalmente con una
mezcla de OpenBSD/sparc y OpenBSD/i386.  Sus dos servidores de Web,
servidor de correo, DNS primarios y secundarios, y servidores Radius
funcionan todos con OpenBSD/sparc, y nuestro servidor de shell y varios
servidores clientes funcionan con OpenBSD/i386.

<p>
<li><a href="http://www.elixor.net/">Elixor Networks Inc.</a><br> 
Elixor Networks usa OpenBSD en <em>hardware</em> AMD para ofrecer
cuentas tipo <em>shell</em>, hospedaje de sitios <em>web</em>, y
hospedaje de nombre de dominio.

<p>
<li><a href="http://www.empirenet.net/">Empire Net</a><br>
Un proveedor de servicios de Internet que usa OpenBSD en sistemas
basados en AMD, Intel y Sun, para enrutamiento, cortafuegos, IPsec
(VPN),
<a href="http://www.csl.sony.co.jp/person/kjc/software.html#ALTQ">
limitaci&oacute;n de bando de ancha</a>, hospedaje de web, servidores de
bases de datos, monitorizaci&oacute;n de redes, detecci&oacute;n de
intrusos, servidores de correo, servidores para copias de seguridad,
servidores de cache, y estaciones de trabajo.  Uno de sus enrutadores
gestiona el tr&aacute;fico entre un T3 y ocho puertos fast ethernet, y
tambi&eacute;n entre varias VLANs 802.1Q para separar las redes entre
los clientes y las compa&ntilde;&iacute;as con espacio alquilado.  Un
servidor de correo OpenBSD gestiona el almacenamiento y el movimiento
del correo electr&oacute;nico, y la autenticaci&oacute;n con RADIUS para
m&aacute;s de 5.000 usuarios.  Varios servidores de <em>web</em> OpenBSD
gestiona cada uno de ellos m&aacute;s de 300 sitios <em>web</em>.

<p>
<li><a href="http://www.globalwire.se/">Globalwire
Communications</a><br> 
Globalwire Communications usa OpenBSD en su pasarela para el
&laquo;Servicio de Mensajes Cortos&raquo; (SMS) y en sus servidores de
bases de datos.

<p>
<li><a href="http://www.hobbiton.org/">Hobbiton.org</a><br>
Este proveedor de servicios de Internet ha usado OpenBSD para su
servidor gratuito de shell durante muchos a&ntilde;os (fue cerrado en
noviembre de 2.001, debido a los altos costes derivados de un servicio
&laquo;gratuito&raquo;).  Tambi&eacute;n usaba OpenBSD en otros
sistemas.  El servidor de shell, un &uacute;nico AMD Athlon 650,
lleg&oacute; a gestionar 101.796 usuarios al final.  &laquo;Probamos
OpenBSD despu&eacute;s de tener problemas constantes de seguridad con
otros sistemas operativos&raquo;, dice Leif Pedersen, de Hobbiton.
&laquo;Desde entonces, la seguridad en el sistema operativo no ha dado
ning&uacute;n problema y, adem&aacute;s, los sistemas han sido
m&aacute;s estables.&raquo;

<p>
<li><a href="http://www.hurontario.net">Hurontario.net</a><br>
En la regi&oacute;n de los lagos de Ontario, Canad&aacute;,
Hurontario.net usa OpenBSD en varias de sus propias m&aacute;quinas y en
las de sus clientes.

<p>
<li><a href="http://www.info-time.nl/">Infotime</a><br> 
Infotime, con base en Holanda, ofrece servicios de hospedaje de
<i>web</i> y registro de nombres de dominio en servidores con OpenBSD.
Creemos que OpenBSD es el sistema operativo m&aacute;s fiable y seguro
sobre el que podemos ofrecer estos servicios.

<p>
<li><a href="http://www.networkinformation.com/">inTEXT
Communications</a><br>
inTEXT Communications es una compa&ntilde;&iacute;a de seguridad de
redes que usa OpenBSD en sus cortafuegos, redes privadas virtuales, y
varios sistemas cr&iacute;ticos de seguridad.  niTEXT Communications Inc
(1994) se encuentra en Vancouver, Canad&aacute;, y monta OpenBSD para
varias grandes compa&ntilde;&iacute;as incluyendo una de productos
farmac&eacute;uticos.

<p>
<li><a href="http://www.ioactive.com/">IOActive</a><br>
IOActive pone a disponibilidad de desarrolladores de WWW y
<em>hackers</em>, un sitio para experimentar con servidores de prueba.
Este proveedor de servicios de Seattle tambi&eacute;n instala sistemas
VPN e IDS, y cortafuegos con OpenBSD para comercios y empresas
regionales.  &laquo;OpenBSD es r&aacute;pido, fiable, y yo duermo un
algo mejor por la noche sabiendo que lo estoy usando,&raquo; dice el
propietario, Josh Pennell.  &laquo;Otra caracter&iacute;stica que valoro
de OpenBSD es que m&aacute;s de la mitad del trabajo para asegurar el
sistema ya est&aacute; hecho nada m&aacute;s instalarlo, ahorrando a mi
compa&ntilde;&iacute;a una cantidad de tiempo enorme.  Para m&iacute;,
OpenBSD es la norma &quot;de facto&quot; para sistemas operativos
seguros de c&oacute;digo abierto.  Los dem&aacute;s s&oacute;lo intentan
ponerse a su altura&raquo;.

<p>
<li><a href="http://www.phoenixcomm.net">Phoenix Communications</a><br>
Phoenix Communications es un proveedor de servicios de Internet en
Dallas, Texas, que usa OpenBSD en cortafuegos y otras infraestructuras.

<p>
<li><a href="http://www.poppe.com">Poppe Tyson Europe</a><br>
Usa OpenBSD como DNS principal, servidor de correo para m&aacute;s de
100 buzones, y como servidor para el desarrollo de su sitio Web para
m&aacute;s de 50 sitios.

<p>
<li><a href="http://www.qpalzm.com">qpalzm.com services</a><br>
qpalzm services ofrece servicios de hospedaje de web y cuentas tipo
shell en sistemas OpenBSD.  En sus p&aacute;ginas ofrecen
actualizaciones diarias sobre programaci&oacute;n, juegos, irc, y otros
aspectos t&eacute;cnicos.  Tambi&eacute;n tienen MUD online.
Adem&aacute;s disponen de una <a href="http://www.jscript.org">Lista de
Correo de JavaScript</a> en OpenBSD para aquellos que est&eacute;n
interesados en JavaScript y DHTML.  Por cierto que el concurrido
servidor de WWW, FTP y correo de qpalzm, funciona perfectamente con
OpenBSD en un Pentium Pro a 200MHz.

<p>
<li><a href="http://www.rtmx.net">RTMX Networking Services</a><br>
Este proveedor de servicios de Internet de Carolina del Norte usa
OpenBSD en m&uacute;ltiples servidores de Web, DNS y m&aacute;s de 1.000
usuarios de correo electr&oacute;nico en su comunidad.  Usa una mezcla
de sistemas con AMD K-6, MicroSPARC-II y PowerPC, con m&aacute;s
servidores de subrred clientes.  RTMX.NET tiene una r&eacute;plica de
las p&aacute;ginas de OpenBSD, 
<a href="http://openbsd.groupbsd.org">WWW</a>, y de las de 
<a href="ftp://openbsd.groupbsd.org/pub/OpenBSD/">FTP</a>;
tambi&eacute;n ofrece acceso a un repositorio de CVS an&oacute;nimo
(CVSROOT=anoncvs@openbsd.groupbsd.org:/cvs), todo gracias a los 47GB de
espacio en disco y una conexi&oacute;n dedicada T1.

<p>
<li><a href="http://start.swebase.com/?sida=maskiner">Swebase
Network</a><br>
Este proveedor de Internet en Suecia usa OpenBSD para sus servidores de
HTTP, DNS, y correo.

<p>
<li><a href="http://www.tronicguard.com/">TronicGuard GmbH</a><br>
Esta compa&ntilde;&iacute;a de servicios de conexi&oacute;n a Internet y
de hospedaje ubicada en Alemania usa OpenBSD para el hospedaje de sus
sistemas, adem&aacute;s de para aplicaciones de seguridad como
cortafuegos y servidores de bases de datos para empresas peque&ntilde;as
y medianas.

<p>
<li><a href="http://www.vovoid.com">Vovoid Software &amp;
Multimedia.</a><br>
Vovoid Software &amp; Multimedia en Gotenburgo, Suecia, usa OpenBSD para
Cortafuegos, Sevidores Web, Servidores de Correo, y Servidores de DNS.
&laquo;La elecci&oacute;n de OpenBSD para nuestros servidores de
producci&oacute;n es obvia y una clave importante en nuestra estrategia
de seguridad&raquo;.

<p>
<li><a href="http://www.wythenet.com">WytheNet, Inc.</a><br>
Este proveedor de servicios de Internet de Virginia usa OpenBSD en todos
sus servidores, incluidos los radius primario y secundario, DNS primario
y secundario, correo, monitorizaci&oacute;n de redes, y varios
cortafuegos.  Tambi&eacute;n venden enrutadores y cortafuegos basados en
OpenBSD a sus clientes de DSL para empresa.


</ul>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: users.html,v 1.102 ]<br>
$Translation: users.html,v 1.37 2003/12/30 11:44:33 horacio Exp $<br>
$OpenBSD: users.html,v 1.35 2004/01/01 23:26:54 horacio Exp $
</small>

</body>
</html>
