<html>
<head>
<meta name=KEYWORDS content="OpenBSD,commercial,operating system,Unix,Un*x,BSD,linux,secure,secure,secure">
<title>OpenBSD at work</title>
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">
<img alt="[OpenBSD]" height=30 width=141 SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Usuarios</font><hr></h2>

<p>
El t&eacute;rmino &laquo;usuarios&raquo; tiene varias connotaciones.
Los <em>Usuarios finales</em> desear conocer a otros usuarios del
sistema, con el prop&oacute;sito de intercambiar ideas, problemas y
soluciones, y para discutir sobre el sistema mientras se toman algo.
Uno de las mejores maneras de hacer esto es mediante uno de nuestros 
<a href="groups.html">Grupos de Usuarios Internacionales</a>.

<p>
Otra connotaci&oacute;n del t&eacute;rmino es la de &laquo;aquellas
entidades que usan el sistema y fin para el que lo usan&raquo;, y
&eacute;ste es el asunto que trataremos en el resto de esta
p&aacute;gina.  Estas compa&ntilde;&iacute;as y organizaciones
conf&iacute;an en el modelo de desarrollo basado en la seguridad como
hecho primordial y en las rigurosas auditor&iacute;as de c&oacute;digo
de OpenBSD.  Utilizan el sistema para construir sistemas de
detecci&oacute;n de intrusos, cortafuegos, o servidores con
prop&oacute;sitos varios.  Los investigadores de las universidades o
los desarrolladores de los departamentos de tecnolog&iacute;a
inform&aacute;tica a menudo necesitan de estas caracter&iacute;sticas
de seguridad, y escogen OpenBSD.

<p>
Si quiere estar en la lista de esta p&aacute;gina, env&iacute;e la
informaci&oacute;n correspondiente a 
<a href="mailto:press@openbsd.org">press@openbsd.org</a>.
<br><br>

<i><b>NOTA:</b> Por motivos de seguridad, las empresas pueden pedirnos
que ocultemos sus nombres o los de sus clientes.  En tal caso
aparecer&iacute;an como &quot;Undisclosed Company&quot;
(Compa&ntilde;ia no revelada).</i>
<br><br>
<hr>

<dl>

<li><a href="http://www.amnesty.org">Amnist&iacute;a
Internacional</a><br>
Amnist&iacute;a Internacional es una organizaci&oacute;n a nivel
mundial que trabaja para promover los derechos humanos tal y como
aparecen en la Declaraci&oacute;n Universal de Derechos Humanos y en
otras regulaciones internacionales.  Amnist&iacute;a Internacional usa
OpenBSD para los cortafuegos de sus redes y para sus Redes Privadas
Virtuales entre sus diferentes secciones alrededor del mundo.

<p>
<li><a href="http://www.netsec.net/">Network Security Technologies,
Inc.</a><br>
Esta firma de seguridad inform&aacute;tica y de redes usa OpenBSD para
la detecci&oacute;n de intrusiones de alta velocidad, redes virtuales
privadas (VPNs), y aplicaciones de almacenamiento de datos.  Network
Security Technologies Inc. est&aacute; ubicada dentro del &aacute;rea
metropolitana de Washington DC, y usa OpenBSD para varias agencias
gubernamentales y militares no reveladas.

<p>
<li><a href="http://www.adobe.com/">Adobe Systems</a><br>
Este gigante del software usa OpenBSD en varios de sus cortafuegos para
red y sus sistemas de pruebas de redes.

<p>
<li><a href="http://www.ceesonora.org.mx">Consejo Electoral del Estado
de Sonora, M&eacute;xico</a><br>
El Consejo Estatal Electoral del Estado de Sonora usa OpenBSD para
proteger sus sistemas;  estas aplicaciones se encuentran disponibles
disponibles a trav&eacute;s de Internet, dando resultados electorales
tanto a usuarios internos como externos.

<p>
<li><a href="http://www.wythenet.com">WytheNet, Inc.</a><br>
Este proveedor de servicios de Internet de Virginia usa OpenBSD en
todos sus servidores, incluidos los radius primario y secundario, DNS
primario y secundario, correo, monitorizaci&oacute;n de redes, y varios
cortafuegos.  Tambi&eacute;n venden enrutadores y cortafuegos basados
en OpenBSD a sus clientes de DSL para empresa.

<p>
<li><a href="http://www.calyx.net">Calyx Internet Access Corp.</a><br>
Esta compa&ntilde;&iacute;a usa OpenBSD para la ejecuci&oacute;n de
todos los servicios con misiones cr&iacute;ticas, incluidos WWW, FTP,
correo electr&oacute;nico, tr&aacute;fico de VPN, y
monitorizaci&oacute;n de redes en sus centros de datos en Nueva York,
Los &Aacute;ngeles y Amsterdam.  Sitios a&uacute;n m&aacute;s grandes
en Internet como 
<a href="http://www.mitsubishicars.com">mitsubishicars.com</a>, 
<a href="http://www.snapple.com">snapple.com</a>, 
<a href="http://www.tanqueray.com">tanqueray.com</a> y otros no 
representan ning&uacute;n reto para OpenBSD.

<p>
<li><a href="http://www.alteon.com">Alteon Networks</a><br>
El manufacturador de ethernet gigabit usa m&aacute;quinas OpenBSD con
fines variados, como campos de prueba y pasarelas.

<p>
<li><a href="http://www.core-sdi.com">CORE SDI S.A.</a><br>
Una compa&ntilde;&iacute;a especializada en Seguridad de la
Informaci&oacute;n con sede en Buenos Aires, Argentina, que usa OpenBSD
como plataforma principal para las operaciones y desarrollo de
productos relacionados con la seguridad de informaci&oacute;n.
&laquo;La fortaleza, portabilidad y el compromiso para con la seguridad
de OpenBSD, as&iacute; como la capacidad de funcionamiento en
diferentes plataformas de hardware, da como resultado un sistema
operativo ideal para entornos en los que la seguridad y alta
disponibilidad son importantes&raquo;, dice Iv&aacute;n Arce, director
ejecutivo de CORE SDI.

<p>
<li><a href="http://www.qpalzm.com">qpalzm.com services</a><br>
qpalzm services ofrece servicios de hospedaje de web y cuentas tipo
shell en sistemas OpenBSD.  En sus p&aacute;ginas ofrecen
actualizaciones diarias sobre programaci&oacute;n, juegos, irc, y otros
aspectos t&eacute;cnicos.  Tambi&eacute;n tienen MUD online.
Adem&aacute;s disponen de una <a href="http://www.jscript.org">Lista de
Correo de JavaScript</a> en OpenBSD para aquellos que est&eacute;n
interesados en JavaScript y DHTML.  Por cierto que el concurrido
servidor de WWW, FTP y correo de qpalzm, funciona perfectamente con
OpenBSD en un Pentium Pro a 200MHz.

<p>
<li><a href="http://www.ioactive.com/">IOActive</a><br>
IOActive pone a disponibilidad de desarrolladores de WWW y
<em>&quot;hackers&quot;</em>, un sitio para experimentar con servidores
de prueba.  Este proveedor de servicios de Seattle tambi&eacute;n
instala sistemas VPN e IDS, y cortafuegos con OpenBSD para comercios y
empresas regionales.  &laquo;OpenBSD es r&aacute;pido, fiable, y yo
duermo un algo mejor por la noche sabiendo que lo estoy usando,&raquo;
dice el propietario, Josh Pennell.  &laquo;Otra caracter&iacute;stica
que valoro de OpenBSD es que m&aacute;s de la mitad del trabajo para
asegurar el sistema ya est&aacute; hecho nada m&aacute;s instalarlo,
ahorrando a mi compa&ntilde;&iacute;a una cantidad de tiempo enorme.
Para m&iacute;, OpenBSD es la norma &quot;de facto&quot; para sistemas
operativos seguros de c&oacute;digo abierto.  Los dem&aacute;s
s&oacute;lo intentan ponerse a su altura&raquo;.

<p>
<li><a href="http://www.umn.edu/">The University of Minnesota</a><br>
Esta universidad usa OpenBSD en estaciones de trabajo Sun Sparc para
tareas de monitorizaci&oacute;n de redes y planificaci&oacute;n de
capacidad.  Hacen pesquisas en 53.000 interfaces diferentes (mayo de
1.999) por medio de SNMP, registrando ingresos de datos SNMP de
m&aacute;s de 250MB a un disco concatenado para procesarlos cada
mes.

<p>
<li><a href="http://www.empirenet.net/">Empire Net</a><br>
Un proveedor de servicios de Internet que usa OpenBSD en sistemas
basados en AMD, Intel y Sun, para enrutamiento, cortafuegos, IPsec/VPN,
<a href="http://www.csl.sony.co.jp/person/kjc/software.html#ALTQ">
limitaci&oacute;n de bando de ancha</a>, hospedaje de web, servidores
de bases de datos, monitorizaci&oacute;n de redes, detecci&oacute;n de
intrusos, servidores de correo, servidores para copias de seguridad,
servidores de cache, y estaciones de trabajo.  Uno de sus enrutadores
gestiona el tr&aacute;fico entre un T3 y ocho puertos fast ethernet, y
tambi&eacute;n entre varias VLANs 802.1Q para separar las redes entre
los clientes y las compa&ntilde;&iacute;as con espacio alquilado.

<p>
<li><a href="http://www.rtmx.com">RTMX Incorporated</a><br>
Esta comercial produce un derivado de OpenBSD, soluci&oacute;n de
sistema extendido a tiempo real IEEE POSIX.  RTMX ha hecho una
reimplementaci&oacute;n total de extensiones a tiempo real IEEE POSIX,
previamente desarrolladas, usando OpenBSD como fuente.  Aproximadamente
todas las extensiones IEEE POSIX han sido a&ntilde;adidas.  Actualmente
todas las caracter&iacute;sticas de OpenBSD se pueden usar, pero
s&oacute;lo en procesadores tipo m68k, MIPS, y PowerPC.  Las versiones
para Pentium y Alpha aparecer&aacute;n pronto.  RTMX Inc.
tambi&eacute;n es una compa&ntilde;&iacute;a con licencia de desarrollo
para OSF Motif, y ha portado Motif 1.2.3 a la mayor&iacute;a de
plataformas soportadas por &eacute;ste.

<p>
<li><a href="http://www.rtmx.net">RTMX Networking Services</a><br>
Este proveedor de servicios de Internet de Carolina del Norte usa
OpenBSD en m&uacute;ltiples servidores de Web, DNS y m&aacute;s de
1.000 usuarios de correo electr&oacute;nico en su comunidad.  Usa una
mezcla de sistemas con AMD K-6, MicroSPARC-II y PowerPC, con m&aacute;s
servidores de subrred clientes.  RTMX.NET tiene una r&eacute;plica de
las p&aacute;ginas de OpenBSD, 
<a href="http://openbsd.groupbsd.org">WWW</a>, y de las de 
<a href="ftp://openbsd.groupbsd.org/pub/OpenBSD/">FTP</a>;
tambi&eacute;n ofrece acceso a un repositorio de CVS an&oacute;nimo
(CVSROOT=anoncvs@openbsd.groupbsd.org:/cvs), todo gracias a los 47GB de
espacio en disco y una conexi&oacute;n dedicada T1.

<p>
<li><a href="http://www.poppe.com">Poppe Tyson Europe</a><br>
Usa OpenBSD como DNS principal, servidor de correo para m&aacute;s de
100 buzones, y como servidor para el desarrollo de su sitio Web para
m&aacute;s de 50 sitios.

<p>
<li><a href="http://www.citi.umich.edu/">The Center for Information
Technology Integration (CITI)</a><br>
Este laboratorio en la Universidad de Michigan usa OpenBSD como la base
para muchos proyectos de investigaci&oacute;n intensiva.  OpenBSD se
usa para desarrollar y analizar los protocolos y contenidos de 
<a href= "http://www.citi.umich.edu/projects/sinciti/smartcard/">
tarjetas inteligentes</a>, tanto en aislamiento como en aplicaciones
reales.  Existen planes para la expedici&oacute;n de tarjetas que
contengan fichas seguras para la introducci&oacute;n del usuario en el
sistema y adquisici&oacute;n de pase con kerberos.  OpenBSD
tambi&eacute;n se usa como plataforma de pruebas para el programa de 
<a href= "http://www.citi.umich.edu/projects/mobile.html">ordenadores
m&oacute;viles</a> en CITI.  Internamente, &laquo;El Cofre del
Paquete&raquo; es un m&aacute;quina OpenBSD que captura y graba en
cd-rom cada paquete en la ethernet de 10Mbps local.  El contenido del
paquete se cifra conforme con los requerimientos de privacidad.  Esta
pr&aacute;ctica se utiliza para la detecci&oacute;n de intrusos.
Aparte de esto, unas cuantas personas del departamento usan OpenBSD
como su sistema operativo principal.

<p>
<li><a href="http://www.ualberta.ca/">The University of Alberta</a><br>
Usa OpenBSD en hardware SPARC e Intel para servidores proxy, servidores
Kerberos, servidores de impresi&oacute;n, monitorizaci&oacute;n de
servicios, escaneados de seguridad preventivos, y respuestas a
incidentes.  Se usa OpenBSD en procesadores Intel para cortafuegos y
Lan-to-Lan VPN (Redes Privadas Virtuales de red de &aacute;rea local a
red de &aacute;rea local) para las subrredes con implementaciones de
seguridad de la universidad, detr&aacute;s de las cuales residen todos
los nuevos sistemas administrativos de la universidad.  OpenBSD se usa
para <a HREF="http://www.ualberta.ca/~beck/authgw.html">pasarelas
(&quot;<em>gateways</em>&quot;) de autenticaci&oacute;n</a> frente a
laboratorios p&uacute;blicos y conexiones p&uacute;blicas ethernet en
unos 40 sitios en todo el campus (150 plazas aproximadamente) para
ayudar a hacer el acceso p&uacute;blico a internet seguro.  El
Departamento de Ciencias Inform&aacute;ticas usa laboratorios OpenBSD
de 20 plazas para las pr&aacute;cticas de los estudiantes.

<p>
<li><a href="http://www.crown.net">Crown.Net</a><br>
Este proveedor de servicios de Internet funciona casi totalmente con
una mezcla de OpenBSD/sparc y OpenBSD/i386.  Sus dos servidores de Web,
servidor de correo, DNS primarios y secundarios, y servidores Radius
funcionan todos con OpenBSD/sparc, y nuestro servidor de shell y varios
servidores clientes funcionan con OpenBSD/i386.

<p>
<li><a href="http://www.fscinternet.com">FSC Internet Corp.</a><br>
Una gran firma de desarrollo de Seguridad Inform&aacute;tica e Internet
ubicada en Toronto que ha usado OpenBSD y su soporte de IPsec para
construir una VPN segura y flexible para un cliente multimillonario.
&laquo;Estamos encantados con el funcionamiento y resultados de
OpenBSD, su fiabilidad, y su actitud proactiva hacia la
seguridad,&raquo; dice el portavoz de la compa&ntilde;&iacute;a.
&laquo;Tenemos la intenci&oacute;n de usar OpenBSD en muchos proyectos
en el futuro.  Creemos firmemente que las soluciones de c&oacute;digo
abierto como OpenBSD pueden ofrecer mejor los altos niveles de
seguridad que requieren nuestros clientes -- el software de
c&oacute;digo propietario nunca recibe el nivel de revisi&oacute;n de
c&oacute;digo al que est&aacute; sometido OpenBSD.&raquo;

<p>
<li><a href="http://www.softquad.com/">SoftQuad Software Inc.</a><br>
Este creador de software de edici&oacute;n para HTML y XML usa OpenBSD
para sus pasarelas, FTP, y servicios de web.

<p>
<li><a href="http://www.hobbiton.org/">Hobbiton.org</a><br>
Este proveedor de servicios de Internet usa OpenBSD para su servidor
gratuito de shell, as&iacute; como otros sistemas.  El servidor de
shell, un simple AMD K6/233, gestiona bastante m&aacute;s de 10.000
usuarios.  &laquo;Probamos OpenBSD despu&eacute;s de tener problemas
constantes de seguridad con otros sistemas operativos&raquo;, dice Leif
Pedersen, de Hobbiton.  &laquo;Desde entonces, la seguridad en el
sistema operativo no ha dado ning&uacute;n problema y, adem&aacute;s,
los sistemas han sido m&aacute;s estables.&raquo;

<p>
<li>Prague Institute of Chemical Technology, Rep&uacute;blica Checa<br>
La universidad usa OpenBSD en PCs para dar acceso de WWW, correo y
shell a sus miembros y estudiantes, y en una SPARC IPX para un servidor
de hora y DNS secundario.  Las estaciones en administraci&oacute;n
tambi&eacute;n tienen PCs con OpenBSD.
<p>

</dl>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: users.html,v 1.55 2000/10/03 23:22:30 louis Exp ]<br>
$Translation: users.html,v 1.7 2000/10/23 21:38:30 horacio Exp $<br>
$OpenBSD: users.html,v 1.6 2000/10/24 18:25:43 jufi Exp $
</small>

</body>
</html>
