<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD y el a&ntilde;o 2.000</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta name="description" content="the main OpenBSD page">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996,1999 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<img alt="[OpenBSD]" height="30" width="141" SRC="../images/smalltitle.gif">
<p>
<h2><font color="#e00000">Declaraci&oacute;n de Cumplimiento con el
A&ntilde;o 2.000</font><hr></h2>

<p>
Como parte de nuestra <a href="security.html">auditor&iacute;a de
seguridad</a>, hemos llevado a cabo una signficante labor para auditar
el &aacute;rbol de fuentes en busca de errores de dise&ntilde;o
relacionados con el <strong>a&ntilde;o 2.000</strong>.
Los que encontramos fueron solucionados antes de la liberaci&oacute;n
de la versi&oacute;n 2.3.  Estamos convencidos de que lo hicimos a
conciencia (llegamos a encontrar problemas en el tratamiento de fechas
de la p&aacute;ginas de manual generadas por <code>nroff</code>).
Las versiones posteriores fueron tratadas con cuidado para evitar
introducir nuevos errores.

<p>
Unos pocos errores de programaci&oacute;n menores se solucionaron entre
las liberaciones de las versiones 2.4, 2.5, y 2.6, pero todos ellos
carec&iacute;n de importancia.  La mayor&iacute;a de estos problemas
estaban relacionados con programas que a&uacute;n imprim&iacute;an las
fechas en formato de 2 d&iacute;gitos (aunque habr&iacute;n mostrado en
pantalla la fecha como 00 y no como 100).  No es algo que nos debiera
preocupar si consideramos que hay otros programas en el sistema que
algunas normativas les requiere que imprima las fechas en ese formato.

<p>
<a href="errata25.html#y2k">
La versi&oacute;n 2.5 del porte para i386 dispone de un parche para el
a&ntilde;o 2.000 relacionado con la BIOS que los usuarios
deber&iacute;n aplicar.
</a>

<p>
<a href="errata.html">
La versi&oacute;n 2.6 dispone de unos pocos parches para el a&ntilde;o
2.000 que los usuarios podr&iacute;an aplicar.
</a>

<p>
Recomendamos a los usuarios preocupados en extremo que se actualicen
con nuestra &uacute;ltima versi&oacute;n (lo que deber&iacute;a ser
algo obvio, considerando nuestras cont&iacute;nuas mejoras en
seguridad).

<p>
Puede ver una lista no comprensiva de problemas que hemos resuelto en
nuestros ficheros <i>Changelog</i> (disponibles en los CDs en
<strong>CD2:/Changelogs/</strong>) o en nuestro
<a href="plus.html">tabl&oacute;n de cambios diario</a> en internet.

<p>
En este momento no tenemos noticias de ning&uacute;n error de
programaci&oacute;n relacionado con el a&ntilde;o 2.000.  Si alguien se
entera de alguno que no hayamos encontrado, por favor informe a
nuestros desarrolladores para que puedan solucionarlo.

<p>
Si quiere una garant&iacute;a nuestra, por favor lea el
&quot;copyright&quot; en nuestros ficheros del c&oacute;digo fuente.
Si ha llegado a esta p&aacute;gina esperando encontrar una
garant&iacute;a, tal vez la deba extraer de otras fuentes, como
Microsoft.  Puede que le haga gracia, o que sean ellos quienes
r&iacute;an cuando les llame.
Esperamos que ahora reconozca lo rid&iacute;culo que es pedir a un
proyecto de software libre una garant&iacute;a cuando los
distribuidores que cobran cifras muy altas ni siquiera lo hacen para su
software.

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: y2k.html,v 1.9 2000/01/03 19:59:01 deraadt Exp ]<br>
$Translation: y2k.html,v 1.1 2000/05/16 00:30:22 horacio Exp $<br>
$OpenBSD: y2k.html,v 1.1 2000/05/16 09:58:06 wvdputte Exp $
</small>

</body>
</html>
