<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Anclajes y Subconjuntos de Reglas con Nombre</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="document">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,preguntas frecuentes,faq,pf">
<meta name="distribution"  content="global">
</head>

<!--
Copyright (c) 2003, 2004 Joel Knight <enabled@myrealbox.com>

Permission to use, copy, modify, and distribute this documentation for
any purpose with or without fee is hereby granted, provided that the
above copyright notice and this permission notice appear in all copies.

THE DOCUMENTATION IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL
WARRANTIES WITH REGARD TO THIS DOCUMENTATION INCLUDING ALL IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE
AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
PERFORMANCE OF THIS DOCUMENTATION
-->

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height="30" width="141" src="../../../images/smalltitle.gif">
<p>
[<a href="scrub.html">Anterior: <i>Scrubbing:</i> Normalizaci&oacute;n
de Paquetes)</a>]
[<a href="index.html">Contenido</a>]
[<a href="queueing.html">Siguiente: Formaci&oacute;n de Colas y
Prioridades de Paquetes</a>]

<p>
<h1><font color="#e00000">PF: Anclajes y Subconjuntos de Reglas con
Nombre</font></h1>

<hr>

<h3>&Iacute;ndice de Contenidos</h3>
<ul>
<li><a href="#intro">Introducci&oacute;n</a>
<li><a href="#named">Subconjuntos de Reglas con Nombre</a>
<li><a href="#options">Opciones de Anclaje</a>
<li><a href="#manip">Manipulaci&oacute;n de Subconjuntos de Reglas con
Nombre</a>
</ul>

<hr>

<a name="intro"></a>
<h2>Introducci&oacute;n</h2>
<p>
Adem&aacute;s del conjunto de reglas principal, PF tambi&eacute;n puede
evaluar subconjuntos de reglas.  Los subconjuntos de reglas se pueden
manipular sobre la marcha usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.4">pfctl(8)</a>,
para lo que disponen de un modo conveniente para alterar
din&aacute;micamente un conjunto de reglas activo.  Mientras que una
<a href="tables.html">tabla</a> se usa para contener una lista
din&aacute;mica de direcciones, un subconjunto de reglas se usa para
contener un conjunto din&aacute;mico de reglas de filtrado,
<tt>nat</tt>, <tt>rdr</tt>, y <tt>binat</tt>.

<p>
Estos subconjuntos de reglas van ligados al conjunto de reglas principal
mediante el uso de reglas de anclaje;  las reglas de anclaje se crean
con la clave <tt>anchor</tt>:
<ul>
<li><tt>anchor <i>nombre</i></tt> - eval&uacute;a todas las
<a href="filter.html">reglas de filtrado</a> en el anclaje
<i><tt>nombre</tt></i>
<li><tt>binat-anchor <i>nombre</i></tt> - eval&uacute;a todas las reglas
de <a href="nat.html#binat"><tt>binat</tt></a> en el anclaje
<i><tt>nombre</tt></i>
<li><tt>nat-anchor <i>nombre</i></tt> - eval&uacute;a todas las reglas
de <a href="nat.html"><tt>nat</tt></a> en el anclaje
<i><tt>nombre</tt></i>
<li><tt>rdr-anchor <i>nombre</i></tt> - eval&uacute;a todas las reglas
de <a href="rdr.html"><tt>rdr</tt></a> en el anclaje
<i><tt>nombre</tt></i>
</ul>

Las reglas de anclaje <tt>anchor</tt> s&oacute;lo se pueden definir en
el conjunto de reglas principal.

<a name="named"></a>
<h2>Subconjuntos de Reglas con Nombre</h2>
<p>
Un subconjunto de reglas con nombre es una agrupaci&oacute;n de reglas
de filtrado y/o traducci&oacute;n a la que se ha asignado un nombre.  Un
punto de anclaje <tt>anchor</tt> puede contener m&aacute;s de uno de
estos subconjuntos de reglas.  Cuando PF se encuentra con una regla
<tt>anchor</tt> en el conjunto principal de reglas, eval&uacute;a todos
los subconjuntos de reglas adjuntas a ese punto de anclaje, en orden
alfab&eacute;tico de acuerdo con sus nombres.  Entonces contin&uacute;a
el procesamiento en el conjunto de reglas principal, a menos que el
paquete concuerde con una regla de filtrado que use la opci&oacute;n
<tt>quick</tt> o con una regla de traducci&oacute;n dentro del mismo
anclaje, en cuyo caso la b&uacute;squeda de concordancia se
considerar&aacute; finalizada y terminar&aacute; la evaluaci&oacute;n de
las reglas, tanto en el anclaje como en el conjunto de reglas principal.

<p>
Por ejemplo:
<blockquote>
<tt>
ext_if = &quot;fxp0&quot;<br>
<br>
block on $ext_if all<br>
pass &nbsp;out on $ext_if all keep state<br>
anchor goodguys
</tt>
</blockquote>

<p>
En este conjunto de reglas se ha definido una pol&iacute;tica de
denegaci&oacute;n predeterminada en <tt>fxp0</tt>, tanto para el
tr&aacute;fico entrante como para el saliente.  A continuaci&oacute;n se
permite pasar el tr&aacute;fico, manteniendo el estado, y se crea una
regla de anclaje con el nombre de <tt>goodguys</tt>.  Hay dos
m&eacute;todos para llenar con reglas los anclajes:
<ul>
<li>usando un regla <tt>load</tt>
<li>usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.5"
>pfctl(8)</a>
</ul>

<p>
La regla <tt>load</tt> hace que <tt>pfctl</tt> llene el anclaje y el
conjunto de reglas con nombre especificados leyendo las reglas desde un
fichero de texto.  Ejemplo:
<blockquote>
<tt>
load anchor goodguys:ssh from &quot;/etc/anchor-goodguys-ssh&quot;
</tt>
</blockquote>

<p>
Cuando el conjunto de reglas principal est&eacute; cargado, las reglas
que aparecen en el fichero <tt>/etc/anchor-goodguys-ssh</tt> se
cargar&aacute;n en el conjunto de reglas con nombre <tt>ssh</tt>
vinculado al anclaje <tt>goodguys</tt>.

<p>
Para a&ntilde;adir reglas a un anclaje usando <tt>pfctl</tt>, hay que
usar una orden parecida a la siguiente:
<blockquote>
<tt>
# echo &quot;pass in proto tcp from 192.0.2.3 to any port 22&quot; \<br>
&nbsp;&nbsp;&nbsp;| pfctl -a goodguys:ssh -f -
</tt>
</blockquote>

<p>
Con esta orden se a&ntilde;ade una regla <tt>pass</tt> al conjunto de
reglas llamado <tt>ssh</tt>, adjunto al anclaje <tt>goodguys</tt>.  PF
eval&uacute;a esta regla, y cualquier otra regla de filtrado que se
a&ntilde;ada, cuando llega a la l&iacute;nea <tt>anchor goodguys</tt> en
el conjunto de reglas principal.

<p>
Tambi&eacute;n es posible guardar y cargar las reglas desde un fichero
de texto:
<blockquote>
<tt>
# cat &gt;&gt; /etc/anchor-goodguys-www<br>
pass in proto tcp from 192.0.2.3 to any port 80<br>
pass in proto tcp from 192.0.2.4 to any port { 80 443 }<br>
<br>
# pfctl -a goodguys:www -f /etc/anchor-goodguys-www<br>
</tt>
</blockquote>

<p>
De este modo se cargan las reglas desde el fichero
<tt>/etc/anchor-goodguys-www</tt> al subconjunto de reglas con nombre
<tt>www</tt> en el anclaje <tt>goodguys</tt>.

<p>
Las reglas de filtrado y de traducci&oacute;n se pueden cargar en un
subconjunto de reglas con nombre, usando la misma sintaxis y opciones
que para las reglas cargadas en el conjunto de reglas principal.  Sin
embargo, hay que tener en cuenta que tambi&eacute;n se debe definir
dentro del subconjunto de reglas con nombre cualquier
<a href="macros.html">macro</a> que est&eacute; siendo utilizada;  Las
macros que se encuentran definidas en el conjunto de reglas principal
<i>no</i> son visibles desde los subconjuntos de reglas con nombre.

<p>
Cada subconjunto de reglas con nombre, as&iacute; como el conjunto de
reglas principal, existe de forma independiente de los otros conjuntos
de reglas.  Las operaciones que se realicen en un conjunto de reglas,
como la limpieza de las reglas, no afecta a ninguno de los otros
conjuntos.  Adem&aacute;s, si se elimina un punto de anclaje del
conjunto de reglas principal, no se destruye el anclaje ni cualquier
subconjunto de reglas con nombre que est&eacute; adjunto a ese anclaje.
Un subconjunto de reglas con nombre no se destruye hasta que se han
limpiado todas las reglas usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.5">pfctl(8)</a>.
Cuando un punto de anclaje ya no tiene ning&uacute;n conjunto de reglas
adjunto, tambi&eacute;n se destruye.


<a name="options"></a>
<h2>Opciones de Anclaje</h2>
<p>
De modo opcional, las reglas <tt>anchor</tt> pueden especificar una
interfaz, un protocolo, una dirección de origen y destino, una marca, etc..
usando la misma sintaxis que las reglas de filtrado.  Cuando se da este
tipo de informaci&oacute;n, las reglas <tt>anchor</tt> s&oacute;lo se
procesan si el paquete concuerda con la definici&oacute;n de la regla
<tt>anchor</tt>.  Por ejemplo:
<blockquote>
<tt>
ext_if = &quot;fxp0&quot;<br>
<br>
block on $ext_if all<br>
pass &nbsp;out on $ext_if all keep state<br>
anchor ssh in on $ext_if proto tcp from any to any port 22<br>
</tt>
</blockquote>

<p>
Las reglas en el anclaje <tt>ssh</tt> s&oacute;lo se eval&uacute;an para
los paquetes TCP destinados al puerto 22 que entran en la interfaz
<tt>fxp0</tt>.  Entonces se a&ntilde;aden las reglas al <tt>anchor</tt>,
del siguiente modo:
<blockquote>
<tt>
# echo &quot;pass in from 192.0.2.10 to any&quot; | pfctl -a ssh:allowed -f -
</tt>
</blockquote>

<p>
Por lo tanto, aunque la regla de filtrado no especifique una interfaz,
un protocolo, o un puerto, al anfitri&oacute;n 192.0.2.10 s&oacute;lo se
le permitir&aacute; conectar usando SSH, de acuerdo con la
definici&oacute;n de la regla <tt>anchor</tt>.

<a name="manip"></a>
<h2>Manipulaci&oacute;n de Subconjuntos de Reglas con Nombre</h2>
<p>
La manipulaci&oacute;n de los subconjuntos de reglas con nombre se
realiza mediante <tt>pfctl</tt>.  Se puede usar <tt>pfctl</tt> para
a&ntilde;adir y eliminar reglas de un conjunto de reglas sin recargar el
conjunto de reglas principal.

<p>
Para ver una lista de todas las reglas en el conjunto de reglas
<tt>allowed</tt> adjunto al anclaje <tt>ssh</tt>:
<blockquote>
<tt>
# pfctl -a ssh:allowed -s rules
</tt>
</blockquote>

<p>
Para limpiar todas las reglas de filtrado de este mismo conjunto de
reglas:
<blockquote>
<tt>
# pfctl -a ssh:allowed -F rules
</tt>
</blockquote>

<p>
Si se omite el nombre del conjunto de reglas, la acci&oacute;n se
aplicar&aacute; a todas las reglas en el anclaje.

<p>
Para una lista completa de &oacute;rdenes, v&eacute;ase
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.5">pfctl(8)</a>.

<p>
[<a href="scrub.html">Anterior: <i>Scrubbing:</i> Normalizaci&oacute;n
de Paquetes)</a>]
[<a href="index.html">Contenido</a>]
[<a href="queueing.html">Siguiente: Formaci&oacute;n de Colas y
Prioridades de Paquetes</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[&Iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: anchors.html,v 1.12 ]<br>
$OpenBSD: anchors.html,v 1.10 2004/08/31 16:10:23 saad Exp $<br>
$Translation: anchors.html,v 1.12 2004/08/30 16:57:44 santana Exp $
</small>
</body>
</html> 
