<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Anclajes y Grupos de Reglas con Nombre</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="document">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,preguntas frecuentes,faq,pf">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height="30" width="141" src="../../../images/smalltitle.gif">
<p>
[<a href="logging.html">Anterior: Registros de Bit&aacute;cora</a>]
[<a href="index.html">Contenido</a>]
[<a href="shortcuts.html">Siguiente: Atajos para la Creaci&oacute;n de
Grupos de Reglas</a>]

<p>
<h1><font color="#e00000">PF: Anclajes y Grupos de Reglas con
Nombre</font></h1>

<hr>

<h3>&Iacute;ndice de Contenidos</h3>
<ul>
<li><a href="#intro">Introducci&oacute;n</a>
<li><a href="#named">Grupos de Reglas con Nombre</a>
<li><a href="#options">Opciones de Anclaje</a>
<li><a href="#manip">Manipulaci&oacute;n de Grupos de Reglas con
Nombre</a>
</ul>

<hr>

<a name="intro"></a>
<h2>Introducci&oacute;n</h2>
<p>
Adem&aacute;s del grupo de reglas principal, PF tambi&eacute;n puede
evaluar subgrupos de reglas.  Los subgrupos de reglas se pueden
manipular sobre la marcha usando
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.3"><tt>pfctl(8)</tt></a>,
raz&oacute;n por la cual proveen un modo conveniente de alterar
din&aacute;micamente un grupo de reglas activo.  Mientras que una
<a href="tables.html">tabla</a> se usa para contener una lista
din&aacute;mica de direcciones, un subgrupo de reglas se usa para
contener un grupo din&aacute;mico de reglas de filtrado, <tt>nat</tt>,
<tt>rdr</tt>, y <tt>binat</tt>.

<p>
Estos subgrupos de reglas van ligados al grupo de reglas principal
mediante el uso de reglas de anclaje;  las reglas de anclaje se crean
con la clave <tt>anchor</tt>:
<ul>
<li><tt>anchor <i>name</i></tt> - eval&uacute;a todas las
<a href="filter.html">reglas de filtrado</a> en el anclaje
<i><tt>name</tt></i>
<li><tt>binat-anchor <i>name</i></tt> - eval&uacute;a todas las reglas
de <a href="nat.html#binat"><tt>binat</tt></a> en el anclaje
<i><tt>name</tt></i>
<li><tt>nat-anchor <i>name</i></tt> - eval&uacute;a todas las reglas de
<a href="nat.html"><tt>nat</tt></a> en el anclaje <i><tt>name</tt></i>
<li><tt>rdr-anchor <i>name</i></tt> - eval&uacute;a todas las reglas de
<a href="rdr.html"><tt>rdr</tt></a> en el anclaje <i><tt>name</tt></i>
</ul>

Las reglas de anclaje <tt>anchor</tt> s&oacute;lo se pueden definir en
el grupo de reglas principal.

<a name="named"></a>
<h2>Grupos de Reglas con Nombre</h2>
<p>
Un grupo de reglas con nombre es una agrupaci&oacute;n de reglas de
filtrado y/o traducci&oacute;n a la que se ha asignado un nombre.  Un
punto de anclaje <tt>anchor</tt> puede contener m&aacute;s de uno de
estos subgrupos de reglas.  Cuando PF se encuentra con una regla
<tt>anchor</tt> en el grupo principal de reglas, eval&uacute;a todos los
subgrupos de reglas adjuntas a ese punto de anclaje, en orden
alfab&eacute;tico de acuerdo con sus nombres.  Entonces contin&uacute;a
el procesamiento en el grupo de reglas principal, a menos que el paquete
coincida con una reglas de filtrado que use la opci&oacute;n
<tt>quick</tt> o una regla de traducci&oacute;n dentro del mismo
anclaje, en cuyo caso la coincidencia se considerar&aacute; finalizada y
terminar&aacute; la evaluaci&oacute;n de las reglas, tanto en el anclaje
como en el grupo de reglas principal.

<p>
Por ejemplo:
<blockquote>
<tt>
ext_if = &quot;fxp0&quot;<br>
<br>
block on $ext_if all<br>
pass  out on $ext_if all keep state<br>
anchor goodguys
</tt>
</blockquote>

<p>
En este grupo de reglas se ha definido una pol&iacute;tica de
denegaci&oacute;n predeterminada en fxp0, tanto para el tr&aacute;fico
entrante como para el saliente.  A continuaci&oacute;n se permite pasar
el tr&aacute;fico, manteniendo el estado, y se crea una regla de anclaje
con el nombre de <tt><i>goodguys</i></tt>.  Para a&ntilde;adir reglas al
anclaje <tt><i>goodguys</i></tt>, se pueden usar las siguientes
&oacute;rdenes:
<blockquote>
<tt>
# echo &quot;pass in proto tcp from 192.0.2.3 to any port 22&quot; \<br>
&nbsp;&nbsp;&nbsp;| pfctl -a goodguys:ssh -f -
</tt>
</blockquote>

<p>
Esto a&ntilde;ade una regla <tt>pass</tt> al grupo de reglas llamado
<tt><i>ssh</i></tt>, adjunto al anclaje <tt><i>goodguys</i></tt>.  PF
eval&uacute;a esta regla (y cualquier otra reglas de filtrado que se
a&ntilde;ada) cuando llega a la l&iacute;nea <tt>anchor goodguys</tt> en
el grupo de reglas principal.

<p>
Tambi&eacute;n se puede guardar y cargar las reglas desde un fichero de
texto:
<blockquote>
<tt>
# cat &gt;&gt; /etc/anchor-goodguys-www<br>
pass in proto tcp from 192.0.2.3 to any port 80<br>
pass in proto tcp from 192.0.2.4 to any port { 80 443 }<br>
<br>
# pfctl -a goodguys:www -f /etc/anchor-goodguys-www<br>
</tt>
</blockquote>

<p>
De este modo se cargan las reglas desde el fichero
<tt>/etc/anchor-goodguys-www</tt> al subgrupo de reglas con nombre
<tt><i>www</i></tt> en el anclaje <tt><i>goodguys</i></tt>.

<a name="options"></a>
<h2>Opciones de Anclaje</h2>
<p>
De modo opcional, las reglas <tt>anchor</tt> pueden especificar una
interfaz, un protocolo, una direcci&oacute;n de origen y destino, etc..
usando la misma sintaxis que las reglas de filtrado.  Cuando se da este
tipo de informaci&oacute;n, las reglas <tt>anchor</tt> s&oacute;lo se
procesan si el paquete coincide con la definici&oacute;n de la regla
<tt>anchor</tt>.  Por ejemplo:
<blockquote>
<tt>
ext_if = &quot;fxp0&quot;<br>
<br>
block on $ext_if all<br>
pass  out on $ext_if all keep state<br>
anchor ssh in on $ext_if proto tcp from any to any port 22<br>
</tt>
</blockquote>

<p>
Las reglas en <tt>anchor <i>ssh</i></tt> s&oacute;lo se eval&uacute;an
para los paquetes TCP destinados al puerto 22 que entran en la interfaz
fxp0.  Entonces se a&ntilde;aden las reglas al <tt>anchor</tt>, del
siguiente modo:
<blockquote>
<tt>
# echo &quot;pass in from 192.0.2.10 to any&quot; | pfctl -a ssh:allowed -f -
</tt>
</blockquote>

<p>
Por lo tanto, aunque la regla de filtrado no especifique una interfaz,
un protocolo, o un puerto, al anfitri&oacute;n 192.0.2.10 s&oacute;lo se
le permitir&aacute; conectar usando SSH, de acuerdo con la
definici&oacute;n de la regla <tt>anchor</tt>.

<a name="manip"></a>
<h2>Manipulaci&oacute;n de Grupos de Reglas con Nombre</h2>
<p>
La manipulaci&oacute;n de los grupos de reglas con nombre se realiza
mediante <tt>pfctl</tt>.  Se puede usar <tt>pfctl</tt> para
a&ntilde;adir y eliminar reglas de un grupo de reglas sin recargar el
grupo de reglas principal.

<p>
Para ver una lista de todas las reglas en el grupo de reglas
<tt><i>allowed</i></tt> adjunto al anclaje <tt><i>ssh</i></tt>:
<blockquote>
<tt>
# pfctl -a ssh:allowed -s rules
</tt>
</blockquote>

<p>
Para limpiar todas las reglas de filtrado de este mismo grupo de reglas:
<blockquote>
<tt>
# pfctl -a ssh:allowed -F rules
</tt>
</blockquote>

<p>
Si se omite el nombre del grupo de reglas, la acci&oacute;n se
aplicar&aacute; a todas las reglas en el anclaje.

<p>
Para una lista completa de &oacute;rdenes, v&eacute;ase
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8&amp;manpath=OpenBSD+3.3"><tt>pfctl(8)</tt></a>.

<p>
[<a href="logging.html">Anterior: Registros de Bit&aacute;cora</a>]
[<a href="index.html">Contenido</a>]
[<a href="shortcuts.html">Siguiente: Atajos para la Creaci&oacute;n de
Grupos de Reglas</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[&Iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: anchors.html,v 1.3 2003/05/15 03:03:54 nick Exp ]<br>
$OpenBSD: anchors.html,v 1.1 2003/05/28 14:39:30 jufi Exp $<br>
$Translation: anchors.html,v 1.2 2003/05/26 09:12:05 horacio Exp $
</small>
</body>
</html> 
