<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Cuestiones Relacionadas con FTP</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="document">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,preguntas frecuentes,faq,pf">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 2002-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height="30" width="141" src="../../../images/smalltitle.gif">
<p>
[<a href="perf.html">Anterior: Rendimiento</a>]
[<a href="index.html">Contenido</a>]
[<a href="authpf.html">Siguiente: <i>Shell</i> de Usuario para la
Autenticaci&oacute;n de Pasarelas</a>]

<p>
<h1><font color="#e00000">PF: Cuestiones Relacionadas con
FTP</font></h1>
<hr>

<h3>&Iacute;ndice de Contenidos</h3>
<ul>
<li><a href="#modes">Modos de FTP</a>
<li><a href="#client">Cliente de FTP detr&aacute;s de un Cortafuegos</a>
<li><a href="#server">Autoprotecci&oacute;n de un Servidor de FTP con
PF</a>
<li><a href="#natserver">Servidor de FTP Protegido por un Cortafuegos de
PF Externo con NAT</a>
<li><a href="#info">M&aacute;s Informaci&oacute;n sobre FTP</a>
</ul>

<hr>

<a name="modes"></a>
<h2>Modos de FTP</h2>
<p>
FTP es un protocolo que se remonta a los tiempos cuando Internet era una
peque&ntilde;a y amigable colecci&oacute;n de computadores y todos los
operadores se conoc&iacute;an entre ellos.  En esos tiempos, no
exist&iacute;a la necesidad de filtrar o de reforzar la seguridad.  FTP
no se dise&ntilde;&oacute; para el filtrado ni para que pasara a
trav&eacute;s de cortafuegos o para que funcionara con NAT.

<p>
Se puede usar FTP de dos modos, pasivo o activo.  Generalmente, la
elecci&oacute;n entre activo o pasivo se toma para determinar
qui&eacute;n tiene el problema con los cortafuegos.  La realidad es que
para mantener a los usuarios contentos ser&aacute; el administrador
tendr&aacute; que dar soporte ambos modos.

<p>
Con FTP activo, cuando un usuario se conecta a un servidor de FTP remoto
y requiere informaci&oacute;n o un fichero de &eacute;ste, el servidor
de FTP abre una nueva conexi&oacute;n de vuelta al cliente para
transferir los datos que le ha requerido.  Esto se conoce como la
<i>conexi&oacute;n de datos</i>.  Para empezar, el cliente de FTP escoge
un puerto aleatorio por el que recibir&aacute; la conexi&oacute;n de
datos.  El cliente env&iacute;a al servidor de FTP el n&uacute;mero de
puerto que ha escogido, y permanece a la espera de recibir una
conexi&oacute;n entrante por este puerto.  Entonces el servidor de FTP
inicia una conexi&oacute;n a la direcci&oacute;n del cliente por el
puerto elegido, y empieza la transferencia de los datos.  Esto supone un
problema para los usuarios que intenten obtener acceso a servidores de
FTP que se encuentren detr&aacute;s de una pasarela de NAT.  Debido al
funcionamiento propio de NAT, el servidor de FTP inicia la
conexi&oacute;n de datos conect&aacute;ndose a la direcci&oacute;n
externa de la pasarela de NAt por el puerto elegido.  La m&aacute;quina
de NAT recibe esta conexi&oacute;n, pero como no tiene asignaci&oacute;n
para el paquete en su tabla de estado, lo bloquea y no lo entrega al
cliente.

<p>
Con el modo pasivo de FTP (el modo predeterminado con el cliente de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp&amp;sektion=1&amp;manpath=OpenBSD+3.3">ftp(1)</a> de OpenBSD),
el cliente env&iacute;a un requerimiento al servidor para que
&eacute;ste escoja un puerto aleatorio en el que se quede a la escucha
en espera de la conexi&oacute;n de datos.  El servidor informa al
cliente sobre el puerto que ha escogido, y el cliente se conecta a este
puerto para la transferencia de datos.  Desafortunadamente, esto no es
siempre posible o deseable a causa de la posiblidad de que exista un
cortafuegos delante del servidor de FTP bloqueando la conexi&oacute;n de
datos entrante.  En OpenBSD, ftp(1) est&aacute; configurado para usar el
modo pasivo; para forzar el modo activo de FTP, hay que usar el
indicador -A de la orden ftp, o desactivar el modo pasivo mediante la
orden <tt>passive off</tt> desde el punto de inserci&oacute;n de
<tt>ftp&gt;</tt>.


<a name="client"></a>
<h2>Cliente de FTP detr&aacute;s de un Cortafuegos</h2>
<p>
Como se ha indicado anteriormente, FTP no pasa muy bien a trav&eacute;s
de NAT y cortafuegos.

<p>
PF provee una soluci&oacute;n a esta situaci&oacute;n, redireccionando
el tr&aacute;fico de FTP a trav&eacute;s de un servidor <i>proxy</i> de
FTP, un proceso que act&uacute;a como &laquo;gu&iacute;a&raquo; del
tr&aacute;fico de FTP a trav&eacute;s de la pasarela/cortafuegos de NAT.
La <i>proxy</i> de FTP que usan OpenBSD y PF es
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftp-proxy&amp;sektion=8&amp;manpath=OpenBSD+3.3">ftp-proxy(8)</a>.
Para activarla, hay que a&ntilde;adir una l&iacute;nea parecida a la
siguiente en la secci&oacute;n de NAT del fichero <tt>/etc/pf.conf</tt>:

<blockquote>
<tt>
rdr on $int_if proto tcp from any to any port 21 -&gt; 127.0.0.1 \<br>
&nbsp;&nbsp;&nbsp;port 8021
</tt>
</blockquote>

<p>
Una breve explicaci&oacute;n de esta l&iacute;nea es:  &laquo;El
tr&aacute;fico en la interfaz interna se redirecciona al servidor de
<i>proxy</i> de esta m&aacute;quina, que est&aacute; a la escucha por el
puerto 8021&raquo;.

<p>
Para que esto funcione es obvio que el servidor de <i>proxy</i> debe
estar iniciado y funcionando en la m&aacute;quina de OpenBSD.  Esto se
hace introduciendo la siguiente l&iacute;nea en el fichero
<tt>/etc/inetd.conf</tt>:

<blockquote>
<tt>
127.0.0.1:8021 stream tcp nowait root /usr/libexec/ftp-proxy \<br>
&nbsp;&nbsp;&nbsp;ftp-proxy
</tt>
</blockquote>

<p>
y a continuaci&oacute;n reiniciando el sistema o enviando una
se&ntilde;al de 'HUP' a
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=inetd&amp;sektion=8&amp;manpath=OpenBSD+3.3">inetd(8)</a>.
Una forma de enviar la se&ntilde;al de 'HUP' es mediante la orden:

<blockquote>
<tt>
kill -HUP `cat /var/run/inetd.pid`
</tt>
</blockquote>

<p>
Prodemos ver que ftp-proxy estar&aacute; a la escucha en el puerto 8021,
el mismo puerto al que la declaraci&oacute;n de <tt>rdr</tt> anterior
estaba enviando el tr&aacute;fico de FTP.  La elecci&oacute;n del puerto
8021 es arbitraria, aunque 8021 es una buena elecci&oacute;n ya que no
est&aacute; definido para ninguna otra aplicaci&oacute;n.

<p>
N&oacute;tese que ftp-proxy(8) sirve para ayudar a los <b>clientes de
FTP</b> que se encuentran detr&aacute;s de un filtro de PF, no para
manejar un <b>servidor de FTP</b> que se encuentre detr&aacute;s de un
filtro de PF.


<a name="server"></a>
<h2>Autoprotecci&oacute;n de un Servidor de FTP con PF</h2>
<p>
Para este caso, PF estar&iacute;a funcionando en el mismo servidor de
FTP, en lugar de hacerlo en una m&aacute;quina separada de cortafuegos.
Cuando d&eacute; servicio a una conexi&oacute;n de FTP pasiva, FTP
usar&aacute; un puerto TCP alto aleatorio para los datos entrantes.
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8&amp;manpath=OpenBSD+3.3">ftpd(8)</a>,
el servidor nativo de FTP en OpenBSD, est&aacute; configurado para usar
de forma predeterminada un puerto en el rango entre 49152 y 65535.
Obviamente, es necesario permitir el paso para estos puertos, junto con
el puerto 21 (el puerto de control de FTP):

<blockquote>
<tt>
pass in on $ext_if proto tcp from any to any port 21 keep state<br>
pass in on $ext_if proto tcp from any to any port &gt; 49151 \<br>
&nbsp;&nbsp;&nbsp;keep state
</tt>
</blockquote>

<p>
N&oacute;tese que es posible restringir el rango de puertos de forma
considerable;  en el caso del programa
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8&amp;manpath=OpenBSD+3.3">ftpd(8)</a>
de OpenBSD, esto se hace usando las variables
<tt>net.inet.ip.porthifirst</tt> y <tt>net.inet.ip.porthilast</tt> de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8&amp;manpath=OpenBSD+3.3">sysctl(8)</a>.


<a name="natserver"></a>
<h2>Servidor de FTP Protegido por un Cortafuegos de PF con NAT</h2>
<p>
En este caso, el cortafuegos debe redireccionar el tr&aacute;fico al
servidor de FTP, adem&aacute;s de no bloquear los puertos requeridos.
Para el ejemplo de esta secci&oacute;n, asumiremos que el servidor de
FTP en cuesti&oacute;n es el de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8&amp;manpath=OpenBSD+3.3">ftpd(8)</a>
est&aacute;ndar de OpenBSD usando el rango de puertos predeterminado.

<p>
He aqu&iacute; un ejemplo de un subgrupo de reglas con el que se
obtendr&iacute;a esto:

<blockquote>
<tt>
ftp_server = &quot;10.0.3.21&quot;<br>
<br>
rdr on $ext_if proto tcp from any to any port 21 -&gt; $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port 21<br>
rdr on $ext_if proto tcp from any to any port 49152:65535 -&gt; \<br>
&nbsp;&nbsp;&nbsp;$ftp_server port 49152:65535<br>
<br>
pass in quick on $ext_if proto tcp from any to $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port 21 keep state<br>
pass in quick on $ext_if proto tcp from any to $ftp_server \<br>
&nbsp;&nbsp;&nbsp;port &gt; 49151 keep state
</tt>
</blockquote>

<a name="info"></a>
<h2>M&aacute;s Informaci&oacute;n sobre FTP</h2>
<p>
Se puede encontrar m&aacute;s informaci&oacute;n sobre el filtrado de
OpenBSD y el funcionamiento de FTP en el siguiente documento:
<ul>
<li><a href="http://www.pintday.org/whitepapers/ftp-review.shtml">FTP
Reviewed</a>
</ul>

<p>
[<a href="perf.html">Anterior: Rendimiento</a>]
[<a href="index.html">Contenido</a>]
[<a href="authpf.html">Siguiente: <i>Shell</i> de Usuario para la
Autenticaci&oacute;n de Pasarelas</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[&Iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: ftp.html,v 1.7 2003/06/29 20:28:24 nick Exp ]<br>
$OpenBSD: ftp.html,v 1.3 2003/07/04 22:43:46 jufi Exp $<br>
$Translation: ftp.html,v 1.7 2003/07/01 14:55:02 horacio Exp $
</small>
</body>
</html> 
