<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Rendimiento</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="document">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,preguntas frecuentes,faq,pf">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 2002-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">

<img alt="[OpenBSD]" height="30" width="141" src="../../../images/smalltitle.gif">
<p>
[<a href="pools.html">Anterior: <i>Pools</i> de Direcci&oacute;n y
Balanceo de Carga</a>]
[<a href="index.html">Contenido</a>]
[<a href="ftp.html">Siguiente: Cuestiones Relacionadas con FTP</a>]

<p>
<h1><font color="#e00000">PF: Rendimiento</font></h1>
<hr>

<h3>
&laquo;&iquest;Cu&aacute;nto ancho de banda puede gestionar
PF?&raquo;<br>
&laquo;&iquest;Qu&eacute; caracter&iacute;sticas debe tener mi
m&aacute;quina para gestionar mi conexi&oacute;n a Internet?&raquo;
</h3>

<p>
No existen respuestas concretas para estas preguntas.  Para algunas
aplicaciones, un 486/66 con un par de NIC (tarjeta de interfaz de red)
ISA de buena calidad pueden filtrar y gestionar NAT a unos 5Mbps, pero
para otras aplicaciones podr&iacute;a no ser suficiente una
m&aacute;quina mucho m&aacute;s r&aacute;pida con unas NIC PCI mucho
m&aacute;s eficientes.  La cuesti&oacute;n no es la cantidad de bits por
segundo, sino la cantidad de paquetes por segundo y la complejidad del
grupo de reglas.

<p>
El rendimiento de PF se determina mediante algunas variables:
<ul>
<li>El n&uacute;mero de paquetes por segundo.  La cantidad de
procesamiento necesaria para un paquete con 1500 bytes de carga
&uacute;til es casi la misma que para un paquete con un byte de carga
&uacute;til.  El n&uacute;mero de paquetes por segundo determina el
n&uacute;mero de veces que hay que evaluar la tabla de estado y, en caso
de no econtrar ah&iacute; la concordancia, las reglas de filtrado
tendr&aacute;n que ser evaluadas cada segundo, lo que a su vez determina
la demanda efectiva en el sistema.

<li>El rendimiento del <i>bus</i> del sistema.  El <i>bus</i> ISA tiene
un ancho de banda m&aacute;ximo de 8Mbps, y cuando est&aacute; siendo
accedido por el procesador tiene que disminuir hasta la velocidad
efectiva de un 80286 a 8MHz, sin que importe lo r&aacute;pido que pueda
ser en realidad el procesador.  El <i>bus</i> PCI tiene un ancho de
banda efectivo mucho mayor, y el impacto del procesador es menor.

<li>La eficiencia de la tarjeta de red.  Algunas adaptadoras de red son
m&aacute;s eficientes que otras.  Las tarjetas basadas en Realtek 8139
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rl&amp;sektion=4&amp;manpath=OpenBSD+3.4">rl</a>) 
tienden a ofrecer un rendimiento relativamente pobre, mientras que las
tarjetas basadas en Intel 21143
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dc&amp;sektion=4&amp;manpath=OpenBSD+3.4">dc</a>)
tienden a ofrecer un rendimiento bastante bueno.  Para obtener un
m&aacute;ximo de rendimiento, hay que considerar el uso de las tarjetas
gigabit Ethernet, aun cuando no se vaya a conectar a redes gigabit, ya
que disponen de una memoria mucho m&aacute;s avanzada.

<li>La complejidad y el dise&ntilde;o del grupo de reglas.  Cuanto
m&aacute;s complejo sea el grupo de reglas, m&aacute;s lento
funcionar&aacute;.  Cuantos m&aacute;s paquetes se filtren con
<tt>keep state</tt> y <tt>quick</tt>, mejor ser&aacute; el rendimiento.
Cuantas m&aacute;s l&iacute;neas deban ser evaluadas por cada paquete,
m&aacute;s bajo ser&aacute; el rendimiento.

<li>Tambi&eacute;n hay que mencionar la CPU y la RAM.  Como PF es un
proceso basado en el n&uacute;cleo del sistema, no usa espacio de
memoria de intercambio (<i>swap</i>).  Por lo tanto, si tenemos
suficiente RAM funcionar&aacute;, pero en caso contrario generar&aacute;
estados de p&aacute;nico a causa del agotamiento de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pool&amp;sektion=9&amp;manpath=OpenBSD+3.4">pool(9)</a>.
No son necesarias enormes cantidades de RAM;  32MB deber&iacute;an ser
suficientes para unos 30.000 estados, que son muchos estados para una
aplicaci&oacute;n en una peque&ntilde;a oficina o en casa.  La
mayor&iacute;a de usuarios se encontrar&aacute;n con que una
m&aacute;quina &laquo;reciclada&raquo; es m&aacute;s que suficiente para
un sistema de filtros PF;  un sistema con 300MHz mover&aacute; un gran
n&uacute;mero de paquetes con rapidez, siempre que est&eacute;
respaldado con unas buenas NIC y un buen grupo de reglas.
</ul>

<p>
Los usuarios suelen preguntar por bancos de pruebas para PF.  El
&uacute;nico banco de pruebas digno de tener en cuenta es el rendimiento
del <i>propio</i> sistema en el <i>propio</i> entorno.  Un banco de
pruebas que no replique nuestro entorno no nos ayudar&aacute; a planear
correctamente nuestro sistema de cortafuegos.  Lo mejor que podemos
hacer para obtener un banco de pruebas de PF es simular nosotros mismos
un entorno con las mismas condiciones de red -o lo m&aacute;s parecidas
que sea posible- que experimentar&iacute;a el cortafuegos real, y en el
mismo <i>hardware</i> que usar&iacute;a el cortafuegos.

<p>
PF se usa en algunas aplicaciones muy grandes con mucho tr&aacute;fico,
y los mismos desarrolladores son usuarios de PF que requieren gran
potencia.  Lo m&aacute;s seguro es que el funcionamiento para un usuario
normal sea excelente.

<p>
[<a href="pools.html">Anterior: <i>Pools</i> de Direcci&oacute;n y
Balanceo de Carga</a>]
[<a href="index.html">Contenido</a>]
[<a href="ftp.html">Siguiente: Cuestiones Relacionadas con FTP</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[&Iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: perf.html,v 1.9 ]<br>
$OpenBSD: perf.html,v 1.7 2003/11/17 19:44:24 horacio Exp $<br>
$Translation: perf.html,v 1.10 2003/11/17 19:22:08 horacio Exp $
</small>
</body>
</html> 
