<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>PF: Normalizaci&oacute;n de Paquetes (Scrub)</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="es">
<meta name="resource-type" content="documento">
<meta name="description"   content="Preguntas Frecuentes de OpenBSD">
<meta name="keywords"      content="openbsd,preguntas frecuentes,faq,pf">
<meta name="distribution"  content="global">
<meta name="copyright"     content="Este documento es copyright 2002-2003 de OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">

<img alt="[OpenBSD]" height="30" width="141" src="../../../images/smalltitle.gif">
<p>
[<a href="options.html">Anterior: Opciones</a>]
[<a href="index.html">Contenidos</a>]
[<a href="queueing.html">Siguiente: Formaci&oacute;n de Colas</a>]

<p>
<h1><font color="#e00000">PF: Normalizaci&oacute;n de Paquetes
(<i>Scrub</i>)</font></h1>
<hr>

<h3>&Iacute;ndice de Contenidos</h3>
<ul>
<li><a href="#intro">Introducci&oacute;n</a>
<li><a href="#options">Opciones</a>
</ul>

<hr>

<a name="intro"></a>
<h2>Introducci&oacute;n</h2>
<p>
<i>&quot;Scrubbing&quot;</i> es la normalizaci&oacute;n de paquetes con
el fin de que no existan ambig&uuml;edades de interpretaci&oacute;n en
el destino final del paquete.  La directiva <i>scrub</i> tambi&eacute;n
realiza el
reensamblaje de paquetes fragmentados, protegiendo a algunos sistemas
operativos de ciertos tipos de ataques y bloqueando los paquetes TCP que
lleven una combinaci&oacute;n no v&aacute;lida del indicador de TCP
(v&eacute;ase <a href="filter.html#tcpflags">flag</a>).  Una forma
simple de la directiva <i>scrub</i> ser&iacute;a:
<blockquote>
<tt>
scrub in all
</tt>
</blockquote>

<p>
Con este ejemplo de <i>scrub</i> se normalizar&iacute;an todos los
paquetes entrantes en todas las interfaces.

<p>
Un motivo para no usar <i>scrub</i> en una interfaz ser&iacute;a que se
estuviera pasando tr&aacute;fico de NFS a trav&eacute;s de PF.  Algunas
plataformas no OpenBSD env&iacute;an (y esperan recibir) paquetes
extra&ntilde;os, paquetes fragmentados con el <i>bit</i> <i>&quot;do not
fragment&quot;</i> activado, y &eacute;stos son rechazados con motivo
por <tt>scrub</tt>.  Este problema se puede solucionar usando la
opci&oacute;n <tt>no-df</tt>.  Otro motivo para no usar <i>scrub</i> es
que algunos juegos de jugadores m&uacute;ltiples tienen problemas de
conexi&oacute;n al pasar a trav&eacute;s de PF con la directiva
<tt>scrub</tt> activada.  A parte de estos casos poco usuales, el uso de
<i>scrub</i> en todos los paquetes es una pr&aacute;ctica muy
recomendable.

<p>
La sintaxis de la directiva <tt>scrub</tt> es muy parecida a la sintaxis
del <a href="filter.html">filtro de paquetes</a>, lo que facilita el uso
de <i>scrub</i> en cierto paquetes y no en otros.

<p>
Puede verse m&aacute;s informaci&oacute;n sobre los principios y
conceptos de <i>scrub</i> en:
<a href="http://www.icir.org/vern/papers/norm-usenix-sec-01-html/index.html">http://www.icir.org/vern/papers/norm-usenix-sec-01-html/index.html</a>

<a name="options"></a>
<h2>Opciones</h2>
La directiva <tt>scrub</tt> acepta las siguientes opciones:
<dl>
<dt><tt>no-df</tt> 
<dd>Elimina el <i>bit</i> &quot;<i>don't fragment</i>&quot; de la
cabecera del paquete de IP.  Se sabe que algunos sistemas operativos
generan paquetes fragmentados con <i>don't fragment</i> activado.  En
concreto, esto es lo que ocurre con NFS.  <i>Scrub</i> bloquea esos
paquetes a menos que se especifique la opci&oacute;n <tt>no-df</tt>.
Debido a que algunos sistemas operativos generan paquetes <i>don't
fragment</i> con un campo de cabecera de identificaci&oacute;n de IP
nulo, se recomienda usar <tt>no-df</tt> junto con <tt>random-ip</tt>.

<dt><tt>random-id</tt> 
<dd>Sustituye el campo de identificaci&oacute;n de IP de los paquetes
salientes con valores aleatorios, para compensar la existencia de
sistemas operativos que usan valores predecibles.  Esta opci&oacute;n
s&oacute;lo se aplica a los paquetes salientes que no est&eacute;n
fragmentados despu&eacute;s del reensamblaje opcional del paquete.

<dt><tt>min-ttl <i>num</i></tt> 
<dd>Impone un <i>Time To Live</i> (TTL, un tiempo de vida) m&iacute;nimo
en cabeceras de paquetes IP.

<dt><tt>max-mss <i>num</i></tt> 
<dd>Impone un <i>Maximum Segment Size</i> (MSS, un tama&ntilde;o
m&aacute;ximo de segmento) m&aacute;ximo en cabeceras de paquetes TCP.

<dt><tt>fragment reassemble</tt> 
<dd>Almacena en memoria fragmentos de paquetes entrantes y los
reensambla en un paquete completo antes de pasarlos a la maquinaria de
filtrado.  La ventaja de esto es que las reglas de filtrado s&oacute;lo
tienen que tratar con paquetes completos y pueden ignorar los
fragmentos.  La desventaja es que necesita m&aacute;s memoria para
almacenar temporalmente los fragmentos de los paquetes.  Cuando no se
especifica la opci&oacute;n <tt>fragment</tt>, este funcionamiento es el
predeterminado.  Tambi&eacute;n es la &uacute;nica opci&oacute;n de
<tt>fragment</tt> que funciona con NAT.

<dt><tt>fragment crop</tt> 
<dd>Provoca que se rechacen los fragmentos duplicados y que se recorten
los que coincidan en parte.  A diferencia de
<tt>fragment&nbsp;reassemble</tt>, los fragmentos no se almacenan
temporalmente en la memoria, sino que que se pasan en cuanto llegan.

<dt><tt>fragment drop-ovl</tt> 
<dd>Parecido a <tt>fragment crop</tt>, con la diferencia de que todos
los fragmentos duplicados o que coincidan, as&iacute; como cualquier
fragmento correspondiente a continuaci&oacute;n, son rechazados.
</dl>

<p>
Ejemplo:
<blockquote>
<tt>
scrub in on fxp0 all fragment reassemble min-ttl 15 max-mss 1400
</tt>
</blockquote>

<p>
[<a href="options.html">Anterior: Opciones</a>]
[<a href="index.html">Contenidos</a>]
[<a href="queueing.html">Siguiente: Formaci&oacute;n de Colas</a>]

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../../images/back.gif" border="0" alt="[&Iacute;ndice]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: scrub.html,v 1.6 ]<br>
$OpenBSD: scrub.html,v 1.6 2003/09/27 14:55:54 horacio Exp $<br>
$Translation: scrub.html,v 1.7 2003/09/27 13:46:08 horacio Exp $
</small>
</body>
</html> 
