<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>10 - Gestion du Syst&egrave;me</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2004 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif"> 
<p>
<font color= "#0000e0">
<a href= "index.html">[Index de la FAQ]</a>
<a href= "faq9.html">[Section 9 - Migrer depuis Linux]</a>
<a href= "faq11.html">[Section 11 - Optimisation des Performances]</a>
</font>

<h1><font color=#e00000>10 - Gestion du Syst&egrave;me</font></h1> 
<hr>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
  <li><a href="#wheel"         >10.1 - Quand j'essaie de passer root &agrave; l'aide de su, on me dit que je suis dans le mauvais groupe.</a> 
  <li><a href="#DupFS"         >10.2 - Comment dupliquer un syst&egrave;me de fichiers ?</a> 
  <li><a href="#rc"            >10.3 - Comment d&eacute;marrer des services en m&ecirc;me temps que le syst&egrave;me ? (Vue d'ensemble de rc(8))</a> 
  <li><a href="#RelayingDenied">10.4 - Pourquoi les utilisateurs sont interdits de relais quand ils envoient des mails &agrave; distance &agrave; travers mon syst&egrave;me OpenBSD ?</a> 
  <li><a href="#POP"           >10.5 - J'ai mis en place POP, mais j'ai des erreurs quand j'acc&egrave;de &agrave; ma messagerie via POP. Que puis-je faire ?</a> 
  <li><a href="#SendmailDNS"   >10.6 - Pourquoi Sendmail ignore-t-il /etc/hosts ?</a>
  <li><a href="#HTTPS"         >10.7 - Configurer HTTP en mode s&eacute;curis&eacute; &agrave; l'aide de ssl(8)</a> 
  <li><a href="#vipw"          >10.8 - J'ai effectu&eacute; des changements dans /etc/passwd avec vi(1), mais les changements ne semblent pas &ecirc;tre pris en compte. Pourquoi ?</a> 
  <li><a href="#AddDelUser"    >10.9 - Comment je cr&eacute;e un compte utilisateur ? Ou je supprime un compte utilisateur ?</a> 
  <li><a href="#FTPOnly"       >10.10 - Comment puis-je cr&eacute;er un compte pour ftp uniquement ?</a> 
  <li><a href="#Quotas"        >10.11 - Mise en place des quotas </a>
  <li><a href="#Kerberos"      >10.12 - Mise en place de Clients et Serveurs KerberosV</a>
  <li><a href="#AnonFTP"       >10.13 - Mise en place d'un serveur FTP Anonyme</a>
  <li><a href="#ftpchroot"     >10.14 - Confiner les utilisateurs &agrave; leur r&eacute;pertoire HOME avec ftpd(8)</a> 
  <li><a href="#Patches"       >10.15 - Appliquer des correctifs sous OpenBSD</a>
  <li><a href="#httpdchroot"   >10.16 - Parlez moi de chroot() Apache ?</a>
  <li><a href="#rootshell"     >10.17 - Je n'aime pas le shell root standard !</a>
  <li><a href="#ksh"           >10.18 - Que puis-je faire d'autre avec ksh ?</a>
</ul>

<hr>

<p>
<a name= "wheel"></a>
<h2>10.1 - Quand j'essaie de passer root &agrave; l'aide de su, on me
       dit que je suis dans le mauvais groupe</h2>

<p> 
Les utilisateurs existant sur le syst&egrave;me doivent &ecirc;tre
rajout&eacute;s au groupe <kbd>&quot;</kbd><kbd>wheel&quot;</kbd>
&agrave; la main. Ceci est fait pour des raisons de
s&eacute;curit&eacute;, et vous devriez apporter une attention toute
particuli&egrave;re lorsque vous donnez l'acc&egrave;s &agrave; ce
groupe &agrave; des utilisateurs. Sous OpenBSD, les utilisateurs
appartenant au groupe <kbd>wheel</kbd> sont autoris&eacute;s &agrave;
utiliser le programme
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=su&amp;sektion=1">su(1)</a>
pour devenir root. Les utilisateurs n'appartenant pas &agrave; ce groupe
ne peuvent pas utiliser su(1). Voici un exemple d'une entr&eacute;e
<kbd>/etc/group</kbd> pour mettre l'utilisateur <strong>ericj</strong>
dans le groupe <kbd>&quot;wheel&quot;</kbd>.
<p>Si vous ajoutez un utilisateur avec 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&amp;sektion=8">adduser(8)</a>, 
vous pouvez le mettre dans le groupe wheel en r&eacute;pondant wheel
&agrave; la question "<tt>Invite <i>user</i> into other groups:</tt>".
Ceci aura pour effet de rajouter l'entr&eacute;e correspondante dans
/etc/group qui ressemble &agrave; la ligne suivante :

<blockquote><pre>
wheel:*:0:root,ericj
</pre></blockquote>

<p>
Si vous cherchez un moyen pour limiter l'acc&egrave;s des utilisateurs
aux privil&egrave;ges du super utilisateur, sans pour autant les mettre
dans le groupe <kbd>&quot;wheel&quot;</kbd>, utilisez
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sudo&amp;sektion=8">sudo(8)</a>. 

<p><a name= "DupFS"></a>
<h2>10.2 - Comment dupliquer un syst&egrave;me de fichiers ?</h2>

<p>
Pour dupliquer votre syst&egrave;me de fichiers, utilisez 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dump&amp;sektion=8">dump(8)</a> 
et 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=restore&amp;sektion=8">restore(8)</a>. 
Par exemple, pour dupliquer tout ce qu'il y a sous le r&eacute;pertoire
<kbd>SRC</kbd> vers le r&eacute;pertoire <kbd>DST</kbd>, faites un :
<blockquote><pre>
# <strong>cd /SRC; dump 0f - . | (cd /DST; restore -rf - )</strong>
</pre></blockquote>

<p>
dump est con&ccedil;u pour vous fournir beaucoup de possibilit&eacute;s
de sauvegarde, et c'est peut-&ecirc;tre trop si vous voulez juste
dupliquer une partie d'un syst&egrave;me de fichiers (entier). La
commande
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=tar&amp;sektion=1">tar(1)</a> 
peut &ecirc;tre plus rapide pour ce genre d'op&eacute;ration. Le format
est tr&egrave;s similaire &agrave; celui de dump :

<blockquote><pre>
# <strong>cd /SRC; tar cf -  . | (cd /DST; tar xpf - )</strong>
</pre></blockquote>

<p>
<a name= "rc"></a>
<h2>10.3 - Comment d&eacute;marrer des services en m&ecirc;me temps que
       le syst&egrave;me ? (Vue d'ensemble de rc(8))</h2>

<p>
OpenBSD utilise un d&eacute;marrage de type 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc&amp;sektion=8">rc(8)</a>
. Il utilise seulement quelques fichiers cl&eacute;s pour le
  d&eacute;marrage.
<ul>
  <li>/etc/rc - Script principal. Ne doit pas &ecirc;tre
       &eacute;dit&eacute;.
  <li>/etc/rc.conf - Fichier de configuration utilis&eacute; par
       <i>/etc/rc </i>pour savoir quels services doivent &ecirc;tre
       d&eacute;marr&eacute;s en m&ecirc;me temps que le syst&egrave;me
  <li>/etc/rc.conf.local - Fichier de configuration servant &agrave;
       compl&eacute;ter /etc/rc.conf, ainsi vous ne devez pas toucher
       &agrave; /etc/rc.conf, ce qui est commode pour ceux qui
       (re)mettent souvent &agrave; jour leur syst&egrave;me.
  <li>/etc/netstart - Script pour initialiser le r&eacute;seau. Ne
       devrait pas &ecirc;tre &eacute;dit&eacute;.
  <li>/etc/rc.local - Script utilis&eacute; pour l'administration
       locale. C'est l&agrave; o&ugrave; les informations relatives
       &agrave; de nouveaux services ou des informations
       sp&eacute;cifiques &agrave; l'h&ocirc;te doivent &ecirc;tre
       stock&eacute;es.
  <li>/etc/rc.securelevel - Script utilis&eacute; pour ex&eacute;cuter
       des commandes qui doivent &ecirc;tre ex&eacute;cut&eacute;es
       avant que le niveau de s&eacute;curit&eacute; ne change. Voir
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=init&amp;sektion=8">init(8)</a> 
  <li>/etc/rc.shutdown - Script ex&eacute;cut&eacute; lors de
       l'arr&ecirc;t de la machine. Mettez tout ce que vous voulez
       ex&eacute;cuter avant l'arr&ecirc;t de la machine dans ce
       fichier. Voir
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.shutdown&amp;sektion=8">rc.shutdown(8)</a> 
</ul>

<h3>Comment fonctionne rc(8) ?</h3>

<p>
<i>/etc/rc.conf</i> (ou <i>/etc/rc.conf.local</i>), <i>/etc/rc.local</i>
et <i>/etc/rc.shutdown</i> sont les principaux fichiers &agrave;
conna&icirc;tre par l'administrateur syst&egrave;me. Pour comprendre le
fonctionnement de la proc&eacute;dure rc(8), en voici le
d&eacute;roulement :

<p>
<i>/etc/rc </i>est appel&eacute; apr&egrave;s le d&eacute;marrage du noyau :
<ul> 
  <li>Les syst&egrave;mes de fichiers sont v&eacute;rifi&eacute;s. Cette
      v&eacute;rification n'aura pas lieu si le fichier /etc/fastboot
      existe. Ce n'est certainement pas une bonne id&eacute;e.
  <li>Les variables de configuration sont lues &agrave; partir de
      <i>/etc/rc.conf</i> et ensuite <i>/etc/rc.conf.local</i>. Les
      param&egrave;tres dans rc.local.conf vont surpasser ceux se
      trouvant dans rc.conf.
  <li>Les syst&egrave;mes de fichiers sont mont&eacute;s
  <li><i>/tmp </i>est nettoy&eacute; et les fichiers d'&eacute;diteurs
          sont pr&eacute;serv&eacute;s
  <li>Le r&eacute;seau est configur&eacute; &agrave; l'aide de
      <i>/etc/netstart</i>
  <ul>
      <li>Les interfaces r&eacute;seau sont mont&eacute;es.
      <li>Le nom d'h&ocirc;te et le nom de domaine (ainsi que d'autres
          param&egrave;tres) sont positionn&eacute;s </ul>
  <li>Les services syst&egrave;me sont d&eacute;marr&eacute;s
  <li>Diverses v&eacute;rifications sont effectu&eacute;es (quota,
      savecore, etc).
  <li>Les services locaux sont d&eacute;marr&eacute;s &agrave; partir de
      <i>/etc/rc.local</i>
</ul>

<h3>D&eacute;marrage des services fournis avec OpenBSD</h3>

<p>
La plupart des services fournis par d&eacute;faut avec OpenBSD sont
lanc&eacute;s au d&eacute;marrage simplement en modifiant le fichier de
configuration <i>/etc/rc.conf</i>. Pour commencer, jetez un coup d'oeil
au fichier
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/etc/rc.conf">/etc/rc.conf</a> 
par d&eacute;faut. Vous verrez des lignes similaires &agrave; la ligne
suivante :
 
<blockquote><pre>
ftpd_flags=NO           # for non-inetd use: ftpd_flags="-D"
</pre></blockquote>

<p>
Une ligne telle que celle-ci montre que ftpd n'est pas lanc&eacute; au
d&eacute;marrage du syst&egrave;me (du moins pas &agrave; travers rc(8),
lisez la <a href="faq10.html#AnonFTP">FAQ Serveur FTP Anonyme</a> pour
plus d'informations). Dans tous les cas, chaque ligne est dot&eacute;e
d'un commentaire qui vous montrent les drapeaux utilis&eacute;s dans le
cadre d'une utilisation <b>NORMALE </b>du service. Cela ne veut pas dire
que vous devez appeler ce service avec ces m&ecirc;mes drapeaux. Vous
pouvez toujours utiliser man(1) pour savoir comment d&eacute;marrer un
service donn&eacute; de la mani&egrave;re que vous souhaitez. Par
exemple, voici la ligne par d&eacute;faut concernant httpd(8) :
<blockquote><pre>
httpd_flags=NO          # for normal use: "" (or "-DSSL" after reading ssl(8))
</pre></blockquote>

<p>
D'apr&egrave;s cet exemple, vous pouvez voir qu'aucun drapeau n'est
n&eacute;cessaire pour d&eacute;marrer httpd normalement. Ainsi, la
ligne &quot;<b> httpd_flags=""</b> suffit. Mais pour d&eacute;marrer
httpd avec le support ssl (Reportez vous &agrave; la <a
href="#HTTPS">FAQ SSL</a> ou &agrave;
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl(8)</a>
), vous devez d&eacute;marrer httpd avec une ligne comme celle-ci :
&quot;httpd_flags="-DSSL"&quot;.

<p>
Une autre approche serait de ne jamais toucher &agrave;
<i>/etc/rc.conf</i>. Au contraire, cr&eacute;ez le fichier
<i>/etc/rc.conf.local</i> et ne copiez que les lignes que vous comptez
changer dans <i>/etc/rc.conf</i> et modifiez-les comme vous voulez. Ceci
peut rendre vos mises &agrave; jour futures plus faciles -- tous les
changements se trouvant dans un fichier.

<h3>D&eacute;marrage et configuration des services locaux</h3>

<p>
Pour les services que vous installez via la collection de ports ou
d'autres m&eacute;thodes, vous devez utiliser le fichier
<i>/etc/rc.local</i>. Par exemple, j'ai install&eacute; un service
fourni par l'applicatif /usr/local/sbin/daemonx. Je souhaite que ce
service soit lanc&eacute; au d&eacute;marrage. Pour cela, je rajoute les
lignes suivantes dans <i>/etc/rc.local</i> :

<blockquote><pre>
if [ -x /usr/local/sbin/daemonx ]; then
             echo -n ' daemonx';       /usr/local/sbin/daemonx
fi
</pre></blockquote>

<p>
(Si le service ne se d&eacute;tache pas automatiquement lors de son
d&eacute;marrage, souvenez-vous de rajouter "&amp;" &agrave; la fin de
la commande.)

<p>
A partir de l&agrave;, ce service sera lanc&eacute; au d&eacute;marrage.
Vous pourrez voir toutes les erreurs au d&eacute;marrage. Un
d&eacute;marrage normal sans erreurs affichera le message suivant :
<blockquote><pre>
Starting local daemons: daemonx.
</pre></blockquote>

<h3>rc.shutdown</h3>

<p>
<i>/etc/rc.shutdown</i> est un script ex&eacute;cut&eacute; &agrave;
l'arr&ecirc;t de la machine. Toutes les t&acirc;ches &agrave; effectuer
avant l'arr&ecirc;t du syst&egrave;me devront &ecirc;tre ajout&eacute;es
&agrave; ce fichier. Si vous avez apm, vous pouvez aussi positionner
&quot;powerdown=YES&quot;. C'est l'&eacute;quivalent de &quot;shutdown
-p&quot;.

<p>
<a name= "RelayingDenied"></a>
<h2>10.4 - Pourquoi les utilisateurs sont interdits de relais quand ils
       envoient des mails &agrave; distance &agrave; travers mon
       syst&egrave;me OpenBSD ?</h2>

<p> 
Essayez ceci : 

<blockquote><pre>
# <strong>cat /etc/mail/sendmail.cf | grep relay-domains</strong>
</pre></blockquote>

<p>
Le r&eacute;sultat ressemblerait &agrave; la ligne suivante :

<blockquote><pre>
FR-o /etc/mail/relay-domains
</pre></blockquote>

<p>
Si ce fichier n'existe pas, cr&eacute;ez le. Vous devez saisir les
h&ocirc;tes qui envoient des messages &agrave; distance en respectant la
syntaxe suivante :

<blockquote><pre>
.domain.com    #Allow relaying for/to any host in domain.com
sub.domain.com #Allow relaying for/to sub.domain.com and any host in that domain
10.2           #Allow relaying from all hosts in the IP net 10.2.*.*
</pre></blockquote>

<p>
N'oubliez pas d'envoyer un signal 'HangUP' &agrave; sendmail (signal qui
notifie la plupart des processus de relire leur fichier de
configuration) :

<blockquote><pre>
# <Strong>kill -HUP `head -1 /var/run/sendmail.pid`</strong>
</pre></blockquote>

<p>
<h3>Pour plus d'informations </h3>

<p>
<ul>
<li><a href="http://www.sendmail.org/~ca/email/relayingdenied.html">http://www.sendmail.org/~ca/email/relayingdenied.html</a>
<li><a href="http://www.sendmail.org/tips/relaying.html">http://www.sendmail.org/tips/relaying.html</a>
<li><a href="http://www.sendmail.org/antispam.html">http://www.sendmail.org/antispam.html</a>
</ul>

<p>
<a name= "POP"></a>
<h2>10.5 - J'ai mis en place POP, mais j'ai des erreurs quand
       j'acc&egrave;de &agrave; ma messagerie via POP. Que puis-je faire
       ? </h2>

<p>
La plupart des probl&egrave;mes rencontr&eacute;s avec POP sont
li&eacute;s aux fichiers temporaires et aux fichiers verrous. Si votre
serveur POP renvoie une erreur du type :

<blockquote><pre>
-ERR Couldn't open temporary file, do you own it?
</pre></blockquote>

<p>
Essayez de positionner les permissions comme suit :

<blockquote><pre>
permission in  /var
drwxrwxr-x   2 bin     mail     512 May 26 20:08 mail


permissions in  /var/mail
-rw-------   1 username   username        0 May 26 20:08 username
</pre></blockquote>

<p>
V&eacute;rifiez aussi que l'utilisateur poss&egrave;de son propre
fichier /var/mail. Bien &eacute;videmment, ceci devrait &ecirc;tre le
cas (comme par exemple l'utilisateur joe qui poss&egrave;de
/var/mail/joe) mais si &ccedil;a n'a pas &eacute;t&eacute;
configur&eacute; proprement, le probl&egrave;me viendrait de l&agrave; !

<p>
Bien entendu, si vous donner l'acc&egrave;s &agrave; /var/mail en
&eacute;criture au groupe mail, vous allez probablement vous exposer
&agrave; des vagues et obscurs probl&egrave;mes de
s&eacute;curit&eacute;. Il se pourrait que &ccedil;a ne pose aucun
probl&egrave;me mais on ne sait jamais (et particuli&egrave;rement si
vous &ecirc;tes un site de haut vol, un FAI,...) ! Il existe plusieurs
services POP de la collection de ports OpenBSD. Si possible, utilisez
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=popa3d&amp;sektion=8">popa3d(8)</a> 
disponible dans le syst&egrave;me de base d'OpenBSD. Ou peut-&ecirc;tre
vous avez s&eacute;lectionn&eacute; les mauvaises options pour votre
programme POP serveur (comme le dot locking). Ou vous avez
peut-&ecirc;tre simplement besoin de changer le r&eacute;pertoire dans
lequel les verrous sont cr&eacute;es (bien que les op&eacute;rations de
verrouillage ne devraient &ecirc;tre b&eacute;n&eacute;fiques qu'au
service POP).

<p>
<b>PS:</b> Il est &agrave; noter que OpenBSD n'a pas de groupe
   &quot;mail&quot;. Vous devez en cr&eacute;er un, si
   n&eacute;cessaire, dans le fichier <i>/etc/group</i>. La ligne
   suivante devrait suffire :

<blockquote><pre>
mail:*:6:
</pre></blockquote>

<p>
<a name="SendmailDNS"></a>
<h2>10.6 - Pourquoi Sendmail ignore-t-il le fichier <tt>/etc/hosts</tt>
       ?</h2>

<p>
Par d&eacute;faut, Sendmail utilise le DNS pour la r&eacute;solution de
nom, non le fichier <tt>/etc/hosts</tt>. Ce comportement peut &ecirc;tre
chang&eacute; par l'usage du fichier <tt>/etc/mail/service.switch</tt>.

<p>
Si vous d&eacute;sirez interroger le fichier d'h&ocirc;tes avant les
serveurs DNS, cr&eacute;ez un fichier <tt>/etc/mail/service.switch</tt>
contenant les lignes suivantes :

<pre>
   hosts      files dns
</pre>

<p>
Si vous d&eacute;sirez interroger QUE le le fichier d'h&ocirc;tes,
utilisez ce qui suit :

<pre>
   hosts      files
</pre>

<p>
Envoyez un signal HUP &agrave; Sendmail :

<pre>
   # <b>kill -HUP `head -1 /var/run/sendmail.pid`</b>
</pre>

<p>
et les changements prendront effet.


<p>
<a name= "HTTPS"></a>
<h2>10.7 - Configurer HTTP en mode s&eacute;curis&eacute; &agrave;
       l'aide de SSL(8)</h2>

<p>
OpenBSD est fourni avec des librairies RSA et un service httpd
supportant SSL. Pour utiliser SSL avec
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=httpd&amp;sektion=8">httpd(8)</a>, 
vous devez d'abord cr&eacute;er un certificat. Ce certificat sera
stock&eacute; dans <i>/etc/ssl/private/</i>. Les &eacute;tapes
d&eacute;crites ici sont en partie prises de la page de manuel
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl(8)</a>. 
Lisez la pour plus d'informations. Cette partie de la FAQ
s'int&eacute;resse seulement &agrave; la g&eacute;n&eacute;ration d'un
certificat RSA pour les serveurs Web. Elle ne d&eacute;crit pas les
certificats serveur DSA. Pour plus d'informations &agrave; ce sujet,
lisez la page de manuel
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssl&amp;sektion=8">ssl(8)</a>.

<p>
Pour commencer, vous aurez besoin de cr&eacute;er votre cl&eacute;
serveur et le certificat en utilisant OpenSSL :

<div style="margin-left: 2em">
<pre>
# <strong>openssl genrsa -out /etc/ssl/private/server.key 1024</strong>
</pre>
</div>

<p>
Ou si vous voulez que la cl&eacute; soit crypt&eacute;e avec un mot de
passe que vous devez saisir &agrave; chaque d&eacute;marrage des
serveurs

<div style="margin-left: 2em">
<pre>
# <strong>openssl genrsa -des3 -out /etc/ssl/private/server.key 1024</strong>
</pre>
</div>

<p>
La prochaine &eacute;tape consiste &agrave; g&eacute;n&eacute;rer une
requ&ecirc;te de signature de certificat qui est utilis&eacute;e pour
permettre &agrave; une autorit&eacute; de certification (CA) de signer
votre certificat. Pour cela, utilisez la commande suivante :

<div style="margin-left: 2em">
<pre>
# <strong>openssl req -new -key /etc/ssl/private/server.key -out /etc/ssl/private/server.csr</strong>
</pre>
</div>

<p>
Le fichier <i>server.csr</i> pourra alors &ecirc;tre communiqu&eacute;
&agrave; une autorit&eacute; de certification qui signera la cl&eacute;.
Une de ces autorit&eacute;s est <b>Thawte Certification</b> que vous
pourrez joindre &agrave; l'adresse 
<a href="http://www.thawte.com/">http://www.thawte.com/</a>. 

<p>
Si vous ne pouvez pas vous permettre un tel service, ou si vous voulez
auto signer le certificat, vous pouvez utiliser la commande suivante :

<div style="margin-left: 2em">
<pre>
# <strong>openssl x509 -req -days 365 -in /etc/ssl/private/server.csr \
       -signkey /etc/ssl/private/server.key -out /etc/ssl/server.crt</strong>
</pre>
</div>

<p> 
Avec <i>/etc/ssl/server.crt</i> et <i>/etc/ssl/private/server.key</i>,
vous devez &ecirc;tre d&eacute;sormais capable de d&eacute;marrer
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=httpd&amp;sektion=8">httpd(8)</a> 
avec le drapeau <b>-DSSL</b> (consultez la <a href=#rc">section &agrave;
propos de rc(8) dans cette faq</a>), activant ainsi les transactions
https sur le port 443 de votre machine.

<p>
<a name= "vipw"></a>
<h2>10.7 - J'ai effectu&eacute; des changements dans /etc/passwd avec
       vi(1), mais les changements ne semblent pas &ecirc;tre pris en
       compte. Pourquoi ?</h2>

<p>
Si vous &eacute;ditez <i>/etc/passwd</i>, vos modifications seront
perdues. OpenBSD g&eacute;n&egrave;re <i>/etc/passwd</i> dynamiquement
avec
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pwd_mkdb&amp;sektion=8">pwd_mkdb(8)</a>. 
Le fichier principal de mots de passe sous OpenBSD est
<i>/etc/master.passwd</i>. D'apr&egrave;s pwd_mkdb(8),

<blockquote><pre>
FILES
     /etc/master.passwd  fichier courant de mots de passe 
     /etc/passwd         fichier de mots de passe au format Version 7
     /etc/pwd.db         fichier non s&eacute;curis&eacute; de mots de passe au format base de donn&eacute;es
     /etc/pwd.db.tmp     fichier temporaire
     /etc/spwd.db        fichier s&eacute;curis&eacute; de mots de passe au format base de donn&eacute;es
     /etc/spwd.db.tmp    fichier temporaire
</pre></blockquote>

<p>
Dans un fichier de mots de passe Unix traditionnel, toutes les
informations y compris le mot de passe crypt&eacute; de l'utilisateur
sont &agrave; la disposition de n'importe quel utilisateur du
syst&egrave;me (et c'est la cible principale de programmes tels que
Crack). 4.4BSD a introduit le fichier master.passwd qui a un format
&eacute;tendu (avec les options additionnelles par rapport &agrave;
/etc/passwd). Ce fichier n'est accessible que pour root. Pour un
acc&egrave;s plus rapide aux donn&eacute;es, les appels &agrave; la
librairie qui utilisent ce type d'informations acc&egrave;dent
normalement &agrave; /etc/pwd.db et &agrave; /etc/spwd.db.

<p>
OpenBSD met &agrave; votre disposition un outil qui vous permet
d'&eacute;diter le fichier de mots de passe. Cet outil s'appelle
vipw(8). vipw utilisera vi (ou votre &eacute;diteur favori tel que
d&eacute;fini par $EDITOR) pour &eacute;diter /etc/master.passwd. Suite
&agrave; vos modifications, vipw recr&eacute;era /etc/passwd,
/etc/pwd.db, et /etc/spwd.db qui tiendront compte de vos modifications.
vipw verrouille aussi l'acc&egrave;s &agrave; ces fichiers de telle
fa&ccedil;on &agrave; en interdire l'acc&egrave;s &agrave; quiconque
essaie d'en changer le contenu en m&ecirc;me temps que vous.

<p>
<a name= "AddDelUser"></a>
<h2>10.8 - Comment je cr&eacute;e un compte utilisateur ? Ou je supprime
       un compte utilisateur ?</h2>

<p>
OpenBSD offre deux commandes pour facilement cr&eacute;er des comptes
utilisateurs sur le syst&egrave; :
<ul>
        <li><a href="#adduser">adduser(8)</a>
        <li><a href="#user">user(8)</a>
</ul>

<a name="adduser"></a> 
<p>
La mani&egrave;re la plus facile pour cr&eacute;er un compte utilisateur
sous OpenBSD est d'utiliser le script
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&amp;sektion=8">adduser(8)</a>.
Ce script est param&eacute;trable &agrave; travers le fichier
<i>/etc/adduser.conf</i>. Bien que c'est la m&eacute;thode
recommand&eacute;e pour cr&eacute;er des comptes utilisateurs, il est
toujours possible de les cr&eacute;er &agrave; la main en utilisant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw(8)</a>. 
adduser(8) permet d'effectuer des v&eacute;rifications sur la
coh&eacute;rence de <i>/etc/passwd</i>, <i>/etc/group</i>, et les bases
de donn&eacute;es shell. adduser(8) cr&eacute;e pour vous les
entr&eacute;es correspondantes et les r&eacute;pertoires $HOME. Il peut
aussi envoyer un message de bienvenue aux utilisateurs. Le comportement
de ce programme peut &ecirc;tre adapt&eacute; &agrave; vos besoins. Pour
illustrer notre propos, prenons comme exemple la cr&eacute;ation du
compte <b>testuser</b>. Le r&eacute;pertoire de cet utilisateur sera
<i>/home/testuser</i>. L'utilisateur fera partie du groupe <b>guest
</b>comme groupe et aura un shell <i>/bin/ksh </i>.

<blockquote><pre>
# <strong>adduser</strong>
Use option ``-silent'' if you don't want to see all warnings and questions.

Reading /etc/shells
Reading /etc/login.conf
Check /etc/master.passwd
Check /etc/group

Ok, let's go.
Don't worry about mistakes. I will give you the chance later to correct any input.
Enter username []: <b>testuser</b>
Enter full name []: <b>Test FAQ User</b>
Enter shell csh ksh nologin sh [sh]: <b>ksh</b>
Uid [1002]: <b><i>Enter</i></b>
Login group testuser [testuser]: <b>guest</b>
Login group is ``guest''. Invite testuser into other groups: guest no 
[no]: <b>no</b>
Login class auth-defaults auth-ftp-defaults daemon default staff 
[default]: <b><i>Enter</i></b>
Enter password []: <b><i>Type password, then Enter</i></b>
Enter password again []: <b><i>Type password, then Enter</i></b>

Name:        testuser
Password:    ****
Fullname:    Test FAQ User
Uid:         1002
Gid:         31 (guest)
Groups:      guest
Login Class: default
HOME:        /home/testuser
Shell:i      /bin/ksh
OK? (y/n) [y]: <b>y</b>
Added user ``testuser''
Copy files from /etc/skel to /home/testuser
Add another user? (y/n) [y]: <b>n</b>
Goodbye!
</pre></blockquote>

<p>
Pour supprimer des comptes utilisateurs, utilisez la commande 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rmuser&amp;sektion=8">rmuser(8)</a>. 
Cette commande supprimera toute chose relative &agrave; l'utilisateur.
Elle supprimera son entr&eacute;e
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=crontab&amp;sektion=1">crontab(1)</a>, 
son r&eacute;pertoire $HOME (s'il lui appartient), et son courrier. Bien
&eacute;videmment, cette commande supprimera aussi les entr&eacute;es
correspondantes dans <i>/etc/passwd</i> et <i>/etc/group</i>. Comme
exemple, nous allons utiliser cette commande pour supprimer le compte
utilisateur pr&eacute;c&eacute;demment cr&eacute;e. Notez que la
commande vous demande l'identifiant du compte et si oui ou non elle doit
supprimer le r&eacute;pertoire home de l'utilisateur.

<blockquote><pre>
# <strong>rmuser</strong>
Enter login name for user to remove: <strong>testuser</strong>
Matching password entry:

testuser:$2a$07$ZWnBOsbqMJ.ducQBfsTKUe3PL97Ve1AHWJ0A4uLamniLNXLeYrEie:1002
:31::0:0:Test FAQ User:/home/testuser:/bin/ksh

Is this the entry you wish to remove? <strong>y</strong>
Remove user's home directory (/home/testuser)? <strong>y</strong>
Updating password file, updating databases, done.
Updating group file: done.
Removing user's home directory (/home/testuser): done.
</pre></blockquote>

<a name="user"></a>
<h3>Cr&eacute;er des comptes utilisateurs via user(8)</h3>

<p>
Ces outils sont moins interactifs que la commande 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&amp;sektion=8">adduser(8)</a>, 
ce qui en facilite l'usage dans des scripts.

<p>
La liste compl&egrave;te des outils est :
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=group&amp;sektion=8">group(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=groupadd&amp;sektion=8">groupadd(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=groupdel&amp;sektion=8">groupdel(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=groupinfo&amp;sektion=8">groupinfo(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=groupmod&amp;sektion=8">groupmod(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=user&amp;sektion=8">user(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=useradd&amp;sektion=8">useradd(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=userdel&amp;sektion=8">userdel(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=userinfo&amp;sektion=8">userinfo(8)</a> 
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=usermod&amp;sektion=8">usermod(8)</a> 
</ul>

<h4>Cr&eacute;ation effective des comptes utilisateurs</h4>

<p>
Etant donn&eacute; que la commande user(8) n'est pas interactive, la
mani&egrave;re la plus simple et la plus efficace pour cr&eacute;er des
comptes utilisateurs est d'utiliser la commande adduser(8). La commande
<i>/usr/sbin/user</i> est seulement une interface aux autres commandes
<i>/usr/sbin/user*</i>. Ainsi, dans l'exemple qui suit il est possible
d'utiliser soit <b>user add</b> soit <b>useradd</b>. Le choix est votre
et ne change rien au r&eacute;sultat. <p>Dans cet exemple, nous allons
cr&eacute;er un compte avec les m&ecirc;mes sp&eacute;cificit&eacute;s
que le compte cr&eacute;e
<a href="#adduser">pr&eacute;c&eacute;demment</a>. useradd(8) est bien
plus facile &agrave; utiliser si vous connaissez les param&egrave;tres
par d&eacute;faut avant de cr&eacute;er un compte utilisateur. Ces
param&egrave;tres se trouvent dans le fichier <i>/etc/usermgmt.conf
</i>et peuvent &ecirc;tre visualis&eacute;s comme suit :

<blockquote><pre>
$ <strong>user add -D</strong>
group           users
base_dir        /home
skel_dir        /etc/skel
shell           /bin/csh
inactive        0
expire          Null (unset)
range           1000..60000
</pre></blockquote>

<p>
Ces param&egrave;tres vont &ecirc;tre appliqu&eacute;s &agrave; chaque
nouveau compte si vous ne changez pas leur valeur en utilisant des
options en ligne de commande. Par exemple, dans notre cas nous voulons
que l'utilisateur appartienne au groupe <b>guest </b> et non pas
&agrave; <b>users</b>. Il est &agrave; noter que lors de la
cr&eacute;ation des comptes utilisateurs, les mots de passe doivent
&ecirc;tre sp&eacute;cifi&eacute;s sous leur forme crypt&eacute;e en
ligne de commande. Vous devez donc utiliser, au pr&eacute;alable,
l'utilitaire
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=encrypt&amp;sektion=1">encrypt(1)</a> 
pour cr&eacute;er le mot de passe. Par exemple : Les mots de passe par
d&eacute;faut sous OpenBSD utilisent l'algorithme Blowfish avec 6
r&eacute;it&eacute;rations. Voici un exemple d'utilisation de la
commande encrypt :

<blockquote><pre>
$ <strong>encrypt -p -b 6</strong>
Enter string:
$2a$06$YOdOZM3.4m6MObBXjeZtBOWArqC2.uRJZXUkOghbieIvSWXVJRzlq
</pre></blockquote>

<p> 
Maintenant que nous avons le mot de passe crypt&eacute;, nous sommes
pr&ecirc;ts &agrave; cr&eacute;er le compte utilisateur :

<blockquote><pre>
# <strong>user add -p '$2a$06$YOdOZM3.4m6MObBXjeZtBOWArqC2.uRJZXUkOghbieIvSWXVJRzlq' -u 1002 \
-s /bin/ksh -c "Test FAQ User" -m -g guest testuser</strong>
</pre></blockquote>

<p>
<b>Remarque :</b> Assurez vous d'utiliser &quot; pour englober le mot de
   passe. L'utilisation de &quot;&quot; ne permet pas d'emp&ecirc;cher
   le shell d'interpr&eacute;ter le jeu de caract&egrave;res
   correspondant au mot de passe avant de les communiquer &agrave;
   user(8). De m&ecirc;me, assurez vous d'utiliser l'option <b>-m </b>si
   vous voulez cr&eacute;er le r&eacute;pertoire $HOME de l'utilisateur
   et copier les fichiers &agrave; partir de <i>/etc/skel</i> vers
   $HOME.

<p>
Pour voir si le compte utilisateur a &eacute;t&eacute; correctement
cr&eacute;e, nous pouvons recourir &agrave; plusieurs utilitaires. Voici
quelques commandes pour v&eacute;rifier rapidement que tout s'est bien
pass&eacute; :

<blockquote><pre>
$ <strong>ls -la /home</strong>
total 14
drwxr-xr-x   5 root      wheel   512 May 12 14:29 .
drwxr-xr-x  15 root      wheel   512 Apr 25 20:52 ..
drwxr-xr-x  24 ericj     wheel  2560 May 12 13:38 ericj
drwxr-xr-x   2 testuser  guest   512 May 12 14:28 testuser
$ <strong>id testuser</strong>
uid=1002(testuser) gid=31(guest) groups=31(guest)
$ <strong>finger testuser</strong>
Login: testuser                         Name: Test FAQ User
Directory: /home/testuser               Shell: /bin/ksh
Last login Sat Apr 22 16:05 (EDT) on ttyC2
No Mail.
No Plan.
</pre></blockquote>

<p>
En plus de ces commandes, user(8) fournit son propre utilitaire,
appel&eacute; userinfo(8), qui permet d'afficher les
caract&eacute;ristiques d'un compte utilisateur :

<blockquote><pre>
$ <strong>userinfo testuser</strong>
login   testuser
passwd  *
uid     1002
groups  guest
change  Wed Dec 31 19:00:00 1969
class
gecos   Test FAQ User
dir     /home/testuser
shell   /bin/ksh
expire  Wed Dec 31 19:00:00 1969
</pre></blockquote>

<h4>Suppression des comptes utilisateurs</h4>

<p>
Pour supprimer des comptes utilisateurs avec la hi&eacute;rarchie de
commandes user(8), vous devez utiliser userdel(8). Cette commande est
simple et efficace. Pour supprimer le compte pr&eacute;c&eacute;demment
cr&eacute;e, utilisez :

<blockquote><pre>
# <strong>userdel -r testuser</strong>
</pre>
</blockquote>

<p>
Notez bien l'option <b>-r</b> qui doit &ecirc;tre
sp&eacute;cifi&eacute;e si vous voulez supprimer les r&eacute;pertoires
$HOME aussi. Si vous voulez juste bloquer l'acc&egrave;s au compte sans
supprimer des informations li&eacute;es au compte, utilisez <b>-p</b> au
lieu de <b>-r</b>.

<p>
<a name= "FTPOnly"></a>
<h2>10.10 - Comment puis-je cr&eacute;er un compte pour ftp uniquement
       ?</h2>

<p>
Il y a plusieurs m&eacute;thodes pour effectuer cette op&eacute;ration.
Une des mani&egrave;res les plus communes est d'ajouter
<i>/usr/bin/false </i> dans le fichier <i>/etc/shells</i>. Et quand vous
cr&eacute;ez le compte utilisateur, attribuez lui le shell
/usr/bin/false. Il sera alors capable d'utiliser les
fonctionnalit&eacute;s ftp sans pour autant &ecirc;tre capable de se
connecter de mani&egrave;re interactive. Par d&eacute;faut,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&amp;sektion=8">adduser(8)</a> 
affecte &agrave; l'utilisateur le r&eacute;pertoire
<i>/home/&lt;user&gt;</i>. Si c'est ce que vous souhaitez, laissez-le
tel quel. Cependant, vous pouvez affecter &agrave; l'utilisateur le
r&eacute;pertoire que vous souhaitez. De m&ecirc;me, vous pouvez
confiner l'utilisateur &agrave; son r&eacute;pertoire $HOME en ajoutant
son nom &agrave; <i>/etc/ftpchroot</i>. En utilisant l'option <b>-A</b>
de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8">ftpd(8)</a>, 
seuls les comptes list&eacute;s dans ce fichier seront autoris&eacute;s
&agrave; se connecter !

<p>
<a name= "Quotas"></a>
<h2>10.11 - Mise en place des quotas</h2>

<p>
Les quotas sont utilis&eacute;s pour limiter l'espace disque disponible
pour les utilisateurs. Ce syst&egrave;me peut &ecirc;tre tr&egrave;s
utile si vous avez des ressources limit&eacute;es. Les quotas peuvent
&ecirc;tre configur&eacute;s par utilisateur et/ou par groupe.


<p>
La premi&egrave;re &eacute;tape pour configurer les quotas est de
s'assurer que <tt>option QUOTA</tt> est pr&eacute;sente dans votre <a
href="faq5.html#Options">configuration noyau</a>. Cette option est
incluse dans le noyau GENERIC. Ensuite, vous aurez besoin de marquer les
syst&egrave;mes de fichiers o&ugrave; les quotas sont utilis&eacute;s
dans le fichier

<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fstab&amp;sektion=5"><tt>/etc/fstab</tt></a>. 
Les mots cl&eacute;s <tt>userquota</tt> et <tt>groupquota</tt> doivent
&ecirc;tre utilis&eacute;s pour marquer chaque syst&egrave;me de
fichiers o&ugrave; les quotas sont activ&eacute;s. Par d&eacute;faut,
les fichiers <tt>quota.user</tt> et <tt>quota.group</tt> seront
cr&eacute;es &agrave; la racine des syst&egrave;mes de fichiers
o&ugrave; les quotas sont utilis&eacute;s pour stocker les informations
relatives &agrave; ces derniers. Si vous voulez les cr&eacute;er
ailleurs, sp&eacute;cifiez un fichier avec l'option des quotas dans
<tt>/etc/fstab</tt>, par exemple
"<tt>userquota=/var/quotas/quota.user</tt>". Voici un exemple de
<tt>/etc/fstab</tt> avec un syst&egrave;me de fichiers avec quotas
activ&eacute;s et le fichier de quotas se trouvant dans un endroit
non-standard :

<blockquote><pre>
/dev/wd0a / ffs rw,userquota=/var/quotas/quota.user 1 1
</pre></blockquote>

<p>
Maintenant, il faut configurer les quotas par utilisateur. A cette fin,
nous utilisons la commande
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=edquota&amp;sektion=8">edquota(8)</a>. 
Une utilisation simple est <strong>edquota&nbsp;&lt;user&gt;</strong>.
edquota(8) va utiliser vi(1) pour &eacute;diter les quotas &agrave;
moins que la variable d'environnement EDITOR est positionn&eacute;e pour
charger un autre &eacute;diteur. Par exemple la commande :

<blockquote><pre>
# <strong>edquota ericj</strong>
</pre></blockquote>

<p>
Affichera un r&eacute;sultat similaire &agrave; :

<blockquote><pre>
Quotas for user ericj:
/: blocks in use: 62, limits (soft = 0, hard = 0)
        inodes in use: 25, limits (soft = 0, hard = 0)
</pre></blockquote>

<p>
Pour ajouter des limites, &eacute;diter l&agrave; pour donner un
r&eacute;sultat similaire &agrave; :

<blockquote><pre>
Quotas for user ericj:
/: blocks in use: 62, limits (soft = 1000, hard = 1050)
        inodes in use: 25, limits (soft = 0, hard = 0)
</pre></blockquote>

<p>
Notez que l'allocation de quotas est en blocs de 1k. Dans ce cas-ci,
softlimit est fix&eacute; &agrave; 1000k et hardlimit &agrave; 1050k.
softlimit est une limite qui permet au syst&egrave;me de pr&eacute;venir
les utilisateurs quand ils l'ont d&eacute;pass&eacute;. Ils auront alors
jusqu'&agrave; la fin de leur p&eacute;riode de gr&acirc;ce pour
redescendre en dessous de cette limite. Les p&eacute;riodes de
gr&acirc;ce peuvent &ecirc;tre configur&eacute;es &agrave; l'aide de
l'option <b>-t </b> de edquota(8). Apr&egrave;s la fin de la
p&eacute;riode de gr&acirc;ce, softlimit est g&eacute;r&eacute; comme
hardlimit. Ce qui cause un &eacute;chec d'allocation.

<p>
Une fois les quotas configur&eacute;s, il faut les activer. Pour cela,
utilisez la commande
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=quotaon&amp;sektion=8">quotaon(8)</a>. 
Par exemple :

<blockquote><pre>
# <strong>quotaon -a</strong>
</pre></blockquote>

<p>
Cette commande analysera le contenu de <tt>/etc/fstab</tt> et activera
les quotas sur les syst&egrave;mes de fichiers o&ugrave; les options de
quota sont positionn&eacute;es. Maintenant que les quotas sont
activ&eacute;s, vous pouvez les visualiser &agrave; l'aide de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=quota&amp;sektion=1">quota(1)</a>. 
Ainsi, la commande <strong>quota &lt;user&gt;</strong> fournit les
informations concernant cet utilisateur. Si aucun argument n'est
utilis&eacute;, quota vous fournira des statistiques sur les quotas. Par
exemple :

<blockquote><pre>
# <Strong>quota ericj</strong>
</pre></blockquote>

<p>
Afficherait :

<blockquote><pre>
Disk quotas for user ericj (uid 1001): 
     Filesystem  blocks   quota   limit   grace   files   quota   limit   grace
              /      62    1000    1050              27       0       0        
</pre></blockquote>

<p>
Par d&eacute;faut, les quotas positionn&eacute;s dans
<tt>/etc/fstab</tt> seront activ&eacute;s au d&eacute;marrage. Pour les
d&eacute;sactiver, utilisez :

<blockquote><pre>
# <strong>quotaoff -a</strong>
</pre></blockquote>

<p>
<a name= "Kerberos"></a>
<h2>10.12 - Mise en place de Clients et Serveurs KerberosV</h2>

<p>
OpenBSD inclut KerberosV comme un composant pr&eacute;-install&eacute;
sur le syst&egrave;me par d&eacute;faut.

<p>
Pour plus d'information concernant KerberosV, sur votre syst&egrave;me
OpenBSD, utilisez la commande :

<pre>
  # <b>info heimdal</b>
</pre>

<p>
<a name= "AnonFTP"></a>
<h2>10.13 - Mise en place d'un serveur FTP Anonyme</h2>

<p>
Le mode FTP anonyme permet &agrave; des utilisateurs sans compte
d'acc&eacute;der aux fichiers sur votre machine en utilisant le
protocole de transfert de fichiers. Ce chapitre a pour but de fournir
une vue d'ensemble de la configuration d'un serveur FTP anonyme, les
logs g&eacute;n&eacute;r&eacute;s, ...etc.

<h3>Cr&eacute;ation du compte FTP</h3>

<p>
La premi&egrave;re &eacute;tape consiste &agrave; cr&eacute;er un compte
&quot;ftp&quot; sur votre syst&egrave;me. Ce compte ne doit pas avoir de
mot de passe utilisable. Dans cet exemple, nous allons consid&eacute;rer
que /home/ftp est le r&eacute;pertoire correspondant au compte
&quot;ftp&quot; mais vous n'&ecirc;tes pas oblig&eacute; de choisir la
m&ecirc;me chose. Quand le mode anonyme est utilis&eacute;, le
d&eacute;mon ftp va se confiner au r&eacute;pertoire HOME de
l'utilisateur 'ftp' (dans notre cas, ce r&eacute;pertoire est
/home/ftp). Pour en savoir plus, lisez les pages du manuel
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8">ftp(8)</a> 
et 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=chroot&amp;sektion=2">chroot(2)</a>. 
Voici un exemple de cr&eacute;ation du compte <i>ftp</i> en utilisant la
commande
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=adduser&amp;sektion=8">adduser(8)</a>. 
Au pr&eacute;alable, nous avons besoin d'ajouter /usr/bin/false au
fichier <i>/etc/shells</i>. C'est le shell que nous allons attribuer
&agrave; l'utilisateur ftp. Il ne permettra pas de connexion en login
&agrave; ce compte m&ecirc;me si nous configurons un mot de passe vide.
Pour effectuer cette op&eacute;ration, il suffit de faire <i>echo
/usr/bin/false &gt;&gt; /etc/shells</i>. Si en plus vous souhaitez que
ce shell apparaisse dans la liste des choix propos&eacute;s par adduser,
vous devez modifier le fichier <i>/etc/adduser.conf</i>.

<blockquote><pre>
# <strong>adduser</strong>
Use option ``-silent'' if you don't want to see all warnings and questions.

Reading /etc/shells
Reading /etc/login.conf
Check /etc/master.passwd
Check /etc/group

Ok, let's go.
Don't worry about mistakes. I will give you the chance later to correct any input.
Enter username []: <b>ftp</b>
Enter full name []: <b>anonymous ftp</b>
Enter shell csh false ksh nologin sh tcsh zsh [sh]: <b>false</b>
Uid [1002]: <b><i>Enter</i></b>
Login group ftp [ftp]: <b><i>Enter</i></b>
Login group is ``ftp''. Invite ftp into other groups: guest no 
[no]: <b>no</b>
Login class auth-defaults auth-ftp-defaults daemon default staff 
[default]: <b><i>Enter</i></b>
Enter password []: <b><i>Enter</i></b>
Set the password so that user cannot logon? (y/n) [n]: <b>y</b>

Name:        ftp
Password:    ****
Fullname:    anonymous ftp
Uid:         1002
Gid:         1002 (ftp)
Groups:      ftp
Login Class: default
HOME:        /home/ftp
Shell:       /usr/bin/false
OK? (y/n) [y]: <b>y</b>
Added user ``ftp''
Copy files from /etc/skel to /home/ftp
Add another user? (y/n) [y]: <b>n</b>
Goodbye!
</pre></blockquote>

<h3>Configuration du r&eacute;pertoire</h3>

<p>
L'op&eacute;ration a cr&eacute;e, en plus de l'utilisateur, le
r&eacute;pertoire <i>/home/ftp</i>. C'est ce que nous voulons mais nous
avons besoin d'effectuer quelques modifications pour pr&eacute;parer le
syst&egrave;me &agrave; h&eacute;berger le service FTP anonyme. Ces
modifications sont expliqu&eacute;es dans la page du manuel
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8">ftp(8)</a>. 

<p>
<b>Vous n'avez pas besoin</b> de cr&eacute;er un r&eacute;pertoire
   /home/ftp/usr ou /home/ftp/bin.

<ul>
<li><i>/home/ftp</i> - C'est le r&eacute;pertoire principal. Il doit &ecirc;tre 
    poss&eacute;d&eacute; par root avec les permissions 555.
<li><i>/home/ftp/etc</i> - Ce r&eacute;pertoire est optionnel et non
        recommand&eacute;. Son seul but est de fournir des informations
        sur les comptes utilisateurs existant. Si vous voulez que les
        fichiers de votre r&eacute;pertoire de ftp soient
        associ&eacute;s &agrave; de vrais utilisateurs, vous devez
        copier /etc/pwd.db et /etc/group dans ce r&eacute;pertoire. Les
        permissions du r&eacute;pertoire doivent &ecirc;tre 511. Les
        permissions sur les deux fichiers doivent &ecirc;tre 444. Ils
        sont utilis&eacute;s pour fournir une correspondance entre des
        nombres et les noms attribu&eacute;s aux comptes utilisateurs et
        groupes. Il n'y a pas de mots de passe dans pwd.db. Tous les
        mots de passe sont stock&eacute;s dans spwd.db alors ne copiez
        pas ce fichier.
<li><i>/home/ftp/pub</i> - C'est le r&eacute;pertoire standard pour
        mettre les fichiers que vous voulez partagez. Ce
        r&eacute;pertoire doit avoir les permissions 555. 
</ul>

<p>
Il est &agrave; noter que tous ces r&eacute;pertoires doivent &ecirc;tre
la propri&eacute;t&eacute; de &quot;root&quot;. Voici &agrave; quoi
doivent ressembler les r&eacute;pertoires apr&egrave;s leur
cr&eacute;ation :

<blockquote><pre>
# pwd 
/home
# ls -laR ftp
total 5
dr-xr-xr-x  5 root  ftp    512 Jul  6 11:33 .
drwxr-xr-x  7 root  wheel  512 Jul  6 10:58 ..
dr-x--x--x  2 root  ftp    512 Jul  6 11:34 etc
dr-xr-xr-x  2 root  ftp    512 Jul  6 11:33 pub

ftp/etc:
total 43
dr-x--x--x  2 root  ftp    512 Jul  6 11:34 .
dr-xr-xr-x  5 root  ftp    512 Jul  6 11:33 ..
-r--r--r--  1 root  ftp    316 Jul  6 11:34 group
-r--r--r--  1 root  ftp  40960 Jul  6 11:34 pwd.db

ftp/pub:
total 2
dr-xr-xr-x  2 root  ftp  512 Jul  6 11:33 .
dr-xr-xr-x  5 root  ftp  512 Jul  6 11:33 ..
</pre></blockquote>

<h3>D&eacute;marrage du serveur et logs</h3>

<p>
Vous pouvez choisir d'ex&eacute;cuter ftpd soit &agrave; partir de inetd
soit directement de le lancer directement via les scripts rc. L'exemple
ci-apr&egrave;s repr&eacute;sente le cas o&ugrave; le service est
d&eacute;marr&eacute; &agrave; partir de
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/etc/inetd.conf">inetd.conf</a>. 
Tout d'abord, nous devons nous familiariser avec quelques options de
ftpd. La ligne par d&eacute;faut dans <i>/etc/inetd.conf</i> est :

<blockquote><pre>
<strong>ftp             stream  tcp     nowait  root    /usr/libexec/ftpd       ftpd -US</strong>
</pre></blockquote>

<p>
Comme vous pouvez le voir, ftpd est invoqu&eacute; avec <i>-US</i>. Ces
options vont permettre de loguer les connexions anonymes dans
<i>/var/log/ftpd </i>et les sessions courantes dans
<i>/var/run/utmp</i>. Ce qui permet de voir ces sessions via who(1).
Dans certains cas, on souhaitera fournir un acc&egrave;s anonyme et
d&eacute;sactiver ftp pour les utilisateurs du syst&egrave;me. Pour
cela, il faut utiliser l'option <i>-A </i>de ftpd. Voici une ligne
d'invocation de ftpd en mode anonyme exclusif. On utilise aussi
<i>-ll</i> qui logue chaque connexion vers syslog en plus des commandes
ftp get, retrieve, etc. 

<blockquote><pre> 
<strong>
ftp stream tcp nowait root /usr/libexec/tcpd ftpd -llUSA
</strong> 
</pre></blockquote>

<p> 
Remarque - Les personnes g&eacute;rant des serveurs ftp &agrave; HAUT
trafic ne devraient pas invoquer ftpd &agrave; partir de inetd.conf. La
meilleure option consiste &agrave; commenter la ligne correspondant
&agrave; ftpd dans /etc/inetd.conf et &agrave; d&eacute;marrer ftpd
&agrave; partir de rc.conf avec l'option <i>-D</i>. Ce qui va
d&eacute;marrer ftpd en tant que d&eacute;mon. Ce mode de fonctionnement
est beaucoup moins co&ucirc;teux et plus rapide que le d&eacute;marrage
via inetd. La ligne correspondant &agrave; ftpd dans rc.conf
ressemblerait &agrave; :

<blockquote><pre>
ftpd_flags="-DllUSA"           # for non-inetd use: ftpd_flags="-D"
</pre></blockquote>

<p>
Bien &eacute;videmment, cette m&eacute;thode ne fonctionnera que si ftpd
est comment&eacute; dans <i>/etc/inetd.conf</i> et en veillant qu'inetd
ait bien relu sont fichier de configuration.

<h3>Autres fichiers importants </h3>

<ul>
<li><i>/etc/ftpwelcome</i> - Ce fichier contient le message de bienvenue
        qui sera affich&eacute; aux personnes qui se connectent sur
        votre serveur ftp.
<li><i>/etc/motd</i> - Ce fichier contient le message qui sera
        affich&eacute; aux utilisateurs une fois authentifi&eacute;s sur
        votre serveur ftp.
<li><i>.message</i> - Ce fichier peut &ecirc;tre mis dans n'importe quel
        r&eacute;pertoire. Il contient un message qui sera
        affich&eacute; lorsque l'utilisateur entre dans le
        r&eacute;pertoire o&ugrave; ce fichier se trouve.
</ul>

<p>
<a name= "ftpchroot"></a>
<h2>10.13 - Confiner les utilisateurs &agrave; leur r&eacute;pertoire
       HOME avec ftpd(8)</h2>

<p>
le d&eacute;mon 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ftpd&amp;sektion=8">ftpd(8)</a> 
livr&eacute; avec OpenBSD est configur&eacute; par d&eacute;faut pour
g&eacute;rer cela de mani&egrave;re tr&egrave;s facile. Cette action est
accomplie par le biais du fichier <b>/etc/ftpchroot</b>. Puisqu'on ne
peut pas toujours faire confiance aux utilisateurs, il sera
peut-&ecirc;tre n&eacute;cessaire de les confiner &agrave; leur
r&eacute;pertoire HOME. Ce mode de fonctionnement n'est pas
activ&eacute; par d&eacute;faut. Voici &agrave; quoi ressemble le mode
par d&eacute;faut :

<blockquote><pre>
$ <strong>ftp localhost</strong>
Connected to localhost.
220 oshibana FTP server (Version 6.4/OpenBSD) ready.
Name (localhost:ericj): <strong>ericj</strong>
331 Password required for ericj.
Password: <strong>*********</strong>
230- OpenBSD 3.4 (GENERIC) #18: Wed Sep 17 03:34:47 MDT 2003
230- 
230- Welcome to OpenBSD: The proactively secure Unix-like operating system.
230- 
230- Please use the sendbug(1) utility to report bugs in the system.
230- Before reporting a bug, please try to reproduce it with the latest
230- version of the code.  With bug reports, please try to ensure that
230- enough information to reproduce the problem is enclosed, and if a
230- known fix for it exists, include that as well.
230- 
230 User ericj logged in.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp&gt; <strong>cd /</strong>
250 CWD command successful.
ftp&gt; <strong>ls</strong>
227 Entering Passive Mode (127,0,0,1,60,7)
150 Opening ASCII mode data connection for 'file list'.
altroot
bin
dev
etc
home
mnt
root
sbin
stand
tmp
usr
var
bsd
sys
boot
226 Transfer complete.
ftp&gt; <strong>quit</strong>
221 Goodbye.
</pre></blockquote>

<p>
Comme vous pouvez le voir, l'acc&egrave;s est permis &agrave; tout le
serveur. Dans un monde parfait o&ugrave; on peut faire confiance aux
utilisateurs, il n'y a pas de mal &agrave; &ccedil;a mais c'est loin
d'&ecirc;tre le cas dans la r&eacute;alit&eacute;. Pour confiner un
utilisateur &agrave; son r&eacute;pertoire HOME, il suffit simplement
d'ajouter son nom au fichier <b>/etc/ftpchroot</b>. Voici un exemple
pour montrer cette restriction appliqu&eacute;e &agrave; l'utilisateur
&quot;ericj&quot; :

<blockquote><pre>
$ <strong>cat /etc/ftpchroot</strong>
#       $OpenBSD: faq10.html,v 1.15 2004/03/02 13:50:41 jufi Exp $
#
# list of users (one per line) given ftp access to a chrooted area.
# read by ftpd(8).
ericj
</pre></blockquote>

<p>
Cette op&eacute;ration est suffisante pour emp&ecirc;cher l'utilisateur
&quot;ericj&quot; de sortir de son propre r&eacute;pertoire comme vous
pouvez le voir &agrave; travers l'exemple suivant. Le r&eacute;pertoire
/ correspond maintenant &agrave; son r&eacute;pertoire HOME !

<blockquote><pre>
$ <strong>ftp localhost</strong>
Connected to localhost.
220 oshibana FTP server (Version 6.4/OpenBSD) ready.
Name (localhost:ericj): <strong>ericj</strong>
331 Password required for ericj.
Password: <strong>*********</strong>
230 User ericj logged in.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp&gt; <strong>cd /</strong>
250 CWD command successful.
ftp&gt; <strong>ls</strong>
227 Entering Passive Mode (127,0,0,1,92,171)
150 Opening ASCII mode data connection for 'file list'.
.login
.mailrc
.profile
.rhosts
.ssh
.cshrc
work
mail
src
226 Transfer complete.
ftp&gt; <strong>quit</strong>
221 Goodbye.
</pre></blockquote>

<p>
<a name= "Patches"></a>
<h2>10.15 - Appliquer des correctifs sous OpenBSD</h2>

<p>
Le code source de OpenBSD est en constante &eacute;volution et
am&eacute;lioration. En m&ecirc;me temps, des correctifs aux
probl&egrave;mes les plus communs sont cr&eacute;es et diffus&eacute;s
au public. Ces correctifs apparaissent sur la
<a href="../../fr/errata.html">page web des errata</a>.
Ils sont s&eacute;par&eacute;s en cat&eacute;gories. Ces
cat&eacute;gories correspondent &agrave; des correctifs qui concernent
diff&eacute;rentes architectures ou &agrave; des correctifs
ind&eacute;pendants de l'architecture.

<p>
Cependant, il est &agrave; noter qu'il n'y a pas de correctifs pour les
nouvelles fonctionnalit&eacute;s ajout&eacute;es &agrave; OpenBSD. Les
correctifs corrigent uniquement des probl&eacute;mes de stabilit&eacute;
ou de s&eacute;curit&eacute; qui doivent &ecirc;tre r&eacute;gl&eacute;s
tr&egrave;s rapidement, bien que le choix final revienne &agrave;
l'administrateur.

<p> 
Comme exemple, nous allons appliquer un correctif de
s&eacute;curit&eacute; obtenu &agrave; partir de la
<a href="../../fr/errata.html">page web des errata</a> &agrave;
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=talkd&amp;sektion=8">talkd(8)</a>.

<h3>Quelle est la diff&eacute;rence entre ces correctifs et ce qui se
    trouve dans l'arborescence CVS ? </h3>

<p>
Tous les correctifs post&eacute;s sur la
<a href="../../fr/errata.html">page web des errata</a>
concernent uniquement l'arborescence des sources de la derni&egrave;re
version diffus&eacute;e. Les autres correctifs qui concernent
l'arborescence actuelle de CVS peuvent contenir certaines modifications
qui ne sont peut-&ecirc;tre pas d&eacute;sirables sur la version de
production.

<h3>Pr&eacute;parer le syst&egrave;me pour l'application des
    correctifs</h3>

<p>
Les correctifs d'OpenBSD sont distribu&eacute;s sous la forme de
fichiers diff. Ces fichiers sont des fichiers texte qui contiennent les
diff&eacute;rences par rapport au code source d'origine. Ils ne sont
<b>PAS </b> distribu&eacute;s sous forme binaire. Cela veut dire que
pour appliquer les correctifs, vous devez avoir &agrave; disposition sur
votre syst&egrave;me le code source de la version <b>RELEASE
</b>d'OpenBSD. Cela ne veut pas dire que vous avez besoin de tout le
code source du syst&egrave;me d'exploitation OpenBSD pour appliquer les
correctifs &agrave; votre syst&egrave;me. Mais vous devez avoir le code
source correspondant au composant &agrave; corriger. Par exemple, si
vous corrigez le noyau vous devez avoir tout le code source au noyau.

<p>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1">cvs(1)</a> 
est un outil tr&egrave;s pratique pour t&eacute;l&eacute;charger
uniquement les sources dont vous avez besoin en utilisant des serveurs
cvs anonymes situ&eacute;s un peu partout dans le monde. Vous pouvez
avoir une liste des serveurs disponibles &agrave; l'adresse suivante
:<br>
<a href="http://www.openbsd.org/fr/anoncvs.html">http://www.openbsd.org/anoncvs.html</a>. 

<p>
Pour t&eacute;l&eacute;charger le code source de talkd(8) correspondant &agrave; la version 
  <i>3.4-release</i> via <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1">cvs(1)</a>, 
  vous utiliseriez les lignes de commande suivantes : 
<div style="margin-left: 2em">
<pre>
$ <b>export CVSROOT=anoncvs@anoncvs5.usa.openbsd.org:/cvs</b>
$ <b>cvs co -rOPENBSD_3_4_BASE src/libexec/talkd/</b>
cvs server: Updating src/libexec/talkd
U src/libexec/talkd/announce.c
U src/libexec/talkd/talkd.c
U src/libexec/talkd/talkd.h
</pre>
</div>

<p>Pour conna&icirc;tre le chemin CVS du code dont vous avez besoin, reportez-vous 
  &agrave; la ligne <i>Index:</i>. Dans notre cas, le chemin CVS est <i>src/libexec/talkd/</i>. 
  Il faut toujours v&eacute;rifier la r&eacute;vision de OPENBSD_version_number_BASE. 
  Sans &quot;_BASE&quot;, vous obtiendrez le code correspondant &agrave; la branche 
  stable qui contient probablement d'autres modifications qui peuvent interf&eacute;rer 
  avec la proc&eacute;dure d'application des correctifs. Si vous synchroniser 
  vos sources par rapport &agrave; la branche stable, les correctifs sont normalement 
  d&eacute;j&agrave; inclus dans le code source. Cependant, nous vous conseillons 
  de toujours effectuer une v&eacute;rification. Vous pouvez voir sur <a href="../../plus.html">http://www.openbsd.org/plus.html</a> 
  les correctifs qui ont &eacute;t&eacute; appliqu&eacute;s &agrave; la branche 
  stable. Si les correctifs n'ont pas encore &eacute;t&eacute; appliqu&eacute;s, 
  vous devez t&eacute;l&eacute;charger les sources de la derni&egrave;re RELEASE 
  en utilisant les commandes pr&eacute;c&eacute;dentes.
<p>Pour les utilisateurs ayant achet&eacute; des CDs OpenBSD officiels, vous pouvez 
  obtenir le code source directement &agrave; partir du CD. Reportez vous &agrave; 
  l'encart livr&eacute; avec votre CD. Vous n'aurez &agrave; ce moment-l&agrave; 
  besoin d'obtenir les sources via anoncvs. 
<blockquote>
<pre>
Apply by doing:
        cd /usr/src
        patch -p0 &lt; 026_talkd.patch
        cd libexec/talkd
        make obj &amp;&amp; make depend &amp;&amp; make &amp;&amp; make install

Index: libexec/talkd/announce.c <b>&lt;------ Chemin CVS</b>
===================================================================
RCS file: /cvs/src/libexec/talkd/announce.c,v
retrieving revision 1.8
retrieving revision 1.9
diff -u -r1.8 -r1.9
--- libexec/talkd/announce.c    1998/08/18 03:42:10     1.8
+++ libexec/talkd/announce.c    2000/07/06 00:01:45     1.9
@@ -160,6 +160,6 @@
                *(bptr++) = '\n';
        }
        *bptr = '\0';
-       fprintf(tf, big_buf);
+       fprintf(tf, "%s", big_buf);
        fflush(tf);
 }
</pre>
</blockquote>

<p>Une fois que vous avez obtenu les sources, vous pouvez t&eacute;l&eacute;charger 
  le correctif que vous mettrez sous <i>src/</i>
<h3>Application des correctifs </h3>

<p>
<div style="margin-left: 2em">
<pre>
$ <b>cd /usr/src</b>
$ <b>patch -p0&lt;/path/to/026_talkd.patch</b>
Hmm...  Looks like a unified diff to me...
The text leading up to this was:
--------------------------
|Apply by doing:
|       cd /usr/src
|       patch -p0 &lt; 026_talkd.patch
|       cd libexec/talkd
|       make obj &amp;&amp; make depend &amp;&amp; make &amp;&amp; make install
|
|Index: libexec/talkd/announce.c
|===================================================================
|RCS file: /cvs/src/libexec/talkd/announce.c,v
|retrieving revision 1.8
|retrieving revision 1.9
|diff -u -r1.8 -r1.9
|--- libexec/talkd/announce.c   1998/08/18 03:42:10     1.8
|+++ libexec/talkd/announce.c   2000/07/06 00:01:45     1.9
--------------------------
Patching file libexec/talkd/announce.c using Plan A...
Hunk #1 succeeded at 160. <b>&lt;------------ Patch Succeeded</b>
done
$ <b>cd /usr/src/libexec/talkd/</b>
$ <b>ls</b>
CVS             announce.c      print.c         table.c         talkd.c
Makefile        announce.c.orig process.c       talkd.8         talkd.h
$ <b>make obj &amp;&amp; make depend &amp;&amp; make</b>
making /home/ericj/lsrc/src/libexec/talkd/obj
mkdep -a /home/ericj/lsrc/src/libexec/talkd/talkd.c /home/ericj/lsrc/sr
c/libexec/talkd/announce.c /home/ericj/lsrc/src/libexec/talkd/process.c
/home/ericj/lsrc/src/libexec/talkd/table.c /home/ericj/lsrc/src/libexec
/talkd/print.c
cc -O2     -c /home/ericj/lsrc/src/libexec/talkd/talkd.c
cc -O2     -c /home/ericj/lsrc/src/libexec/talkd/announce.c
cc -O2     -c /home/ericj/lsrc/src/libexec/talkd/process.c
cc -O2     -c /home/ericj/lsrc/src/libexec/talkd/table.c
cc -O2     -c /home/ericj/lsrc/src/libexec/talkd/print.c
cc   -o ntalkd talkd.o announce.o process.o table.o print.o
nroff -Tascii -mandoc /home/ericj/lsrc/src/libexec/talkd/talkd.8 &gt; talk
d.cat8
$ <b>sudo make install</b>
install -c -s -o root -g bin  -m 555 ntalkd /usr/libexec
install -c -o root -g bin -m 444 talkd.cat8 /usr/share/man/cat8/talkd.0
/usr/share/man/cat8/ntalkd.0 -&gt; /usr/share/man/cat8/talkd.0
</pre>
</div>

<p>
Une fois cette op&eacute;ration effectu&eacute;e, red&eacute;marrez le
service.


<a name="httpdchroot"></a>
<h2>10.16 - Parlez moi de chroot() Apache ?</h2>

Sous OpenBSD, le serveur 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=httpd&amp;sektion=8">httpd(8)</a>
d'Apache est 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=chroot&amp;sektion=2">chroot(2)</a>&eacute;
par d&eacute;faut. Etant un grand pas en avant du point de vue de la
s&eacute;curit&eacute;, cela peut cr&eacute;er des probl&egrave; si vous
n'y &ecirc;tes pas pr&eacute;par&eacute;.

<h3>Qu'est-ce qu'un chroot ?</h3>

Une application 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=chroot&amp;sektion=2">chroot(2)</a>&eacute;e
est bloqu&eacute;e dans un r&eacute;pertoire sp&eacute;cifique et ne
peut errer dans les autres r&eacute;pertoires de l'arbre du
syst&egrave;me de fichiers et voit ce r&eacute;pertoire comme sont
r&eacute;pertoire <tt>/</tt> (root). Dans le cas d'httpd(8), le
programme d&eacute;marre, ouvre ses fichiers log, ouvre ses ports TCP
(bien qu'il n'accepte pas encore de donn&eacute;es), et lis sont fichier
de configuration. Ensuite, il se fixe lui-m&ecirc;me dans le
r&eacute;pertoire <i>/var/www</i> et baisse ses privil&egrave;ges. Ce
qui veut dire que tous les fichiers servis et utilis&eacute;s par
Apache, doivent &ecirc;tre dans le r&eacute;pertoire <i>/var/www</i>.
Cela aide consid&eacute;rablement la s&eacute;curit&eacute; -- si il
devait y avoir un probl&egrave;me de s&eacute;curit&eacute;, les
d&eacute;gats seraient confin&eacute;s dans un seul r&eacute;pertoire
avec les permissions de "lecture seule" et aucune ressource pour causer
des probl&egrave;mes.

<h3>Qu'est-ce que cela signifie pour l'utilisateur ?</h3>
En gros, chroot(2)er Apache est quelque chose de nouveau, et donc
beaucoup d'applications et de configurations syst&egrave;me ne
fonctionneront plus comme avant.

<ul>
<li><b>Hi&eacute;rarchie historique du syst&egrave;me de fichiers :</b>
       Les serveurs mis &agrave; jour depuis d'anciennes versions
       d'OpenBSD peuvent avoir les fichiers web situ&eacute;s dans les
       r&eacute;pertoires HOME des utilisateurs, ce qui clairement ne
       fonctionnera pas dans un environnement chroot(2)&eacute;
       &eacute;tant donn&eacute; qu'httpd(8) ne peut atteindre le
       r&eacute;pertoire <i>/home</i>. Les administrateurs
       d&eacute;couvriront peut-&ecirc;tre que leur partition /var/www
       existente est trop petite pour accueillir tous les fichiers web.
       Vos options sont d&egrave;s lors de restructurer votre
       syst&egrave;me ou de ne pas utiliser l'option du chroot(2). Vous
       pouvez, bien evidemment, utiliser des liens symboliques dans le
       r&eacute;pertoire HOME de l'utilisateur pointant vers les
       sous-r&eacute;pertoires dans <i>/var/www</i>, mais vous ne pouvez
       PAS utiliser des liens dans <i>/var/www</i> pointant vers une
       autre partie du syst&egrave;me de fichier -- ceci ne peut
       fonctionner d&ucirc; au chroot(2). Notez que si vous voulez que
       vos utilisateurs aient un <a
       href="faq10.html#ftpchroot">acc&egrave;s FTP
       chroot(2)&eacute;</a>, ceci ne fonctionnera pas plus &eacute;tant
       donn&eacute; que le chroot FTP va (&agrave; nouveau) vous
       emp&ecirc;cher d'acc&eacute;der aux destinations de ces liens
       symboliques. Une solution est donc, de ne pas utiliser
       <i>/home</i> comme r&eacute;pertoire HOME pour ces utilisateurs
       mais plutot quelque chose similaire &agrave;
       <i>/var/www/home</i>.


<li><b>Rotation des fichiers log :</b> Normalement, une rotation des
       fichiers log est r&eacute;alis&eacute;e en renommant les anciens
       fichiers, ensuite en envoyant &agrave; httpd(8) un signal SIGUSR1
       qui forcera Apache &agrave; fermer ses anciens fichiers logs et
       &agrave; en ouvrir de nouveaux. Ceci n'est d&eacute;sormais plus
       possible, &eacute;tant donn&eacute; qu'httpd(8) n'a plus la
       possibilit&eacute; d'ouvrir ses propres fichiers log une fois que
       ses privil&egrave;ges ont baiss&eacute;s. httpd(8) doit donc
       &ecirc;tre stopp&eacute; et relanc&eacute; :

<pre>
   # <b>apachectl stop && apachectl start</b>
</pre> 

Il existe n&eacute;anmoins d'autres techniques, notamment logguer 
vers un 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pipe&amp;sektion=2">pipe(2)</a>, 
et utiliser un programme ext&eacute;rieur afin de r&eacute;aliser une
rotation des fichiers &agrave; la fin du pipe.

<li><b>Modules Apache existant :</b> Pratiquement, ils se lanceront
       tous, cependant, certains pourraient ne pas fonctionner
       correctement dans le chroot(2), et pourraient causer des
       probl&egrave;mes lors de "<tt>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=apachectl&amp;sektion=8">apachectl</a> 
        restart"</tt>, g&eacute;n&eacute;rant une erreur, causant
        httpd(8) &agrave; se stopper.

<li><b>CGIs existant :</b> La plupart ne fonctionneront pas tels quels.
       Ils auront certainement besoin de programmes ou de librairies se
       trouvant hors de <i>/var/www</i>. Certains peuvent &ecirc;tre
       corrig&eacute;s en &eacute;tant compil&eacute;s statiquement
       (n'ayant pas besoin de librairies se trouvant dans un autre
       r&eacute;pertoire), la plupart peuvent &ecirc;tre corrig&eacute;s
       en copiant dans <i>/var/www</i> les fichiers n&eacute;cessaires
       &agrave; l'application, bien que cette manoeuvre soit non
       triviale et requiert certaines notions de programmation -- la
       plupart des utilisateurs trouveront plus facile de ne pas
       employer le chroot(2) en attendant une mise &agrave; jour de ces
       CGIs.
</ul>

Dans certains cas, les applications ou les configurations peuvent
&ecirc;tre chang&eacute;es pour fonctionner dans le chroot. Dans 
d'autres cas, vous devrez tout simplement retirer cette option 
en utilisant l'option <tt>u</tt> d'Apache dans <i>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.conf&amp;sektion=8">rc.conf</a></i>

<a name="rootshell"></a>
<h2>10.17 - Je n'aime pas le shell root standard !</h2>
Le shell par d&eacute;faut sur OpenBSD de l'utilisateur 
<i>root</i> est 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=csh&amp;sektion=1">csh</a>,
d&ucirc; principalement &agrave; la tradition. Il n'est pas
sp&eacute;cialement requis qu'OpenBSD ait csh(1) comme shell pour
l'utilisateur root (lisez n&eacute;anmoins avant de le changer).

<p>
Certains utilisateurs venant d'un syst&egrave;me d'exploitation
"Unix-like" trouvent csh(1) peu familier et demande d&egrave;s lors si
ils peuvent le changer et comment. Il y a plusieurs options :

<ul>
<li><b>Ne vous authentifiez pas directement en tant que <i>root</i></b> Entre
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=su&amp;sektion=1">su</a> 
et
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sudo&amp;sektion=8">sudo</a>, 
il ne devrait y avoir que peu de raisons pour que les utilisateurs
s'authentifient en tant que <i>root</i> pour la plupart des applications
apr&egrave;s l'installation initiale.
<li><b>Invoquez votre shell favori apr&egrave;s le login :</b> Si vous
       aimez ksh(1) ou n'importe quel autre shell, invoquez le
       simplement depuis votre shell par d&eacute;faut.
<li><b>Changez le shell de l'utilisateur root :</b> Ceci peut &ecirc;tre
       fait en utilisant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=chsh&amp;sektion=1">chsh</a>
ou
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw</a>.
</ul>

Une directive Unix traditionelle est d'utiliser pour l'utilisateur root
des shells compil&eacute;s statiquement, car si votre syst&egrave;me
d&eacute;marre en mode utilisateur unique, les partitions non-root ne
seront pas mont&eacute;es et les shells li&eacute;s dynamiquement ne
seront pas capable d'acc&eacute;der aux librairies situ&eacute;es dans
la partition <tt>/usr</tt>. Ceci n'&eacute;tant pas tr&egrave;s
important pour OpenBSD, car le syst&egrave;me vous demandera de choisir
un shell lors d'un d&eacute;marrage en mode utilisateur unique, le shell
par d&eacute;faut &eacute;tant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sh&amp;sektion=1">sh</a>.

Les trois shells standards sous OpenBSD 
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=csh&amp;sektion=1">csh</a>,
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sh&amp;sektion=1">sh</a>
et
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ksh&amp;sektion=1">ksh</a>)
sont li&eacute;s statiquement et donc utilisables en mode utilisateur
unique.

<p>
Il est parfois dit qu'il ne faut pas changer le shell de l'utilisateur
root, bien qu'il n'y ait aucune raison de ne pas le faire sous OpenBSD.
Mais encore une fois, ceci ne devrait pas &ecirc;tre une raison -- ne
vous authentifiez pas directement en tant que root.

<a name="ksh"></a>
<h2>10.18 - Que puis-je faire d'autre avec <i>ksh</i> ?</h2>
Sous OpenBSD,  
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ksh&amp;sektion=1">ksh</a>
est 
<a href="http://web.cs.mun.ca/~michael/pdksh/">pdksh</a>, 
le Shell Korn du Domaine Public (Public Domain Korn Shell), et est le
m&ecirc;me binaire que
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sh&amp;sektion=1">sh</a>.

<p>
Les utilisateurs qui sont &agrave; l'aise avec <i>bash</i>, souvent
utilis&eacute; sur les syst&egrave;mes Linux, trouveront probablement
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ksh&amp;sektion=1">ksh</a> 
tr&egrave;s familier. Ksh(1) offre la plupart des options habituellement
utilis&eacute;es avec <i>bash</i>, notamment l'ach&egrave;vement des
commandes avec la touche tab, l'&eacute;dition de la ligne de commande
et l'historique via les touches fl&egrave;ch&eacute;es, et CTRL-A/CTRL-E
pour aller au d&eacute;but/&agrave; la fin de la ligne de commande. Si
vous d&eacute;sirez d'autres options de <i>bash</i>, <i>bash</i> peut
&ecirc;tre install&eacute; soit via les <a
href="faq8.html#Ports">ports</a> ou soit via les <a
href="faq8.html#Packages">packages</a>.

<p>
Le prompt de <i>ksh</i> peut &ecirc;tre facilement chang&eacute; de
mani&egrave;re &agrave; fournir plus d'informations que le simple "$ "
par d&eacute;faut en modifiant la variable <tt>PS1</tt>. Par exemple, en
ins&eacute;rant la ligne suivante :

<pre>
   export PS1='$PWD $ '
</pre>
 
dans votre <tt>/etc/profile</tt>, cela produira le prompt suivant :

<pre>
   /home/nick $
</pre>

Consultez le fichier 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/~checkout~/src/etc/ksh.kshrc?content-type=text/plain"><tt>/etc/ksh.kshrc</tt></a>,
qui inclut plusieurs options utiles ainsi que des exemples, et qui peut
&ecirc;tre invoqu&eacute; dans les fichiers <tt>.profile</tt> de vos
utilisateurs.

<p>
<font color= "#0000e0">
<a href= "index.html">[Index de la FAQ]</a> 
<a href= "../faq9.html">[Section 9 - Migrer depuis Linux]</a>
<a href= "faq11.html">[Section 11 - Optimisation des Performances]</a>
</font>

<p>
<hr>
<p><a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt="[back]"></a> 
  <a href="mailto:www@openbsd.org">www@openbsd.org</a> <br>
<small>
Originally [OpenBSD: faq10.html,v 1.97 ]<br>
$Translation: faq10.html,v 1.20 2004/03/02 05:30:43 saad Exp $<br>
$OpenBSD: faq10.html,v 1.15 2004/03/02 13:50:41 jufi Exp $
</small>
</body>
</html>
