<html>
<head>
<title>1 - Introduction &agrave; OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content= "document">
<meta name="description"   content= "the OpenBSD FAQ page">
<meta name="keywords"      content= "openbsd,faq">
<meta name="distribution"  content= "global">
<meta name="copyright"     content= "This document copyright 1998-2003 by
OpenBSD."> 
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href="faq2.html">[Section 2 - Autres Ressources d'Information
OpenBSD]</a>
</font>

<h1><font color="#e00000">1 - Introduction &agrave; OpenBSD</font></h1>
<hr>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
<li><a href="#WhatIs" >1.1 - Qu'est-ce qu'OpenBSD ?</a>
<li><a href="#Platforms" >1.2 - Sur quels syst&egrave;mes OpenBSD
    fonctionne-t-il ?</a>
<li><a href="#ReallyFree" >1.3 - Est-ce qu'OpenBSD est vraiment libre
    ?</a>
<li><a href="#WhyUse" >1.4 - Pourquoi est-ce que j'utiliserais OpenBSD
    ?</a>
<li><a href="#Support" >1.5 - Comment puis-je aider OpenBSD ?</a>
<li><a href="#WhoMaintains" >1.6 - Qui maintient OpenBSD ?</a>
<li><a href="#Next">1.7 - La prochaine version d'OpenBSD est
    pr&eacute;vue pour quand ?</a>
</ul>
<hr>

<p>
<a name="WhatIs"></a>
<a name="1.1"></a>
<h2>1.1 - Qu'est-ce qu'OpenBSD ?</h2>

<p>
Le projet OpenBSD fournit un syst&egrave;me d'exploitation de type UNIX
<b>LIBRE</b>, multi plates-formes et bas&eacute; sur 4.4BSD. Nos <a
href="../../goals.html">objectifs</a> concernent principalement
l'exactitude, la <a
href="../../security.html">s&eacute;curit&eacute;</a>, la
standardisation et la <a href="../../fr/plat.html"> portabilit&eacute;.
<a href="../../fr/index.html">OpenBSD</a> supporte l'&eacute;mulation
des binaires SVR4 (Solaris), FreeBSD, Linux, BSD/OS, SunOS et HP-UX.

<p>
<a name="Platforms"></a>
<a name="1.2"></a>
<h2>1.2 - Sur quels syst&egrave;mes OpenBSD fonctionne-t-il ?</h2>
<!-- XXXrelease -->
<p> 
OpenBSD 3.3 tourne sur les plates-formes suivantes : 
</a>
<ul>
   <li> <a href="../../fr/plat.html"></a><a href=
        "../../fr/i386.html">i386</a> - CD bootable
  <li><a href="../../sparc.html">sparc</a> - CD bootable
  <li><a href="../../sparc64.html">sparc64</a> - CD bootable
  <li><a href="../../fr/hp300.html">hp300</a> - FTP uniquement
  <li><a href="../../fr/mac68k.html">mac68k</a> - FTP uniquement
  <li><a href="../../fr/macppc.html">macppc</a> - CD bootable
  <li><a href="../../fr/mvme68k.html">mvme68k</a> - FTP uniquement
  <li><a href="../../fr/alpha.html">alpha</a> - FTP uniquement
  <li><a href="../../fr/vax.html">vax</a>
  <li><a href="../../fr/hppa.html">hppa</a> - FTP uniquement <i>*
      Nouveau pour 3.3 *</i> 
</ul>

<p> 

<i>bootable</i> indique qu'OpenBSD d&eacute;marrera directement depuis
le CD. Le CD d&eacute;marre sur plusieurs types de plates-formes. Voir
<a href="../faq3.html">le chapitre 3</a> de cette FAQ pour les
d&eacute;tails quant &agrave; l'obtention d'OpenBSD sur CD.

<p>
Les versions pr&eacute;c&eacute;dentes d'OpenBSD supportaient aussi :
<ul>
  <li><a href="../../fr/amiga.html">amiga</a> - supprim&eacute; apr&egrave;s la
      version 3.2
  <li><a href="../../fr/sun3.html">sun3</a> - supprim&eacute;
      apr&egrave;s la version 2.9
  <li><a href="../../fr/arc.html">arc</a> - supprim&eacute; apr&egrave;s
      la version 2.3
  <li><a href="../../fr/mvme88k.html">mvme88k</a>
  <li><a href="../../fr/pmax.html">pmax</a>
</ul>

<p> 
A l'heure actuelle, OpenBSD ne supporte pas plus d'un processeur.
Consultez <a href="../faq8.html#SMP"> FAQ 8, SMP</a> pour plus
d'informations. 
<br>

<p>
<a name="ReallyFree"></a>
<a name="1.3"></a>
<h2>1.3 - Est-ce qu'OpenBSD est vraiment libre ?</h2>

<p>
OpenBSD est totalement libre. Les binaires sont libres, le source est
libre. Toutes les parties d'OpenBSD ont des copyright raisonnables
permettant la libre redistribution. Cela comprend la possibilit&eacute;
de REUTILISER la plupart des sources d'OpenBSD, pour un usage personnel
comme pour un usage commercial. OpenBSD ne poss&egrave;de pas de
restrictions autres que celles sp&eacute;cifi&eacute;es dans la licence
BSD originelle. Les logiciels qui sont &eacute;crits avec une licence
restrictive ne peuvent pas &ecirc;tre inclus dans la distribution
standard d'OpenBSD. Ceci dans le but de sauvegarder l'usage libre
d'OpenBSD. Par exemple, OpenBSD peut &ecirc;tre utilis&eacute; librement
pour un usage personnel, pour un usage &eacute;ducatif, par des
institutions gouvernementales, par des associations &agrave; but non
lucratif et par des organisations commerciales. </p>

<p>
Pour plus d'informations sur les autres licences, veuillez lire : <a
href="../../policy.html">http://www.openbsd.org/policy.html</a>.

<p>
Les d&eacute;veloppeurs du projet OpenBSD supportent celui-ci
principalement gr&acirc;ce &agrave; leurs revenus. Ceci inclut le temps
d&eacute;pens&eacute; en programmation pour le projet, le
mat&eacute;riel utilis&eacute;, les ressources r&eacute;seaux
utilis&eacute;es pour que vous puissiez obtenir OpenBSD et le temps
d&eacute;pens&eacute; &agrave; r&eacute;pondre aux questions et &agrave;
corriger les bugs trouv&eacute;s par les utilisateurs. Les
d&eacute;veloppeurs OpenBSD ne sont pas forc&eacute;ment riches et
m&ecirc;me de petites contributions de temps, de mat&eacute;riel ou
autres peuvent faire de grosses diff&eacute;rences.

<br>

<p>
<a name="WhyUse"></a> 
<a name="1.4"></a> 
<h2>1.4 - Pourquoi est-ce que j'utiliserai OpenBSD ?</h2>

<p>
Les nouveaux utilisateurs veulent souvent savoir si OpenBSD est
sup&eacute;rieur &agrave; d'autres UNIX libres. Il est quasiment
impossible de r&eacute;pondre &agrave; cette question qui est sujette
&agrave; de nombreux et inutiles d&eacute;bats "religieux". Ne jamais,
en aucune circonstance, poser cette question sur une des listes de
discussion OpenBSD. 

<p>
Ci-dessous, vous trouverez les raisons qui nous font penser qu'OpenBSD
est un syst&egrave;me utile. Maintenant, vous seul pouvez
r&eacute;pondre &agrave; la question qui est de savoir s'il est utile
pour vous. </p>

<p>
<ul>
    <li>OpenBSD tourne sur de <a href="../../fr/plat.html">nombreuses
        plates-formes mat&eacute;rielles.</a>
    <li>OpenBSD est consid&eacute;r&eacute; par de nombreux
        professionnels de la s&eacute;curit&eacute; comme &eacute;tant
        le syst&egrave;me de type UNIX le plus <a
        href="../../security.html">s&ucirc;r</a> qui soit. Ceci est du
        au fait que le code source a &eacute;t&eacute; audit&eacute; par
        une dizaine de personnes pendant un an et demi.
    <li>OpenBSD est un syst&egrave;me UNIX complet disponible
        gratuitement avec les sources.
    <li>OpenBSD int&egrave;gre les derniers outils en mati&egrave;re de
        s&eacute;curit&eacute; pour construire des pare-feux et des <a
        href="../../fr/crypto.html#hardware">r&eacute;seaux
        priv&eacute;s virtuels</a> dans un environnement
        distribu&eacute;.
    <li>OpenBSD b&eacute;n&eacute;ficie d'un d&eacute;veloppement fort
        et continu dans de nombreux domaines, donnant la
        possibilit&eacute; de travailler sur des technologies
        &eacute;mergentes avec une communaut&eacute; internationale de
        programmeurs et d'utilisateurs.
    <li>OpenBSD offre la possibilit&eacute; aux utilisateurs de
        participer aux tests et au d&eacute;veloppement de ce produit.
        </ul>

<p>
<a name="Support"></a>
<a name="1.5"></a>
<h2>1.5 - Comment puis-je aider OpenBSD ?</h2>

<p>
<a href="../../fr/donations.html">http://www.openbsd.org/fr/donations.h-
tml</a> ont contribu&eacute; au projet OpenBSD. Elles sont cit&eacute;es
dans la <a href="../../fr/donations.html">page des dons</a>

<p>
OpenBSD a constamment besoin de plusieurs types de support de la part
des utilisateurs. Si vous trouvez OpenBSD utile, nous vous invitons
&agrave; trouver un moyen de contribuer. Si aucuns de ceux
propos&eacute;s ci-dessous ne vous convient, vous pouvez toujours en
proposer d'autres en envoyant un courrier &eacute;l&eacute;ctronique
&agrave; : <a
href="mailto:donations@openbsd.org">donations@openbsd.org</a>

<p>
<ul>
  <li><a href="../../orders.html">Acheter un jeu de CD OpenBSD</a>. Il
      comprend la version actuelle d'OpenBSD, et est bootable sur
      plusieurs plates-formes. Il permet aussi de financer le projet
      OpenBSD et permet d'&eacute;viter la consommation de bande
      passante lors d'un t&eacute;l&eacute;chargement &agrave; travers
      l'Internet. Ce jeu de trois CD peu on&eacute;reux incluent la
      totalit&eacute; du code source. Rappelez vous que vos amis doivent
      avoir leurs propres CD !
  <li><a href="../../fr/donations.html">Financer le projet</a>. Le
      projet a toujours besoin d'argent pour payer l'&eacute;quipement,
      l'&eacute;quipement r&eacute;seau et la publication du CD. Presser
      des CD demande un investissement aux d&eacute;veloppeurs OpenBSD
      qu'ils ne sont pas toujours assur&eacute;s de
      r&eacute;cup&eacute;rer. Envoyer un courrier &eacute;lectronique
      &agrave; <a
      href="mailto:donations@openbsd.org">donations@openbsd.org</a> pour
      savoir comment contribuer. M&ecirc;me les petits dons font de
      grandes diff&eacute;rences.
  <li><a href="../../want.html">Donner des &eacute;quipements</a>. Le
      projet a toujours besoin de mat&eacute;riel, qu'il soit
      sp&eacute;cifique ou g&eacute;n&eacute;ral. Des articles tels que
      les disques IDE ou SCSI et les barrettes de m&eacute;moire RAM
      sont toujours les bienvenus. Pour d'autres types de
      mat&eacute;riels tels que les syst&egrave;mes complets ou les
      cartes m&egrave;res, il est pr&eacute;f&eacute;rable de se
      renseigner au pr&eacute;alable. Écrivez &agrave; <a href=
      "mailto:donations@openbsd.org">donations@openbsd.org</a> pour
      l'envoi.
  <li>Faites don de votre temps et de vos comp&eacute;tences. Les
      programmeurs qui aiment &eacute;crire des syst&egrave;mes
      d'exploitation sont bien entendu les bienvenus mais il existe bien
      d'autres fa&ccedil;ons d'&ecirc;tre utile. Suivez <a
      href="../../fr/mail.html">les listes de discussion </a> et aidez
      &agrave; r&eacute;pondre aux questions des nouveaux utilisateurs.
  <li>Aidez &agrave; maintenir la documentation &agrave; jour en
      soumettant de nouvelles rubriques pour la FAQ (&agrave; <a href=
      "mailto:faq@openbsd.org">faq@openbsd.org</a>). Cr&eacute;ez un <a
      href="../../groups.html">groupe</a> d'utilisateurs local et faites
      d&eacute;couvrir OpenBSD &agrave; vos amis. Insistez pour utiliser
      OpenBSD au travail. Si vous &ecirc;tes &eacute;tudiant, parler
      d'utiliser OpenBSD &agrave; vos professeurs en tant qu'outil
      d'apprentissage pour les cours d'informatique ou de sciences de
      l'ing&eacute;nieur. Il est aussi important de mentionner l'une des
      fa&ccedil;ons de ne pas "aider" le projet OpenBSD : ne perdez pas
      votre temps en guerres de religion inter syst&egrave;mes
      d'exploitation. Cela n'aide en rien le projet &agrave; trouver de
      nouveaux utilisateurs et nuit aux liens que les
      d&eacute;veloppeurs auront li&eacute;s avec des
      d&eacute;veloppeurs d'autres projets. 
</ul>

<p>
<a name="WhoMaintains"></a>
<a name="1.6"></a>
<h2>1.6 - Qui maintient OpenBSD ?</h2>

<p>
OpenBSD est maintenu par une &eacute;quipe de d&eacute;veloppement
diss&eacute;min&eacute;e &agrave; travers de nombreux <a
href="../../images/map.jpg">pays</a>. Le projet est coordonn&eacute; par
Theo de Raadt bas&eacute; au Canada.

<p>
<a name="Next"></a>
<h2>1.7 - La prochaine version d'OpenBSD est pr&eacute;vue pour quand
      ?</h2>

L'&eacute;quipe de d&eacute;veloppement OpenBSD cr&eacute;e une nouvelle
version tous les six mois, avec des dates de mise &agrave;
disponibilit&eacute; fix&eacute;es au 1er Mai et au 1er Novembre. Vous
pourrez obtenir plus d'informations concernant le cycle de
d&eacute;veloppement <a href="../faq5.html#Flavors">ici</a>.

<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href="faq2.html">[Section 2 - Autres Ressources d'Information
OpenBSD]</a> </font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[retour]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: faq1.html,v 1.47 ]<br>
$Translation: faq1.html,v 1.22 2003/05/04 20:56:02 saad Exp $<br>
$OpenBSD: faq1.html,v 1.13 2003/05/05 09:37:40 jufi Exp $ 
</small> 

</body>
</html> 
