<html>
<head>
<title>1 - Introduction &agrave; OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name="resource-type" content= "document">
<meta name="description"   content= "the OpenBSD FAQ page">
<meta name="keywords"      content= "openbsd,faq">
<meta name="distribution"  content= "global">
<meta name="copyright"     content= "This document copyright 1998-2004 by
OpenBSD."> 
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href="faq2.html">[Section 2 - Autres Ressources d'Information
OpenBSD]</a>
</font>

<h1><font color="#e00000">1 - Introduction &agrave; OpenBSD</font></h1>
<hr>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
<li><a href="#WhatIs" >1.1 - Qu'est-ce qu'OpenBSD ?</a>
<li><a href="#Platforms" >1.2 - Sur quels syst&egrave;mes OpenBSD
    fonctionne-t-il ?</a>
<li><a href="#ReallyFree" >1.3 - Est-ce qu'OpenBSD est vraiment libre
    ?</a>
<li><a href="#WhyUse" >1.4 - Pourquoi est-ce que j'utiliserais OpenBSD
    ?</a>
<li><a href="#Support" >1.5 - Comment puis-je aider OpenBSD ?</a>
<li><a href="#WhoMaintains" >1.6 - Qui maintient OpenBSD ?</a>
<li><a href="#Next">1.7 - La prochaine version d'OpenBSD est
    pr&eacute;vue pour quand ?</a>
<li><a href="#Included">1.8 - Quels logiciels sont inclus avec OpenBSD
    ?</a>
<li><a href="#WhatsNew">1.9 - Quoi de neuf dans OpenBSD 3.4 ?</a>

</ul>
<hr>

<p>
<a name="WhatIs"></a>
<h2>1.1 - Qu'est-ce qu'OpenBSD ?</h2>

<p>
Le projet OpenBSD fournit un syst&egrave;me d'exploitation de type UNIX
<b>LIBRE</b>, multi plates-formes et bas&eacute; sur 4.4BSD. Nos <a
href="../../goals.html">objectifs</a> concernent principalement
l'exactitude, la <a
href="../../security.html">s&eacute;curit&eacute;</a>, la
standardisation et la <a href="../../fr/plat.html"> portabilit&eacute;.
<a href="../../fr/index.html">OpenBSD</a> supporte l'&eacute;mulation
des binaires SVR4 (Solaris), FreeBSD, Linux, BSD/OS, SunOS et HP-UX.

<!-- XXXrelease -->
<p>
Cette FAQ couvre sp&eacute;cifiquement la version la plus r&eacute;cente d'OpenBSD, la
version 3.4.

<p>
<a name="Platforms"></a>
<h2>1.2 - Sur quels syst&egrave;mes OpenBSD fonctionne-t-il ?</h2>
<!-- XXXrelease -->
<p> 
OpenBSD 3.4 tourne sur les plates-formes suivantes : 
</a>
<ul>
   <li> <a href="../../fr/plat.html"></a><a href=
        "../../fr/i386.html">i386</a> - CD bootable
  <li><a href="../../sparc.html">sparc</a> - CD bootable
  <li><a href="../../sparc64.html">sparc64</a> - CD bootable
  <li><a href="../../fr/hp300.html">hp300</a> - FTP uniquement
  <li><a href="../../fr/mac68k.html">mac68k</a> - FTP uniquement
  <li><a href="../../fr/macppc.html">macppc</a> - CD bootable
  <li><a href="../../fr/mvme68k.html">mvme68k</a> - FTP uniquement
  <li><a href="../../fr/mvme88k.html">mvme88k</a> - Experimental, FTP
      uniquement
  <li><a href="../../fr/alpha.html">alpha</a> - FTP uniquement
  <li><a href="../../fr/vax.html">vax</a>
  <li><a href="../../fr/hppa.html">hppa</a> - FTP uniquement
</ul>

<p> 

<i>bootable</i> indique qu'OpenBSD d&eacute;marrera directement depuis
le CD. Le CD d&eacute;marre sur plusieurs types de plates-formes. Voir
<a href="../faq3.html">le chapitre 3</a> de cette FAQ pour les
d&eacute;tails quant &agrave; l'obtention d'OpenBSD sur CD.

<p>
Les versions pr&eacute;c&eacute;dentes d'OpenBSD supportaient aussi :
<ul>
  <li><a href="../../fr/amiga.html">amiga</a> - supprim&eacute; apr&egrave;s la
      version 3.2
  <li><a href="../../fr/sun3.html">sun3</a> - supprim&eacute;
      apr&egrave;s la version 2.9
  <li><a href="../../fr/arc.html">arc</a> - supprim&eacute; apr&egrave;s
      la version 2.3
  <li><a href="../../fr/pmax.html">pmax</a> - supprim&eacute;
      apr&egrave;s la version 2.7
</ul>

<p> 
A l'heure actuelle, OpenBSD ne supporte pas plus d'un processeur.
Consultez <a href="../faq8.html#SMP"> FAQ 8, SMP</a> pour plus
d'informations. 
<br>

<p>
<a name="ReallyFree"></a>
<h2>1.3 - Est-ce qu'OpenBSD est vraiment libre ?</h2>

<p>
OpenBSD est totalement libre. Les binaires sont libres, le source est
libre. Toutes les parties d'OpenBSD ont des copyright raisonnables
permettant la libre redistribution. Cela comprend la possibilit&eacute;
de REUTILISER la plupart des sources d'OpenBSD, pour un usage personnel
comme pour un usage commercial. OpenBSD ne poss&egrave;de pas de
restrictions autres que celles sp&eacute;cifi&eacute;es dans la licence
BSD originelle. Les logiciels qui sont &eacute;crits avec une licence
restrictive ne peuvent pas &ecirc;tre inclus dans la distribution
standard d'OpenBSD. Ceci dans le but de sauvegarder l'usage libre
d'OpenBSD. Par exemple, OpenBSD peut &ecirc;tre utilis&eacute; librement
pour un usage personnel, pour un usage &eacute;ducatif, par des
institutions gouvernementales, par des associations &agrave; but non
lucratif et par des organisations commerciales. </p>

<p>
Pour plus d'informations sur les autres licences, veuillez lire : <a
href="../../policy.html">http://www.openbsd.org/policy.html</a>.

<p>
Les d&eacute;veloppeurs du projet OpenBSD supportent celui-ci
principalement gr&acirc;ce &agrave; leurs revenus. Ceci inclut le temps
d&eacute;pens&eacute; en programmation pour le projet, le
mat&eacute;riel utilis&eacute;, les ressources r&eacute;seaux
utilis&eacute;es pour que vous puissiez obtenir OpenBSD et le temps
d&eacute;pens&eacute; &agrave; r&eacute;pondre aux questions et &agrave;
corriger les bugs trouv&eacute;s par les utilisateurs. Les
d&eacute;veloppeurs OpenBSD ne sont pas forc&eacute;ment riches et
m&ecirc;me de petites contributions de temps, de mat&eacute;riel ou
autres peuvent faire de grosses diff&eacute;rences.

<br>

<p>
<a name="WhyUse"></a> 
<h2>1.4 - Pourquoi est-ce que j'utiliserai OpenBSD ?</h2>

<p>
Les nouveaux utilisateurs veulent souvent savoir si OpenBSD est
sup&eacute;rieur &agrave; d'autres UNIX libres. Il est quasiment
impossible de r&eacute;pondre &agrave; cette question qui est sujette
&agrave; de nombreux et inutiles d&eacute;bats "religieux". Ne jamais,
en aucune circonstance, poser cette question sur une des listes de
discussion OpenBSD. 

<p>
Ci-dessous, vous trouverez les raisons qui nous font penser qu'OpenBSD
est un syst&egrave;me utile. Maintenant, vous seul pouvez
r&eacute;pondre &agrave; la question qui est de savoir s'il est utile
pour vous. </p>

<p>
<ul>
    <li>OpenBSD tourne sur de <a href="../../fr/plat.html">nombreuses
        plates-formes mat&eacute;rielles.</a>
    <li>OpenBSD est consid&eacute;r&eacute; par de nombreux
        professionnels de la s&eacute;curit&eacute; comme &eacute;tant
        le syst&egrave;me de type UNIX le plus <a
        href="../../security.html">s&ucirc;r</a> qui soit. Ceci est du
        au fait que le code source a &eacute;t&eacute; audit&eacute; par
        une dizaine de personnes pendant un an et demi.
    <li>OpenBSD est un syst&egrave;me UNIX complet disponible
        gratuitement avec les sources.
    <li>OpenBSD int&egrave;gre les derniers outils en mati&egrave;re de
        s&eacute;curit&eacute; pour construire des pare-feux et des <a
        href="../../fr/crypto.html#hardware">r&eacute;seaux
        priv&eacute;s virtuels</a> dans un environnement
        distribu&eacute;.
    <li>OpenBSD b&eacute;n&eacute;ficie d'un d&eacute;veloppement fort
        et continu dans de nombreux domaines, donnant la
        possibilit&eacute; de travailler sur des technologies
        &eacute;mergentes avec une communaut&eacute; internationale de
        programmeurs et d'utilisateurs.
    <li>OpenBSD offre la possibilit&eacute; aux utilisateurs de
        participer aux tests et au d&eacute;veloppement de ce produit.
        </ul>

<p>
<a name="Support"></a>
<h2>1.5 - Comment puis-je aider OpenBSD ?</h2>

<p>
<a href="../../fr/donations.html">http://www.openbsd.org/fr/donations.h-
tml</a> ont contribu&eacute; au projet OpenBSD. Elles sont cit&eacute;es
dans la <a href="../../fr/donations.html">page des dons</a>

<p>
OpenBSD a constamment besoin de plusieurs types de support de la part
des utilisateurs. Si vous trouvez OpenBSD utile, nous vous invitons
&agrave; trouver un moyen de contribuer. Si aucuns de ceux
propos&eacute;s ci-dessous ne vous convient, vous pouvez toujours en
proposer d'autres en envoyant un courrier &eacute;l&eacute;ctronique
&agrave; : <a
href="mailto:donations@openbsd.org">donations@openbsd.org</a>.

<p>
<ul>
  <li><a href="../../orders.html">Acheter un jeu de CD OpenBSD</a>. Il
      comprend la version actuelle d'OpenBSD, et est bootable sur
      plusieurs plates-formes. Il permet aussi de financer le projet
      OpenBSD et permet d'&eacute;viter la consommation de bande
      passante lors d'un t&eacute;l&eacute;chargement &agrave; travers
      l'Internet. Ce jeu de trois CD peu on&eacute;reux incluent la
      totalit&eacute; du code source. Rappelez vous que vos amis doivent
      avoir leurs propres CD !
  <li><a href="../../fr/donations.html">Financer le projet</a>. Le
      projet a toujours besoin d'argent pour payer l'&eacute;quipement,
      l'&eacute;quipement r&eacute;seau et la publication du CD. Presser
      des CD demande un investissement aux d&eacute;veloppeurs OpenBSD
      qu'ils ne sont pas toujours assur&eacute;s de
      r&eacute;cup&eacute;rer. Envoyer un courrier &eacute;lectronique
      &agrave; <a
      href="mailto:donations@openbsd.org">donations@openbsd.org</a> pour
      savoir comment contribuer. M&ecirc;me les petits dons font de
      grandes diff&eacute;rences.
  <li><a href="../../want.html">Donner des &eacute;quipements</a>. Le
      projet a toujours besoin de mat&eacute;riel, qu'il soit
      sp&eacute;cifique ou g&eacute;n&eacute;ral. Des articles tels que
      les disques IDE ou SCSI et les barrettes de m&eacute;moire RAM
      sont toujours les bienvenus. Pour d'autres types de
      mat&eacute;riels tels que les syst&egrave;mes complets ou les
      cartes m&egrave;res, il est pr&eacute;f&eacute;rable de se
      renseigner au pr&eacute;alable. Écrivez &agrave; <a href=
      "mailto:donations@openbsd.org">donations@openbsd.org</a> pour
      l'envoi.
  <li>Faites don de votre temps et de vos comp&eacute;tences. Les
      programmeurs qui aiment &eacute;crire des syst&egrave;mes
      d'exploitation sont bien entendu les bienvenus mais il existe bien
      d'autres fa&ccedil;ons d'&ecirc;tre utile. Suivez <a
      href="../../fr/mail.html">les listes de discussion </a> et aidez
      &agrave; r&eacute;pondre aux questions des nouveaux utilisateurs.
  <li>Aidez &agrave; maintenir la documentation &agrave; jour en
      soumettant de nouvelles rubriques pour la FAQ (&agrave; <a href=
      "mailto:faq@openbsd.org">faq@openbsd.org</a>). Cr&eacute;ez un <a
      href="../../groups.html">groupe</a> d'utilisateurs local et faites
      d&eacute;couvrir OpenBSD &agrave; vos amis. Insistez pour utiliser
      OpenBSD au travail. Si vous &ecirc;tes &eacute;tudiant, parler
      d'utiliser OpenBSD &agrave; vos professeurs en tant qu'outil
      d'apprentissage pour les cours d'informatique ou de sciences de
      l'ing&eacute;nieur. Il est aussi important de mentionner l'une des
      fa&ccedil;ons de ne pas "aider" le projet OpenBSD : ne perdez pas
      votre temps en guerres de religion inter syst&egrave;mes
      d'exploitation. Cela n'aide en rien le projet &agrave; trouver de
      nouveaux utilisateurs et nuit aux liens que les
      d&eacute;veloppeurs auront li&eacute;s avec des
      d&eacute;veloppeurs d'autres projets. 
</ul>

<p>
<a name="WhoMaintains"></a>
<h2>1.6 - Qui maintient OpenBSD ?</h2>

<p>
OpenBSD est maintenu par une &eacute;quipe de d&eacute;veloppement
diss&eacute;min&eacute;e &agrave; travers de nombreux <a
href="../../images/map.jpg">pays</a>. Le projet est coordonn&eacute; par
Theo de Raadt bas&eacute; au Canada.

<p>
<a name="Next"></a>
<h2>1.7 - La prochaine version d'OpenBSD est pr&eacute;vue pour quand
      ?</h2>

L'&eacute;quipe de d&eacute;veloppement OpenBSD cr&eacute;e une nouvelle
version tous les six mois, avec des dates de mise &agrave;
disponibilit&eacute; fix&eacute;es au 1er Mai et au 1er Novembre. Vous
pourrez obtenir plus d'informations concernant le cycle de
d&eacute;veloppement <a href="faq5.html#Flavors">ici</a>.

<a name="Included"></a>
<h2>1.8 - Quels logiciels sont inclus avec OpenBSD ?</h2>
OpenBSD est distribu&eacute; avec un certain nombre d'applications
tierces telles que :

<ul>
<li><a href="http://www.xfree.org">XFree86 4.3.0</a> l'environnement X
    Window. Les serveurs v3.3 sont aussi inclus pour la plate-forme i386
    pour le support de chipsets graphiques additionnels. Install&eacute;
    par les <a href="faq4.html#FilesNeeded">ensembles d'installation</a>
    <tt>x*.tgz</tt>.

<li><a href="http://gcc.gnu.org/">GCC 2.95.3</a> Compilateur GNU C.
    L'&eacute;quipe OpenBSD a ajout&eacute; la technologie de protection
    de la pile <a
    href="http://www.trl.ibm.com/projects/security/ssp">Propolice</a>,
    activ&eacute;e par d&eacute;faut et utilis&eacute;e par toutes les
    applications int&eacute;gr&eacute;es au syst&egrave;me
    d'exploitation ainsi que sur les applications compil&eacute;es sur
    OpenBSD. Fait partie de <a href="faq4.html#FilesNeeded">l'ensemble
    d'installation</a> <tt>comp34.tgz</tt>.

<li><a href="http://www.perl.com/">Perl 5.8.0</a>, avec des correctifs
    et des am&eacute;liorations cr&eacute;es par l'&eacute;quipe
    OpenBSD.

<li>Le serveur web <a href="http://www.apache.org/">Apache 1.3.28</a>.
    L'&eacute;quipe OpenBSD a ajout&eacute; le <a
    href="faq10.html#httpdchroot">confinement chroot par d&eacute;faut
    </a>, la r&eacute;vocation de privil&egrave;ges, et d'autres
    am&eacute;liorations s&eacute;curit&eacute;. mod_ssl 2.8 et DSO sont
    aussi inclus.

<li><a href="http://www.openssl.org">OpenSSL 0.9.7b</a>, avec des
    correctifs et des am&eacute;liorations de la part de l'&eacute;quipe
    OpenBSD

<li>Le processeur de texte <a
href="http://www.gnu.org/software/groff/groff.html">Groff 1.15</a>.

<li>Le serveur <a href="http://www.sendmail.org/">Sendmail 8.12.9</a>
avec le correctif s&eacute;curit&eacute; parse8.359.2.8.

<li>Le serveur DNS <a href="http://www.isc.org/products/BIND/">BIND
    9.2.2</a>. OpenBSD a impl&eacute;ment&eacute; plusieurs
    am&eacute;liorations au processus de confinement chroot ainsi que
    d'autres am&eacute;lioration s&eacute;curit&eacute;.

<li>Le navigateur web en mode texte <a href="http://lynx.isc.org/">Lynx
    2.8.4rel.1</a>. Sont inclus le support HTTPS et des correctifs
    cr&eacute;es par l'&eacute;quipe OpenBSD.

<li><a href="http://www.courtesan.com/sudo/">Sudo v1.6.7p5</a>, permettant
    aux utilisateurs d'ex&eacute;cuter des commandes individuelles avec
    les privil&egrave;ges root.

<li><a href="http://www.gnu.org/software/ncurses/ncurses.html">Ncurses
    5.2.</a>

<li>IPv6 <a href="http://www.kame.net/">KAME</a>.

<li>Heimdal 0.6rc1 avec correctifs
<li><a href="http://www.openssh.com">OpenSSH 3.7.1</a>

</ul>

Comme on peut le constater, l'&eacute;quipe OpenBSD ajoute souvent des
correctifs aux applications tierces (typiquement) pour am&eacute;liorer
la s&eacute;curit&eacute; ou la qualit&eacute; du code. Dans certains
cas, l'utilisateur ne verra aucune diff&eacute;rence dans le
fonctionnement. Tandis que dans d'autres cas, il existe des
diff&eacute;rences op&eacute;rationnelles qui peuvent impacter certains
utilisateurs. Gardez ces am&eacute;liorations en t&ecirc;te avant
d'ajouter des versions diff&eacute;rentes du m&ecirc;me logiciel de
mani&egrave;re aveugle.

<p>
Bien entendu, des applications suppl&eacute;mentaires peuvent &ecirc;tre
ajout&eacute;es avec le syst&egrave;me des <a
href="faq8.html#Packages">packages</a> et des <a
href="faq8.html#Ports">ports</a>.
<p>

<a name="WhatsNew"></a>
<h2>1.9 - Quoi de neuf dans OpenBSD 3.4 ?</h2>
La liste compl&egrave;te des changements apport&eacute;s &agrave;
OpenBSD 3.3 pour cr&eacute;er OpenBSD 3.4 se trouve <a
href="../../plus34.html">ici</a>, cependant voici quelques changements
que l'&eacute;quipe de d&eacute;veloppement OpenBSD juge importants
&agrave; signaler aux personnes qui vont faire des mises &agrave; jour
ou des installations d'OpenBSD 3.4 et qui sont famili&egrave;res des
versions ant&eacute;rieures :

<ul>
<li><b>La plate-forme i386 est maintenant en ELF.</b>
Le format de fichier ex&eacute;cutable
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=elf&amp;sektion=5">ELF</a>
offre une plus grande flexibilit&eacute; au niveau de l'agencement
m&eacute;moire par rapport &agrave; l'ancien format
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=a.out&amp;sektion=5">a.out</a>.
Le format ELF &eacute;tait requis pour notre impl&eacute;mentation W^X
pour i386. (W^X est un agencement de permissions m&eacute;moire fines,
permettant de s'assurer que la m&eacute;moire pouvant &ecirc;tre
&eacute;crite par des programmes applicatifs ne peut &ecirc;tre
ex&eacute;cutable au m&ecirc;me moment et vice versa. Ceci met la barre
haute pour l'exploitation de d&eacute;bordements tampon et d'autres
attaques : l'attaquant ne peut plus &eacute;crire du code en
m&eacute;moire dans des endroits o&ugrave; il peut &ecirc;tre
ex&eacute;cut&eacute;.) La mise &agrave; jour en utilisant les sources
n'est pas une option.

Les mises &agrave; jour binaires sont possibles mais tr&egrave;s
difficiles. Elles n&eacute;cessitent de d&eacute;sinstaller tous les <a
href="../faq8.html">packages</a> avant la mise &agrave; jour et de les
r&eacute;installer apr&egrave;s mise &agrave; jour. Il existe plusieurs
probl&egrave;mes potentiels &agrave; ce niveau, l'&eacute;quipe de
d&eacute;veloppement OpenBSD recommande HAUTEMENT la
r&eacute;installation compl&egrave;te de votre syst&egrave;me. Il est
&agrave; noter que
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_aout&amp;sektion=8">
l'&eacute;mulation binaire a.out</a> est fournie par sysctl aux
applications binaires (uniquement) qui le n&eacute;cessitent.
Si vous effectuez une mise &agrave; jour, vous aurez tr&egrave;s
certainement besoin d'activer cette option.

<li><b>Les &eacute;mulations binaires sont d&eacute;sactiv&eacute;es par
       d&eacute;faut.</b>
Cette d&eacute;cision a &eacute;t&eacute; prise pour rendre plus
difficile l'ex&eacute;cution d'un programme malicieux &eacute;crit pour
une autre plate-forme OpenBSD. Ceci emp&ecirc;chera plusieurs <a
href="../faq8.html#Ports">ports</a> de fonctionner correctement
jusqu'&agrave; ce que l'&eacute;mulation soit activ&eacute;e si
n&eacute;cessaire en utilisant des

<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8">sysctl</a>s.
Le noyau standard GENERIC comporte ces options. Elles sont juste
d&eacute;sactiv&eacute;es. Aucune recompilation de noyau n'est
n&eacute;cessaire. Pour plus d'informations, veuillez consulter <a
href="faq9.html#Interact">Cet article</a>.
Si vous effectuez une mise &agrave; jour, vous aurez s&ucirc;rement
besoin d'activer
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_aout&amp;sektion=8">compat_aout</a>.

<li><b>L'authentification Kerberos IV a &eacute;t&eacute; supprim&eacute;e.</b>
Si vous optez pour une mise &agrave; jour plut&ocirc;t qu'une
r&eacute;installation, vous devrez supprimer toute
r&eacute;f&eacute;rence &agrave; krb4 dans <tt>/etc/login.conf</tt>
<i>avant</i> d'effectuer la mise &agrave; jour, sinon vous pouvez avoir
des difficult&eacute;s pour vous connecter &agrave; une machine i386 en
mode multi-utilisateur. Si vous avez d&eacute;j&agrave; mis &agrave;
jour votre syst&egrave;me et vous rencontrez ce probl&egrave;me, vous
pouvez vous connecter et corriger ce probl&egrave;me en suivant les
instructions explicit&eacute;es <a href="../faq4.html#krb4">ici</a>. La
suppression des anciens modules krb4 de <tt>/usr/libexec/auth</tt> est
conseill&eacute;e.

</ul>

<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href="faq2.html">[Section 2 - Autres Ressources d'Information
OpenBSD]</a> </font>

<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../../images/back.gif" border="0" alt="[retour]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: faq1.html,v 1.55 ]<br>
$Translation: faq1.html,v 1.32 2004/01/02 22:19:02 saad Exp $<br>
$OpenBSD: faq1.html,v 1.20 2004/01/03 19:44:34 jufi Exp $ 
</small> 

</body>
</html> 
