<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>12 - Questions Sp&eacute;cifiques Aux Plates-Formes</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 2003-2004 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000">

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href= "faq11.html">[Section 11 - Optimisation des Performances]</a>
<a href= "../faq14.html">[Section 14 - Configuration des Disques]</a>
</font>

<h1><font color="#e00000">12 - Questions Sp&eacute;cifiques Aux Plates-
    Formes</font></h1> <hr>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
<li><a href="#General">12.1 - Remarques G&eacute;n&eacute;rales sur le
    Mat&eacute;riel</a> <ul>
  <li><a href="#GenPCI">12.1.1 - PCI</a>
  <li><a href="#GenISA">12.1.2 - ISA</a>
  </ul>
<li><a href="#alpha">12.2 - DEC Alpha </a>
<li><a href="#hp300">12.3 - HP 9000 series 300, 400</a>
<li><a href="#hppa" >12.4 - HP Precision Architecture (PA-RISC)</a>
<li><a href="#i386" >12.5 - i386</a>
  <ul>
  <li><a href="#ISANIC">12.5.1 - Cartes R&eacute;seau ISA </a>
  <li><a href="#FPU">12.5.2 - OpenBSD ne fonctionne pas sur mon
      syst&egrave;me 80386/80386SX/80486SX</a>
  <li><a href="#IrqShare">12.5.3 - Mon dmesg affiche plusieurs
      p&eacute;riph&eacute;riques partageant la m&ecirc;me
      interruption</a> </ul>
<li><a href="#mac68k">12.6 - Mac68k</a>
  <ul>
  <li><a href="#mac68kSupport">12.6.1 - Mon syst&egrave;me Mac68k ne
      semble pas fonctionner</a>
  <li><a href="#mac68kTime">12.6.2 - Plus le temps passe, plus mon
      horloge d&eacute;rive. Pourquoi ?</a>
  <li><a href="#mac68k2disks">12.6.3 - Mon syst&egrave;me Mac68k ne veut
      pas fonctionner avec deux disques</a>
  <li><a href="#mac68kInstCrash">12.6.4 - Le programme d'installation a
      plant&eacute; durant l'installation</a> </ul>
<li><a href="#macppc">12.7 - MacPPC</a>
<li><a href="#mvme68k">12.8 - MVME68k</a>
<li><a href="#sparc">12.9 - SPARC</a>
<li><a href="#sparc64">12.10 - UltraSPARC</a>
  <ul>
  <li><a href="#sparc64Floppy">12.10.1 - Mon syst&egrave;me UltraSPARC
      ne veut pas d&eacute;marrer &agrave; partir de l'image sur
      disquette</a> </ul>
<li><a href="#vax">12.11 - DEC VAX</a>
</ul>

<hr>

<a name="General"></a>
<h2>12.1 - Notes G&eacute;n&eacute;rales sur le Mat&eacute;riel</h2>

<a name="GenPCI"></a>
<h3>12.1.1 - P&eacute;riph&eacute;riques PCI</h3>

<ul>
<li>Les p&eacute;riph&eacute;riques PCI sont pratiquement tous auto-
    configur&eacute;s -- la machine et le syst&egrave;me d'exploitation
    vont allouer des ressources aux cartes si n&eacute;cessaire.

<li>Les interruptions peuvent &ecirc;tre partag&eacute;es sur le bus
    PCI. Non seulement ils le peuvent, mais le syst&egrave;me va souvent
    &ecirc;tre plus performant lorsque les IRQs sont partag&eacute;s, et
    particuli&egrave;rement sur les syst&egrave;mes i386.

<li>Il existe plusieurs standard PCI diff&eacute;rents.
    Occasionnellement, vous trouverez une carte de sp&eacute;cification
    PCI2.2 qui va juste fonctionner sur un syst&egrave;me de
    sp&eacute;cification 2.1. De m&ecirc;me, plusieurs cartes avec des
    ponts int&eacute;gr&eacute;s (telles que les cartes r&eacute;seaux
    multi-port) ne fonctionneront pas correctement sur d'anciens
    syst&egrave;mes.

<li>Le bus PCI supporte deux niveaux de signalisation, 3.3v et 5v. Les
    cartes fonctionnant avec la signalisation 3.3v ont une seconde
    "coupure" au niveau de leur connecteur PCI. La plupart des cartes
    PCI utilisent la signalisation 5v, utilis&eacute;e par la plupart
    des ordinateurs. Les ordinateurs &agrave; carte unique Soekris
    (Net45x1 et Net4801) sont des machines communes qui ne supportent
    que la signalisation 3.3v.

</ul>

<a name="GenISA"></a>
<h3>12.1.2 - P&eacute;riph&eacute;riques ISA</h3>
<ul>
<li>Les p&eacute;riph&eacute;riques ISA ne peuvent partager de
    ressources et de mani&egrave;re g&eacute;n&eacute;rale, doivent
    &ecirc;tre configur&eacute;s manuellement en utilisant des
    param&egrave;tres qui ne rentrent pas en conflit avec d'autres
    p&eacute;riph&eacute;riques syst&egrave;me.

<li>Quelques p&eacute;riph&eacute;riques ISA sont"Plug and Play" 
(<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isapnp&amp;sektion=4">isapnp(4)</a>)
-- si vous avez des probl&egrave;mes avec de tels
p&eacute;riph&eacute;riques, v&eacute;rifiez leur configuration dans
votre
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>,
ISAPNP ne fonctionne pas toujours comme on le souhaite.

<li>De mani&egrave;re g&eacute;n&eacute;rale, si vous avez le choix
    &eacute;vitez les cartes ISA au profit de cartes PCI. Les cartes ISA
    sont plus difficiles &agrave; configurer et ont un impact
    n&eacute;gatif plus grand sur les performances syst&egrave;me. </ul>


<p> <a name="alpha"></a>
<h2>12.2 - DEC Alpha</h2> 
[aucune information pour le moment]

<a name="hp300"></a>
<h2>12.3 - HP300</h2>
[aucune information pour le moment]

<a name="hppa"></a>
<h2>12.4 - HPPA</h2>
[aucune information pour le moment]

<a name="i386"></a>
<h2>12.5 - i386</h2>

<a name="ISANIC"></a>
<h3>12.5.1 - Cartes r&eacute;seau ISA</h3>
Etant donn&eacute; qu'OpenBSD fonctionne bien sur le mat&eacute;riel
ancien, les utilisateurs finissent souvent par utiliser des cartes
r&eacute;seau NIC avec les syst&egrave;mes OpenBSD. Le mat&eacute;riel
ISA n&eacute;cessit&eacute; beaucoup plus de configuration et de
compr&eacute;hension que le mat&eacute;riel PCI. De mani&egrave;re
g&eacute;n&eacute;rale, vous ne pouvez pas vous contenter
d'ins&eacute;rer votre carte dans la machine et esp&eacute;rer qu'elle
fonctionne par magie. Avec plusieurs machines, si votre
p&eacute;riph&eacute;rique ISA n'est pas en mode "Plug 'n' Play" (PNP),
vous devez r&eacute;server les ressources que la carte utilise au niveau
du BIOS.

<h4>3Com 3C509B ep(4)</h4>
C'est une carte r&eacute;seau ISA tr&egrave;s performante,
support&eacute;e par le p&eacute;riph&eacute;rique
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ep&amp;sektion=4">ep(4)</a>
. La version 'B' peut &ecirc;tre distingu&eacute;e de la version non-B
par le nom figurant sur la carte et par une puce principale plus large
sur la carte (approximativement 2.5cm sur un c&ocirc;t&eacute;  pour  la
version 'B' vs. 2cm sur un c&ocirc;t&eacute; pour  l'ancienne  version),
et elle  fournira  de  meilleures  performances  sur  un  syst&egrave;me
charg&eacute; ou dot&eacute; de deux cartes r&eacute;seau.

Les 3C509B sont livr&eacute;es avec une configuration en mode PNP, qui
malheureusement n'est pas conforme aux standards, et cause des
probl&egrave;mes dans le support
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isapnp&amp;sektion=4"
>isapnp(4)</a> d'OpenBSD.
L'adaptateur est d'abord s&eacute;lectionn&eacute; comme
p&eacute;riph&eacute;rique non-PNP, puis une seconde fois lorsque le
support PNP devient disponible. Le r&eacute;sultat est l'affichage d'une
carte r&eacute;seau suppl&eacute;mentaire dans le dmesg. Le
fonctionnement peut alors &ecirc;tre correct ou probl&eacute;matique. Il
est hautement recommand&eacute; de d&eacute;sactiver le mode PNP pour
les cartes 3C509B et de configurer manuellement la carte avec des
param&egrave;tres non conflictuels &agrave; l'aide des utilitaires DOS
3Com avant la configuration.

<p>
Le pilote ep(4) va trouver les cartes en utilisant n'importe quelle
combinaison mat&eacute;rielle qui ne cause pas de conflit avec d'autres
p&eacute;riph&eacute;riques dans le syst&egrave;me.

<p>
Si vous avez plusieurs cartes 3C509 dans votre syst&egrave;me, il est
recommand&eacute; d'inscrire l'adresse MAC sur la surface des cartes
situ&eacute;e &agrave; l'ext&eacute;rieur du bo&icirc;tier et d'utiliser
dmesg pour identifier les cartes.

<p>
Il est &agrave; noter que les cartes 3C509, 3C905 et 3C590 sont souvent
confondues. La carte 3C509 est une carte ISA 10Mbps, les cartes 3C905 et
3C590 sont des cartes PCI.


<p>
<h4>NE2000</h4>
La premi&egrave;re carte NE2000 a &eacute;t&eacute;
d&eacute;velopp&eacute;e au milieu des ann&eacute;es 1980 par Novell.
Depuis, plusieurs constructeurs ont produit des cartes tr&egrave;s
similaires g&eacute;n&eacute;ralement appel&eacute;es "compatible
NE2000" ou clones. La performance de ces cartes clones varie
&eacute;norm&egrave;ment. Alors que quelques anciennes cartes
"compatibles NE2000" ont de tr&egrave;s bonnes performances, la plupart
des cartes actuellement disponibles ont de faibles performances. Les
cartes "compatible NE2000" sont support&eacute;es par le pilote

<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ne&amp;sektion=4">ne(4)</a>
sous OpenBSD.

<p>
OpenBSD va bien g&eacute;rer quelques cartes "compatible NE2000"
capables d'utiliser ISAPNP lorsque le mode ISAPNP est activ&eacute;.
D'autres cartes vont devoir &ecirc;tre configur&eacute;s soit par le
biais de cavaliers soit &agrave; l'aide d'un utilitaire de configuration
sous DOS. Malheureusement, les premi&egrave;res cartes NE2000 n'avaient
pas de support pour la configuration logicielle ou ISAPNP, il n'y a
aucun standard -- vous avez besoin de l'utilitaire fourni au
d&eacute;part avec votre carte. Ce qui peut souvent &ecirc;tre difficile
&agrave; obtenir.

<p>
Le pilote ne(4) supporte trois configurations des cartes ISA NE2000 dans
le noyau GENERIC OpenBSD :
<pre>
     ne0:  port 0x240 irq 9
     ne1:  port 0x300 irq 10
     ne2:  port 0x280 irq 9
</pre>
Si ces param&egrave;tres ne sont pas acceptables, vous pouvez les
ajuster en utilisant
<a href="faq5.html#BootConfig">User Kernel Configuration (UKC)</a> ou en 
<a href="faq5.html">compilant un noyau personnalis&eacute;</a>.

<p>
Il est &agrave; noter que le pilote ne(4) est assez "idiot" -- seul le
port E/S est sond&eacute;, l'IRQ correspondant est
<i>suppos&eacute;e</i>.

<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>
ne va pas refl&eacute;ter l'IRQ r&eacute;elle de l'adaptateur dans le
cas des pilotes ISA ne(4). Si ce n'est l'IRQ r&eacute;elle
utilis&eacute;e par votre carte, &ccedil;a ne marchera pas.

<p>
Il est &agrave; noter qu'il existe des cartes non-ISA qui utilisent le
pilote ne(4) -- des cartes PCI et PCMCIA existent. Ces notes ne
s'appliquent pas &agrave; ces cartes qui sont auto-configur&eacute;s.

<a name="80386"></a>
<a name="FPU"></a>
<h3>12.5.2 - OpenBSD ne fonctionne pas sur mon syst&egrave;me
         0386/80386SX/80486SX !</h3>
Le 80386sx peut adresser au maximum 16M, ce qui est au plus pr&egrave;s
du minimum support&eacute; par OpenBSD/i386. La plupart des
syst&egrave;mes 80386sx ne peuvent supporter plus de 8M de RAM, ce qui
les placent dans la cat&eacute;gorie 'Pour Experts Uniquement", puisque
des &eacute;tapes non triviales et une seconde machine sont
n&eacute;cessaires pour commencer. Consultez aussi la prochaine section
:

<h4>80386</h4>

OpenBSD 3.4 pourra fonctionner sur un syst&egrave;me 80386 ou 80386sx SI
ce syst&egrave;me a un coprocesseur math&eacute;matique (Floating Point
Unit, ou FPU) 80387 ou 80387sx. Malheureusement, ces FPUs ne sont pas
tr&egrave;s communs, plusieurs syst&egrave;mes 80386 ne les auront donc
pas. OpenBSD ne pourra pas fonctionner sans ce FPU sur plate-forme i386.
Encore une fois, soyez conscient que c'est vraiment un processeur
tr&egrave;s faible pour un syst&egrave;me d'exploitation comme OpenBSD
qui utilise autant le chiffrement. Vous ne serez probablement satisfait
des performances d'une telle machine pour une utilisation
g&eacute;n&eacute;rale.

<h4>80486SX</h4>
Le processeur 80486SX f&ucirc;t une version "bas de gamme" du 80486. Il
lui manque le support mat&eacute;riel de la virgule flottante (comme le
80386) qu'OpenBSD 3.4 n&eacute;cessite. Heureusement, des processeurs
complets 80486DX sont assez communs et constituent une mise &agrave;
jour facile sur la plupart des syst&egrave;mes.

<a name="IrqShare"></a>
<h3>12.5.3 - Mon dmesg affiche plusieurs p&eacute;riph&eacute;riques
         partageant la m&ecirc;me interruption (IRQ) !</h3>

C'est enti&egrave;rement acceptable et, en v&eacute;rit&eacute;,
m&ecirc;me souhaitable pour les p&eacute;riph&eacute;riques PCI. C'est
une caract&eacute;ristique de la conception du bus PCI. Certaines
personnes diront que le partage de requ&ecirc;tes d'interruption est une
mauvaise chose, Cependant ils confondent la situation avec un bus ISA
(o&ugrave; le partage d'IRQs n'est pas permit) ou ils ont une
exp&eacute;rience avec du mauvais mat&eacute;riel ou logiciel.

<p>
Les p&eacute;riph&eacute;riques ISA ne peuvent pas partager des IRQs. Si
vous trouvez des p&eacute;riph&eacute;riques ISA partageant des IRQs,
vous devez corriger le probl&egrave;me.

<a name="mac68k"></a>
<h2>12.6 - Mac68k</h2>

<a name="mac68kSupport"></a>
<h3>12.6.1 - Mon syst&egrave;me Mac68k ne semble pas fonctionner !</h3>

Les d&eacute;veloppeurs n'ont malheureusement acc&egrave;s qu'&agrave;
un petit nombre de machines Mac86k diff&eacute;rentes. C'est pour cette
raison que le bon fonctionnement n'a &eacute;t&eacute; valid&eacute; que
pour quelques machines.

<a name= "mac68kTime"></a>
<h3>12.6.2 - Plus le temps passe, plus mon horloge d&eacute;rive.
         Pourquoi ? </h3>

Ce dysfonctionnement est caus&eacute; par un bogue mat&eacute;riel.
OpenBSD utilise des interruptions d'horloge pour maintenir le temps,
mais ces interruptions ont la plus basse priorit&eacute; dans
l'architecture <a href="../../fr/mac68k.html">Mac68k</a>. Les
interruptions d'horloge sont ainsi perdues sous une charge importante
(activ&eacute; disque ou r&eacute;seau par exemple) et l'horloge Unix ne
fonctionne pas comme il se doit. Les syst&egrave;mes <a
href="../../fr/macppc.html">MacPPC</a> n'ont pas ce probl&egrave;me.

<p>
MacOS contourne ce probl&egrave;me en consultant continuellement
l'horloge mat&eacute;rielle. En revanche, OpenBSD ne la consulte que
lors de la phase de d&eacute;marrage et l'ignore par la suite. Vous
remarquerez peut-&ecirc;tre que, lors d'un arr&ecirc;t, le noyau n'a pas
suffisamment confiance pour r&eacute;injecter le temps Unix dans
l'horloge mat&eacute;rielle puisque ce probl&egrave;me de perte
d'interruptions est bien connu.

<p>
Une solution simple consiste &agrave; utiliser rdate(8)
r&eacute;guli&egrave;rement avec une entr&eacute;e crontab. Vous pouvez
aussi lancer

<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&amp;sektion=8">rdate
(8)</a>
&agrave; partir de votre fichier <i>/etc/ppp/ppp.linkup</i> si vous
n'&ecirc;tes pas connect&eacute; de fa&ccedil;on permanente et que vous
&ecirc;tes un utilisateur PPP.

<p>
Voir aussi :
<a href="http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17">
http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17</a>


<a name="mac68k2disks"></a>
<h3>12.6.3 - Mon syst&egrave;me Mac68k ne veut pas
fonctionner avec deux disques</h3>
C'est un probl&egrave;me connu qui se manifeste habituellement par des
plantages peu de temps apr&egrave;s le passage du syst&egrave;me en
multi- utilisateur. Le plantage peut ne pas &ecirc;tre li&eacute; au
disque syst&egrave;me. La solution consiste &agrave; utiliser une seul
disque sur vos syst&egrave;mes Mac68k. Une meilleure solution est la
bienvenue
!

<a name="mac68kInstCrash"></a>
<h3>12.6.4 -  Le programme d'installation
a plant&eacute; durant l'installation</h3>
Le programme d'installation Mac68k ex&eacute;cut&eacute; par MacOS
n'installera pas de fichiers sur une "grande" partition. Si n'importe
quelle partition sur laquelle vous effectuez l'installation a une taille
plus grande que 500M, vous pouvez vous attendre &agrave; l'erreur
&eacute;trange suivante :
<pre>
    Error on SCSIRead(), #5
    pos = 0, i = 22, fs = /
    alloccgblk: can't find blk in cyl
</pre>
La solution consiste &agrave; installer d'abord un syst&egrave;me
minimal sur une "petite" partition root, d&eacute;marrer OpenBSD et
transf&eacute;rer les fichiers comme souhait&eacute;.

<p>
Supposons que vous voulez une partition / de 200M. Cr&eacute;ez la
partition root, cr&eacute;ez les autres partitions
d&eacute;sir&eacute;es, utilisez newfs avec les utilitaires Mac0S.
Installez etc34.tgz et base34.tgz sur la partition /.

<p>
Montez les autres partitions dans un point de montage temporaire et
copiez les r&eacute;pertoires que vous voulez &agrave; ces partitions
comme indiqu&eacute; <a href="faq10.html#DupFS">ici</a>.

<p>
Maintenant, modifiez /etc/fstab, rebootez et d&eacute;faites le reste
des fichiers *.tgz tel que c'est document&eacute; <a
href="faq4.html#AddFileSet">ici</a>.

<p>
En suivant cette proc&eacute;dure, vous pouvez choisir n'importe quelle
taille pour les partitions autres que /.


<a name="macppc"></a>
<h2>12.7 - MacPPC</h2>
[aucune information pour le moment]

<a name="mvme68k"></a>
<h2>12.8 - MVME68k</h2>
[aucune information pour le moment]

<a name="sparc"></a>
<h2>12.9 - SPARC</h2>
[aucune information pour le moment]

<a name="sparc64"></a>
<h2>12.10 - UltraSPARC (sparc64)</h2>

<a name="sparc64Floppy"></a>
<h3>12.10.1 -  Mon syst&egrave;me UltraSPARC ne veut
pas d&eacute;marrer &agrave; partir de l'image sur disquette</h3>
Seul les mod&egrave;les Ultra 1/1e et Ultra 2 peuvent d&eacute;marrer
<i>n'importe</i> quel OS &agrave; partir d'une disquette. Utilisez les
m&eacute;thodes d'installation CD-ROM, Miniroot ou d&eacute;marrage
r&eacute;seau pour effectuer votre installation.

<a name="vax"></a>
<h2>12.11 - DEC VAX</h2>
[aucune information pour le moment]



<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ] </a>
<a href= "faq11.html">[Section 11 - Optimisation des Performances]</a>
<a href= "../faq14.html">[Section 14 - Configuration des Disques]</a>
</font>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt="[back]"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq12.html,v 1.46 ]<br>
$Translation: faq12.html,v 1.14 2004/01/02 22:19:03 saad Exp $<br>
$OpenBSD: faq12.html,v 1.11 2004/01/03 19:44:35 jufi Exp $
</small>

</body>
</html>
