<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>12 - Pour Utilisateurs de Haut Niveau</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2003 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif"> 
<p>
<font color= "#0000e0">
<a href= "index.html">[Index de la FAQ]</a>
<a href= "faq11.html">[Section 11 - Optimisation des Performances]</a>
<a href= "../faq13.html">[Section 13 - IPsec]</a>
</font>
</p>

<h1><font color=#e00000>12 - Pour utilisateurs de haut niveau</font></h1>
<hr>
<p></p>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
  <li><a href="#IDEDMA">12.1 - Forcer l'acc&egrave;s DMA sur les disques IDE</a>
  <li><a href= "../upgrade-minifaq.html">12.2 - Mise &agrave; jour &agrave; partir 
    des diff&eacute;rentes versions de OpenBSD via CVS</a> 
</ul>
<p></p> 
<hr>

<P>Par utilisateurs de haut niveau, nous d&eacute;signons les personnes qui ont 
  une exp&eacute;rience terrain de la mani&egrave;re d'utiliser et d'administrer 
  un syst&egrave;me d'exploitation type Unix. Si vous suiviez les instructions 
  de cette section sans comprendre ce que vous &ecirc;tes entrain de faire, vous 
  causeriez des probl&egrave;mes au niveau du fonctionnement de votre syst&egrave;me.
<p>
<a name= "IDEDMA"></a>
<a name= "12.1"></a>
<h2>12.1 - Forcer l'acc&egrave;s DMA sur les disques IDE</h2>
</a>

<p>Votre chipset n'est peut-&ecirc;tre pas connu du code PCI IDE. Si c'est le 
  cas, vous verrez le message suivant :: 

<blockquote>
<pre>
pciide0: DMA, (unused)
</pre>
</blockquote>

<p>Si vous voyez ce message, vous pouvez essayer de forcer le mode DME en utilisant 
  'flags 0x0001' dans l'entr&eacute;e pciide dans votre fichier de configuration 
  du noyau comme ceci :</p>
<UL><PRE>
pciide* at pci ? dev ? function ? flags 0x0001
</PRE></ul>
<p>Apr&egrave;s avoir effectu&eacute; cette op&eacute;ration, le code pciide essayera 
  d'utiliser le mode DMA qu'il sache ou pas comment faire &ccedil;a avec votre 
  chipset. Si &ccedil;a marche et que votre syst&egrave;me passe les &eacute;tapes 
  de fsck et de d&eacute;marrage, alors il est fort probable que &ccedil;a marche 
  pour de bon. Si &ccedil;a ne marche pas et que votre syst&egrave;me se fige 
  ou panique apr&egrave;s la s&eacute;quence de d&eacute;marrage cela voudrait 
  dire que vous ne pouvez pas utiliser le mode DMA (jusqu'&agrave; ce que le support 
  de votre chipset soit ajout&eacute;). Il est &agrave; noter que si vous trouvez 
  la documentation du chipset de votre contr&ocirc;leur PCI-IDE, c'est un bon 
  d&eacute;but pour un support complet de votre chipset par le code PCI-IDE. Vous 
  pouvez effectuer des recherches sur le site Web du fabricant ou appelez les. 
  Si le contr&ocirc;leur PCI-IDE fait partie de votre carte m&egrave;re, essayez 
  de trouver le fabricant du chipset et sollicitez leur ressources !</p>
<p>Vous saurez que le support DMA a &eacute;t&eacute; activ&eacute; si vous voyez 
  le message suivant :</p>

<blockquote>
<pre>
cd0(pciide0:1:0): using PIO mode 3, DMA mode 1
</pre>
</blockquote>

<p>Cela veut dire que pciide0, canal 1, pilote 0 (qui semble &ecirc;tre un CD-ROM 
  ATAPI) utilise les transferts de donn&eacute;es DMA.</p>

<p>
<font color= "#0000e0">
<a href= "index.html">[Index de la FAQ]</a> 
<a href= "faq11.html">[Section 11 - Optimisation des Performances]</a> 
<a href= "../faq13.html">[Section 13 - IPsec]</a>
</font>
</p>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt="[back]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a> <br>
<small>
Originally [OpenBSD: faq12.html,v 1.34 ]<br>
$Translation: faq12.html,v 1.8 2003/05/11 15:42:48 saad Exp $<br>
$OpenBSD: faq12.html,v 1.5 2003/05/12 19:07:12 jufi Exp $
</small> 
</body>
</html>
