<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<head>
<title>3 - Obtenir OpenBSD</title>
<link rev= "made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright" content= "This document copyright 1998-2003 by
OpenBSD."> 
</head>

<body bgcolor= "#ffffff" text= "#000000">

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href= "../faq2.html">[Section 2 - Autres Ressources d'Information
OpenBSD]</a>
<a href= "../faq4.html">[Section 4 - Guide d'Installation]</a>
</font>

<h1><font color="#e00000">3 - Obtenir OpenBSD</font></h1>
<hr>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
<li><a href= "#BuyCD" >3.1 - Acheter un CD OpenBSD</a>
<li><a href= "#BuyTShirts" >3.2 - Acheter des T-shirts OpenBSD</a>
<li><a href= "#ISO" >3.3 - Est-ce qu'OpenBSD fournit une image ISO
    disponible en t&eacute;l&eacute;chargement ?</a>
<li><a href= "#FTP" >3.4 - T&eacute;l&eacute;charger par FTP ou AFS</a>
<li><a href= "#GetCurrent" >3.5 - Obtenir le code source actuel</a>
</ul> 
<hr>

<p>
<a name= "BuyCD"></a>
<a name= "3.1"></a>
<h2>3.1 - Acheter un CD OpenBSD</h2>

<p>
Acheter un CD OpenBSD est sans doute la meilleure mani&egrave;re de
commencer. Veuillez consulter la page des commandes pour en obtenir une
copie : <a href=
"../../orders.html">http://www.openbsd.org/orders.html</a>.

<p>
Il y a plusieurs bonnes raisons d'acheter un CD OpenBSD :
<ul>
  <li>La vente des CDs finance le d&eacute;veloppement d'OpenBSD.
      continu
  <li>Le d&eacute;veloppement d'un syst&egrave;me d'exploitation multi
      plates-formes n&eacute;cessite beaucoup d'investissements en
      mat&eacute;riels.
  <li>Votre contribution sous la forme de l'achat d'un CD &agrave; un
      v&eacute;ritable impact sur le d&eacute;veloppement futur.
  <li>Le CD contient les binaires (et les sources) pour toutes les
      plates-formes support&eacute;es.
  <li>Le CD est "bootable" sur plusieurs plates-formes et peut
      &ecirc;tre utilis&eacute; pour d&eacute;marrer une machine sans
      syst&egrave;me pr&eacute;-install&eacute;.
  <li>Le CD est utile pour d&eacute;marrer un syst&egrave;me m&ecirc;me
      si vous choisissez d'installer un "snapshot".
  <li>Installer depuis le CD est plus rapide! De plus cela permet de
      pr&eacute;server la bande passante.
  <li>Les CDs OpenBSD sont toujours fournis avec de jolis autocollants.
      Votre syst&egrave;me n'est pas vraiment complet sans eux. Vous ne
      pouvez les obtenir que si vous achetez le CD ou donner du
      mat&eacute;riel. 
</ul>

<p>
Si vous installer un version stable d'OpenBSD, vous devriez utiliser le
CD. 

<p>
<a name= "BuyTShirts"></a>
<a name= "3.2"></a>
<h2>3.2 - Acheter des T-shirts OpenBSD</h2>
<p>
OpenBSD propose des T-shirts pour votre plaisir vestimentaire. Vous
pouvez les visualiser &agrave; : <a
href="../../tshirts.html">http://www.OpenBSD.org/tshirts.html</a>.

<p>
<a name="ISO"></a>
<a name="3.3"></a>
<h2>3.3 - Est-ce qu'OpenBSD fournit une image ISO disponible en
      t&eacute;l&eacute;chargement ?</h2>
Certains syst&egrave;mes d'exploitation libres sont distribu&eacute;s
sous forme d'images ISO. Ce <i>n'</i>est pas la m&eacute;thode de
distribution d'OpenBSD.
<p>
Le projet OpenBSD ne fournit pas en t&eacute;l&eacute;chargement les
images ISO utilis&eacute;es pour cr&eacute;er les les masters des CDs
officiels. La raison est simplement que nous souhaiterions que vous
achetiez les CDs, pour aider au financement des d&eacute;veloppements
futurs dans OpenBSD. La disposition du CD-ROM officiel est copyright
Theo de Raadt. Theo n'autorise pas les gens &agrave; redistribuer des
images des CDs OpenBSD officiels. Comme incitation pour que les gens
ach&egrave;tent les CDs, plusieurs extras sont aussi disponibles dans le
paquetage (Dessins, Autocollants, etc).

<p>
Notez que seule la disposition du CD est sous copyright, OpenBSD
lui-m&ecirc;me est libre. Rien n'emp&ecirc;che quelqu'un d'autre de
r&eacute;cup&eacute;rer OpenBSD et de cr&eacute;er son propre CD. Si
pour une raison quelconque vous souhaitez t&eacute;l&eacute;charger une
image de CD, vous pouvez rechercher dans les archives des listes de
diffusion pour des pistes possibles. Bien sur, toute image ISO d'OpenBSD
disponible sur l'Internet est soit en violation du copyright de Theo de
Raadt ou n'est pas une image officielle. Les sources pour les images non
officielles peuvent &ecirc;tre de confiance ou non; c'est &agrave; vous
de le d&eacute;terminer.

<p>
Nous sugg&eacute;rons que les personnes souhaitant
t&eacute;l&eacute;charger OpenBSD gratuitement utilise l'option
d'installation par FTP. Pour ceux qui ont besoin d'un CD bootable pour
leur syst&egrave;me, des images ISO des disquettes de d&eacute;marrage
(appel&eacute;es <tt>cd33.iso</tt>) sont disponibles pour un certain
nombre de plates-formes et qui permettront d'installer le syst&egrave;me
par FTP. Ces images ISO ont une taille de quelques megaoctets seulement,
et contiennent uniquement les outils d'installation. Elles ne
contiennent pas les jeux de fichiers constituant le syst&egrave;me.

<p>
<a name= "FTP"></a>
<a name= "3.4"></a>
<h2>3.4 - T&eacute;l&eacute;charger par FTP ou AFS</h2>

<p>
Il y a plusieurs miroirs internationaux offrant un acc&egrave;s FTP aux
snapshots et versions stables d'OpenBSD. L'acc&egrave;s par AFS est
aussi disponible. Il est pr&eacute;f&eacute;rable de toujours utiliser
le site le plus proche de vous. Avant de commencer &agrave;
t&eacute;l&eacute;charger cous pouvez utiliser <a href="http://www.open
bsd.org/cgi-bin/man.cgi?query=ping&amp;sektion=8">ping
(8)</a> et <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=tracer
oute&amp;sektion=8">traceroute(8)</a> pour d&eacute;terminer quel est le site
miroir le plus proche et voir si celui-ci fonctionne correctement. Bien
sur votre CD d'OpenBSD est toujours plus proche qu'un site miroir. Les
informations sont contenues l&agrave; : 

<p>
<a href= "../../fr/ftp.html">http://www.openbsd.org/fr/ftp.html</a>.

<p>
<a name= "GetCurrent"></a>
<a name= "3.4"></a>
<h2>3.4 - Obtenir le code source actuel</h2>

<p>
Le code source d'OpenBSD est disponible librement et gratuitement. La
meilleure fa&ccedil;on d'obtenir le code source est d'installer les
sources qui se trouvent sur le CD et de configurer AnonCVS pour les
mettre &agrave; jour r&eacute;guli&egrave;rement. Les informations
&agrave; propos d'AnonCVS ainsi que la fa&ccedil;on de le configurer se
trouvent l&agrave; :

<p>
<a href=
"../../fr/anoncvs.html">http://www.openbsd.org/fr/anoncvs.html</a>.

<p>
Vous pouvez aussi consulter <a href= "../faq8.html#CVS">FAQ 8, CVS</a>

<p>
Si vous n'avez pas assez de bande passante pour utiliser AnonCVS, ou si
votre acc&egrave;s &agrave; l'Internet se fait par UUCP, vous pouvez
utiliser CTM au lieu d'AnonCVS pour mettre vos sources &agrave; jour. Si
c'est votre cas, il est vraiment important de commencer &agrave; l'aide
d'un CD r&eacute;cent. Les informations au sujet de CTM, incluant sa
configuration se trouvent l&agrave; :

<p>
<a href= "../../fr/ctm.html">http://www.openbsd.org/fr/ctm.html</a>.

<p>
Une autre possibilit&eacute; est d'obtenir le code source par
l'interm&eacute;diaire du web. Vous pouvez l'obtenir par
l'interm&eacute;diaire de cvsweb :

<a href= "http://www.openbsd.org/cgi-bin/cvsweb/">Http://www.openbsd.or
g/cgi-bin/cvsweb/</a>.

<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href= "../faq2.html">[Section 2 - Autres Ressources d'Information
OpenBSD]</a> 
<a href= "../faq4.html">[Section 4 - Guide d'installation OpenBSD]</a>
</font>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[retour]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: faq3.html,v 1.39 ]<br>
$Translation: faq3.html,v 1.15 2003/05/03 10:01:04 saad Exp $<br>
$OpenBSD: faq3.html,v 1.10 2003/05/03 11:28:06 jufi Exp $ 
</small> 

</body>
</html>  
