<html>
<head>
<title>4.0 - Guide d'installation</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-1999 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000" link= "#23238E">

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<h2><font color=#e00000>4.0 - Guide d'installation</font></h2>
<!-- UNCOMMENT ONLY WHEN THE FILE IS OUT OF SYNC -->

<hr>
<p>
<b><font color="#e00000">Remarque Importante :</font></b> Le contenu de
   ce fichier est obsol&egrave;te. Consultez la version anglaise 
   <a href="../faq4.html">ici</a> pour des informations &agrave; jour.

<p>
Si vous souhaitez contribuez &agrave; l'effort de traduction,
pri&egrave;re de consultez
<a href="../../fr/translation.html">la page de traduction</a>.

<!-- -->
<hr>

<p>
<ul><h3>Table des mati&egrave;res</h3>
<li><a href="faq4.html#4.1">4.1 - Pr&eacute;sentation de la proc&eacute;dure d'installation d'OpenBSD.</a>
<li><a href= "faq4.html#4.2">4.2 - Quels sont les fichiers n&eacute;cessaires &agrave; l'installation ?</a></li>
<li><a href= "faq4.html#4.3">4.3 - Quelle est la place requise pour installer OpenBSD ?</a></li>
<li><a href= "faq4.html#4.4">4.4 - Multiboot OpenBSD.</a></li>
<li><a href= "faq4.html#4.5">4.5 - Envoyer votre dmesg &agrave; dmesg@openbsd.org apr&egrave;s l'installation.</a></li>
<li>Mon installation s'arr&ecirc;te &agrave; MAKEDEV all sur mon i386 avec 8 Mo de RAM.
</ul>
</p>
<hr>

<p>
<a name= "4.1"></a>
<h2>4.1 - Pr&eacute;sentation de la proc&eacute;dure d'installation d'OpenBSD.</h2>
</p>

<p>
Il existe de multiples possibilit&eacute;s pour installer OpenBSD et ce, sur des architectures diff&eacute;rentes. Les diff&eacute;rentes m&eacute;thodes d'installation sont les suivantes :
</p>

<ul>
<li><strong>CD-ROM</strong> - Cette m&eacute;thode implique que vous ayez
achet&eacute; le CD d'OpenBSD. Ceci peut-&ecirc;tre fait en le commandant &agrave; cette
page <a
href="../../orders.html">http://www.openbsd.org/orders.html</a>.
C'est la m&eacute;thode d'installation la plus simple. 
<li><strong>FTP</strong> - Cette m&eacute;thode implique la connaissance de
votre adresse IP de votre masque de sous-r&eacute;seau, de votre passerelle
par d&eacute;faut, etc... Si c'est le cas, il y a une tr&egrave;s longue liste de
miroirs FTP &agrave; travers le monde qui vous permettront de r&eacute;cup&eacute;rer
OpenBSD rapidement. 
<li><strong>DHCP</strong> - Cette m&eacute;thode est la m&ecirc;me que
<strong>FTP</strong> sauf que votre adresse IP, votre masque de
sous-r&eacute;seau, votre passerelle vous sont attribu&eacute;s par un serveur
DHCP. 
<li><strong>Syst&egrave;me de fichiers local</strong> - Cette m&eacute;thode vous
permet de faire l'installation depuis des fichiers se trouvant sur un
syst&egrave;me pr&eacute;-&eacute;xistant. Le support pour les syst&egrave;mes de fichier DOS,
EXT2FS et FFS est inclus sur le disque d'installation. 
<li><strong>NFS</strong> - Ceci vous permet de faire l'installation
depuis des fichiers situ&eacute;s sur un serveur NFS. Veuillez lire <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_nfs&sektion=8&format=html">mount_nfs(8)</a>
pour plus d'informations. 
</ul>

<p>
Toutes ces m&eacute;thodes d'installation sont disponibles sur une
disquette. Ces disquettes peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;es directement depuis
un miroir FTP (vous obtiendrez une liste des miroirs sur la page <a
href="../../fr/ftp.html">http://www.openbsd.org/fr/ftp.html</a>). 
Chaque architecture poss&egrave;de sa propre disquette donc prenez garde &agrave;
prendre la bonne disquette. La liste des architectures support&eacute;es se
trouve dans la <a href="faq1.html#1.2">FAQ 1</a>. 
</p>

<p>

Dans ces documents, le processus d'installation est d&eacute;taill&eacute; compl&egrave;tement :
<ul>
<li>install-i386.html pour l'architecture <strong>i386</strong>.
<li>install-sparc.html pour l'architecture <strong>sparc</strong>.
</ul>
Sinon n'oubliez pas de consulter les documents <A
HREF="ftp://ftp.openbsd.org/pub/OpenBSD/2.7/i386/INSTALL.i386">INSTALL.i386</a>
et <A
HREF="ftp://ftp.openbsd.org/pub/OpenBSD/2.7/sparc/INSTALL.sparc">INSTALL.sparc</a>. 

Les personnes utilisant d'autres architectures sont invit&eacute;es &agrave;
regarder dans les documents INSTALL.<i>arch</i> fournis avec la
distribution d'OpenBSD pour leur architecture ainsi que dans le
document g&eacute;n&eacute;rique d&eacute;taillant
l'installation

<h3>Remarque sur l'architecture Alpha</h3>
<p>
Votre machine Alpha doit poss&eacute;der un firmware SRM et non un firmware
ARC. Vous pouvez d&eacute;marrer sur votre machine Alpha directement &agrave; partir
du CD2. 
Il vous suffit pour cela de lancer une commande telle que :
<ul>
<strong>boot -fi 2.8/alpha/bsd.rd dkaX</strong>
</ul>
Utilisez <strong>show device</strong> pour trouver l'identifiant de
votre lecteur de CDROM. S'il ne vous est pas possible de d&eacute;marrer &agrave;
partir du CD, vous pouvez toujours utiliser l'image de la disquette de
d&eacute;marrage sur le CD2 : <i>CD2:2.8/alpha/floppy28.fs</i> et la cr&eacute;er
avec la proc&eacute;dure d&eacute;crite dans les documents i386 ci-dessus. Ensuite
suivez la proc&eacute;dure d'installation.
</p>

<p>
<a name= "4.2"></a>
<h2>4.2 - Quels sont les fichiers n&eacute;cessaires &agrave; l'installation ?</h2>
</p>

<p>
Il y a plusieurs packages contenant les binaires OpenBSD, mais quels
sont ceux dont vous avez besoin pour mettre en place votre syst&egrave;me ?
Voici une description de chaque package. 
</p>

<p>
<ul>
    <li><strong>base28.tar.gz</strong>    - Syst&egrave;me de base <b>Indispensable</b></li>
    <li><strong>etc28.tar.gz</strong>     - Les fichiers de /etc <b>Indispensable</b></li>
    <li><strong>comp28.tar.gz</strong>    - Compilateurs, biblioth&egrave;ques et outils associ&eacute;s. <b>Recommand&eacute;</b></li>
    <li><strong>man28.tar.gz</strong>     - Pages du manuel <b>Recommand&eacute;</b></li>
    <li><strong>misc28.tar.gz</strong>    - Informations diverses, documentation de mise en place</li>
    <li><strong>game28.tar.gz</strong>    - Les jeux pour OpenBSD</li>
    <li><strong>xbase28.tar.gz</strong>   - Installation de base de X11</li>
    <li><strong>xfont28.tar.gz</strong>   - Serveur de polices et polices X11</li>
    <li><strong>xlink28.tar.gz</strong>   - Liens pour les serveurs X</li>
    <li><strong>xserv28.tar.gz</strong>   - Serveurs X</li>
    <li><strong>xshare28.tar.gz</strong>  - Pages du manuel, fichiers includes, etc... pour X</li>
    <li><strong>bsd</strong>              - Il s'agit du noyau <b>Indispensable</b></li>
</ul>
</p>

<p>
<a name= "4.3"></a>
<h2> 4.3 - Quelle est la place requise pour installer OpenBSD ?</h2>
</p>

<p>
Les tailles de partition suivantes sont sugg&eacute;r&eacute;es pour une
installation compl&egrave;te. Ces nombres incluent suffisamment de place pour
vous permettre de faire tourner une machine connect&eacute;e &agrave; l'Internet.  

<UL>
<LI>Pour un syst&egrave;me multi-utilisateurs, il vous faudra sans doute
tripler ces valeurs. 
<LI>Si vous avez l'intention d'installer une quantit&eacute; significative de
logiciels, il est conseill&eacute; de faire en sorte que /usr soit de grande
capacit&eacute; ! Triplez <strong>au moins</strong> ces valeurs ! 
<LI>Pour un syst&egrave;me qui va g&eacute;rer beaucoup de courrier &eacute;lectronique ou
de pages web (situ&eacute;s, respectivement dans /var/mail et /var/www) vous
allez devoir augmenter la taille de /var. 
<LI>Pour un syst&egrave;me multi-utilisateurs qui g&eacute;n&egrave;re de grandes quantit&eacute;s
de journaux, il faudra encore augmenter la taille de /var (/var/log). 
</UL>Rappeler vous que /usr et /usr/X11R6 font d'habitude partie du
m&ecirc;me syst&egrave;me de fichier (/usr) et qu'il n'y a aucun int&eacute;r&ecirc;t &agrave; les
placer sur des syst&egrave;mes de fichiers s&eacute;par&eacute;s. 
<ul>
<strong>
<pre>
SYSTÈME         /       /usr    /var    /usr/X11R6
alpha           56M     540M    27M     161M
amiga           45M     399M    24M      36M
hp300           31M     234M    24M      47M
i386            35M     229M    24M      72M
mac68k          29M     232M    24M      36M
mvme68k         29M     232M    24M       -  (pas de serveur X)
pmax            50M     355M    24M      60M
sparc           40M     259M    24M      49M
</pre>
</strong>
</ul>

<p>
Quand vous &ecirc;tes dans l'&eacute;diteur disklabel, vous pouvez choisir de ne
cr&eacute;er qu'un seul syst&egrave;me de fichiers : `a' (syst&egrave;me de fichiers
principal) avec un `b' (swap). Le syst&egrave;me de fichiers `a' que vous
avez d&eacute;fini dans l'&eacute;diteur disklabel deviendra votre partition racine
qui sera la somme des 3 valeurs principales ci-dessus (/, /usr et
/var) plus la place n&eacute;cessaire &agrave; /tmp. La partition `b' deviendra la
partition de swap (nous recommandons un minimum de 32 Mo pour celle-ci
mais si vous avez de la place disque, faites la d'au moins 64 Mo. Si
vous avez beaucoup de place, alors faites la de 256 Mo, voire de 512
Mo). 

<P>
Il y a quatre raisons principales &agrave; l'utilisation de syst&egrave;me de
fichiers s&eacute;par&eacute;s, plut&ocirc;t que de tout placer sur un ou deux syst&egrave;mes de
fichiers : 
<UL>
<LI><b>Securit&eacute;</b>: Vous pouvez indiquer certains syst&egrave;mes de
fichiers comme &eacute;tant `nosuid', `nodev', `noexec', `readonly', etc... 
<LI><b>Stabilit&eacute;</b>: Un utilisateur ou un programme mal configur&eacute;
peut remplir un syst&egrave;me de fichiers avec des donn&eacute;es s'ils y ont les
permissions en &eacute;criture. Vos programmes critiques, qui se trouveraient
sur d'autres syst&egrave;mes de fichiers n'en seraient pas interrompus. 
<LI><b>Vitesse</b>: Un syst&egrave;me de fichiers o&ugrave; l'on &eacute;crit trop souvent
devient fragment&eacute; (Heureusement, le syst&egrave;me de fichiers ffs,
qu'utilise OpenBSD n'est pas trop sujet &agrave; la fragmentation). 
<LI><b>Int&eacute;grit&eacute;</b>: Si un syst&egrave;me de fichier est corrompu pour une
raison o&ugrave; une autre, les autres ne sont pas affect&eacute;s. 
</UL>

<P>
<a name="4.4"></a>
<h2>4.4 - Multiboot OpenBSD (i386, alpha).</h2>
</p>

<p>
<strong>OpenBSD & NT</strong>
</p>

<p>
Pour cr&eacute;er un multiboot OpenBSD et NT, il faut utiliser le NTloader,
le bootloader de Windows NT. Pour effectuer le multi-boot avec NT,
vous aurez besoin d'une copie de votre pbr OpenBSD. Apr&egrave;s avoir lu
installboot, vous pouvez copier votre pbr comme ceci : 
</p>

<ul>
<pre>
        # <strong>dd if=/dev/rsd0c of=openbsd.pbr bs=512 count=1</strong>
</pre>
</ul>

<p>
Maintenant d&eacute;marrez NT et placez openbsd.pbr dans c: Ajoutez une ligne
telle que celle-ci &agrave; la fin de c:\boot.ini : 
</p>

<ul>
<pre>
        c:\openbsd.pbr="OpenBSD"
</pre>
</ul>

<p>
Quand vous red&eacute;marrez, il devrait &ecirc;tre possible de s&eacute;lectionner
OpenBSD depuis le menu du gestionnaire de d&eacute;marrage de NT. Vous
trouverez plus d'information &agrave; propos du NTloader dans le <a
href="http://www.dorsai.org/~dcl/publications/NTLDR_Hacking/">NTLDR
Hacking Guide.</a>  
</p>

<p>
<strong>OpenBSD & Windows ou DOS (i386)</strong>
</p>

<p>
Pour d&eacute;marrer OpenBSD ainsi que Windows 3.1, Windows 95 ou DOS, vous
aurez besoin d'un gestionnaire de d&eacute;marrage capable de lancer tous ces
syst&egrave;mes. Quelques uns de ces gestionnaires de choix sont : <a
href="http://www.freebird.org/sw-map/bootmanager.html">osbs20b8.zip</a>
ou <a href="http://www.users.intercom.com/~ranish/part/">The Ranish
Partition Manager</a>. 
Ils sont tous deux capables de d&eacute;marrer OpenBSD.
</p>

<p>
<strong>OpenBSD & Linux (i386)</strong>
</p>

<p>
R&eacute;ferer vous &agrave; <a href="ftp://ftp.openbsd.org/pub/OpenBSD/2.8/i386/INSTALL.linux">INSTALL.linux</a>, qui vous donnent toutes les instructions n&eacute;cessaires pour faire fonctionner OpenBSD avec Linux.
</p>

<p>
<a name="4.5"></a>
<h2>4.5 - Envoyer votre dmesg &agrave; dmesg@openbsd.org apr&egrave;s l'installation.</h2>
</p>

<p>
Il est important pour les d&eacute;veloppeurs OpenBSD de garder une trace de quel mat&eacute;riel fonctionne et quel mat&eacute;riel ne fonctionne pas correctement.
</p>

<p>
Citation de /usr/src/etc/root/root.mail
<pre>
If you wish to ensure that OpenBSD runs better on your machines, please do us
a favor (after you have your mail system setup!) and type
        dmesg | mail dmesg@openbsd.org
so that we can see what kinds of configurations people are running.  We will
use this information to improve device driver support in future releases.
(We would be much happier if this information was for the supplied GENERIC
kernel; not for a custom compiled kernel).  The device driver information
we get from this helps us fix existing drivers.
</pre>
Veuillez aussi consulter la <a href= "../faq14.html#14.7">section 14.7</a>
</p>
<p>
Assurez vous d'envoyer le message depuis un compte capable de recevoir
du courier au cas o&ugrave; les d&eacute;veloppeurs voudraient vous contacter s'ils
ont quelque chose &agrave; vous faire tester (ou &agrave; changer) dans le but de
faire fonctionner au mieux votre syst&egrave;me. Il n'est pas du tout
indispensable d'envoyer le message depuis la machine o&ugrave; se trouve
OpenBSD, donc si cette machine ne peut recevoir de mails, il vous
suffit de faire : 
<pre>
 dmesg | mail votre-compte@votremail.dom
</pre>
et ensuite transmettez ce message &agrave; :
<pre>
 dmesg@openbsd.org
</pre>
o&ugrave; <tt>votre-compte@votremail.dom</tt> est votre compte de messagerie
habituel (ou alors envoyez votre dmesg en utilisant
ftp/scp/floppydisk/pigeon voyageur/...)
</p>

<p>
<strong>REMARQUE</strong> - N'envoyer que des dmesg relatifs &agrave; un noyau GENERIC. Les autres noyaux ne sont pas utiles.
</p>

<p>
<font color= "#0000e0">
<a href= "index.html">[Retour &agrave; l'Index principal]</a>
<a href= "faq3.html">[To Section 3.0 - Obtenir OpenBSD]</a>
<a href= "faq5.html">[To Section 5.0 - Configuration du noyau]</a>
</font>
</p>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[retour]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>Originally [OpenBSD: faq4.html,v 1.73 2000/09/14 19:19:24 ericj Exp ]<br>
$Translation: faq4.html,v 1.14 2003/12/14 14:05:07 saad Exp $<br>
$OpenBSD: faq4.html,v 1.7 2003/12/15 19:20:57 horacio Exp $
</small>
</p>
</body>
</html>
