<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>5 - Construire le Syst&egrave;me &agrave; partir des
Sources</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2004 by OpenBSD.">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<!-- Passes validator.w3.org.  Please keep it this way -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href= "../faq4.html">[Section 4 - Guide d'Installation]</a>
<a href= "../faq6.html">[Section 6 - Mise en place du r&eacute;seau]</a>
</font>

<h1><font color="#e00000">5 - Construire le Syst&egrave;me &agrave;
    partir des Sources</font></h1>
<!-- UNCOMMENT ONLY WHEN THE FILE IS OUT OF SYNC -->

<hr>
<p>
<b><font color="#e00000">Remarque Importante :</font></b> Le contenu de
   ce fichier est obsol&egrave;te. Consultez la version anglaise
   <a href="../faq5.html">ici</a> pour des informations &agrave; jour.

<p>
Si vous souhaitez contribuez &agrave; l'effort de traduction,
pri&egrave;re de consultez
<a href="../../fr/translation.html">la page de traduction</a>.

<!-- -->
<hr>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
<li><a href="#Flavors" >5.1 - Les Saveurs (&quot;Flavors&quot;)
    OpenBSD</a>
<li><a href= "#Why">5.2 - Pourquoi est-ce que j'ai besoin de faire un
    noyau sur mesure ?</a>
<li><a href= "#Options">5.3 - Options de configuration du noyau</a>
<li><a href= "#Building">5.4 - Construire votre propre noyau</a>
<li><a href= "#BootConfig">5.5 - Configuration au d&eacute;marrage</a>
<li><a href= "#VerboseBoot">5.6 - Avoir plus d'informations pendant le
    d&eacute;marrage</a>
<li><a href= "#config">5.7 - Utilisation de config(8) pour changer le
    binaire du noyau</a>
<li><a href="#buildprobs">5.8 - Probl&egrave;mes Usuels de Compilation
    </a>
   <ul>
   <li><a href="#sig11">5.8.1 - La compilation s'est
       arr&ecirc;t&eacute;e avec une erreur "Signal 11"</a>
   <li><a href="#snake">5.8.2 - "make build" &eacute;choue en
       g&eacute;n&eacute;rant un message "cannot open output file snake:
       is a directory"</a>
   </ul>
</ul>
<hr>
<br>


<a name="Flavors"></a>
<h2>5.1 - Les Saveurs (&quot;Flavors&quot;) OpenBSD</h2>
<!-- XXXversion - revise doodle -->
Il existe trois "saveurs" OpenBSD :
<ul>
<li><b>-release:</b> La version d'OpenBSD livr&eacute;e tous les six
       mois sur CD.
<li><b>-stable:</b> "release", plus les correctifs
       consid&eacute;r&eacute;s comme critiques pour la
       s&eacute;curit&eacute; et la fiabilit&eacute;.
<li><b>-current:</b> La version courante (ou de d&eacute;veloppement)
       d'OpenBSD, qui deviendra la prochaine "release". </ul>

Graphiquement, le d&eacute;veloppement de ces versions ressemble
&agrave; ceci :

<blockquote>
<pre>
       ,------o-----------o----X                    3.1 Stable
       |      .           .
       |      .    ,------o---------o----X          3.2 Stable
       |      .    |      .         .
       |      .    |      .    ,----o----------o--&gt; 3.3 Stable
       |      .    |      .    |    .          .
       |      .    |      .    |    .    ,-----o--&gt; 3.4 Stable
       |      .    |      .    |    .    |     .
       |      .    |      .    |    .    |     .
 --&gt;3.1Rel-----&gt;3.2Rel-----&gt;3.3Rel-----&gt;3.4Rel----&gt; Current 

          Temps ---&gt;
</pre>
</blockquote>

<p>
L'arborescence des sources est s&eacute;par&eacute;e en trois branches
tous les six mois : <i>-current</i>, <i>-release</i>, et <i>-stable</i>
-- <i>-release</i> devient un point gel&eacute; (une &quot;Balise&quot;)
dans l'historique de l'arborescence des sources - aucune modification
n'est apport&eacute;e &agrave; cette branche. Elle constitue ce qui
figure sur les <a href="../../orders.html">CDs</a> et les <a
href="../../fr/ftp.html">serveurs FTP </a>. <i>-Current</i> est la
branche qui re&ccedil;oit tous les travaux en cours, et devient la
prochaine <i>-release</i> d'OpenBSD.

<p>
La branche <i>-stable</i> (aussi connue sous le nom de "branche des
correctifs") est bas&eacute;e sur <i>-release</i>, et comme on peut le
constater, c'est une "branche" &agrave; partir de la trajectoire de
d&eacute;veloppement d'OpenBSD. Lorsque des correctifs importants sont
cr&eacute;es pour <i>-current</i>, ils sont port&eacute;s "en
arri&egrave;re" vers les branches <i>-stable</i>. Dans l'illustration
ci-dessus, les lignes verticales en pointill&eacute; sont des correctifs
de bogues incorpor&eacute;s aux branches <i>-stable</i>. Vous
remarquerez aussi dans l'exemple ci-dessus que la branche
<i>3.1-stable</i> a &eacute;t&eacute; supprim&eacute;e &agrave; la
sortie de <i>3.3-release</i>, et que la branche <i>3.2-stable</i> a
&eacute;t&eacute; supprim&eacute;e &agrave; la sortie de
<i>3.4-release</i> -- les anciennes versions sont typiquement
support&eacute;es durant deux "releases" au maximum. Le support
d'anciennes versions n&eacute;cessite des ressources et du temps, et
alors que nous pourrions vouloir plut&ocirc;t fournir un support continu
pour les anciennes versions, nous pr&eacute;f&eacute;rerions nous
concentrer sur les nouvelles fonctionnalit&eacute;s. La branche
<i>-stable</i> est, par conception, tr&egrave;s facile &agrave;
construire &agrave; partir de <i>-release</i> de la m&ecirc;me version
(i.e., en allant de <i>3.4-release</i> vers <i>3.4-stable</i>).

<p>
La branche <i>-stable</i> est <i>-release</i> plus les correctifs
list&eacute;s dans la <a href="../../fr/errata.html">page des errata</a>,
ainsi que quelques correctifs ne n&eacute;cessitant pas d'erratum.
Habituellement, le fonctionnement de <i>-stable</i> est le m&ecirc;me
que celui de <i>-release</i> sur laquelle elle est bas&eacute;e. Si les
<a href="http://www.openbsd.org/cgi-bin/man.cgi">pages du manuel</a>
doivent &ecirc;tre modifi&eacute;s, il est tr&egrave;s probable que ces
modifications ne feront pas partie de <i>-stable</i>. En d'autres
termes, le support de nouveaux p&eacute;riph&eacute;riques NE sera pas
ajout&eacute; &agrave; <i>-stable</i>, et le support de nouvelles
fonctionnalit&eacute;s sera tr&egrave;s rarement ajout&eacute; sauf si
c'est consid&eacute;r&eacute; comme tr&egrave;s important.

<p>
Attention : <i>-current</i> change tout le temps. Elle change
pratiquement toutes les minutes, et pourrait bien changer plusieurs fois
le temps de t&eacute;l&eacute;charger le code source. Comme
pr&eacute;c&eacute;demment indiqu&eacute;, aucune garantie n'est
donn&eacute;e quant &agrave; la compilation du syst&egrave;me ou
&agrave; son fonctionnement (bien entendu, nous esp&eacute;rons qu'il
fonctionne). Il est compl&egrave;tement possible et pas si rare
d'obtenir les sources <i>-current</i> et de voir leur compilation
&eacute;chouer et cinq minutes plus tard, il se pourrait que &ccedil;a
fonctionne correctement. <b>Si vous n'&ecirc;tes pas pr&ecirc;t &agrave;
g&eacute;rer ce type de situation, prenez vos distances de
<i>-current</i>.</b>

<p>
La plupart des utilisateurs devraient utiliser <i>-stable</i> ou
<i>-release</i>. Cela dit, plusieurs personnes utilisent <i>-current</i>
sur des syst&egrave;mes en production, et il est important que certaines
personnes fassent cela pour identifier des bogues et tester les
nouvelles fonctionnalit&eacute;s. Cependant, si vous ne savez pas
comment d&eacute;crire, diagnostiquer et g&eacute;rer proprement un
probl&egrave;me, ne vous dites pas (ou &agrave; quelqu'un d'autre) que
vous &ecirc;tre entrain d'"aider le projet" en utilisant
<i>-current</i>. "&Ccedil; ne marche pas !" n'est pas un <a
href="../../report.html#bugtypes">rapport de bogue utile</a>. "Les
changements r&eacute;cents dans le pilote pciide a bris&eacute; la
compatibilit&eacute; avec mon interface IDE bas&eacute;e sur Slugchip,
ci-joint le dmesg d'un syst&egrave;me fonctionnel et un syst&egrave;me
ne fonctionnant pas..." peut &ecirc;tre un rapport utile.

<p>
Des fois, les utilisateurs "normaux" veulent disposer des derniers
d&eacute;veloppements et utiliser <i>-current</i>. La raison la plus
commune de faire cela est que l'utilisateur poss&egrave;de un
p&eacute;riph&eacute;rique qui n'est pas support&eacute; par
<i>-release</i> (et donc, par <i>-stable</i> non plus), ou il souhaite
utiliser une nouvelle fonctionnalit&eacute; de <i>-current</i>. Dans ce
cas, soit l'utilisateur utilise <i>-current</i> ou n'utilise pas le
p&eacute;riph&eacute;rique, et utiliser <i>-current</i> est
peut-&ecirc;tre l'option la plus logique. Cependant, il ne faut pas
esp&eacute;rer que les d&eacute;veloppeurs vous tiennent la main.


<h3>Snapshots</h3>
Entre les versions formelles d'OpenBSD, des <i>snapshots</i> sont mis
&agrave; disposition sur les <a href="../../fr/ftp.html">sites FTP </a>.
Comme le nom l'indique, ce sont des images du code dans l'arborescence
&agrave; l'instant o&ugrave; le cr&eacute;ateur de l'image a pris une
copie du code pour une plate-forme donn&eacute;e. Il est &agrave; noter
que, pour certaines plates-formes, il peut s'&eacute;couler des jours
entiers avant que l'image soit compl&egrave;tement construite et mise
&agrave; disposition. Aucune garantie n'est donn&eacute;e quant au bon
fonctionnement ou &agrave; la possibilit&eacute; d'installer des
snapshots. Souvent, une modification qui a besoin d'&ecirc;tre
test&eacute;e peut enclencher le processus de cr&eacute;ation des
snapshots. Quelques plates-formes ont des snapshots construits
pratiquement tous les jours, d'autres en ont beaucoup moins
fr&eacute;quemment. Si vous souhaitez utiliser <i>-current</i>, un
snapshot r&eacute;cent est tout ce dont vous aurez besoin, et mettre
&agrave; jour un snapshot est g&eacute;n&eacute;ralement un bon point de
d&eacute;part avant de tenter de compiler <i>-current</i>.

<p>
Parfois, on demande s'il y a un moyen d'obtenir une copie exacte du code
qui a servi &agrave; construire un snapshot. La r&eacute;ponse est non.
Primo, il n'y a aucun int&eacute;r&ecirc;t. Secundo, les snapshots sont
construits selon le souhait des d&eacute;veloppeurs, lorsque le planning
le permet, et lorsque des ressources sont disponibles. Sur les
plates-formes rapides, il est possible de cr&eacute;er plusieurs
snapshots en un jour. Sur les plates-formes lentes, la cr&eacute;ation
d'un snapshot peut durer une semaine ou plus. Fournir des balises ou des
marques dans l'arborescence des sources pour chaque snapshot peut
s'av&eacute;rer peu pratique.

<h3>Garder Les Composants Synchronis&eacute;s</h3>
Il est important de comprendre qu'OpenBSD est un Syst&egrave;me
d'Exploitation, et il faut le prendre en tant que tel et non pas comme
un noyau entour&eacute; d'un ensemble d'outils. Vous devez vous assurer
que votre noyau, le "userland" (les utilitaires et fichiers
compl&eacute;tant le noyau) et l'arborescence des <a
href="../../fr/ports.html"><tt>ports</tt></a> sont synchronis&eacute;s,
autrement des choses d&eacute;sagr&eacute;ables peuvent arriver. Dit
autrement (vu que les gens continuent &agrave; commettre les m&ecirc;mes
erreurs), vous ne pouvez pas utiliser des <tt>ports</tt> tout neufs sur
un syst&egrave;me datant d'il y a un mois, ou reconstruire un noyau
&agrave; partir de <i>-current</i> et esp&eacute;rer qu'il fonctionne
avec un "userland" <i>-release</i>. Oui, cela veut dire que vous aurez
besoin de mettre &agrave; jour votre syst&egrave;me si vous voulez
utiliser un nouveau programme qui a a &eacute;t&eacute; rajout&eacute;
aujourd'hui &agrave; l'arborescence des ports. OpenBSD n'a
malheureusement que des ressources limit&eacute;es.

<p>
Il faut aussi comprendre que lors de la <a
href="../upgrade-minifaq.html">mise &agrave; jour des sources</a>, le
processus de mise &agrave; jour est uniquement support&eacute; <b>dans
une seule direction uniquement : de l'ancien au nouveau</b>, et de
<i>-stable</i> vers <i>-current</i>. Vous ne pouvez pas utiliser
<i>3.4-current</i> (ou un snapshot), puis d&eacute;cider que c'est trop
dangereux, et revenir vers <i>3.4-stable</i>. Vous ne pouvez compter que
sur vous-m&ecirc;me si vous choisissez un autre chemin que celui,
support&eacute;, consistant &agrave; r&eacute;installer votre
syst&egrave;me proprement. Vous ne devez esp&eacute;rer aucune aide de
la part de l'&eacute;quipe de d&eacute;veloppement OpenBSD.

<p>
Oui, cela veut dire que vous devez prendre le temps de
r&eacute;fl&eacute;chir avant d'utiliser <i>-current</i>.


<p>
<a name="Why"></a>
<h2>5.2 - Pourquoi est-ce que j'ai besoin de faire un noyau sur mesure
      ?</h2>

<p>
Il y a plusieurs raisons, bien que cette pratique s'adresse avant tout
&agrave; des utilisateurs poss&eacute;dant une bonne
compr&eacute;hension du syst&egrave;me.

<ul>
  <li>Votre ordinateur n'a que peu de RAM et vous voulez en
      pr&eacute;server le plus possible en enlevant les pilotes de
      p&eacute;riph&eacute;rique que vous n'utilisez pas.
  <li>Vous voulez supprimer des options mises par d&eacute;faut ou
      ajouter des options qui ne sont pas activ&eacute;es par
      d&eacute;faut.
  <li>Vous voulez activer les options exp&eacute;rimentales.
</ul>

<p>
La plupart du temps, vous n'aurez PAS besoin de compiler votre propre
noyau. Le noyau GENERIC sera largement suffisant. En fait, plusieurs
raisons font que vous ne voudrez pas cr&eacute;er votre propre noyau. La
raison principale est qu'il facile de faire des changements &agrave; la
configuration du noyau qui paraissent logiques mais qui ne fonctionnent
pas. Si quelque chose ne fonctionne pas correctement, essayer le noyau
GENERIC avant d'envoyer un rapport de bogue. Les d&eacute;veloppeurs
ignorent d'habitude les rapports de bogue relatifs &agrave; des noyaux
personnalis&eacute;s, sauf si le probl&egrave;me peut &ecirc;tre
reproduit avec un noyau GENERIC. Vous avez &eacute;t&eacute;
pr&eacute;venu.

<p>
<a name="Options"></a>
<h2>5.3 - Options de configuration du noyau</h2>
La cr&eacute;ation d'un noyau OpenBSD est contr&ocirc;l&eacute;e par le
biais de fichiers de configuration, se trouvant dans le
r&eacute;pertoire <tt>/usr/src/sys/arch/<i>&lt;arch&gt;</i>/conf/</tt>
par d&eacute;faut. Toutes les architectures poss&egrave;dent un fichier,
<tt>GENERIC</tt>, qui peut &ecirc;tre utilis&eacute; pour
g&eacute;n&eacute;rer un noyau OpenBSD standard pour une plate-forme
donn&eacute;e. Il peut aussi y avoir d'autres fichiers de configuration
qui peuvent &ecirc;tre utilis&eacute;s pour cr&eacute;er des noyaux avec
des objectifs diff&eacute;rents tels que la minimisation de
l'utilisation de la RAM, les stations de travail "diskless", etc.

<p>
Le fichier de configuration est trait&eacute; par 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>,
qui cr&eacute;e et peuple un r&eacute;pertoire de compilation
situ&eacute; sous <tt>../compile</tt>. Pour une installation typique, le
chemin absolu du r&eacute;pertoire serait situ&eacute; sous
<tt>/usr/src/sys/arch/&lt;<i>arch</i>&gt;/compile/</tt>. config(8) peut
aussi cr&eacute;er un fichier
 <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&amp;sektion=1">Makefile</a>,
et d'autres fichiers requis pour cr&eacute;er avec succ&egrave;s un
noyau.

<p>
Les options de configuration du noyau sont des options que vous ajoutez
&agrave; la configuration de votre noyau pour activer certaines
caract&eacute;ristiques dans celui-ci. Ceci vous permet d'avoir
exactement le support que vous voulez sans vous encombrer des pilotes
inutiles. Il y a une multitude d'options qui vous permettront de
personnaliser votre noyau. Veuillez consulter la page du manuel 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4
">options(4)</a> pour une liste compl&egrave;te des options.
Vous pouvez aussi consulter les fichiers d'exemples de configurations
qui sont disponibles pour votre architecture.

<p>
<b>L'ajout, la suppression, ou la modification d'options dans votre
noyau ne doivent &ecirc;tre effectu&eacute;s que si vous avez une bonne
raison pour le faire !</b> La seule configuration du noyau
support&eacute;e par l'&eacute;quipe OpenBSD est le noyau GENERIC, la
combinaison d'options figurant dans les fichiers
<tt>/usr/src/sys/arch/&lt;<i>arch</i>&gt;/conf/GENERIC</tt> et
<tt>/usr/src/sys/conf/GENERIC</tt> <i>tels que livr&eacute;s par
l'&eacute;quipe OpenBSD</i> (i.e. non &eacute;dit&eacute;s). Emettre un
rapport de bogues concernant un noyau personnalis&eacute; va dans la
plupart des cas se r&eacute;sumer &agrave; une retour vous demandant
d'essayer de reproduire le probl&egrave;me avec un noyau GENERIC. Les
options ne sont pas toutes compatibles entre elles, et plusieurs options
sont n&eacute;cessaires au bon fonctionnement du syst&egrave;me. Il n'y
a aucune garantie quant au fonctionnement d'un noyau personnalis&eacute;
que vous avez r&eacute;ussi &agrave; compiler.

<p>
Vous pouvez voir les fichiers de configuration sp&eacute;cifiques
&agrave; une plate-forme donn&eacute;e ici :

<ul>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/alpha/conf/">Fichiers de Configuration du Noyau alpha </a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/i386/conf/">Fichiers de Configuration du Noyau i386</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/macppc/conf/">Fichiers de Configuration du Noyau macppc</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc/conf/">Fichiers de Configuration du Noyau sparc</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc64/conf/">Fichiers de Configuration du Noyau sparc64</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/vax/conf/">Fichiers de Configuration du Noyau vax</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/hppa/conf/">Fichiers de Configuration du Noyau hppa</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/">Other Arch's</a>
</ul>

<p>
Si vous lisez attentivement ces fichiers vous verrez une ligne du
genre :
<pre>
     include "../../../conf/GENERIC"
</pre>
Cela signifie que l'on fait r&eacute;f&eacute;rence &agrave; un
autre fichier de configuration. Ce fichier comprend toutes les options
qui ne sont pas d&eacute;pendantes de l'architecture. Donc quand vous
cr&eacute;ez votre fichier de configuration, soyez s&ucirc;r de regarder
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/conf/GENERIC">
/sys/conf/GENERIC</a> pour voir ce que vous voulez. 

<p>
Toutes les options ci-dessous doivent &ecirc;tre plac&eacute;es dans le
fichier de configuration du noyau avec le format :
<blockquote>
<tt>option&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</tt><i>nom</i>
</blockquote>
Par exemple, pour utiliser l'option "DEBUG" dans le noyau, il faut
mettre la ligne suivante :
<pre>
     option      DEBUG
</pre>
Les options dans le noyau OpenBSD sont traduites en tant qu'options du
pr&eacute;processeur, donc une option telle que DEBUG compilerait les
sources avec l'option -DDEBUG. Ce qui est &eacute;quivalent &agrave;
placer un <tt>#define DEBUG</tt> &agrave; travers les sources du noyau.

<p>
Quelques fois, vous aurez peut-&ecirc;tre besoin de d&eacute;sactiver
une option pr&eacute;cedemment d&eacute;finie dans le fichier
"<tt>src/sys/conf/GENERIC</tt>" typiquement. Bien entendu, vous pouvez
modifier une copie de ce fichier, mais une meilleure m&eacute;thode
consiste &agrave; utiliser la clause <i>rmoption</i>. Par exemple, si
vous souhaitiez vraiment d&eacute;sactiver le d&eacute;bogueur
int&eacute;gr&eacute; au noyau (<i>non recommand&eacute; !</i>), vous
ajouteriez la ligne suivante : <pre> rmoption DDB </pre> &agrave; votre
fichier de configuration du noyau. <tt>option DDB</tt> est
d&eacute;finie dans <tt>src/sys/conf/GENERIC</tt>, mais la ligne
<tt>rmoption</tt> ci-dessus la d&eacute;sactive.

<p>
Encore une fois, veuillez consulter 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a>
pour plus d'informations concernant les sp&eacute;cificit&eacute;s de
ces options. Il est &agrave; noter que plusieurs options
poss&egrave;dent leurs propres pages de manuel -- il faut toujours lire
toutes les informations disponibles au sujet d'une option avant de
l'ajouter ou la supprimer de votre noyau.

<p> 
<a name="Building"></a>
<h2>5.4 - Construire votre propre noyau</h2>

<p>
Toutes les instructions pour cr&eacute;er votre noyau sur mesure sont
dans la page du manuel 
<a href=
"http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8"> 
afterboot(8)</a>.

<p>
Pour compiler votre noyau depuis le cdrom vous aurez tout d'abord besoin
d'avoir le code source. Ce dernier est disponible &agrave; partir du <a
href="../../orders.html">CD officiel</a> (disque 3) et &agrave; partir
des <a href="../../fr/ftp.html">sites FTP</a>. Cet exemple suppose que
le CD3 est mont&eacute; sur /mnt :

<blockquote>
<pre>
# <strong>cd /usr/src</strong>
# <strong>tar xvzf /mnt/src.tar.gz</strong>
</pre>
</blockquote>

<b>Remarque :</b> Si vous effectuez un t&eacute;l&eacute;chargement
&agrave; partir des serveurs FTP, vous trouverez DEUX fichiers :
<i>src.tar.gz</i> et <i>sys.tar.gz</i>. Le premier correspond
&agrave; "userland" -- tout except&eacute; le noyau, le second est le
code source du noyau. T&eacute;l&eacute;chargez et effectuez une
extraction des deux comme expliqu&eacute; ci-dessus vu que pour la
plupart des utilisations, vous aurez besoin des deux. Sur le CD-ROM, ils
sont combin&eacute;s dans un seul fichier.

<p>
Maintenant, pour cr&eacute;er votre noyau personnalis&eacute; il est
plus facile de partir du noyau GENERIC. Ce dernier est situ&eacute; sous
<tt>/usr/src/sys/arch/$ARCH/conf/GENERIC</tt>, o&ugrave; $ARCH est votre
architecture. Il y a d'autres configurations en exemples dans le
r&eacute;pertoire. Voici deux exemples vous montrant comment compiler
votre noyau. Le premier exemple permet de compiler votre noyau avec des
sources en lecture seule. Le second correspond &agrave; des sources
accessibles en &eacute;criture.

<blockquote> 
<pre>
# <strong>cd /somewhere</strong>
# <strong>cp /usr/src/sys/arch/$ARCH/conf/SOMEFILE .</strong>
# <strong>vi SOMEFILE</strong>   <i>(pour effectuer les changements voulus)</i>
# <strong>config -s /usr/src/sys -b . SOMEFILE</strong>
</pre>
suivi par :

<pre>
    # <strong>make depend</strong>
         <b><i>- OU -</i></b>
    # <strong>make clean</strong>
# <strong>make</strong>
</pre>
</blockquote>

Vous devez ex&eacute;cuter '<tt>make depend</tt>' lorsque vous effectuez
n'importe quelle modification &agrave; votre arborescence des sources (y
compris des mises &agrave; jour et des correctifs) (en d'autres termes,
pratiquement toujours, sauf si vous avez besoin d'ex&eacute;cuter
'<tt>make clean</tt>').

<p>
Si vous avez effectu&eacute; des modifications aux options de
configuration de votre noyau, et/ou effectu&eacute; des modifications
majeures &agrave; votre arborescence des sources, vous devriez utiliser
'<tt>make clean</tt>' au lieu de '<tt>made depend</tt>'. Il est &agrave;
noter qu'il est toujours de bon ton de faire un 'make clean', m&ecirc;me
si &ccedil;a peut aboutir &agrave; des temps de compilation plus longs,
vu que plus de choses ont besoin d'&ecirc;tre reconstruites.

<p>
Pour compiler un noyau avec des sources accessibles en &eacute;criture
il faut effectuer les actions suivantes :

<blockquote>
<tt>
# <strong>cd sys/arch/$ARCH/conf</strong><br>
# <strong>vi SOMEFILE</strong><i> (pour effectuer tous les changements voulus)</i><br>
# <strong>config SOMEFILE</strong><i> (plus de d&eacute;tails sur cette
# op&eacute;ration sont disponibles ici :
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>)</i><br>
# <strong>cd ../compile/SOMEFILE</strong><br>
# <strong>make</strong> <br>
</tt>
</blockquote>

<p>
O&ugrave; $ARCH est l'architecture que vous utilisez (par exemple i386).
Vous pouvez aussi faire un <strong>make depend</strong> pour
cr&eacute;er les d&eacute;pendances pour la prochaine compilation de
votre noyau.

<p>
Pour d&eacute;placer votre noyau &agrave; sa destination.

<blockquote>
<pre>
# <strong>cp /bsd /bsd.old</strong>
# <strong>cp /sys/arch/$ARCH/compile/SOMEFILE/bsd /bsd</strong>
</pre>
</blockquote>

Pour d&eacute;marrer avec votre ancien noyau au d&eacute;marrage, il
suffit juste de faire ceci

<blockquote>
<pre>
boot&gt; <strong>bsd.old</strong>
</pre>
</blockquote>

votre ancien noyau sera alors charg&eacute; &agrave; la place de /bsd.

<p>
Parfois quand vous installez un nouveau noyau, il vous faudra
installer de nouveaux blocs de d&eacute;marrage. Pour ce faire, lisez <a
href="../faq14.html#InstBoot">FAQ 14, Installation des Bootblocks</a>, qui
vous donnera toutes les informations sur le bootloader OpenBSD.

<p>
<a name="BootConfig"></a>
<h2>5.5 - Configuration au d&eacute;marrage</h2>

<p>
Parfois lorsque vous d&eacute;marrez votre syst&egrave;me vous
remarquerez que votre noyau trouve vos p&eacute;riph&eacute;riques mais
&agrave; la mauvaise IRQ. Et avez-vous imm&eacute;diatement besoin de ce
p&eacute;riph&eacute;rique. Sans recompiler votre noyau vous pouvez
utiliser la configuration au d&eacute;marrage de celui-ci. Cela
permettra de corriger votre probl&egrave;me pour cette fois et
uniquement pour cette fois. Si vous red&eacute;marrez le syst&egrave;me
il faudra recommencer la proc&eacute;dure. Il s'agit donc d'une
m&eacute;thode temporaire. Le probl&egrave;me devra &ecirc;tre
corrig&eacute; en recompilant votre noyau. De plus votre noyau &agrave;
besoin de l'<strong>option BOOT_CONFIG</strong> dans la configuration du
noyau. Le noyau GENERIC poss&egrave;de cette option.

<p>
Une grande partie de ce document peut-&ecirc;tre trouv&eacute; dans la
page du manuel
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&amp;sektion=8">boot_config(8)</a>.

<p>
Pour d&eacute;marrer avec UKC (User Kernel Config), il faut
sp&eacute;cifier l'option -c au d&eacute;marrage.

<blockquote><pre>
boot&gt; <strong>boot hd0a:/bsd -c</strong>
</pre></blockquote>

O&ugrave; n'importe quel autre noyau que vous voulez d&eacute;marrer.
L'invite de commandes UKC appara&icirc;tra. De l&agrave; vous pourrez
sp&eacute;cifier au noyau les p&eacute;riph&eacute;riques que vous
d&eacute;sirez modifier, ceux que vous voulez activer ou
d&eacute;sactiver.

<p>
Voici un liste des commandes les plus utilis&eacute;es dans UKC.

<ul>
<li><tt>add <strong>device</strong></tt> - Ajoute un
    p&eacute;riph&eacute;rique en en copiant un autre
<li><tt>change <strong>devno | device </strong></tt> - Modifie un ou
    plusieurs p&eacute;riph&eacute;riques
<li><tt>disable <strong>devno | device </strong></tt> - D&eacute;sactive
    un ou plusieurs p&eacute;riph&eacute;riques
<li><tt>enable <strong>devno | device </strong></tt> - Active un ou
    plusieurs p&eacute;riph&eacute;riques
<li><tt>find <strong>devno | device </strong></tt> - Trouver un ou
    plusieurs p&eacute;riph&eacute;riques
<li><tt>help</tt> - Rapide sommaire de ces commandes
<li><tt>list</tt> - Liste TOUS les p&eacute;riph&eacute;riques connus
<li><tt>exit/quit</tt> - Continue le d&eacute;marrage
<li><tt>show <strong>[attr [val]]</strong></tt> - Montre les
    p&eacute;riph&eacute;riques avec un attribut et une valeur
    sp&eacute;cifi&eacute;e optionnelle 
</ul>

<p>
Une fois que votre p&eacute;riph&eacute;rique est configur&eacute;,
utilisez quit ou exit pour continuer &agrave; d&eacute;marrer.
Apr&egrave;s avoir fait ceci, vous devriez corriger la configuration de
votre noyau et en compiler un nouveau. Voir <a
href="faq5.html#Building">Construire votre propre noyau</a> pour plus de
renseignements.

<p>
<a name="VerboseBoot"></a>
<h2>5.6 - Avoir plus d'informations pendant le d&eacute;marrage</h2>

Obtenir plus d'informations pendant le d&eacute;marrage peut-&ecirc;tre
tr&egrave;s pratique lorsque vous essayez de r&eacute;gler certains
probl&egrave;mes lors de celui-ci. Si vous avez un probl&egrave;me et
que vous aimeriez avoir plus d'informations, red&eacute;marrez votre
machine. Quand vous obtenez l'invite &quot;boot&gt;quot; d&eacute;marrez
avec l'option -c. L'invite UKC&gt; appara&icirc;tra et ensuite :

<blockquote><pre>
UKC&gt; <strong>verbose</strong>
autoconf verbose enabled
UKC&gt; <strong>quit</strong>
</pre></blockquote>

<p>
Vous obtiendrez un d&eacute;marrage extr&ecirc;mement verbeux.

<p>
<a name="config"></a>
<h2>5.7 - Utilisation de config(8) pour changer le binaire du noyau</h2>

<p>
<p> Les options <b>-e</b> et <b>-u</b> de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>
peuvent &ecirc;tre tr&egrave;s utiles et vous &eacute;vitent de perdre
du temps &agrave; recompiler votre noyau. Le drapeau <b>-e</b> vous
permet de rentrer en configuration UKC alors que le syst&egrave;me
fonctionne. Les changements prendront effets au prochain
red&eacute;marrage. Le drapeau <b>-u</b> permet de voir si des
changements ont &eacute;t&eacute; effectu&eacute;s au noyau pendant le
d&eacute;marrage, signifiant que vous avez utilis&eacute; <b>boot -c</b>
pour entrer en configuration UKC.

<p>
Les exemples suivants montrent la d&eacute;sactivation des
p&eacute;riph&eacute;riques ep* dans le noyau. Pour plus de
s&eacute;curit&eacute;, il est pr&eacute;f&eacute;rable d'utiliser
l'option <b>-o</b> qui &eacute;crira les changements dans un fichier
sp&eacute;cifi&eacute;. Par exemple : <strong>config -e -o bsd.new
/bsd</strong> &eacute;crira les changements dans bsd.new. Les exemples
n'utilisent pas l'option <b>-o</b>, mais les changements sont
ignor&eacute;s et non &eacute;crit dans le binaire du noyau. Pour plus
d'informations sur les messages d'erreur et d'avertissement, lire la
page du manuel

<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>
.

<blockquote><pre>
$ <strong>sudo config -e /bsd</strong>
OpenBSD 3.4 (GENERIC) #18: Wed Sep 17 03:34:47 MST 2003
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
warning: no output file specified
Enter 'help' for information
ukc&gt; ?
        help                            Command help list
        add         dev                 Add a device
        base        8|10|16             Base on large numbers
        change      devno|dev           Change device
        disable     attr val|devno|dev  Disable device
        enable      attr val|devno|dev  Enable device
        find        devno|dev           Find device
        list                            List configuration
        lines       count               # of lines per page
        show        [attr [val]]        Show attribute
        exit                            Exit, without saving changes
        quit                            Quit, saving current changes
        timezone    [mins [dst]]        Show/change timezone
        nmbclust    [number]            Show/change NMBCLUSTERS
        cachepct    [number]            Show/change BUFCACHEPERCENT
        nkmempg     [number]            Show/change NKMEMPAGES
        shmseg      [number]            Show/change SHMSEG
        shmmaxpgs   [number]            Show/change SHMMAXPGS
ukc&gt; <strong>list</strong>
  0 audio* at sb0|sb*|gus0|pas0|sp0|ess*|wss0|wss*|ym*|eap*|eso*|sv*|neo*|cmpci*
|clcs*|clct*|auich*|autri*|auvia*|fms*|uaudio*|maestro*|esa*|yds*|emu* flags 0x0
  1 midi* at sb0|sb*|opl*|opl*|opl*|opl*|ym*|mpu*|autri* flags 0x0
  2 nsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  3 nsphyter* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|
vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep
*|ep*|ep* phy -1 flags 0x0
  4 qsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  5 inphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  6 iophy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  7 eephy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  8 exphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
[...snip...]
ukc&gt; <strong>disable ep</strong>
 67 ep0 disabled
 68 ep* disabled
 69 ep* disabled
155 ep0 disabled
156 ep0 disabled
157 ep* disabled
158 ep* disabled
210 ep* disabled
ukc&gt; <strong>quit</strong>
not forced
</pre></blockquote>

<p>
Dans l'exemple ci-dessus, tous les p&eacute;riph&eacute;riques ep* sont
d&eacute;sactiv&eacute;s du noyau et ne seront donc pas test&eacute;s.
Dans certaines situations o&ugrave; vous aurez effectu&eacute; ces
changements au d&eacute;marrage avec UKC et <b>boot -c</b>, il vous
faudra les rendre d&eacute;finitifs. Pour ce faire, il faudra utiliser
l'option <b>-u</b>. Dans l'exemple suivant, l'ordinateur a
&eacute;t&eacute; d&eacute;marr&eacute; avec UKC et les
p&eacute;riph&eacute;riques wi(4) sont d&eacute;sactiv&eacute;s. Ètant
donn&eacute; que les changements fait par boot -c ne sont pas
permanents, ceux-ci doivent &ecirc;tre &eacute;crits sur le disque. Cet
exemple montre comment &eacute;crire les changements effectu&eacute;s
par boot -c dans un nouveau binaire noyau bsd.new.

<blockquote><pre>
$ <strong>sudo config -e -u -o bsd.new /bsd</strong>
OpenBSD 3.3 (GENERIC) #44: Sat Mar 29 13:22:05 MST 2003
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
Processing history...
105 wi* disabled
106 wi* disabled
Enter 'help' for information
ukc&gt; <strong>quit</strong>
</pre></blockquote>

<a name="buildprobs"></a>
<h2>5.8 - Probl&egrave;mes Usuels de Compilation</h2>

<a name="sig11"></a>
<h3>5.8.1 - La compilation s'est arr&ecirc;t&eacute;e avec une erreur
        "Signal 11"</h3>

<p>
La compilation d'OpenBSD et d'autres programmes &agrave; partir des
sources est une t&acirc;che qui sollicite le mat&eacute;riel plus que la
plupart des autres op&eacute;rations, faisant un usage intensif du CPU,
du disque et de la m&eacute;moire. Par cons&eacute;quence, si votre
mat&eacute;riel a des probl&egrave;mes, ces derniers appara&icirc;tront
plus facilement durant une compilation. Les d&eacute;faillances "Signal
11" sont <tt>typiquement</tt> caus&eacute;es par des probl&egrave;mes
mat&eacute;riel, et la plupart du temps &agrave; cause de
probl&egrave;mes de m&eacute;moirei. Mais ces d&eacute;faillances
peuvent aussi caus&eacute;es par le CPU, la carte m&egrave;re, ou des
probl&egrave;mes de surchauffe. Votre syst&egrave;me peut d'ailleurs
&ecirc;tre stable la plupart du temps et conna&icirc;tre des
d&eacute;faillances lors de la compilation de programmes.

<p>
Il est recommand&eacute; de r&eacute;parer ou remplacer les composants
&agrave; l'origine des d&eacute;faillances; les probl&egrave;mes pouvant
se manifester sous d'autres formes plus tard. Si vous avez du
mat&eacute;riel que vous souhaitez utiliser et qui ne vous pose aucun
probl&egrave;me, installez simplement une snapshot ou une "release".

<p>
Pour plus d'informations, consultez la 
<a href="http://www.bitwizard.nl/sig11/">Faq Sig11</a>.

<a name="snake"></a>
<h3>5.8.2 - "make build" &eacute;choue en g&eacute;n&eacute;rant un
        message "cannot open output file snake: is a directory"</h3>

Ceci est le r&eacute;sultat de deux erreurs s&eacute;par&eacute;es :
<ul>
<li><b>Vous n'avez pas proprement r&eacute;cup&eacute;r&eacute; ou mis
       &agrave; jour votre arborescence CVS.</b> Lorsque vous effectuez
       une op&eacute;ration "CVS checkout", vous devez utiliser l'option
       "<tt>-P</tt>", et lorsque vous mettez &agrave; jour votre
       arborescence des sources &agrave; partir de CVS, vous devez
       utiliser les options "<tt>-Pd</tt>" de
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&amp;sektion=1"
>cvs(1)</a>,
tel que c'est document&eacute; dans le 
<a href="../../fr/anoncvs.html">guide anoncvs </a>, l'
<a href="../upgrade-minifaq.html">upgrade-minifaq</a> et la 
<a href="../faq8.html#CVS">FAQ</a>.  Ces options s'assurent que les
nouveaux r&eacute;pertoires sont ajout&eacute;s et supprim&eacute;s de
l'arborescence suivant l'&eacute;volution d'OpenBSD.

<li><b>Vous n'avez pas correctement cr&eacute;e le r&eacute;pertoire
       <tt>obj</tt> avant de commencer la compilation.</b> La
       compilation de l'arborescence sans r&eacute;pertoire
       <tt>/usr/obj</tt> n'est pas support&eacute;e.

</ul>
Il est important de suivre soigneusement les instructions lors de  
<a href="../../fr/anoncvs.html">l'obtention et de la mise &agrave; jour</a> 
de votre arborescence des sources et lors de la
<a href="../upgrade-minifaq.html">compilation</a>de votre arborescence.

<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href= "../faq4.html">[Section 4 - Guide d'Installation]</a>
<a href= "../faq6.html">[Section 6 - Mise en place du r&eacute;seau]</a>
</font>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[back]"></a>
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq5.html,v 1.90 ]<br>
$Translation: faq5.html,v 1.30 2004/02/07 01:21:19 saad Exp $<br>
$OpenBSD: faq5.html,v 1.24 2004/02/08 11:59:35 jufi Exp $ 
</small> 

</body>
</html>
