<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>5 - Construire le Syst&egrave;me &agrave; partir des
Sources</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2002 by OpenBSD.">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<!-- Passes validator.w3.org.  Please keep it this way -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">5 - Construire le Syst&egrave;me &agrave;
    partir des Sources</font></h2>
<hr>

<p>
<h3>Table des mati&egrave;res</h3>
<ul>
<li><a href="#Flavors" >5.1 - Les Saveurs (&quot;Flavors&quot;)
    OpenBSD</a>
<li><a href= "#Why">5.2 - Pourquoi est-ce que j'ai besoin de faire un
    noyau sur mesure ?</a>
<li><a href= "#Options">5.3 - Options de configuration du noyau</a>
<li><a href= "#Building">5.4 - Construire votre propre noyau</a>
<li><a href= "#BootConfig">5.5 - Configuration au d&eacute;marrage</a>
<li><a href= "#VerboseBoot">5.6 - Avoir plus d'informations pendant le
    d&eacute;marrage</a>
<li><a href= "#config">5.7 - Utilisation de config(8) pour changer le
    binaire du noyau</a>
</ul>
<hr>
<br>

<a name="Flavors"></a>
<h2>5.1 - Les Saveurs (&quot;Flavors&quot;) OpenBSD</h2>
<!-- XXXversion - revise doodle -->
Il existe trois "saveurs" OpenBSD :
<ul>
<li><b>-release:</b> La version d'OpenBSD livr&eacute;e tous les six
       mois sur CD.
<li><b>-stable:</b> "release", plus les correctifs
       consid&eacute;r&eacute;s comme critiques pour la
       s&eacute;curit&eacute; et la fiabilit&eacute;.
<li><b>-current:</b> La version courante (ou de d&eacute;veloppement)
       d'OpenBSD, qui deviendra la prochaine "release". </ul>

Graphiquement, le d&eacute;veloppement de ces versions ressemble
&agrave; ceci :

<blockquote>
<pre>
       ,------o-----------o----X                    3.0 Stable
       |      .           .
       |      .    ,------o---------o----X          3.1 Stable
       |      .    |      .         .
       |      .    |      .    ,----o----------o--&gt; 3.2 Stable
       |      .    |      .    |    .          .
       |      .    |      .    |    .    ,-----o--&gt; 3.3 Stable
       |      .    |      .    |    .    |     .
       |      .    |      .    |    .    |     .
 --&gt;3.0Rel-----&gt;3.1Rel-----&gt;3.2Rel-----&gt;3.3Rel----&gt; Current 

          Temps ---&gt;
</pre>
</blockquote>

<p>
L'arborescence des sources est s&eacute;par&eacute;e en trois branches
tous les six mois : <i>-current</i>, <i>-release</i>, et <i>-stable</i>
-- <i>-release</i> devient un point gel&eacute; (une &quot;Balise&quot;)
dans l'historique de l'arborescence des sources - aucune modification
n'est apport&eacute;e &agrave; cette branche. Elle constitue ce qui
figure sur les <a href="../../orders.html">CDs</a> et les <a
href="../../fr/ftp.html">serveurs FTP </a>. <i>-Current</i> est la
branche qui re&ccedil;oit tous les travaux en cours, et devient la
prochaine <i>-release</i> d'OpenBSD.

<p>
La branche <i>-stable</i> (aussi connue sous le nom de "branche des
correctifs") est bas&eacute;e sur <i>-release</i>, et comme on peut le
constater, c'est une "branche" &agrave; partir de la trajectoire de
d&eacute;veloppement d'OpenBSD. Lorsque des correctifs importants sont
cr&eacute;es pour <i>-current</i>, ils sont port&eacute;s "en
arri&egrave;re" vers les branches <i>-stable</i>. Dans l'illustration
ci-dessus, les lignes verticales en pointill&eacute; sont des correctifs
de bogues incorpor&eacute;s aux branches <i>-stable</i>. Vous
remarquerez aussi dans l'exemple ci-dessus que la branche
<i>3.0-stable</i> a &eacute;t&eacute; supprim&eacute;e &agrave; la
sortie de <i>3.2-release</i>, et que la branche <i>3.1-stable</i> a
&eacute;t&eacute; supprim&eacute;e &agrave; la sortie de
<i>3.3-release</i> -- les anciennes versions sont typiquement
support&eacute;es durant deux "releases" au maximum. Le support
d'anciennes versions n&eacute;cessite des ressources et du temps, et
alors que nous pourrions vouloir plut&ocirc;t fournir un support continu
pour les anciennes versions, nous pr&eacute;f&eacute;rerions nous
concentrer sur les nouvelles fonctionnalit&eacute;s. La branche
<i>-stable</i> est, par conception, tr&egrave;s facile &agrave;
construire &agrave; partir de <i>-release</i> de la m&ecirc;me version
(i.e., en allant de <i>3.3-release</i> vers <i>3.3-stable</i>).

<p>
La branche <i>-stable</i> est <i>-release</i> plus les correctifs
list&eacute;s dans la <a href="../fr/errata.html">page des errata</a>,
ainsi que quelques correctifs ne n&eacute;cessitant pas d'erratum.
Habituellement, le fonctionnement de <i>-stable</i> est le m&ecirc;me
que celui de <i>-release</i> sur laquelle elle est bas&eacute;e. Si les
<a href="http://www.openbsd.org/cgi-bin/man.cgi">pages du manuel</a>
doivent &ecirc;tre modifi&eacute;s, il est tr&egrave;s probable que ces
modifications ne feront pas partie de <i>-stable</i>. En d'autres
termes, le support de nouveaux p&eacute;riph&eacute;riques NE sera pas
ajout&eacute; &agrave; <i>-stable</i>, et le support de nouvelles
fonctionnalit&eacute;s sera tr&egrave;s rarement ajout&eacute; sauf si
c'est consid&eacute;r&eacute; comme tr&egrave;s important.

<p>
Attention : <i>-current</i> change tout le temps. Elle change
pratiquement toutes les minutes, et pourrait bien changer plusieurs fois
le temps de t&eacute;l&eacute;charger le code source. Comme
pr&eacute;c&eacute;demment indiqu&eacute;, aucune garantie n'est
donn&eacute;e quant &agrave; la compilation du syst&egrave;me ou
&agrave; son fonctionnement (bien entendu, nous esp&eacute;rons qu'il
fonctionne). Il est compl&egrave;tement possible et pas si rare
d'obtenir les sources <i>-current</i> et de voir leur compilation
&eacute;chouer et cinq minutes plus tard, il se pourrait que &ccedil;a
fonctionne correctement. <b>Si vous n'&ecirc;tes pas pr&ecirc;t &agrave;
g&eacute;rer ce type de situation, prenez vos distances de
<i>-current</i>.</b>

<p>
La plupart des utilisateurs devraient utiliser <i>-stable</i> ou
<i>-release</i>. Cela dit, plusieurs personnes utilisent <i>-current</i>
sur des syst&egrave;mes en production, et il est important que certaines
personnes fassent cela pour identifier des bogues et tester les
nouvelles fonctionnalit&eacute;s. Cependant, si vous ne savez pas
comment d&eacute;crire, diagnostiquer et g&eacute;rer proprement un
probl&egrave;me, ne vous dites pas (ou &agrave; quelqu'un d'autre) que
vous &ecirc;tre entrain d'"aider le projet" en utilisant
<i>-current</i>. "&Ccedil; ne marche pas !" n'est pas un <a
href="../../report.html#bugtypes">rapport de bogue utile</a>. "Les
changements r&eacute;cents dans le pilote pciide a bris&eacute; la
compatibilit&eacute; avec mon interface IDE bas&eacute;e sur Slugchip,
ci-joint le dmesg d'un syst&egrave;me fonctionnel et un syst&egrave;me
ne fonctionnant pas..." peut &ecirc;tre un rapport utile.

<p>
Des fois, les utilisateurs "normaux" veulent disposer des derniers
d&eacute;veloppements et utiliser <i>-current</i>. La raison la plus
commune de faire cela est que l'utilisateur poss&egrave;de un
p&eacute;riph&eacute;rique qui n'est pas support&eacute; par
<i>-release</i> (et donc, par <i>-stable</i> non plus), ou il souhaite
utiliser une nouvelle fonctionnalit&eacute; de <i>-current</i>. Dans ce
cas, soit l'utilisateur utilise <i>-current</i> ou n'utilise pas le
p&eacute;riph&eacute;rique, et utiliser <i>-current</i> est
peut-&ecirc;tre l'option la plus logique. Cependant, il ne faut pas
esp&eacute;rer que les d&eacute;veloppeurs vous tiennent la main.


<h3>Snapshots</h3>
Entre les versions formelles d'OpenBSD, des <i>snapshots</i> sont mis
&agrave; disposition sur les <a href="../../fr/ftp.html">sites FTP </a>.
Comme le nom l'indique, ce sont des images du code dans l'arborescence
&agrave; l'instant o&ugrave; le cr&eacute;ateur de l'image a pris une
copie du code pour une plate-forme donn&eacute;e. Il est &agrave; noter
que, pour certaines plates-formes, il peut s'&eacute;couler des jours
entiers avant que l'image soit compl&egrave;tement construite et mise
&agrave; disposition. Aucune garantie n'est donn&eacute;e quant au bon
fonctionnement ou &agrave; la possibilit&eacute; d'installer des
snapshots. Souvent, une modification qui a besoin d'&ecirc;tre
test&eacute;e peut enclencher le processus de cr&eacute;ation des
snapshots. Quelques plates-formes ont des snapshots construits
pratiquement tous les jours, d'autres en ont beaucoup moins
fr&eacute;quemment. Si vous souhaitez utiliser <i>-current</i>, un
snapshot r&eacute;cent est tout ce dont vous aurez besoin, et mettre
&agrave; jour un snapshot est g&eacute;n&eacute;ralement un bon point de
d&eacute;part avant de tenter de compiler <i>-current</i>.

<p>
Parfois, on demande s'il y a un moyen d'obtenir une copie exacte du code
qui a servi &agrave; construire un snapshot. La r&eacute;ponse est non.
Primo, il n'y a aucun int&eacute;r&ecirc;t. Secundo, les snapshots sont
construits selon le souhait des d&eacute;veloppeurs, lorsque le planning
le permet, et lorsque des ressources sont disponibles. Sur les
plates-formes rapides, il est possible de cr&eacute;er plusieurs
snapshots en un jour. Sur les plates-formes lentes, la cr&eacute;ation
d'un snapshot peut durer une semaine ou plus. Fournir des balises ou des
marques dans l'arborescence des sources pour chaque snapshot peut
s'av&eacute;rer peu pratique.

<h3>Garder Les Composants Synchronis&eacute;s</h3>
Il est important de comprendre qu'OpenBSD est un Syst&egrave;me
d'Exploitation, et il faut le prendre en tant que tel et non pas comme
un noyau entour&eacute; d'un ensemble d'outils. Vous devez vous assurer
que votre noyau, le "userland" (les utilitaires et fichiers
compl&eacute;tant le noyau) et l'arborescence des <a
href="../../ports.html"><tt>ports</tt></a> sont synchronis&eacute;s,
autrement des choses d&eacute;sagr&eacute;ables peuvent arriver. Dit
autrement (vu que les gens continuent &agrave; commettre les m&ecirc;mes
erreurs), vous ne pouvez pas utiliser des <tt>ports</tt> tout neufs sur
un syst&egrave;me datant d'il y a un mois, ou reconstruire un noyau
&agrave; partir de <i>-current</i> et esp&eacute;rer qu'il fonctionne
avec un "userland" <i>-release</i>. Oui, cela veut dire que vous aurez
besoin de mettre &agrave; jour votre syst&egrave;me si vous voulez
utiliser un nouveau programme qui a a &eacute;t&eacute; rajout&eacute;
aujourd'hui &agrave; l'arborescence des ports. OpenBSD n'a
malheureusement que des ressources limit&eacute;es.

<p>
Il faut aussi comprendre que lors de la <a
href="../upgrade-minifaq.html">mise &agrave; jour des sources</a>, le
processus de mise &agrave; jour est uniquement support&eacute; <b>dans
une seule direction uniquement : de l'ancien au nouveau</b>, et de
<i>-stable</i> vers <i>-current</i>. Vous ne pouvez pas utiliser
<i>3.3-current</i> (ou un snapshot), puis d&eacute;cider que c'est trop
dangereux, et revenir vers <i>3.3-stable</i>. Vous ne pouvez compter que
sur vous-m&ecirc;me si vous choisissez un autre chemin que celui,
support&eacute;, consistant &agrave; r&eacute;installer votre
syst&egrave;me proprement. Vous ne devez esp&eacute;rer aucune aide de
la part de l'&eacute;quipe de d&eacute;veloppement OpenBSD.

<p>
Oui, cela veut dire que vous devez prendre le temps de
r&eacute;fl&eacute;chir avant d'utiliser <i>-current</i>.


<p>
<a name= "Why"></a>
<a name= "5.2"></a>
<h2>5.2 - Pourquoi est-ce que j'ai besoin de faire un noyau sur mesure
      ?</h2>

<p>
Il y a plusieurs raisons, bien que cette pratique s'adresse avant tout
&agrave; des utilisateurs poss&eacute;dant une bonne
compr&eacute;hension du syst&egrave;me

<ul>
  <li>Votre ordinateur n'a que peu de RAM et vous voulez en
      pr&eacute;server le plus possible en enlevant les pilotes de
      p&eacute;riph&eacute;rique que vous n'utilisez pas.
  <li>Vous voulez supprimer des options mises par d&eacute;faut ou
      ajouter des options qui ne sont pas activ&eacute;es par
      d&eacute;faut.
  <li>Vous voulez activer les options exp&eacute;rimentales.
</ul>

<p>
La plupart du temps, vous n'aurez PAS besoin de compiler votre propre
noyau. Le noyau GENERIC sera largement suffisant. En fait, plusieurs
raisons font que vous ne voudrez pas cr&eacute;er votre propre noyau. La
raison principale est qu'il facile de faire des changements &agrave; la
configuration du noyau qui paraissent logiques mais qui ne fonctionnent
pas. Si quelque chose ne fonctionne pas correctement, essayer le noyau
GENERIC avant d'envoyer un rapport de bogue. Les d&eacute;veloppeurs
ignorent d'habitude les rapports de bogue relatifs &agrave; des noyaux
personnalis&eacute;s, sauf si le probl&egrave;me peut &ecirc;tre
reproduit avec un noyau GENERIC. Vous avez &eacute;t&eacute;
pr&eacute;venu.

<p>
<a name= "Options"></a>
<a name= "5.3"></a>
<h2>5.3 - Options de configuration du noyau</h2>

<p>
Les options de configuration du noyau sont des options que vous ajoutez
&agrave; la configuration de votre noyau pour activer certaines
caract&eacute;ristiques dans celui-ci. Ceci vous permet d'avoir
exactement le support que vous voulez sans vous encombrer des pilotes
inutiles. Il y a une multitude d'options qui vous permettront de
personnaliser votre noyau. Veuillez consulter la page du manuel <a href
="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4
">options(4)</a> pour une liste compl&egrave;te des options.
Vous pouvez aussi consulter les fichiers d'exemples de configurations
qui sont disponibles pour votre architecture.

<p>
Toutes les options du noyau n'ont pas &eacute;t&eacute; test&eacute;es
au point de vue compatibilit&eacute; avec les autres options. Ne pas
activer une option du noyau &agrave; moins d'avoir une bonne raison de
le faire ! La configuration noyau qui est la plus test&eacute;e est
GENERIC. Il s'agit g&eacute;n&eacute;ralement d'une combinaison des
options des fichiers <tt>/usr/src/sys/arch/&lt;votre
architecture&gt;/conf/GENERIC</tt> et
<tt>/usr/src/sys/conf/GENERIC</tt>.

<p>
<ul>
<li><a href=
"http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/alpha/conf/">
Fichiers de configuration du noyau Alpha</a>
<li><a href=
"http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/i386/conf/">
Fichiers de configuration du noyau i386</a>
<li><a
href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/macppc/conf/">
Fichiers de configuration du noyau macppc</a>
<li><a href=
"http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc/conf/">
Fichiers de configuration du noyau sparc</a>
<li><a href=
"http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc64/conf/"> 
Fichiers de configuration du noyau sparc64</a> 
<li><a href=
"http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/vax/conf/">
Fichiers de configuration du noyau vax </a>
<li><a href=
"http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/">Autres
architectures</a> 
</ul>

<p>
Si vous lisez attentivement ces fichiers vous verrez une ligne du
genre :<br>
<strong>include "../../../conf/GENERIC"</strong><br>
Cela signifie que l'on <i>fait</i> r&eacute;f&eacute;rence &agrave; un
autre fichier de configuration. Ce fichier comprend toutes les options
qui ne sont pas d&eacute;pendantes de l'architecture. Donc quand vous
cr&eacute;ez votre fichier de configuration, soyez s&ucirc;r de regarder
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/conf/GENERIC">
/sys/conf/GENERIC</a> pour voir ce que vous voulez. Il y a des options
qui sont <b>indispensables</b>. 

<p>
Toutes les options ci-dessous doivent &ecirc;tre plac&eacute;es dans le
fichier de configuration du noyau avec le format :<br>
<strong>option      OPTION</strong><br>
Par exemple, pour placer l'option de debug dans le noyau, il faut
ajouter une ligne telle que :<br>
<strong>option      DEBUG</strong><br>
Les options dans le noyau OpenBSD sont traduites en tant qu'options du
pr&eacute;processeur, donc une option telle que DEBUG compilerait les
sources avec l'option -DDEBUG. Ce qui est &eacute;quivalent &agrave;
placer un #define DEBUG &agrave; travers les sources du noyau.


<p>
OpenBSD poss&egrave;de un grand nombre d'options de compatibilit&eacute;
qui permettent d'utiliser les binaires d'autres syst&egrave;mes
d'exploitation. Elles ne sont pas toutes disponibles sur toutes les
architectures, donc veuillez lire les pages du manuel correspondantes
pour voir ce qui support&eacute; sur la v&ocirc;tre.

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_svr4&amp;sektion=8">COMPAT_SVR4(8)</a> - Compatibilit&eacute; avec les binaires SVR4.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_bsdos&amp;sektion=8">COMPAT_BSDOS(8)</a> - Compatibilit&eacute; avec les binaires BSD/OS.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&amp;sektion=8">COMPAT_LINUX(8)</a> - Compatibilit&eacute; avec les binaires Linux.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_sunos&amp;sektion=8">COMPAT_SUNOS(8)</a> - Compatibilit&eacute; avec les binaires SunOS.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ultrix&amp;sektion=8">COMPAT_ULTRIX(8)</a> - Compatibilit&eacute; avec les binaires ULTRIX.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_freebsd&amp;sektion=8">COMPAT_FREEBSD(8)</a> - Compatibilit&eacute; avec les binaires FreeBSD.
<li>COMPAT_HPUX - Compatibilit&eacute; avec les binaires HP-UX.
    Disponible uniquement sur quelques architectures m68k.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ibcs2&amp;sektion=8">COMPAT_IBCS2(8)</a> - Compatibilit&eacute; pour faire tourner des binaires ibcs2.
<li>COMPAT_OSF1 - Fait tourner les binaires Digital Unix. Uniquement
    disponible sur la plate-forme Alpha.
<li>COMPAT_43 - Compatibilit&eacute; avec 4.3BSD. Utilisation
    d&eacute;conseill&eacute;e, mais c'est requis par quelques
    applications.
<li>COMPAT_11 - Compatibilit&eacute; avec NetBSD 1.1
<li>COMPAT_NOMID - Compatibilit&eacute; avec les ex&eacute;cutables
    a.out qui n'ont pas d'identifiant de machine (id). 
</ul>

<p>
Il est toujours utile de pouvoir mettre au point les probl&egrave;mes
avec votre noyau. Mais de nombreuses personnes choisissent de pas mettre
ces options dans leur noyau parce que celles-ci prennent une place
consid&eacute;rable. Elles sont pourtant tr&egrave;s utiles quand un bug
est pr&eacute;sent. Cela permettra aux d&eacute;veloppeurs de trouver la
source de vos probl&egrave;mes plus rapidement. Voici une liste des
options de "debugging" qui peuvent &ecirc;tre ajout&eacute;es &agrave;
votre noyau.

<p>
<ul>
<li><a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=ddb&amp;sektion=4">DDB</a>
- Ceci va compiler le debugger du noyau. Il n'est pas disponible sur
  toutes les plates-formes donc veuillez consulter le manuel avant de
  l'ajouter.
<li><a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=gdb&amp;sektion=1">KGDB</a>
- Compile un debugger distant pour le noyau en utilisant la
  caract&eacute;ristique `remote target' de gdb.
<li>makeoptions DEBUG="-g" - Cr&eacute;&eacute; bsd.gdb avec bsd. C'est
    tr&egrave;s pratique pour debugger un crashdump avec gdb.
<li>DEBUG - Utilis&eacute;e pour placer diverses options de debug dans
    le noyau o&ugrave; les sources les ont d&eacute;finies.
<li>KTRACE - Place des balises pour utiliser le syst&egrave;me de suivi
    des appels syst&egrave;mes. Cela permet aux utilisateurs d'utiliser
    <a href=
    "http://www.openbsd.org/cgi-bin/man.cgi?query=ktrace&amp;sektion=1">
    ktrace(1)</a>.
<li>DIAGNOSTIC - Ajoute du code dans le noyau qui effectuera des
    contr&ocirc;les logiques internes.
<li>GPROF - Ajoute du code dans le noyau pour examiner son profil &agrave;
l'aide de <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=kgmon&amp;sektion=8">kgmon(8)</a>. 
<li>makeoptions PROF="-pg" - Le drapeau (flags) -pg permet de compiler
    le noyau avec le support pour le profiling. L'option GPROF requiert
    l'utilisation de cette option. 
</ul>

<p>
<strong>Options des syst&egrave;mes de fichiers.</strong>
<ul>
<li>FFS - Berkeley Fast Filesystem <strong>REMARQUE :</strong> Cette
    option est indispensable
<li>EXT2FS - Second Extended File System, n&eacute;cessaire pour lire
    une partition Linux.
<li>MFS - Memory File System, permet de stocker les fichiers en
    m&eacute;moire swap.
<li>NFS - Network File System, n&eacute;cessaire pour utiliser NFS.
<li>CD9660 - Il s'agit du syst&egrave;me de fichiers iso9660 +
    rockridge. N&eacute;cessaire pour lire les CD.
<li>MSDOSFS - N&eacute;cessaire pour lire les syst&egrave;mes de
    fichiers MS-DOS FAT. Supporte aussi les noms long de Windows 95 et
    les caract&egrave;res minuscules/majuscules.
<li>FDESC - Inclus le code pour un syst&egrave;me de fichiers qui peut
    &ecirc;tre mont&eacute; sur /dev/fd
<li>KERNFS - Inclus le code qui permet de monter un syst&egrave;me de
    fichiers particulier (habituellement sur /kern) dans lequel les
    fichiers repr&eacute;sentent certaines variables et certains
    param&egrave;tres du noyau.
<li>NULLFS - Code pour avoir un syst&egrave;me de fichiers boucl&eacute;. <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_null&amp;sektion=8">mount_null(8)</a>
pour plus d'informations 
<li>PROCFS - Inclus le code d'un syst&egrave;me de fichiers particulier
    (habituellement sur /proc)
<li>PORTAL - Inclus le syst&egrave;me de fichiers portal
    (exp&eacute;rimental). Il permet quelques petites astuces
    int&eacute;ressantes telles que l'ouverture d'une socket TCP par
    l'ouverture d'un fichier.
<li>UMAPFS - Inclus un syst&egrave;me de fichiers boucl&eacute; dans
    lequel chaque uid et gid peut-&ecirc;tre red&eacute;fini. Cela
    peut-&ecirc;tre pratique quand on monte un syst&egrave;me de
    fichiers &eacute;tranger avec des uid et des gid diff&eacute;rents
    de ceux du syst&egrave;me local (tel qu'un syst&egrave;me de
    fichiers distant par NFS).
<li>UNION - Inclus le code pour le syst&egrave;me de fichiers union qui
    permet aux r&eacute;pertoires d'&ecirc;tre mont&eacute;s les un au
    dessus des autres de telle fa&ccedil;on que les deux syst&egrave;mes
    de fichiers restent visibles. Ce code n'est pas encore stable.
<li>XFS - Ajoute ce qu'il faut pour utiliser un syst&egrave;me de
    fichiers compatible avec le syst&egrave;me de fichier AFS.
    Utilis&eacute; actuellement par le code AFS/Arla.
<li>FFS_SOFTUPDATES - Permet l'utilisation des softupdates. Pour plus
    d'information sur les softupdates, veuillez lire la section <a
    href="../faq14.html#SoftUpdates">FAQ Softupdates</a>.
<li>NFSSERVER - Permet d'inclure le code serveur de NFS dans le noyau.
<li>NFSCLIENT - Permet d'inclure le code client de NFS dans le noyau.
<li>FIFO - Support pour les FIFOs... RECOMMANDÉ.
<li>NVNODE=entier - O&ugrave; entier est la taille du cache
    utilis&eacute; par les routines de traduction "nom vers i-node
    (name-to-inode)" (tel que le cache namei(), bien que portant
    d'innombrables autres noms dans les sources du noyau).
<li>EXT2FS_SYSTEM_FLAG - Cette fonction change le comportement des
    drapeaux (flags) APPEND et IMMUTABLE pour un fichier sur un
    syst&egrave;me de fichiers EXT2FS. Veuillez consulter <a href="http-
    ://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">opt-
    ions(4)</a> pour de plus amples d&eacute;tails.
<li>QUOTA - Support des quotas. Pour plus d'informations sur les quotas,
    veuillez lire la <a href="../faq10.html#Quotas">FAQ 10, Quotas</a>
</ul>

<p>
<strong>Options diverses</strong>
<ul>
<li>PCIVERBOSE - Rend la proc&eacute;dure de d&eacute;marrage plus verbeuse pour les p&eacute;riph&eacute;riques PCI.  
<li>EISAVERBOSE - Rend la proc&eacute;dure de d&eacute;marrage plus verbeuse pour les p&eacute;riph&eacute;riques EISA.  
<li>PCMCIAVERBOSE - Rend la proc&eacute;dure de d&eacute;marrage plus verbeuse pour les p&eacute;riph&eacute;riques PCMCIA.  
<li>APERTURE - Fourni un support pour le framebuffer dans le noyau aux
processus utilisateur. Indispensable pour utiliser X.
<li>LKM - Support pour les modules noyau. N'est pas disponible sur
toutes les architectures. Lire <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=lkm&amp;sektion=4">lkm(4)</a>
pour plus d'informations. 
<li>INSECURE - Code (sans possibilit&eacute; de changement) le niveau de
s&eacute;curit&eacute; du noyau &agrave; -1. Lire <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=init&amp;sektion=8">init(8)</a>
pour plus d'informations sur les niveaux de s&eacute;curit&eacute; du noyau. 
<li>RAM_DISK_HOOKS - Permet l'utilisation de fonctions d&eacute;pendantes de
l'architecture quand le pilote ramdisk est configur&eacute;. 
<li>RAM_DISK_IS_ROOT - Force le ramdisk &agrave; &ecirc;tre root.
<li>CCDNBUF=integer - Fixe le nombre de tampons m&eacute;moires utilis&eacute;s par CCD(4). Le
d&eacute;faut est 8. Pour plus d'informations sur CCD, veuillez lire la page du manuel
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccd&amp;sektion=4">CCD(4)</a>,
ou la <a href="../faq11.html#ccd">section optimisation des performances de la FAQ.</a>
<li>KMEMSTATS - Permet de garder des statistiques sur l'utilisation de
malloc(9). Si l'option DEBUG est utilis&eacute;e, cette option est
automatiquement activ&eacute;e. 
<li>BOOT_CONFIG - Active le support pour l'option de d&eacute;marrage -c.
</ul>


<p>
<strong>Options r&eacute;seau</strong><br>
Veuillez aussi consulter la<a href="../faq6.html">FAQ r&eacute;seau</a> ou la
<a href="../faq11.html#Network">FAQ Optimisation des performances r&eacute;seau</a>. 
<ul>
<li>GATEWAY - Active IPFORWARDING et (sur la plupart des ports) accro&icirc;t la taille de NMBCLUSTERS.
<li>NMBCLUSTERS=entier - Contr&ocirc;le la taille des clusters de mbuf. 
<li>IPFORWARDING - Active le routage IP. Avec cette option, la machine transmettra les paquets IP entre ses interfaces qui sont destin&eacute;s &agrave; d'autres machines.
<li>MROUTING - Inclus le support pour les routeurs multicast IP.
<li>INET - Inclus le support pour la pile de protocoles TCP/IP. Cette option est indispensable
<li>MCLSHIFT=valeur - Cette option est le logarithme binaire (base 2)
de la taille des mbuf clusters. Lire <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&amp;sektion=4">options(4)</a>
pour plus d'informations sur cette option. 
<li>NS - Inclus le support pour la pile de protocoles Xerox
XNS. Voir<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=ns&amp;sektion=4">ns(4)</a> 
<li>ISO,TPIP - Inclus le support pour la pile de protocoles OSI. Voir
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=iso&amp;sektion=4">iso(4)</a>
pour plus d'informations. 
<li>EON - Inclus le support pour les tunnels OSI dans IP.
<li>CCITT,LLC,HDLC - Inclus le support pour la pile de protocoles X.25.
<li>IPX, IPXIP - Inclus le support pour le protocole IPX (Internetwork
Packet Exchange) principalement utilis&eacute; par Novell NetWare. 
<li>NETATALK - Inclus le support pour la famille de protocoles
AppleTalk. 
<li>TCP_COMPAT_42 - L'utilisation de cette option est particuli&egrave;rement
d&eacute;conseill&eacute;e. Il s'agit de la compatibilit&eacute; avec un bug de
4.2BSD. Dans 4.2BSD, les num&eacute;ros de s&eacute;quence &eacute;taient des entiers
sign&eacute;s de 32 bits. Les mises en oeuvre modernes utilisent des valeurs
non sign&eacute;es. 
<li>TCP_NEWRENO - Active la phase de recouvrement rapide NewReno qui
permet &agrave; un segment perdu d'&ecirc;tre r&eacute;cup&eacute;r&eacute; par "round trip time". 
<li>TCP_SACK - Active les acquittements s&eacute;lectifs.
<li>TCP_FACK - Active la transmission des acquittements permettant une
estimation plus pr&eacute;cise des donn&eacute;es en suspens durant la phase de
recouvrement rapide gr&acirc;ce &agrave; l'utilisation des informations SACK. Cette
option peut-&ecirc;tre utilis&eacute;e avec TCP_SACK. 
<li>PPP_FILTER - Cette option active le filtrage avec <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcap&amp;sektion=3">pcap(3)</a>
sur les connexions ppp. 
<li>PPP_BSDCOMP - compression PPP BSD.
<li>PPP_DEFLATE - Utilis&eacute; en conjonction avec PPP_BSDCOMP.
<li>IPSEC - Cette option active le support du protocole de s&eacute;curit&eacute;
IP. Voir <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&amp;sektion=4">ipsec(4)</a>
pour plus de d&eacute;tails. Cette option implique l'option KEY, qui fournit
le support pour PFKEYv2.  
<li>ENCDEBUG - Cette option active la journalisation des informations
de debug au cas o&ugrave; IPSEC rencontrerait des erreurs. 
</ul>


<p>
<strong>Options du sous-syst&egrave;me SCSI</strong>
<ul>
<li>SCSITERSE - Messages d'erreurs SCSI.  Les informations de d&eacute;codage ASC/ASCQ sont omises ce qui permet de sauver environ 8 octets.
<li>SCSIDEBUG - Afficher des informations de debug pour le sous-syst&egrave;me SCSI &agrave; la console.
</ul>



<p> 
<a name= "Building"></a>
<a name= "5.4"></a>
<h2>5.4 - Construire votre propre noyau</h2>


<p>
Toutes les instructions pour cr&eacute;er votre noyau sur mesure sont dans la
page du manuel <a href=
"http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&apropos=0&amp;sektion=8"> 
afterboot(8)</a>.


<p> Pour compiler votre noyau depuis le cdrom vous aurez tout d'abord besoin d'avoir 
  le code source. Ce dernier est disponible &agrave; partir du <a href="../../orders.html">CD 
  officiel</a> (disque 3) et &agrave; partir des <a href="../../fr/ftp.html">sites 
  FTP</a>. Cet exemple suppose que le CD3 est mont&eacute; sur /mnt. 

<blockquote>
<pre>
# <strong>cd /usr/src</strong>
# <strong>tar xvzf /mnt/src.tar.gz</strong>
</pre>
</blockquote>

<p>
Maintenant pour cr&eacute;er votre noyau sur mesure, la mani&egrave;re la plus
simple est de partir du noyau GENERIC. Il se trouve dans
<tt>/usr/src/sys/arch/$ARCH/conf/GENERIC</tt>, o&ugrave; ARCH est votre
architecture. Il y a d'autres configurations en exemples dans le
r&eacute;pertoire. Voici deux exemples vous montrant comment compiler votre
noyau. Le premier exemple permet de compiler votre noyau avec des
sources en lecture seule. Le second correspond &agrave; des sources
accessibles en &eacute;criture.


<blockquote> 
<pre>
# <strong>cd /quelque_part</strong>
# <strong>cp /usr/src/sys/arch/$ARCH/conf/UN_FICHIER .</strong>
# <strong>vi UN_FICHIER</strong> (pour effectuer les changements voulus)
# <strong>config -s /usr/src/sys -b . UN_FICHIER</strong>
suivi par :

<pre>
    # <strong>make depend</strong>
         <b><i>- OR -</i></b>
    # <strong>make clean</strong>
# <strong>make</strong>
</pre>
</blockquote>

Vous devez ex&eacute;cuter '<tt>make depend</tt>' lorsque vous effectuez
n'importe quelle modification &agrave; votre arborescence des sources (y
compris des mises &agrave; jour et des correctifs) (en d'autres termes,
pratiquement toujours, sauf si vous avez besoin d'ex&eacute;cuter '<tt>make
clean</tt>').

<p>
Si vous avez effectu&eacute; des modifications aux options de configuration de
votre noyau, et/ou effectu&eacute; des modifications majeures &agrave; votre
arborescence des sources, vous devriez utiliser ' '<tt>make
clean</tt>' au lieu de '<tt>made depend</tt>'. Il est &agrave; noter qu'il est
toujours de bon ton de faire un 'make clean', m&ecirc;me si &ccedil;a peut aboutir &agrave;
des temps de compilation plus longs, vu que plus de choses ont besoin
d'&ecirc;tre reconstruites.

<p>
Pour compiler un noyau avec des sources accessibles en &eacute;criture il faut effectuer les actions suivantes :


<blockquote>
<tt>
# <strong>cd sys/arch/$ARCH/conf</strong>
# <strong>vi UN_FICHIER</strong> (pour effectuer les changements voulus)
# <strong>config UN_FICHIER</strong> (pour en savoir plus lisez : <a
href=
"http://www.openbsd.org/cgi-bin/man.cgi?query=config&apropos=0&amp;sektion=8">config(8)</a>) 
# <strong>cd ../compile/UN_FICHIER</strong>
# <strong>make</strong> 
</tt>
</blockquote>

<p>
O&ugrave; $ARCH est l'architecture que vous utilisez (par exemple i386). Vous
pouvez aussi faire un <strong>make depend</strong> pour cr&eacute;er les
d&eacute;pendances pour la prochaine compilation de votre noyau. 


<p>
D&eacute;placer votre noyau &agrave; sa place.


<blockquote>
<pre>
# <strong>cp /bsd /bsd.old</strong>
# <strong>cp /sys/arch/$ARCH/compile/UN_FICHIER/bsd /bsd</strong>
</pre>
</blockquote>

<p>
Pour d&eacute;marrer avec votre ancien noyau au d&eacute;marrage, il suffit juste de faire ceci


<blockquote>
<pre>
boot&gt; <strong>bsd.old</strong>
</pre>
</blockquote>

<p>
votre ancien noyau sera charg&eacute; &agrave; la place de /bsd.


<p>
Parfois quand vous installez un nouveau noyau, il vous faudra
installer de nouveaux blocs de d&eacute;marrage. Pour ce faire, lisez <a
href="../faq14.html#InstBoot">FAQ 14, Installation des bootblocks</a>, qui
vous donnera toutes les informations sur le bootloader OpenBSD.


<p>
<a name="BootConfig"></a> 
<a name="5.5"></a> 
<h2>5.5 - Configuration au d&eacute;marrage</h2>


<p>
Parfois lorsque vous d&eacute;marrez votre syst&egrave;me vous remarquerez que
votre noyau trouve vos p&eacute;riph&eacute;riques mais &agrave; la mauvaise IRQ. Et
avez-vous imm&eacute;diatement besoin de ce
p&eacute;riph&eacute;rique. Sans recompiler votre noyau vous pouvez utiliser la
configuration au d&eacute;marrage de celui-ci. Cela permettra de corriger
votre probl&egrave;me pour cette fois et uniquement pour cette fois. Si vous
red&eacute;marrez le syst&egrave;me il faudra recommencer la proc&eacute;dure. Il s'agit
donc d'une m&eacute;thode temporaire. Le probl&egrave;me devra &ecirc;tre corrig&eacute; en
recompilant votre noyau. De plus votre noyau &agrave; besoin de
l'<strong>option BOOT_CONFIG</strong> dans la configuration du
noyau. Le noyau GENERIC poss&egrave;de cette option.  


<p>
Une grande partie de ce document peut-&ecirc;tre trouv&eacute; dans la page du
manuel <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&apropos=0&amp;sektion=8">boot_config(8)</a> 


Pour d&eacute;marrer avec UKC (User Kernel Config), il faut sp&eacute;cifier l'option -c au d&eacute;marrage.

<blockquote><pre>
boot&gt; <strong>boot wd0a:/bsd -c</strong>
</pre></blockquote>

<p>
O&ugrave; n'importe quel autre noyau que vous voulez d&eacute;marrer. L'invite de
commandes UKC appara&icirc;tra. De l&agrave; vous pourrez sp&eacute;cifier au noyau les
p&eacute;riph&eacute;riques que vous d&eacute;sirez modifier, ceux que vous voulez activer
ou d&eacute;sactiver.


<p>
Voici un liste des commandes les plus utilis&eacute;es dans UKC.


<ul>
<li><tt>add <strong>device</strong></tt> - Ajoute un p&eacute;riph&eacute;rique en en copiant un autre
<li><tt>change <strong>devno | device </strong></tt> - Modifie un ou plusieurs p&eacute;riph&eacute;riques
<li><tt>disable <strong>devno | device </strong></tt> - D&eacute;sactive un ou plusieurs p&eacute;riph&eacute;riques
<li><tt>enable <strong>devno | device </strong></tt> - Active un ou plusieurs p&eacute;riph&eacute;riques
<li><tt>find <strong>devno | device </strong></tt> - Trouver un ou plusieurs p&eacute;riph&eacute;riques
<li><tt>help</tt> - Rapide sommaire de ces commandes
<li><tt>list</tt> - Liste TOUS les p&eacute;riph&eacute;riques connus
<li><tt>exit/quit</tt> - Continue le d&eacute;marrage
<li><tt>show <strong>[attr [val]]</strong></tt> - Montre les p&eacute;riph&eacute;riques avec un attribut et une valeur sp&eacute;cifi&eacute;e optionnelle
</ul>

<p>
Une fois que votre p&eacute;riph&eacute;rique est configur&eacute;, utilisez quit ou exit
pour continuer &agrave; d&eacute;marrer. Apr&egrave;s avoir fait ceci, vous devriez
corriger la configuration de votre noyau et en compiler un
nouveau. Voir <a href="faq5.html#Building">Construire votre propre
noyau</a> pour plus de renseignements. 


<p>
<a name="VerboseBoot"></a>
<a name="5.6"></a>
<h2>5.6 - Avoir plus d'informations pendant le d&eacute;marrage</h2>


<p>
Obtenir plus d'informations pendant le d&eacute;marrage peut-&ecirc;tre tr&egrave;s
pratique lorsque vous essayez de r&eacute;gler certains probl&egrave;mes lors de
celui-ci. Si vous avez un probl&egrave;me et que vous aimeriez avoir plus
d'informations, red&eacute;marrez votre machine. Quand vous obtenez l'invite
&quot;boot&gt;quot; d&eacute;marrez avec l'option -c. L'invite UKC&gt; appara&icirc;tra
et ensuite : 



<blockquote><pre>
UKC&gt; <strong>verbose</strong>
autoconf verbose enabled
UKC&gt; <strong>quit</strong>
</pre></ul>

<p>
Vous obtiendrez un d&eacute;marrage extr&ecirc;mement verbeux.


<p>
<a name="config"></a>
<a name="5.7"></a>
<h2>5.7 - Utilisation de config(8) pour changer le binaire du noyau</h2>


<p> Les options <b>-e</b> et <b>-u</b> dans <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>. 
  Ces options peuvent &ecirc;tre tr&egrave;s utiles et vous &eacute;vitent de perdre du temps &agrave; recompiler 
  votre noyau. Le drapeau <b>-e</b> vous permet de rentrer en configuration UKC 
  alors que le syst&egrave;me fonctionne. Les changements prendront effets au prochain 
  red&eacute;marrage. Le drapeau <b>-u</b> permet de voir si des changements ont &eacute;t&eacute; 
  effectu&eacute;s au noyau pendant le d&eacute;marrage, signifiant que vous avez utilis&eacute; <b>boot 
  -c</b> pour entrer en configuration UKCi. 

<p>
Les exemples suivants montrent la d&eacute;sactivation des p&eacute;riph&eacute;riques ep*
dans le noyau. Pour plus de s&eacute;curit&eacute;, il est pr&eacute;f&eacute;rable d'utiliser
l'option <b>-o</b> qui &eacute;crira les changements dans un fichier
sp&eacute;cifi&eacute;. Par exemple <strong>config -e -o bsd.new /bsd</strong> &eacute;crira
les changements dans bsd.new. Les exemples n'utilisent pas l'option
<b>-o</b>, mais les changements sont ignor&eacute;s et non &eacute;crit dans le
binaire du noyau. Pour plus d'informations sur les messages d'erreur
et d'avertissement, lire la page du manuel <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&amp;sektion=8">config(8)</a>
<ul>
  <pre>
$ <strong>sudo config -e /bsd</strong>
OpenBSD 3.3 (GENERIC) #44: Sat Mar 29 13:22:05 MST 2003
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
warning: no output file specified
Enter 'help' for information
ukc&gt; ?
        help                            Command help list
        add         dev                 Add a device
        base        8|10|16             Base on large numbers
        change      devno|dev           Change device
        disable     attr val|devno|dev  Disable device
        enable      attr val|devno|dev  Enable device
        find        devno|dev           Find device
        list                            List configuration
        lines       count               # of lines per page
        show        [attr [val]]        Show attribute
        exit                            Exit, without saving changes
        quit                            Quit, saving current changes
        timezone    [mins [dst]]        Show/change timezone
        nmbclust    [number]            Show/change NMBCLUSTERS
        cachepct    [number]            Show/change BUFCACHEPERCENT
        nkmempg     [number]            Show/change NKMEMPAGES
        shmseg      [number]            Show/change SHMSEG
        shmmaxpgs   [number]            Show/change SHMMAXPGS
ukc&gt; <strong>list</strong>
  0 audio* at sb0|sb*|gus0|pas0|sp0|ess*|wss0|wss*|ym*|eap*|eso*|sv*|neo*|cmpci*
|clcs*|clct*|auich*|autri*|auvia*|fms*|uaudio*|maestro*|esa*|yds*|emu* flags 0x0
  1 midi* at sb0|sb*|opl*|opl*|opl*|opl*|ym*|mpu*|autri* flags 0x0
  2 nsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  3 nsphyter* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|
vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep
*|ep*|ep* phy -1 flags 0x0
  4 qsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  5 inphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  6 iophy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  7 eephy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
  8 exphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*
|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|e
p*|ep* phy -1 flags 0x0
[...snip...]
ukc&gt; <strong>disable ep</strong>
 67 ep0 disabled
 68 ep* disabled
 69 ep* disabled
155 ep0 disabled
156 ep0 disabled
157 ep* disabled
158 ep* disabled
210 ep* disabled
ukc&gt; <strong>quit</strong>
not forced
</pre></blockquote>

<p> 
Dans l'exemple ci-dessus, tous les p&eacute;riph&eacute;riques ep* sont
d&eacute;sactiv&eacute;s du noyau et ne seront donc pas test&eacute;s. Dans
certaines situations o&ugrave; vous aurez effectu&eacute; ces changements au d&eacute;marrage
avec UKC et <b>boot -c</b>, il vous faudra les rendre d&eacute;finitifs. Pour
ce faire, il faudra utiliser l'option <b>-u</b>. Dans l'exemple suivant,
l'ordinateur a &eacute;t&eacute; d&eacute;marr&eacute; avec UKC et les p&eacute;riph&eacute;riques wi(4) sont
d&eacute;sactiv&eacute;s. Ètant donn&eacute; que les changements fait par boot -c ne sont pas
permanents, ceux-ci doivent &ecirc;tre &eacute;crits sur le disque. Cet exemple
montre comment &eacute;crire les changements effectu&eacute;s par boot -c dans un
nouveau binaire noyau bsd.new.

<blockquote><pre>
$ <strong>sudo config -e -u -o bsd.new /bsd</strong>
OpenBSD 3.1 (GENERIC) #2: Sat Apr 20 21:44:54 EDT 2002
    root@build:/usr/src/sys/arch/i386/compile/GENERIC
Processing history...
105 wi* disabled
106 wi* disabled
Enter 'help' for information
ukc&gt; <strong>quit</strong>
</pre></blockquote>


<p>
<font color= "#0000e0">
<a href= "index.html">[Retour &agrave; l'Index principal]</a>
<a href= "faq4.html">[Section 4 - Guide d'Installation]</a>
<a href= "../faq6.html">[Section 6 - R&eacute;seau]</a>
</font>

<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[retour]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: faq5.html,v 1.70 ]<br>
$Translation: faq5.html,v 1.18 2003/05/02 21:20:42 saad Exp $<br>
$OpenBSD: faq5.html,v 1.13 2003/05/03 07:43:06 jufi Exp $ 
</small> 

</body>
</html>
