<html>
<head>
<title>8.0 - Questions diverses</title>
<link rev=  "made"          href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2002 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif"> 
<p>
<h2><font color=#e00000>8.0 - Questions diverses</font> 
  <hr></h2>
<p></p>
   
<p>
<ul>
  <h3>Table des mati&egrave;res</h3>
  <li><a href= "#Kerberos"    >8.1 - Que signifient ces erreurs Kerberos
  lorsque je me connecte la premi&egrave;re fois ?</a></li>
  <li><a href= "#VirtTerms"   >8.2 - Comment puis-je changer de terminal virtuel ? (UNIQUEMENT 
    SUR I386)</a></li>
  <li><a href= "#LostPW"      >8.3 - J'ai oubli&eacute; mon mot de passe root... 
    Que faire ?</a></li>
  <li><a href= "#X"           >8.4 - X ne veut pas d&eacute;marrer, et j'ai de 
    nombreux messages d'erreur </a></li>
  <li><a href= "#CVS"         >8.5 - Qu'est-ce que CVS, et comment puis-je l'utiliser 
    ? </a></li>
  <li><a href= "#Ports"       >8.6 - Qu'est-ce que l'arborescence des ports ?</a></li>
  <li><a href= "#Packages"    >8.7 - Qu'est-ce que les packages?</a></li>
  <li><a href= "#NoFloppy"    >8.8 - Y a t'il un moyen d'utiliser mon lecteur 
    de disquettes alors qu'il n'&eacute;tait pas connect&eacute; durant la phase 
    de d&eacute;marrage ?</a></li>
  <li><a href= "#Bootloader"  >8.9 - Les options de d&eacute;marrage - Utilisation 
    du chargeur de d&eacute;marrage OpenBSD (<i>sp&eacute;cifique &agrave; i386</i>)</a></li>
  <li><a href= "#SKey"        >8.10 - Utilisation de S/Key sur votre syst&egrave;me 
    OpenBSD</a></li>
  <li><a href= "#MacTime"     >8.11 - Pourquoi mon Macintosh est-il si lent ? </a></li>
  <li><a href= "#SMP"         >8.12 - Est-ce qu'OpenBSD supporte plusieurs processeurs 
    ?</a></li>
  <li><a href= "#TTY"         >8.13 - Parfois, j'ai des erreurs d'entr&eacute;e/sortie 
    lorsque j'essaie d'utiliser mes p&eacute;riph&eacute;riques tty </a></li>
  <li><a href= "#Netscape"    >8.14 - O&ugrave; puis-je trouver un binaire Netscape 
    pour OpenBSD ?</a></li>
  <li><a href= "#mg"          >8.15 - Comment s'utilise l'&eacute;diteur mg ?</a></li>
  <li><a href= "#ksh"         >8.16 - Apparemment, Ksh ne lit pas mon fichier 
    .profile !</a></li>
  <li><a href= "#motd"        >8.17 - Pourquoi le contenu de /etc/motd est-il &eacute;cras&eacute; 
    alors que je l'ai modifi&eacute; ?</a></li>
  <li><a href= "#wwwsolaris"  >8.18 - Pourquoi le site www.openbsd.org est-il h&eacute;berg&eacute; 
    sur une machine Solaris ?</a></li>
  <li><a href= "#PCI"         >8.19 - J'ai des probl&egrave;mes de d&eacute;tection 
    de p&eacute;riph&eacute;riques PCI sur OpenBSD 2.8</a></li>
  <li><a href= "truetype.html">8.20 - Les polices anti-alias&eacute;es et &quot;TrueType&quot; 
    sous OpenBSD 2.9/XFree86</a></li>
  <li><a href= "#Journaling"  >8.21 - Est-ce qu'OpenBSD supporte des syst&egrave;mes 
    de fichiers journalis&eacute;s ?</a></li>
</ul>
<p></p> 
<hr> 

<br>

<p>
<a name= "Kerberos"></a>
<a name= "8.1"></a>
<h2>8.1 - Que signifient ces erreurs Kerberos lorsque je me connecte la premi&egrave;re 
  fois ?</h2>
<p></p>
<p><b>Remarque</b>: Cette section est obsol&egrave;te si vous avez mis &agrave; 
  jour votre syst&egrave;me en OpenBSD <a href="../../stable.html">2.8-stable</a> 
  ou sup&eacute;rieur. (le correctif se trouve &agrave; l'adresse : <a href="ftp://ftp.openbsd.org/pub/OpenBSD/patches/2.8/common/008_kerberos.patch">ftp://ftp.openbsd.org/pub/OpenBSD/patches/2.8/common/008_kerberos.patch</a>). 
<p>Lorsque vous avez install&eacute; votre syst&egrave;me pour la premi&egrave;re 
  fois, vous avez tr&egrave;s probablement observ&eacute; un message d'erreur 
  qui ressemble au message suivant :
<ul>
<kbd>
Warning: no Kerberos tickets issued.
</kbd>
</ul>

<p><b>CE MESSAGE D'ERREUR N'EST PAS DU TOUT PERTINENT ET DEVRAIT ETRE SUPPRIME 
  SI CELA EST VRAIMENT NECESSAIRE</b> 
<p>

<p>Vous n'avez probablement pas configur&eacute; Kerberos sur votre syst&egrave;me. 
  Il est donc normal que vous n'obteniez pas de ticket Kerberos. Mais si Kerberos 
  est configur&eacute;, vous devriez vous pencher sur le probl&egrave;me.
  Consultez la
  <a href="../faq10.html#Kerberos">FAQ 10, Mise en place de Kerberos</a>. Si 
  vous ne pouvez plus supporter de voir ce message d'erreur et si vous ne 
  comptez pas mettre en oeuvre Kerberos, suivez la proc&eacute;dure suivante 
  pour vous en d&eacute;barrasser une bonne fois pour toutes : </p>
<p>
<ul>
  <li>Assurez-vous d'avoir le code source.</li>
  <li>Editez le fichier /usr/share/mk/bsd.own.mk et fixez la valeur de KERBEROS 
    &agrave; 'no', ou cr&eacute;ez un fichier /etc/mk.conf pour prendre en compte 
    cette modification.</li>
  <li>cd /usr/src/usr.bin/login; make clean; make; make install</li>
</ul>
<p>
<a name= "VirtTerms"></a>
<a name= "8.2"></a>
<h2>8.2 - Comment puis-je changer de terminal virtuel ?</h2>
<p></p>

<p>Appuyez simplement sur les touches <kbd>[ctrl] - [alt] - [une des touches de 
  fonction]</kbd> (i386) </p>
<p>i386 est la seule architecture incluant le support des terminaux virtuels. 
  Vous pouvez également acc&eacute;der &agrave; des terminaux virtuels lorsque
  vous utilisez X. Par exemple, si vous d&eacute;marrez X dans le terminal 1, 
  puis vous appuyez sur [ctrl]-[alt]-[F2] pour acc&eacute;der au terminal 2, X ne r&eacute;appara&icirc;tra 
  pas si vous changez &agrave; nouveau de terminal pour revenir vers le terminal 
  1. Pour retrouver votre affichage X, vous devez utilisez la combinaison [ctrl]-[alt]-[F5].</p>
<p>
<a name= "LostPW"></a>
<a name= "8.3"></a>
<h2>8.3 - J'ai oubli&eacute; mon mot de passe root... Que faire ?</h2>
<p> Respectez les &eacute;tapes suivantes: </p>
<p></p>

<ol>
  <li>D&eacute;marrez en mode &quot;single user&quot;. Pour les architectures 
    i386, saisissez &quot;boot -s&quot; au prompt de d&eacute;marrage
  <li>Montez la partition racine : 
    <ul>
      <kbd>bsd# <b>fsck -p / && mount -u /</b></kbd> 
    </ul>
  <li>Si /usr n'est pas sur la m&ecirc;me partition que / (recommand&eacute; !), 
    alors vous aurez également besoin de la monter : 
    <ul>
      <kbd>bsd# <b>fsck -p /usr && mount /usr</b></kbd> 
    </ul>
  <li>Ex&eacute;cutez <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&sektion=1&format=html">passwd(1)</a> 
  <li>D&eacute;marrez en mode multi-utilisateur...et rappelez-vous de votre mot 
    de passe !
</ol>
<p></p>

<p>
<a name= "X"></a>
<a name= "8.4"></a>
<h2>8.4 - X ne veut pas d&eacute;marrer, et j'ai de nombreux messages d'erreur 
</h2>
<p></p>

<p>Si vous &ecirc;tes s&ucirc;r que X est proprement param&eacute;tr&eacute; et 
  que votre fichier XF86Config est fonctionnel, alors le probl&egrave;me vient 
  tr&egrave;s probablement de machdep.allowaperture. Vous devez aussi vous assurez 
  que votre fichier de configuration du noyau contient les deux options suivantes:</p>
<ul><pre>
option XSERVER
option APERTURE
</pre></ul>

<p> [Ces deux options sont incluses dans le noyau GENERIC]</p>

<p>Editez le fichier <i>/etc/sysctl.conf </i>et positionnez <b>machdep.allowaperture 
  </b>&agrave; <b>1</b>. Ceci permettra &agrave; X d'acc&eacute;der au pilote 
  dit d'ouverture (aperture). Ce param&eacute;tre est positionn&eacute; &agrave; 
  la bonne valeur si vous avez correctement r&eacute;pondu &agrave; la question 
  sur l'utilisation de X durant la phase d'installation du syst&egrave;me. L'acc&egrave;s 
  &agrave; ce pilote est n&eacute;cessaire car il contr&ocirc;le les entr&eacute;es/sorties 
  sur les cartes graphiques. </p>
<p>Pour les autres probl&egrave;mes relatifs &agrave; X sur plateforme i386, consultez 
  la documentation en ligne de XFree86 disponible &agrave; l'adresse <a href= "http://www.xfree86.org/support.html">http://www.xfree86.org/support.html</a>. 
</p>

<p>
<a name= "CVS"></a>
<a name= "8.5"></a>
<h2>8.5 - Qu'est-ce que CVS, et comment puis-je l'utiliser ? </h2>
<p></p>

<p>CVS est le syst&egrave;me utilis&eacute; par le projet OpenBSD pour contr&ocirc;ler 
  les modifications apport&eacute;es au code source. CVS veut dire Concurrent 
  Versions System. Vous pouvez en savoir plus sur CVS &agrave; l'adresse <a href= "http://www.cvshome.org/">http://www.cvshome.org/</a>. 
  CVS peut &ecirc;tre employ&eacute; par l'utilisateur final pour maintenir &agrave; 
  jour le code source et l'arborescence des ports. CVS rend le t&eacute;l&eacute;chargement 
  du code source via un des miroirs CVS du projet
  extr&ecirc;mement 
  simple. </p>
<h3>Mise en place initiale de votre environnement CVS</h3>
<p>Il y a diff&eacute;rentes m&eacute;thodes pour configurer votre environnement 
  CVS. Pour commencer, vous aurez besoin d'une copie CVS initiale des sources. 
  Si vous avez achet&eacute; le CD, alors vous &ecirc;tes chanceux car il contient 
  une copie CVS pour la version concern&eacute;e. Vous pouvez extraire cette copie 
  &agrave; partir du CD en :</p>
<p> 1) Copiant l'arborescence (nous supposerons que le CD est mont&eacute; sur 
  /mnt) : </p>
<ul>
<pre>
# <strong>mkdir /usr/src</strong>
# <strong>cd /mnt; cp -Rp CVS Makefile bin distrib etc games gnu \
include kerberosIV lib libexec lkm regress sbin share \
sys usr.bin usr.sbin /usr/src</strong>
</pre>
</ul>

<p> 2) En utilisant le CD en montage de type union sous un r&eacute;pertoire accessible 
  en &eacute;criture. Cependant, il faut savoir que le code du syst&egrave;me 
  de fichiers union n'est pas infaillible : </p>

<ul>
<pre>
# <strong>mkdir /usr/src</strong>
# <strong>mount -t union -o -b /mnt /usr/src</strong>
</pre>
</ul>

<p>/usr/src sera d&egrave;s lors une zone de travail o&ugrave; toutes les commandes 
  <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">cvs(1)</a> 
  fonctionneront correctement.</p>
<p>Si vous n'avez pas de CD OpenBSD, vous allez devoir r&eacute;cup&eacute;rer 
  les sources &agrave; partir d'un des serveurs CVS anonyme OpenBSD. La liste de ces 
  serveurs est disponible sur <a
  href="../../fr/anoncvs.html">http://www.openbsd.org/fr/anoncvs.html</a>. 
  Une fois un serveur s&eacute;lectionn&eacute;, vous devez choisir le module 
  &agrave; r&eacute;cup&eacute;rer. Il y a trois modules principaux disponibles 
  via CVS :</p>
<ul>
  <li><i>src</i> - Le module src constitue la totalit&eacute; du code source de 
    OpenBSD. Ceci inclut aussi bien les sources du noyau que les sources 
    des programmes de l'espace utilisateur.</li>
  <li><i>ports</i> - Le module ports contient tout ce dont vous avez besoin pour 
    avoir l'arborescence des ports de OpenBSD. Pour en savoir plus sur cette arborescence, 
    consultez <a href= "#Ports"       >FAQ 8, Qu'est-ce que l'arborescence des 
    ports ?</a></li>
  <li><i>www</i> - Le module www contient toutes les pages web de OpenBSD, y compris 
    la pr&eacute;sente FAQ.</li>
</ul>

<p>Maintenant que vous avez choisi le module &agrave; r&eacute;cup&eacute;rer, 
  il vous reste &agrave; effectuer une &eacute;tape suppl&eacute;mentaire avant 
  de pouvoir effectivement r&eacute;cup&eacute;rer ce module. Vous devez choisir 
  la m&eacute;thode &agrave; utiliser. Par d&eacute;faut, CVS utilise <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rsh&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">rsh(1)</a> 
  mais la plupart des serveurs CVS anonyme n'autorisent pas ce protocole. Il est 
  donc plus judicieux d'utiliser <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">ssh(1)</a>. 
  Pour ceux qui sont derri&egrave;re un pare-feu, il est possible d'utiliser pserver 
  ou ssh sur le port 2022 sur certains serveurs CVS anonyme. Lisez <a
  href="../../fr/anoncvs.html">http://www.openbsd.org/fr/anoncvs.html</a> pour savoir quels serveurs acceptent quels protocoles. Une 
  fois cette &eacute;tape termin&eacute;e, voici un exemple de r&eacute;cup&eacute;ration 
  du code source. Dans cet exemple, le serveur CVS anonyme utilis&eacute; est 
  situ&eacute; en Belgique. Il est important de noter que si vous &ecirc;tes en 
  dehors de la Belgique, vous devriez utiliser un serveur plus proche de vous. 
  Les serveurs CVS anonyme sont situ&eacute;s un peu partout dans le monde. Cet 
  exemple utilise ssh comme protocole de r&eacute;cup&eacute;ration. </p>
<ul>
  <pre>
ericj@oshibana:~&gt; <strong>export CVS_RSH=/usr/bin/ssh</strong>
ericj@oshibana:~&gt; <strong>echo $CVS_RSH</strong>
/usr/bin/ssh
ericj@oshibana:~&gt; <strong>export CVSROOT=CVS anonyme@CVS anonyme.be.openbsd.org:/cvs</strong>
ericj@oshibana:~&gt; <strong>cvs get src</strong>
Warning: Remote host denied X11 forwarding, perhaps xauth program could not be run on the server side.
cvs checkout: in directory src:
cvs checkout: cannot open CVS/Entries for reading: No such file or directory
cvs server: Updating src
U src/Makefile
[snip]
</pre>
</ul>

<p>Vous remarquerez que la variable d'environnement CVSROOT est positionn&eacute;e. 
  Cette variable indique &agrave; <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">cvs(1)</a> 
  le serveur CVS anonyme &agrave; utiliser. Nous pourrions aussi sp&eacute;cifier 
  ce serveur en utilisant l'option <i>-d</i>. Par exemple :</p>
<ul>
<pre>
ericj@oshibana:~&gt;<strong>cvs -d CVS anonyme@CVS anonyme.be.openbsd.org:/cvs get src</strong>
</pre>
</ul>

<p>Ces commandes doivent &ecirc;tre ex&eacute;cut&eacute;es sous <i>/usr</i>. 
  Les r&eacute;pertoires <i>/usr/src</i>, <i>/usr/ports</i>, et <i>/usr/www </i>seront 
  cr&eacute;&eacute;s en cons&eacute;quence si vous r&eacute;cup&eacute;rez les modules 
  correspondants. Vous pouvez bien s&ucirc;r mettre ces modules n'importe o&ugrave; 
  dans votre arborescence, mais si vous souhaitez travailler avec (pour faire 
un <i>make build </i>par exemple), ils doivent &ecirc;tre sous <i>/usr</i>. </p>
<h3>Mise &agrave; jour de votre arborescence CVS</h3>
<p>Une fois la mise en place initiale de votre arborescence CVS termin&eacute;e, 
  la mise &agrave; jour est facile. Vous pouvez mettre &agrave; jour votre arborescence 
  n'importe quand. Certains serveurs CVS anonyme disposent des mises &agrave; jour 
  plus rapidement que d'autres. Ceci est indiqu&eacute; dans <a
  href="../../fr/anoncvs.html">http://www.openbsd.org/fr/anoncvs.html</a>. Dans 
  l'exemple suivant, une mise &agrave; jour du module www sera effectu&eacute;e 
  &agrave; partir du serveur CVS anoncvs.be.openbsd.org. Notez l'utilisation 
  de l'option -q qui indique &agrave; cvs d'&ecirc;tre moins verbeux. </p>
<ul>
  <pre>
ericj@oshibana:~&gt; <strong>echo $CVSROOT</strong>                                 
CVS anoncvs@CVS anoncvs.be.openbsd.org:/cvs
ericj@oshibana:~&gt; <strong>cvs -q up -Pd www</strong>
Warning: Remote host denied X11 forwarding, perhaps xauth program could not be run on the server side.
U www/want.html
M www/faq/faq8.html
ericj@oshibana:~&gt;
</pre>
</ul>

<h3>Autres options cvs</h3>
<p>Pour quelques personnes, la bande passante et le temps sont des facteurs importants 
  lors de la mise &agrave; jour des sources. CVS dispose d'une option -z[1-9] 
  qui utilise gzip pour compresser les donn&eacute;es. Pour l'utiliser, faites 
  -z[niveau-de-compression]. Par exemple, -z3 pour un niveau de compression de 
  3. </p>
<p>
<a name= "Ports"></a>
<a name= "8.6"></a>
<h2>8.6 - Qu'est-ce que l'arborescence des ports ?</h2>
<p></p>
<p></p>
<p></p>

<p>L'arborescence des ports est un ensemble de fichiers Makefile qui t&eacute;l&eacute;chargent, 
  appliquent des correctifs, configurent et installent des programmes pour que 
  vous puissiez les ex&eacute;cuter dans votre environnement OpenBSD sans avoir 
  &agrave; effectuer toutes les op&eacute;rations pr&eacute;cit&eacute;es manuellement. 
  Vous pouvez r&eacute;cup&eacute;rer l'arborescence des ports &agrave; partir 
  de <kbd>/pub/OpenBSD/3.0/ports.tar.gz</kbd> sur n'importe quel serveur ftp OpenBSD. 
  L'arborescence des ports la plus r&eacute;cente est disponible via le module 
  cvs <i>ports</i> ou &agrave; partir de <kbd>/pub/OpenBSD/snapshots/ports.tar.gz</kbd>. 
  Cependant, la plupart d'entre vous pr&eacute;f&eacute;reront utiliser les packages. 
  Ces derniers sont cr&eacute;es &agrave; partir de l'arborescence des ports et 
  sont d&eacute;j&agrave; compil&eacute;s et pr&ecirc;ts &agrave; &ecirc;tre utilis&eacute;s. 
  Pour en savoir plus sur les packages, consultez <a href= "#Packages"    >FAQ 
  8, Qu'est-ce que les packages?</a></p>
<h3>Obtenir la derni&egrave;re version de l'arborescence des ports</h3>
<p>Si vous comptez utiliser la derni&egrave;re version de l'arborescence des ports, 
  vous devriez avoir la derni&egrave;re version de OpenBSD. En effet, cela est 
  n&eacute;cessaire vu que l'arborescence des ports est constamment corrig&eacute;e 
  et modifi&eacute;e pour faciliter l'interaction avec le reste de votre syst&egrave;me 
  OpenBSD. Si vous ne tenez pas compte de ce conseil, attendez vous &agrave; quelques 
  probl&egrave;mes mineurs lors des mises &agrave; jour. </p>
<p>La meilleure fa&ccedil;on de maintenir l'arborescence des ports de OpenBSD 
  &agrave; jour est d'utiliser <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">cvs(1)</a>. 
  OpenBSD poss&egrave;de un groupe entier de serveurs CVS anonyme publiquement accessibles. 
  Pour en savoir plus sur cvs, consultez <a
  href="../../fr/anoncvs.html">www.openbsd.org/anoncvs.html</a> 
  et <a href= "#CVS"         >Qu'est-ce que CVS, et comment puis-je l'utiliser 
  ? </a></p>
<p>Si vous n'avez pas du tout de copie de l'arborescence des ports en local, 
  vous pouvez la t&eacute;l&eacute;charger &agrave; partir de n'importe quel serveur 
  ftp OpenBSD. <a href="../../fr/ftp.html">www.openbsd.org/fr/ftp.html</a> contient 
  la liste des serveurs. Une fois connect&eacute; &agrave; un serveur, t&eacute;l&eacute;chargez 
  /pub/OpenBSD/3.0/ports.tar.gz et ouvrez l'archive dans <i>/usr/ports</i>. Par 
  exemple : </p>
<ul><pre>
ericj@oshibana&gt; <strong>ftp ftp://ftp.fr.openbsd.org/pub/OpenBSD/3.0/ports.tar.gz</strong>
ericj@oshibana&gt; <strong>sudo cp ports.tar.gz /usr</strong>
ericj@oshibana&gt; <strong>cd /usr; sudo tar xfz ports.tar.gz</strong>
</pre></ul>

<p>Une fois ces op&eacute;rations achev&eacute;es, vous pouvez utiliser <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&sektion=1&format=html">cvs(1)</a> 
  pour mettre &agrave; jour votre arborescence des ports. Si vous avez commenc&eacute; 
  par l'arborescence des ports de OpenBSD 3.0, vous devez effectuer quelques changements. 
  <i>/usr/share/mk</i>, qui contient des fichiers utilis&eacute;s par <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&sektion=1&format=html">make(1)</a> 
  doit &ecirc;tre mis &agrave; jour. Si vous avez le module src, vous pouvez le 
  mettre &agrave; jour simplement de la mani&egrave;re suivante : </p>
<ul><pre>
ericj@oshibana&gt; <strong>cd /usr/src/share/mk; sudo make install</strong>
</pre></ul>

<p>Apr&egrave;s avoir fait cela, vous aurez probablement besoin de la derni&egrave;re 
  version du binaire <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&sektion=1&format=html">make(1)</a>. 
  Si vous n'avez pas le module src, vous pouvez r&eacute;cup&eacute;rer les sources 
  de <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&sektion=1&format=html">make(1)</a> 
  par <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">cvs(1)</a> 
  et les compiler. Par exemple: </p>
<ul><pre>
ericj@oshibana&gt; <strong>export CVS_RSH=/usr/bin/ssh</strong>
ericj@oshibana&gt; <strong>cvs -dCVS anonyme@any.CVS anonyme.server:/cvs get src/usr.bin/make</strong>
cvs server: Updating src/usr.bin/make
U src/usr.bin/make/Makefile
U src/usr.bin/make/Makefile.boot
U src/usr.bin/make/arch.c
U src/usr.bin/make/bit.h
U src/usr.bin/make/buf.c
U src/usr.bin/make/buf.h
U src/usr.bin/make/compat.c
[SNIP] 
ericj@oshibana&gt; <strong>cd src/usr.bin/make; sudo make install</strong>
</pre></ul>

<p>Si vous avez d&eacute;j&agrave; le module src sur votre machine, mettez &agrave; 
  jour make et installez-le. C'est pratiquement tout ce dont vous aurez besoin 
  pour avoir une arborescence des ports fonctionnelle. </p>
<p>Une snapshot de l'arborescence des ports est cr&eacute;&eacute;e 
quotidiennement et peut 
  &ecirc;tre t&eacute;l&eacute;charg&eacute; &agrave; partir de <strong>/pub/OpenBSD/snapshots/ports.tar.gz</strong> 
  d'un des <a href="../../ftp.html">serveurs ftp OpenBSD</a>. </p>

<h3>Quels sont les ports disponibles ? et comment les trouver ? </h3>
<p>Utilisez l'arborescence des ports pour chercher des mots-cl&eacute;s. Pour 
  faire ceci, utilisez la commande <kbd>make search key="searchkey"</kbd>. Voici 
  un exemple de recherche pour 'samba' : </p>
<ul><pre>
ericj@oshibana&gt; <strong>make search key=&quot;samba&quot;</strong>
Port:   samba-2.2.2
Path:   net/samba
Info:   SMB and CIFS client and server for UNIX
Maint:  Daniel Hartmeier <daniel@benzedrine.cx>
Index:  net
B-deps: devel/autoconf
R-deps:
Archs:  any

Port:   ADMsmb-0.2
Path:   /usr/ports/security/ADMsmb
Info:   Samba security scanner
Maint:  dugsong@monkey.org
Index:  security
B-deps:
R-deps:
Archs:  any
</pre></ul>

<h3>Installation des ports</h3>
<p>Les ports sont con&ccedil;us pour &ecirc;tre EXTREMEMENT faciles &agrave; configurer 
  et &agrave; installer. L'exemple ci-apr&egrave;s montre une installation de 
  xfig, un programme X11. Vous remarquerez que les d&eacute;pendances sont automatiquement 
  d&eacute;tect&eacute;es et compl&eacute;t&eacute;es: </p>
<p>D'abord, vous devez aller dans le r&eacute;pertoire du programme que vous voulez 
  installer. Si vous cherchez un programme, vous pouvez soit mettre &agrave; jour 
  votre base de donn&eacute;es locate, soit utiliser la fonction search pr&eacute;cit&eacute;e. 
  Une fois que vous &ecirc;tes dans le bon r&eacute;pertoire, tapez simplement 
  &quot;make install&quot;: <br>
</p>
<ul>
<pre>
fenetyllin:/usr/ports/graphics/xfig# <strong>make install</strong>
===&gt;  Extracting for xfig-3.2.2
===&gt;  xfig-3.2.2 depends on shared library: jpeg.62. - /usr/local/lib/libjpeg.so.62.0 found
===&gt;  xfig-3.2.2 depends on shared library: Xaw3d.6. - not found
===&gt;  Verifying install for Xaw3d.6. in /usr/ports/x11/Xaw3d
&gt;&gt; Xaw3d-1.3.tar.gz doesn't seem to exist on this system.
&gt;&gt; Attempting to fetch from ftp://crl.dec.com/pub/X11/contrib/widgets/Xaw3d/R6.1/.
Connected to crl.dec.com.
220 crl.dec.com FTP server (Digital UNIX Version 5.60) ready.
331 Guest login ok, send ident as password.
230 Guest login ok, access restrictions apply.
Remote system type is UNIX.
Using binary mode to transfer files.
200 Type set to I.
250 CWD command successful.
250 CWD command successful.
Retrieving pub/X11/contrib/widgets/Xaw3d/R6.1/Xaw3d-1.3.tar.gz
local: Xaw3d-1.3.tar.gz remote: Xaw3d-1.3.tar.gz
227 Entering Passive Mode (192,58,206,2,5,14)
150 Opening BINARY mode data connection for Xaw3d-1.3.tar.gz (0.0.0.0,0) (290277 bytes).
100% |**************************************************|   283 KB    00:00 ETA
226 Transfer complete.
290277 bytes received in 101.09 seconds (2.80 KB/s)
221 Goodbye.
===&gt;  Extracting for Xaw3d-1.3
/bin/mkdir -p /usr/ports/x11/Xaw3d/work/xc/lib/Xaw3d/X11/Xaw3d
cd /usr/ports/x11/Xaw3d/work/xc/lib/Xaw3d/X11/Xaw3d; ln -sf ../../*.h .
===&gt;  Patching for Xaw3d-1.3
===&gt;  Configuring for Xaw3d-1.3
mv -f Makefile Makefile.bak
imake -DUseInstalled -I/usr/X11R6/lib/X11/config
make Makefiles
[snip]
</pre></ul><p></p>


<h3>Liste des ports/packages install&eacute;s</h3>
<p>Vous pouvez voir la liste des ports et packages install&eacute;s en utilisant 
  la commande pkg_info :
<ul>
<pre>
bsd# <strong>/usr/sbin/pkg_info</strong>
zsh-4.0.4           The Z shell.
screen-3.9.1        A multi-screen window manager.
emacs-20.7          GNU editing macros.
tcsh-6.10.00        An extended C-shell with many useful features.
bash-1.14.7         The GNU Borne Again Shell.
zip-2.3             Create/update ZIP files compatible with pkzip.
ircii-20011210      An enhanced version of ircII, the Internet Relay Chat client
ispell-3.1.20       An interactive spelling checker.
tin-1.4.5           TIN newsreader (termcap based)
procmail-3.21       A local mail delivery agent.
strobe-1.06         Fast scatter/gather TCP port scanner
lsof-4.57B          Lists information about open files.
ntp-4.1.72          Network Time Protocol Implementation.
ncftp-3.0.4         ftp replacement with advanced user interface
nmh-1.0.4           The New MH mail handling program
bzip2-1.0.1         A block-sorting file compressor
</pre>
</ul>


<h3>Informations suppl&eacute;mentaires</h3>
<p>Vous pourrez trouver plus d'informations concernant les ports en consultant 
  la page du manuel <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&sektion=7&format=html">ports(7)</a>. 
</p>
<p>Notre arborescence de ports est constamment en &eacute;volution, et si vous 
  voulez nous aider &agrave; la faire &eacute;voluer, consultez s'il vous pla&icirc;t 
  <a href= "../../fr/ports.html">http://www.openbsd.org/fr/ports.html</a></p>

<p>
<a name= "Packages"></a>
<a name= "8.7"></a>
<h2>8.7 - Qu'est-ce que les packages?</h2>
<p></p>

<p>Les packages sont les binaires pr&eacute;compil&eacute;s de quelques programmes 
  tr&egrave;s utilis&eacute;s. Ils sont pr&ecirc;ts &agrave; l'utilisation sur 
  un syst&egrave;me OpenBSD. Comme les ports, les packages sont tr&egrave;s 
  faciles &agrave; maintenir et &agrave; mettre &agrave; jour. Des packages 
  sont ajout&eacute;s de mani&egrave;re constante alors regardez pour chaque version 
  les packages additionnels. </p>
<p>Voici une liste d'outils utilis&eacute;s pour g&eacute;rer les packages :<br>
</p>
<ul>
  <li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add">pkg_add(1)</a> 
    - un utilitaire pour installer les packages</li>
  <li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_create">pkg_create(1)</a> 
    - un utilitaire pour cr&eacute;er les packages</li>
  <li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete">pkg_delete(1)</a> 
    - un utilitaire pour supprimer des packages pr&eacute;c&eacute;demment install&eacute;s</li>
  <li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info">pkg_info(1)</a> 
    - un utilitaire pour afficher des informations sur les packages</li>
</ul>

<h3>O&ugrave; trouver les packages</h3>
<p>Si vous &ecirc;tes un utilisateur intelligent et que vous avez achet&eacute; 
  un <a href="../../orders.html">CD OpenBSD</a>, alors les packages se trouvent 
  sur un des CDs selon votre architecture. Si vous ne poss&eacute;dez pas un CD 
  OpenBSD, vous pouvez t&eacute;l&eacute;charger &agrave; partir de n'importe 
  quel miroir ftp. La page <a href="../../fr/ftp.html">http://www.openbsd.org/fr/ftp.html</a> 
  contient la liste des miroirs. Les packages se trouvent sous <i>/pub/OpenBSD/3.0/packages</i>. 
  Les sous-r&eacute;pertoires sont nomm&eacute;s d'apr&egrave;s les diff&eacute;rentes 
  architectures support&eacute;es par OpenBSD.</p>
<h3>Installation des packages</h3>
<p>L'utilitaire <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add">pkg_add(1)</a> 
  sert &agrave; installer les packages. Il est tr&egrave;s facile &agrave; utiliser. 
  Dans les deux exemples suivants, il sera utilis&eacute; pour installer un package. 
  Le premier exemple montre l'utilisation de pkg_add(1) pour installer un package 
  qui se trouve sur le disque local. Le second exemple montre une installation 
  de package &agrave; travers ftp. Dans les deux exemples, screen-3.9.1 sera install&eacute;.</p>
<ul>
  Installation &agrave; partir du disque local : 
  <pre>
$ <strong>sudo pkg_add -v screen-3.9.1.tgz</strong>
Requested space: 749864 bytes, free space: 2239117312 bytes in /var/tmp/instmp.cpsHA27596
Running install with PRE-INSTALL for `screen-3.9.1'
extract: Package name is screen-3.9.1
extract: CWD to /usr/local
extract: /usr/local/bin/screen-3.9.1
extract: execute 'ln -sf screen-3.9.1 /usr/local/bin/screen'
extract: /usr/local/man/man1/screen.1
extract: /usr/local/info/screen.info
extract: execute '[ -f /usr/local/info/dir ] || sed -ne '1,/Menu:/p' /usr/share/info/dir > /usr/local/info/dir'
extract: execute 'install-info /usr/local/info/screen.info /usr/local/info/dir'
extract: /usr/local/lib/screen/screencap
extract: /usr/local/lib/screen/screenrc
extract: CWD to .
Running mtree for `screen-3.9.1'
mtree -q -U -f +MTREE_DIRS -d -e -p /usr/local
Running install with POST-INSTALL for `screen-3.9.1'

+---------------
| The file /etc/screenrc has been created on your system.
| You may want to verify/edit its contents
|
| The file /usr/local/lib/screen/screencap contains a
| termcap like description of the screen virtual terminal.
| You may use it to update your terminal database.
| See <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=termcap&sektion=5&format=html">termcap(5)</a>.
+---------------

Attempting to record package into `/var/db/pkg/screen
Package `screen-3.9.1' registered in `/var/db/pkg/screen-3.9.1'
</pre>
</ul>

<p>Dans cet exemple, le drapeau <b>-v </b> a &eacute;t&eacute; utilis&eacute; 
  pour plus de verbosit&eacute;. Cette option n'est pas n&eacute;cessaire mais 
  aide au d&eacute;boguage. Elle a &eacute;t&eacute; utilis&eacute;e ici 
  pour montrer ce que pkg_add(1) &eacute;tait en train de faire. Notez la pr&eacute;sence 
  de quelques messages concernant <i>/etc/screenrc</i>. Ce type de messages sera 
  affich&eacute; que vous utilisiez le drapeau <b>-v </b>ou pas. </p>
<ul>
  Installation &agrave; partir de ftp 
  <pre>
$ <strong>sudo pkg_add ftp://ftp.openbsd.org/pub/OpenBSD/3.0/packages/i386/screen-3.9.1.tgz</strong>
&gt;&gt;&gt; ftp -o - ftp://ftp.openbsd.org/pub/OpenBSD/3.0/packages/i386/screen-3.9.1.tgz

+---------------
| The file /etc/screenrc has been created on your system.
| You may want to verify/edit its contents
|
| The file /usr/local/lib/screen/screencap contains a
| termcap like description of the screen virtual terminal.
| You may use it to update your terminal database.
| See termcap(5).
+---------------
</pre></ul>

<p>Vous pouvez voir l'installation d'un package pour plateforme i386. Modifiez 
  i386 par le nom correspondant &agrave; votre architecture. Les diff&eacute;rentes 
  architectures support&eacute;es par OpenBSD n'ont pas forc&eacute;ment les m&ecirc;me 
  packages. Certains ports ne fonctionnement pas sur certaines plateformes. Dans 
  cet exemple, <b>-v </b>n'a pas &eacute;t&eacute; utilis&eacute;. Ainsi, seulement 
  les messages NECESSAIRES sont affich&eacute;s. </p>
<h3>Voir et supprimer les packages install&eacute;s </h3>
<p>L'utilitaire <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info">pkg_info(1)</a> 
  sert &agrave; visualiser la liste des packages install&eacute;s sur votre syst&egrave;me. 
  Ceci est souvent n&eacute;cessaire pour trouver le nom correct d'un package 
  avant de pouvoir le supprimer. Pour voir quels packages sont install&eacute;s 
  sur votre syst&egrave;me, utilisez : 
<ul><pre>
$ <strong>pkg_info</strong>
mpg123-0.59r       mpeg audio 1/2 layer 1, 2 and 3 player
nmap-2.54BETA25    port scanning large networks
ircii-20011210     enhanced version of ircII (internet relay chat)
screen-3.9.1       multi-screen window manager
unzip-5.42         extract, list &amp; test files in a ZIP archive
ntp-4.1.72 	   Network Time Protocol implementation
icb-5.0.9          Internet CB - mostly-defunct chat client
</pre></ul>

<p>Pour supprimer un package, prenez le nom du package tel qu'il est affich&eacute; 
  par pkg_info() et utilisez <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete">pkg_delete(1)</a> 
  pour le supprimer. Dans l'exemple ci-apr&egrave;s, le package screen est supprim&eacute;. 
  Notez que dans certains cas, des instructions sont fournies pour effacer des 
  objets suppl&eacute;mentaires que pkg_delete(1) n'a pas supprim&eacute;. A l'instar 
  de pkg_add(1), vous pouvez utiliser le drapeau <b>-v </b> pour avoir une sortie 
  plus verbeuse. </p>
<ul><pre>
$ <strong>sudo pkg_delete screen-3.9.1</strong>

+---------------
| To completely deinstall the screen-3.9.1 package you need to perform
| this step as root:
|
|           rm -f /etc/screenrc
|
| Do not do this if you plan on re-installing screen-3.9.1
| at some future time.
+---------------
</pre></ul>

<p>
<a name= "NoFloppy"></a>
<a name= "8.8"></a>
<h2>8.8 - Y a t'il un moyen d'utiliser mon lecteur de disquettes alors qu'il n'&eacute;tait 
  pas connect&eacute; durant la phase de d&eacute;marrage ?</h2>
<p></p>
<p></p>
<p></p>
<p></p>
<p>Bien s&ucirc;r. Vous devez rajoutez &quot;flags 0x20&quot; &agrave; la fin 
  de la ligne fd* et recompiler votre noyau. En d&eacute;finitif, voici &agrave; 
  quoi ressemble cette ligne : </p>
<ul>
<pre>  fd*     at fdc? drive ? flags 0x20</pre>
</ul>

<p>Vous devriez &ecirc;tre capable maintenant d'utiliser votre lecteur de disquettes 
  quand vous le souhaitez. Cela n'aura plus d'importance si vous l'avez connect&eacute; 
  apr&egrave;s le d&eacute;marrage.</p>
<p><a name= "Bootloader"></a> <a name= "8.9"></a> </p>
<h2>8.9 - Les options de d&eacute;marrage - Utilisation du chargeur de d&eacute;marrage 
  OpenBSD</h2>
<p></p>

<p>Au d&eacute;marrage de votre syst&egrave;me OpenBSD, vous avez probablement 
  remarqu&eacute; le prompt de boot : 
<p>

<p>
<ul>boot&gt;</ul>
<p></p>
<p></p>

<p>La plupart des gens n'ont rien besoin de faire &agrave; ce niveau. Le syst&egrave;me 
  d&eacute;marrera automatiquement si aucune commande n'est donn&eacute;e. Cependant, 
  des probl&egrave;mes surviennent quelques fois lorsque des fonctions sp&eacute;ciales 
  sont n&eacute;cessaires. C'est &agrave; cet endroit que les options de d&eacute;marrage 
  interviennent. Pour commencer, vous devriez lire la page du manuel <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&sektion=8&format=html&arch=i386">boot(8)</a>. 
  Nous allons couvrir ici les commandes les plus fr&eacute;quemment utilis&eacute;es 
  avec le chargeur de d&eacute;marrage. </p>
<p>Si aucune commande n'est saisie, le chargeur de d&eacute;marrage essaiera automatiquement 
  de d&eacute;marrer <b>/bsd</b>. Si cette tentative &eacute;choue, il essaiera 
  de charger <b>/obsd<i> </i></b>et ainsi de suite jusqu'&agrave; ce qu'il trouve 
  un noyau ad&eacute;quat. Vous pouvez sp&eacute;cifier le noyau &agrave; charger 
  &agrave; l'aide de la commande suivante : </p>

<ul>
<p>
boot&gt; <strong>boot wd0a:/bsd</strong>
</ul>
ou
<ul>
boot&gt; <strong>b /bsd</strong>
</ul>
<p></p>

<p>Cette commande fonctionnera si wd0a est votre partition racine. </p>
<p>Voici une liste br&egrave;ve des options que vous pouvez utiliser avec le noyau 
  OpenBSD : </p>

<ul>
  <li><strong>-a</strong> : Cette option vous permettra de sp&eacute;cifier une 
    partition racine alternative apr&egrave;s chargement du noyau.</li>
  <li><strong>-c</strong> : Cette option vous permettra d'entrer en mode configuration. 
    Consultez la section <a href="faq5.html#BootConfig">Configuration au d&eacute;marrage</a> 
    de la FAQ.</li>
  <li><strong>-s</strong> : Cette option vous permet de d&eacute;marrer en mode 
    &quot;single user&quot;.</li>
  <li><strong>-d</strong> : Cette option est employ&eacute;e pour basculer
    le noyau dans le d&eacute;bogueur ddb. Il faut que DDB soit inclus dans votre 
    noyau. </li>
</ul>
<p></p>

<p>Ces options sont saisies dans le format <strong>boot [ image [-acds]]</strong> 
</p>
<p>Pour plus d'informations, vous pouvez lire la page de manuel <a href="http://www.OpenBSD.org/cgi-bin/man.cgi?query=boot_i386&sektion=8&format=html">boot_i386(8)</a></p>

<p>
<a name= "SKey"></a>
<a name="8.10"></a>
<h2>8.10 - Utilisation de S/Key sur votre syst&egrave;me OpenBSD</h2>
<p></p>

<p>S/Key est un syst&egrave;me de mots de passe &agrave; utilisation unique, ce 
  qui permet d'utiliser ces mots de passe au sein de canaux non s&eacute;curis&eacute;s. 
  C'est une fonctionnalit&eacute; fort utile pour les personnes ne pouvant pas 
  utiliser <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ssh&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">ssh(1)</a> 
  ou un autre canal chiffr&eacute;. L'impl&eacute;mentation OpenBSD de S/Key peut 
  utiliser différents d'algorithmes comme fonction de hachage &agrave; 
  sens unique. Voici une liste des algorithmes disponibles : </p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md4&sektion=3&format=html">md4</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md5&sektion=3&format=html">md5</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sha1&sektion=3&format=html">sha1</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rmd160&sektion=3&format=html">rmd160</a>.</li>
</ul>

<h3>Mise en place de S/Key - Les premi&egrave;res &eacute;tapes</h3>
<p>Pour commencer, le fichier <i>/etc/skeykeys </i>doit exister. Si ce fichier 
  n'existe pas, demandez au super-utilisateur de le cr&eacute;er : </p>
<ul>
<strong><pre>
# touch /etc/skeykeys
</pre></strong>
</ul>

<p>Une fois ce fichier cr&eacute;&eacute;, vous pouvez initialiser S/Key. Pour cela, 
  vous devez utiliser <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skeyinit&sektion=1&format=html">skeyinit(1)</a>. 
  Avec skeyinit(1), votre mot de passe d'acc&egrave;s au syst&egrave;me vous sera 
  d'abord demand&eacute;. C'est le m&ecirc;me mot de passe que celui que vous 
  utilisez pour vous connecter au syst&egrave;me. L'ex&eacute;cution de skeyinit(1) 
  dans un canal non s&eacute;curis&eacute; n'est pas recommand&eacute;. Vous devriez 
  donc effectuer cette op&eacute;ration &agrave; travers un canal s&eacute;curis&eacute; 
  (tel que ssh) ou la console. Une fois que votre mot de passe est valid&eacute;, 
  skeyinit(1) vous demandera un second mot de passe. Ce dernier est le <i>mot 
  de passe secret </i>et <b>NON </b> votre mot de passe syst&egrave;me. Le mot 
  de passe secret n'est pas limit&eacute; &agrave; 8 caract&egrave;res comme les 
  mots de passe syst&egrave;me; en fait, il doit avoir une longueur minimale de 
  10 caract&egrave;res. Quelques phrases sont sugg&eacute;r&eacute;es. Voici un 
  exemple d'ajout d'un utilisateur : </p>
<ul>
<pre>
oshibana:ericj&gt; <strong>skeyinit ericj</strong>
[Adding ericj]
Reminder - Only use this method if you are directly connected
   or have an encrypted channel.  If you are using telnet
   or rlogin, exit with no password and use skeyinit -s.
Enter secret password:
Again secret password:

ID ericj skey is otp-md5 99 oshi45820             
Next login password: HAUL BUS JAKE DING HOT HOG
</pre>
</ul>

<p>La ligne <i>ID ericj skey is otp-md5 99 oshi45820</i> est particuli&egrave;rement 
  int&eacute;ressante. Elle fournit beaucoup d'informations &agrave; l'utilisateur 
  comme expliqu&eacute; ci-apr&egrave;s : </p>
<ul>
  <li><i>otp-md5</i> - Ceci indique quelle fonction &agrave; sens unique a &eacute;t&eacute; 
    utilis&eacute;e pour cr&eacute;er votre mot de passe &agrave; usage unique 
    (One-Time Password ou otp).</li>
  <li><i>99</i> - C'est votre num&eacute;ro de s&eacute;quence. Ce num&eacute;ro 
    appartient &agrave; l'intervalle 1-100. Une fois le num&eacute;ro 1 atteint, 
    un autre mot de passe secret doit &ecirc;tre g&eacute;n&eacute;r&eacute;.</li>
  <li><i>oshi45820</i> - Ceci est votre cl&eacute;.</li>
</ul>

<p>Mais le plus important est votre mot de passe. Il consiste en 6 petits mots. 
  Combin&eacute;s, ils constituent votre mot de passe, espaces compris.</p>
<h3>Utilisation de S/Key pour se connecter</h3>
<p>Maintenant, S/Key est initialis&eacute; et vous avez votre mot de passe. Vous 
  &ecirc;tes pr&ecirc;t &agrave; vous connecter. Voici un exemple d'une session 
  utilisant S/Key pour se connecter :</p>
<ul>
  <pre>
oshibana:ericj&gt; ftp localhost
Connected to localhost.
220 oshibana.shin.ms FTP server (Version 6.4/OpenBSD) ready.
Name (localhost:ericj): ericj
331 Password [ otp-md5 96 oshi45820 ] for ericj required.
Password:
230- OpenBSD 2.5-current (OSHIBANA) #8: Tue Jun 22 19:20:16 EDT 1999
230-
230- Welcome to OpenBSD: The proactively secure Unix-like operating system.
230-
230- Please use the sendbug(1) utility to report bugs in the system.
230- Before reporting a bug, please try to reproduce it with the latest
230- version of the code.  With bug reports, please try to ensure that
230- enough information to reproduce the problem is enclosed, and if a
230- known fix for it exists, include that as well.
230-
230 User ericj logged in.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp&gt; quit
221 Goodbye.
</pre>
</ul>

<p>Vous avez peut-&ecirc;tre remarqu&eacute; que le num&eacute;ro de s&eacute;quence 
  a chang&eacute; : <i>otp-md5 96 oshi45820</i>. C'est normal puisque nous avons 
  utilis&eacute; S/Key pour vous connecter plusieurs fois. Mais comment avoir 
  votre nouveau mot de passe apr&egrave;s une connexion ? Il vous faudra conna&icirc;tre 
  votre cl&eacute; et votre num&eacute;ro de s&eacute;quence. Vous &ecirc;tes 
  peut-&ecirc;tre en train de chercher un moyen de vous rappeler de votre num&eacute;ro 
  de s&eacute;quence. En fait, vous n'en avez pas vraiment besoin. Il vous suffit 
  d'utiliser la commande <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skeyinfo&sektion=1&format=html">skeyinfo(1)</a>. 
  Par exemple, supposons que nous ayons besoin de g&eacute;n&eacute;rer un nouveau 
  mot de passe pour une connexion future (nous le faisons toujours &agrave; travers 
  un canal s&ucirc;r).</p>
<ul>
  <pre>
oshibana:ericj&gt; <strong>skeyinfo</strong>
95 oshi45820
</pre>
</ul>

<p>Maintenant, nous pouvons cr&eacute;er le mot de passe pour la prochaine connexion. 
  Nous utilisons pour cela <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=skey&sektion=1&format=html">skey(1)</a> 
  avec la sortie de la commande pr&eacute;c&eacute;dente.</p>
<ul>
<pre>
oshibana:ericj&gt; <strong>skey 95 oshi45820</strong>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password:
NOOK CHUB HOYT SAC DOLE FUME
</pre>
</ul>

<p>Il est plus que probable que beaucoup de personnes n'ont pas toujours acc&egrave;s 
  &agrave; un canal s&ucirc;r pour g&eacute;n&eacute;rer ces mots de passe, et 
  leur cr&eacute;ation &agrave; travers un canal non s&eacute;curis&eacute; n'est 
  pas faisable. Comment donc cr&eacute;er plusieurs mots de passe en une seule 
  fois ? Vous pouvez fournir &agrave; skey(1) le nombre de mots de passe que vous 
  voulez cr&eacute;er. Vous pourriez alors les imprimer et les emporter avec vous.</p>
<ul>
<pre>
oshibana:ericj&gt; <strong>skey -n 5 95 oshi45820</strong>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password:
91: SHIM SET LEST HANS SMUG BOOT
92: SUE ARTY YAW SEED KURD BAND
93: JOEY SOOT PHI KYLE CURT REEK
94: WIRE BOGY MESS JUDE RUNT ADD
95: NOOK CHUB HOYT SAC DOLE FUME
</pre>
</ul>

<p>Il est &agrave; noter que le dernier mot de passe de la liste doit &ecirc;tre 
  le premier utilis&eacute; vu que nous comptons de mani&egrave;re
  d&eacute;croissante &agrave; partir de 100.</p>
<h4>Utilisation de S/Key avec telnet(1), ssh(1), et rlogin(1)</h4>

<p>L'utilisation de S/Key avec <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=telnet&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">telnet(1)</a>, 
  ssh(1), et <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rlogin&apropos=0&sektion=0&manpath=OpenBSD%2BCurrent&arch=i386&format=html">rlogin(1)</a> 
  se fait &agrave; peu pr&egrave;s de la m&ecirc;me mani&egrave;re qu'avec ftp; 
  la seule diff&eacute;rence notable &eacute;tant l'utilisation du mot de passe 
  &quot;s/key&quot; en premier. Exemple : </p>
<ul>
<pre>
ericj@oshibana&gt; <strong>telnet localhost</strong>
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

OpenBSD/i386 (oshibana) (ttyp2)

login: ericj
Password:              &lt;------------ "s/key" entered.
otp-md5 98 oshi45821
Response: <strong>SCAN OLGA BING PUB REEL COCA</strong>
Last login: Thu Oct  7 12:21:48 on ttyp1 from 156.63.248.77
Warning: no Kerberos tickets issued.
OpenBSD 2.5-current (OSHIBANA) #4: Thu Sep  2 23:36:16 EDT 1999

Welcome to OpenBSD: The proactively secure Unix-like operating system.

Please use the sendbug(1) utility to report bugs in the system.
Before reporting a bug, please try to reproduce it with the latest
version of the code.  With bug reports, please try to ensure that
enough information to reproduce the problem is enclosed, and if a
known fix for it exists, include that as well.

You have mail.
ericj@oshibana&gt;
</pre></ul>

<p>
<a name= "MacTime"></a>
<a name="8.11"></a>
<h2>8.11 - Pourquoi mon Macintosh est si lent ? </h2>
<p></p>

<p>C'est &agrave; cause d'un bogue mat&eacute;riel. OpenBSD utilise des interruptions 
  d'horloge pour calculer la date courante, mais ces interruptions ont la plus 
  faible priorit&eacute; sur architecture Apple. Ainsi, durant des charges importantes 
  (telles celles caus&eacute;es par des activit&eacute;s disque ou r&eacute;seau), 
  des interruptions d'horloge sont perdues et l'horloge Unix n'avance pas comme 
  elle le devrait. </p>
<p>MacOS contourne ce probl&egrave;me de temps en acc&eacute;dant toujours &agrave; 
  l'horloge mat&eacute;rielle. OpenBSD lit cette horloge mat&eacute;rielle uniquement 
  durant la phase de d&eacute;marrage puis l'ignore par apr&egrave;s. Vous constaterez 
  peut-&ecirc;tre, durant la phase d'arr&ecirc;t, que le noyau n'est pas suffisamment 
  s&ucirc;r du temps Unix pour &eacute;crire sur l'horloge mat&eacute;rielle car 
  ce probl&egrave;me de temps est bien connu. </p>
<p>La meilleure solution consiste &agrave; utiliser ntpd (que vous pouvez trouver 
  dans la collection des ports) et g&eacute;rer les d&eacute;synchronisations 
  occasionnelles. Parfois, ces derni&egrave;res sont tellement importantes que 
  ntpd a peur d'avancer dans le temps. Dans ce cas, ajoutez l'option -g &agrave; 
  ntpd dans le fichier /etc/rc.securelevel pour forcer la synchronisation.</p>

<p> Une autre m&eacute;thode plus simple mais moins pr&eacute;cise est d'utiliser 
  <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&sektion=8&format=html">rdate(8)</a> 
  de mani&egrave;re r&eacute;guli&egrave;re, &agrave; travers une entr&eacute;e 
  crontab par exemple, avec l'option <b>-a </b>de pr&eacute;f&eacute;rence pour 
  &eacute;viter les &quot;sauts&quot; temporels. Le fichier <i>/etc/ppp/ppp.linkup 
  </i>constitue un autre bon endroit &agrave; partir duquel nous pourrions lancer 
  <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rdate&sektion=8&format=html">rdate(8)</a> 
  si vous n'&ecirc;tes pas connect&eacute; en permanence et que vous utilisez 
  PPP.</p>

<p> Voir aussi : <a href="http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17"> 
  http://www.macbsd.com/macbsd/macbsd-docs/faq/faq-3.html#ss3.17</a> 
<p>
<a name= "SMP"></a>
<a name="8.12"></a>
<h2>8.12 - Est-ce qu'OpenBSD supporte plusieurs processeurs ?</h2>
<p></p>
<p></p>
<p>Pas en ce moment. Le travail avance et il y a un <a href="../../smp.html"> 
  projet OpenBSD SMP (Symmetrical Multi-Processor)</a> bien qu'il n'y ait rien 
  d'utilisable &agrave; l'heure actuelle et aucun agenda n'a &eacute;t&eacute; 
  fix&eacute; pour le support SMP. </p>
<p></p>
<p></p>
<p>Sur la plupart des plateformes, OpenBSD peut tourner sur un syst&egrave;me 
  SMP mais n'utilisera qu'un processeur. L'exception est la plateforme SPARC -- 
  OpenBSD/SPARC ne pourra &ecirc;tre ex&eacute;cut&eacute; sur certains syst&egrave;mes 
  multi-processeurs SPARC ( en r&egrave;gle g&eacute;n&eacute;rale : un module 
  MBus marche toujours. Plusieurs modules MBus peuvent marcher tant qu'ils sont 
  uni-processeurs et qu'ils soient, bien entendu, <a href="../../fr/sparc.html">support&eacute;s</a>). 
  Les syst&egrave;mes multi-processeurs SPARC64 marchent &agrave; condition que 
  la machine soit <a href="../../fr/sparc64.html">support&eacute;e</a>. </p>
<p> <b>Comment puis-je aider ?</b><br>
<ul>
  <li>Ecrivez du code. Il y a beaucoup de travail &agrave; faire.
  <li>Donnez du mat&eacute;riel. Le but du projet SMP OpenBSD est de supporter 
    le plus de plateformes possibles, <a href="../../fr/sparc.html">SPARC</a>, 
    <a href="../../fr/sparc64.html">SPARC64</a>, <a href="../../fr/alpha.html">Alpha</a>, 
    <a href="../../fr/macppc.html">MacPPC</a> inclus et bien s&ucirc;r, <a href="../../fr/i386.html">i386</a>. 
    Les donations du <a href="../../want.html">mat&eacute;riel d&eacute;sir&eacute;</a> 
    sont encourag&eacute;es !
  <li>Ne vous proposez pas pour &quot;tester&quot;. Le projet SMP ne fait pas 
    encore partie du noyau du projet OpenBSD pour une raison : il n'est pas encore 
    pr&ecirc;t pour &ecirc;tre utilis&eacute; en production ou en test. Informer 
    les d&eacute;veloppeurs que &ccedil;a n'a pas march&eacute; sans le code n&eacute;cessaire 
    pour le faire fonctionner n'est pas utile maintenant. <a href="faq4.html#SendDmesg"> 
    Envoyez votre dmesg</a>. Si un d&eacute;veloppeur voit quelque chose d'int&eacute;ressant 
    dans votre configuration mat&eacute;rielle, il vous contactera pour tester.<br>
  
  <li>
</ul>
<p></p>

<p>
<a name= "TTY"></a>
<a name="8.13"></a>
<h2>8.13 - Parfois, j'ai des erreurs d'entr&eacute;e/sortie lorsque j'essaie d'utiliser 
  mes p&eacute;riph&eacute;riques tty </h2>
<p></p>
<p></p>
<P>Avec la version 2.6 (et ant&eacute;rieur) de OpenBSD, vous devez utiliser /dev/cuaXX 
  pour les connexions initi&eacute;es &agrave; partir du syst&egrave;me OpenBSD. 
  Les p&eacute;riph&eacute;riques /dev/ttyXX doivent seulement &ecirc;tre employ&eacute;es 
  pour les terminaux et les connexions d'appel entrant (dial-in). Auparavant, 
  il &eacute;tait possible d'utiliser les p&eacute;riph&eacute;riques tty mais 
  le noyau n'est plus compatible avec ce type d'utilisation. 
<P>Extrait de <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=cua&sektion=4&format=html">cua(4)</a>: 
<P>Pour les ports terminaux mat&eacute;riels, l'appel sortant (dial-out) est support&eacute; 
  &agrave; travers des noeuds p&eacute;riph&eacute;riques correspondants d&eacute;nomm&eacute;s 
  unit&eacute;s d'appel. Par exemple, le terminal /dev/tty03 aurait une unit&eacute; 
  d'appel correspondante d&eacute;nomm&eacute;e /dev/cua03. Ces deux p&eacute;riph&eacute;riques 
  sont diff&eacute;renci&eacute;s en cr&eacute;ant un p&eacute;riph&eacute;rique 
  pour l'unit&eacute; d'appel avec un nombre mineur sup&eacute;rieur de 128 par 
  rapport au noeud de p&eacute;riph&eacute;rique d'appel entrant. <i>Alors que 
  le p&eacute;riph&eacute;rique d'appel entrant (tty) requiert habituellement 
  un signal mat&eacute;riel pour indiquer au syst&egrave;me qu'il est actif, le 
  p&eacute;riph&eacute;rique d'appel sortant (dial-out) n'en pas besoin ; il peut donc communiquer 
  sans entrave avec un &eacute;quipement type modem. </i>Ce qui veut dire qu'un 
  programme comme <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&sektion=8&format=html">getty(8)</a> 
  se mettra en attente par rapport &agrave; un dispositif d'appel entrant jusqu'&agrave; 
  &eacute;tablissement d'une connexion. En m&ecirc;me temps, une connexion d'appel 
  sortant peut &ecirc;tre &eacute;tablie &agrave; partir du p&eacute;riph&eacute;rique 
  d'appel sortant (sur le m&ecirc;me port terminal mat&eacute;riel) sans g&ecirc;ner 
  quoi que ce soit dans le syst&egrave;me. Le programme <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&sektion=8&format=html">getty(8)</a> 
  ne remarque m&ecirc;me pas que quelque chose a lieu sur le port terminal. Si 
  un appel de connexion arrive apr&egrave;s que la connexion d'appel sortant soit 
  termin&eacute;e, le programme <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&sektion=8&format=html">getty(8)</a> 
  le g&eacute;rera sans probl&egrave;me et sans remarquer l'action g&eacute;n&eacute;r&eacute;e 
  par la connexion d'appel sortant. 
<p>
<a name= "Netscape"></a>
<a name="8.14"></a>
<h2>8.14 - O&ugrave; puis-je trouver un binaire Netscape pour OpenBSD ?</h2>
<p></p>

<p>Il n'y a pas de binaire Netscape pour OpenBSD. Cependant, et puisque OpenBSD 
  supporte l'&eacute;mulation binaire de plusieurs autres syst&egrave;mes d'exploitation, 
  vous pouvez utiliser d'autres binaires. </p>
<ul>
  <li>Sur les syst&egrave;mes I386, il est pr&eacute;f&eacute;rable d'utiliser 
    le binaire BSDI.
  <li>Sur les syst&egrave;mes SPARC, il est pr&eacute;f&eacute;rable d'utiliser 
    le binaire SUN-OS.
</ul>

<p>En utilisant la <a href="../../fr/ports.html">ports collection</a>, vous pouvez 
  installer ces binaires sans probl&egrave;me. Les ports Navigator et Communicator 
  sont situ&eacute;s sous <i>/usr/ports/www/netscape </i>si vous avez install&eacute; 
  l'arborescence des ports. </p>
<p>
<a name= "mg"></a>
<a name="8.15"></A>
</p>
<H2>8.15 - Comment s'utilise l'&eacute;diteur mg ? (faisant partie de OpenBSD 
  post-2.6 !!)</H2>
<P>mg est un micro &eacute;diteur texte ressemblant &agrave; Emacs. Micro veut 
  dire qu'il est tr&egrave;s petit (alors qu'Emacs est &eacute;norme !). Pour 
  les notions de base, consultez la page du manuel <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mg&sektion=1">mg(1)</a> 
  et le <a href="http://www.openbsd.org/cgi-bin/cvsweb/src/usr.bin/mg/tutorial?rev=1.1">guide 
  d'utilisation</a>, inclus avec le code source. Si vous avez d'autres questions 
  (comme par exemple : &quot;Je n'ai pas de touche Meta !&quot;), consultez la 
  <a href="http://www.lerner.co.il/emacs/faq_toc.html">FAQ Emacs</a>. 
<P>Vu que mg est une impl&eacute;mentation d'Emacs de petite taille, tr&egrave;s 
  similaire aux fonctionnalit&eacute;s d'&eacute;dition de texte de Emacs 17, 
  beaucoup de fonctionnalit&eacute;s de Emacs sont indisponibles (y compris des 
  fonctionnalit&eacute;s de messagerie et de news et des modes d'&eacute;dition 
  pour Lisp, C++, Lex, Awk, Java, etc...)
<p>
<a name= "ksh"></a>
<a name="8.16"></a>
<p>
<H2>8.16 - Apparemment, Ksh ne lit pas mon fichier .profile !</H2>
<P>Il y a deux raisons possibles : 
<UL>
  <LI>.profile n'est pas la propri&eacute;t&eacute; de l'utilisateur. Ceci est facile 
    &agrave; corriger: 
    <P> 
    <UL>
      <TT> # <b>chown username ~username/.profile</b> </TT> 
    </UL>
    <P> 
  <LI>Vous utilisez ksh &agrave; partir du syst&egrave;me X Window 
    <blockquote> 
      <p>Sous xterm, argv[0] pour ksh n'est pas pr&eacute;c&eacute;d&eacute; d'un 
        tiret. L'utilisation d'un tiret (-) avant argv[0] permet de faire savoir 
        &agrave; csh et &agrave; ksh qu'ils doivent interpr&eacute;ter leur fichiers 
        de login. (Pour csh, c'est le fichier .login avec un fichier .cshrc s&eacute;par&eacute; 
        qui est toujours ex&eacute;cut&eacute; quand csh est charg&eacute;. Pour 
        ksh, c'est plus visible car il n'y a qu'un seul script de d&eacute;marrage, 
        .profile. Ce fichier est ignor&eacute; si le shell n'est pas un shell 
        de connexion.)</p>
    </blockquote>
  
</UL>
<p>Pour corriger cela, cr&eacute;ez un fichier dans votre r&eacute;pertoire HOME 
  appel&eacute; .Xdefaults contenant la ligne <i>XTerm*loginShell: true</i> </p>
<UL>
  <blockquote>
    <p><TT> $ <b>echo "XTerm*loginShell: true" &gt; ~/.Xdefaults</b> </TT> </p>
  </blockquote>
</UL>
<p>Des fois, vous n'aurez pas besoin d&quot;effectuer cette op&eacute;ration car 
  quelques installations du syst&egrave;me X Window ont ce param&egrave;tre par 
  d&eacute;faut. OpenBSD a choisi de respecter le comportement de XFree86. </p>
<p>
<a name= "motd"></a>
<a name="8.17"></a>
<h2>8.17 - Pourquoi le contenu de /etc/motd est-il &eacute;cras&eacute; alors que 
  je l'ai modifi&eacute; ?</h2>
<p></p>

<p>Le fichier <i>/etc/motd </i>est &eacute;dit&eacute; &agrave; chaque d&eacute;marrage 
  du syst&egrave;me. La premi&egrave;re ligne est alors remplac&eacute;e par la 
  version du noyau du syst&egrave;me. Quand vous &eacute;ditez ce fichier, assurez-vous 
  de ne pas modifier les deux premi&egrave;res lignes afin d'&eacute;viter que 
  <i>/etc/rc </i>ne les modifie quand il &eacute;dite <i>/etc/motd </i>durant 
  la phase de d&eacute;marrage.
<p>
<a name= "wwwsolaris"></a>
<a name="8.18"></a>
<h2>8.18 - Pourquoi le site www.openbsd.org est h&eacute;berg&eacute; sur 
  une machine Solaris ?</h2>
<p></p>
<p>Bien qu'aucun des d&eacute;veloppeurs ne pense qu'elle soit pertinente, cette 
  question revient assez souvent dans les listes de diffusion pour m&eacute;riter 
  une r&eacute;ponse ici. <i>www.openbsd.org </i>et le principal site ftp de OpenBSD 
  sont h&eacute;berg&eacute;s par SunSITE &agrave; l'universit&eacute; 
  d'Alberta au Canada. Ces sites sont h&eacute;berg&eacute;s sur un grand syst&egrave;me 
  Sun, qui a acc&egrave;s a beaucoup d'espace de stockage et de bande passante 
  Internet. La pr&eacute;sence du SunSITE permet au groupe OpenBSD d'avoir acc&egrave;s 
  &agrave; cette bande passante. C'est pourquoi le site principal y est h&eacute;berg&eacute;. 
  Plusieurs miroirs OpenBSD sont sous OpenBSD, mais comme ils n'offrent aucune 
  garantie d'avoir acc&egrave;s &agrave; cette large bande passante, le groupe 
  a choisi d'h&eacute;berger le site principal sur le SunSITE de l'universit&eacute; 
  d'Alberta.
<p>
<a name= "PCI"></a>
<a name="8.19"></a>
<h2>8.19 - J'ai des probl&egrave;mes de d&eacute;tection de p&eacute;riph&eacute;riques 
  PCI sur OpenBSD 2.8</h2>
<p>Sous OpenBSD 2.8, il y a un cas o&ugrave; certaines machines peuvent ne pas 
  d&eacute;tecter correctement les p&eacute;riph&eacute;riques PCI, ou
  m&ecirc;eme
  se figer lorsqu'elles d&eacute;tectent plusieurs cartes r&eacute;seau. C'est 
  &agrave; cause du support PCIBIOS. La solution &agrave; ce probl&egrave;me est
  simple &agrave; mettre en oeuvre. Il suffit juste d'entrer dans le mode 
  configuration durant la phase de d&eacute;marrage et de d&eacute;sactiver 
  le support PCIBIOS. Voici un exemple 
  : </p>

<ul>
<table border=0 width="800">
        <tr>
                <td nowrap bgcolor="#EEEEEE">
<pre>
boot&gt; <b>boot -c</b>
OpenBSD 2.8 (GENERIC) #377: Tue Oct 24 03:04:08 MDT 2000
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
cpu0: Intel Pentium III (Coppermine) ("GenuineIntel" 686-class) 390 MHz
cpu0: FPU,V86,DE,PSE,TSC,MSR,PAE,MCE,CX8,SYS,MTRR,PGE,MCA,CMOV,PAT,PSE36,MMX,FXS
R,SIMD
real mem  = 66629632 (65068K)
avail mem = 56770560 (55440K)
using 838 buffers containing 3432448 bytes (3352K) of memory
UKC&gt; <b>disable pcibios</b>
UKC&gt; <b>quit</b>
[... snip ...]
</pre>
                </td>
        </tr>
</table>
</ul>

<p>Une fois cette op&eacute;ration effectu&eacute;e, suivez les instructions indiqu&eacute;es 
  dans <a href="faq5.html#Building">FAQ 5, Configuration du noyau</a> pour cr&eacute;er 
  un nouveau noyau sans support PCIBIOS.</p>
<p>
<a name= "TrueType"></a>
<a name="8.20"></a>
<h2>8.20 - Les polices anti-alias&eacute;es et &quot;TrueType&quot; sous OpenBSD 
  2.9/XFree86</h2>
<p></p>
<p> Consultez le <a href="truetype.html">document suivant</a>. </p>

<p>
<a name= "Journaling"></a>
<a name="8.21"></a>
<h2>8.21 - Est-ce qu'OpenBSD supporte des syst&egrave;mes de fichiers journalis&eacute;s 
  ?</h2>
<p></p>
<p>Non. Nous utilisons un m&eacute;canisme diff&eacute;rent appel&eacute; <a href="../faq14.html#SoftUpdates">Soft 
  Updates</a> pour arriver &agrave; des r&eacute;sultats similaires. Pour plus 
  de d&eacute;tails, lisez la FAQ 14. </p>
<P> <font color= "#0000e0"> <a href= "index.html">[Retour &agrave; l'Index G&eacute;n&eacute;ral]</a> 
  <a href= "faq7.html">[Vers la Section 7.0 - Param&eacute;trage du clavier]</a> 
  <a href= "../faq9.html">[Vers la Section 9.0 - Migrer depuis Linux]</a> </font> 
</p>

<p>
<hr>
<p><a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[back]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a> <br>
<small>
Originally [OpenBSD: faq8.html,v 1.84 2002/02/03 22:36:38 nick Exp ]<br>
$Translation: faq8.html,v 1.11 2003/09/22 20:29:35 saad Exp $<br>
$OpenBSD: faq8.html,v 1.6 2003/09/26 12:12:22 horacio Exp $ 
</small>
</p>
</body>
</html>
