<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>9 - Migrer vers OpenBSD</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2004 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href= "../faq8.html">[Section 8 - Questions G&eacute;n&eacute;rales]</a>
<a href= "faq10.html">[Section 10 - Gestion du Syst&egrave;me]</a>
</font>

<h1><font color="#e00000">9 - Astuces et conseils pour les utilisateurs
de Linux (et d'autres OS libres Unix-like)</font></h1>
<!-- UNCOMMENT ONLY WHEN THE FILE IS OUT OF SYNC

<hr>
<p>
<b><font color="#e00000">Remarque Importante :</font></b> Le contenu de
   ce fichier est obsol&egrave;te. Consultez la version anglaise
   <a href="../faq9.html">ici</a> pour des informations &agrave; jour.

<p>
Si vous souhaitez contribuez &agrave; l'effort de traduction,
pri&egrave;re de consulter
<a href="../../fr/translation.html">la page de traduction</a>.

-->
<hr>

<p>
<h3>Table Des Mati&egrave;res</h3>
<ul>
<li><a href="#Introduction">9.1 - Astuces et conseils pour les
    utilisateurs d'autres syst&egrave;mes d'exploitation Unix-like</a>
<li><a href="#DualBoot">9.2 - Double d&eacute;marrage de Linux et
    d'OpenBSD</a>
<li><a href="#passwd">9.3 - Convertir votre fichier de mots de passe de
    Linux (ou de tout autre System-7) au format BSD</a>
<li><a href="#Interact">9.4 - Ex&eacute;cution des binaires Linux sous
    OpenBSD </a>
<li><a href="#Ext2FS">9.5 - Acc&egrave;der &agrave; vos fichiers Linux
    depuis OpenBSD</a>
</ul>
Les utilisateurs Linux pourront trouver des informations
suppl&eacute;mentaires a l'adresse suivante :
<a href="http://sites.inka.de/mips/unix/bsdlinux.html">http://sites.inka.de/mips/unix/bsdlinux.html</a>.
<hr>
<br>


<p>
<a name= "Linux"></a>
<a name="Introduction"></a>
<h2>9.1 - Astuces et conseils pour les utilisateurs d'autres syst&egrave;mes
d'exploitation Unix-like</h2>

<p>
Bien qu'OpenBSD soit un syst&egrave;me d'exploitation Unix-like
tr&egrave;s traditionnel et tr&egrave;s familier pour les personnes
ayant utilis&eacute; d'autres syst&egrave;mes d'exploitation Unix-like,
il existe d'importantes diff&eacute;rences.
Les nouveaux utiliisateurs d'OpenBSD doivent se baser sur leur propre
exp&eacute;rience :
si votre connaissance d'Unix se limite &agrave; une certaine
exp&eacute;rience avec une variante de Linux, vous pourrez trouver
OpenBSD &quot;&eacute;trange&quot;. Soyez rassur&eacute;, Linux parait
aussi &quot;&eacute;trange&quot; pour quelqu'un qui a commenc&eacute;
son exp&eacute;rience d'Unix avec OpenBSD. Vous devez faire la
distinction entre le &quot;standard&quot; et votre exp&eacute;rience.

<p>
Si vous avez appris Unix &agrave; l'aide d'un des 
<a href="../../books.html">bons ouvrages </a> sur Unix en
g&eacute;n&eacute;ral, et si vous avez saisi la &quot;philosophie
Unix&quot; puis &eacute;tendu votre connaissance &agrave; un plate-forme
particuli&egrave;re, vous trouverez qu'OpenBSD est un Unix
&quot;vrai&quot; et tr&egrave;s familier. Si vous avez appris Unix en
utilisant un proc&eacute;d&eacute; de type &quot;saisis ceci au clavier
pour faire cela&quot; ou un livre tel que &quot;Apprendre PinkBeenie
v8.3 en
31.4 Heures&quot;, puis vous vous &ecirc;tes dit que vous &quot;connaissez
Unix&quot;, vous trouverez certainement OpenBSD tr&egrave;s diff&eacute;rent.

<p>
Une diff&eacute;rence importante entre OpenBSD et plusieurs autres
syst&egrave;mes d'exploitation est la documentation. Les
d&eacute;veloppeurs OpenBSD sont tr&egrave;s fiers des
<a href="http://www.openbsd.org/cgi-bin/man.cgi">pages de manuel</a> du
syst&egrave;me. Les pages de manuel sont <i>les</i>sources de
r&eacute;f&eacute;rence de la documentation OpenBSD -- ce qui n'est pas
le cas de cette FAQ ou des pages maintenues ind&eacute;pendamment du
projet ou des &quot;HOWTO&quot;s etc. Lorsqu'un d&eacute;veloppeur fait
une modification au niveau syst&egrave;me, on attend de sa part qu'il
mette &agrave; jour les pages du manuel en m&ecirc;me temps que la
modification du code syst&egrave;me, et pas &quot;apr&egrave;s&quot; ou
&quot;losqu'il aura le temps de le faire&quot; ou lorsque
&quot;quelqu'un se plain&quot;. Une page de manuel existe pour
virtuellement chaque programme, utilitaire, pilote, fichier de
configuration et ainsi de suite dans le syst&egrave;me de base. On
attend de la part de l'utilisateur qu'il prenne le temps d'effectuer des
recherches dans les pages du manuel avant de demander de l'aide sur les
<a href="../fr/mail.html">listes de diffusion</a>.

<p>Voici quelques unes des diff&eacute;rences les plus communes entre
   OpenBSD et d'autres variantes Unix.

<ul>
<li>OpenBSD est un Unix du style &quot;BSD&quot; assez pur, qui suit la
    conception 4.4BSD de mani&egrave;re rapproch&eacute;e. Linux et SCO
    Unix sont des syst&egrave;mes du syst&egrave;me &quot;System
    7&quot;. Certains syst&egrave;mes d'exploitation Unix-like (y
    compris quelques distributions Linux) font un m&eacute;lange de
    plusieurs caract&eacute;ristiques propres &agrave; Sys7 et &agrave;
    BSD. Cela pr&ecirc;te &agrave; confusion particuli&egrave;rement
    dans les <a href="faq10.html#rc">scripts de d&eacute;marrage</a>,
    pour lesquels OpenBSD utilise le syst&egrave;me traditionnel
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc&amp;sektion=8">rc(8)</a>
    4.4BSD.

<li>OpenBSD est un <i>syst&egrave;me</i> complet, destin&eacute;
    &agrave; &ecirc;tre maintenu de mani&egrave;re homog&egrave;ne. Ce
    n'est pas un &quot;noyau plus quelques utilitaires&quot; qui peuvent
    &ecirc;tre mis &agrave; jour s&eacute;paremment. Si vous n'arrivez
    pas &agrave; maintenir votre syst&egrave;me (noyau, utilitaires et
    applications) homog&egrave;ne, de mauvaises choses peuvent arriver.

<li>Etant donn&eacute; que plusieurs applications ne sont pas
    d&eacute;velopp&eacute;es pour &ecirc;tre compil&eacute;es
    directement et s'ex&eacute;cuter dans un environnement OpenBSD,
    OpenBSD a une <a href="../faq8.html#Ports">arborescence de
    ports</a>, un syst&egrave;me qui permet aux utilisateurs de
    facilement acqu&eacute;rir du code, le modifier pour qu'il soit
    compilable sur OpenBSD, installer des d&eacute;pendances, le
    compiler, et l'installer et le supprimer de mani&egrave;re
    standardis&eacute;e et maintenable. Des 
    <a href="../faq8.html#Packages">packages</a> pr&eacute;-compil&eacute;s
    sont cr&eacute;&eacute;s et distribu&eacute;s par l'&eacute;quipe de
    portage OpenBSD. Les utilisateurs sont 
    <a href="../faq8.html#PortsvsPkgs">encourag&eacute;s</a> &agrave;
    utiliser des packages au lieu de compiler les leurs.

<li>OpenBSD utilise CVS pour les modifications des sources. OpenBSD a
    &eacute;t&eacute; un pionnier d'
    <a href="../fr/anoncvs.html">anonymous CVS</a>, qui permet &agrave;
    n'importe qui d'extraire l'arborescence compl&egrave;te des sources
    pour n'importe quelle version d'OpenBSD (&agrave; partir de 2.0
    jusqu'&agrave; la version actuelle, y compris n'importe quelle
    r&eacute;vision de n'importe quel fichier situ&eacute;e entre ces
    deux versions) &agrave; n'importe quel moment, et vous pouvez
    acc&eacute;der aux modifications les plus r&eacute;centes &agrave;
    peine quelques heures apr&egrave;s qu'elles aient &eacute;t&eacute;
    effectu&eacute;. Il y a aussi une There is also a very convenient
    and easy to use
    <a href="http://www.openbsd.org/cgi-bin/cvsweb/">interface web pour CVS </a>
    tr&egrave;s utile et facile d'utilisation.

<li>OpenBSD produit une version officielle disponible sur 
    <a href="../../orders.html">CD</a> et par
    <a href="../fr/ftp.html">FTP</a> tous les six mois selon un
    <a href="faq1.html#Next">agenda pr&eacute;d&eacute;fini</a>. Des
    snapshots pour toutes les plates-formes support&eacute;es sont
    cr&eacute;&eacute;s de mani&egrave;re semi-r&eacute;guli&egrave;re
    &agrave; partir du code de d&eacute;veloppement le plus
    r&eacute;cent. Un des buts du projet OpenBSD est de garder
    l'arborescence des sources compilable &agrave; tout moment et de
    faire en sorte que le syst&egrave;me issu de la compilation de cette
    arborescence soit utilisable. L'arborescence peut conna&icirc;tre
    des probl&egrave;mes de compilation mais c'est &agrave; titre
    exceptionnel et ces probl&egrave;mes sont r&eacute;solus rapidement.

<li>OpenBSD contient <a href="../fr/crypto.html"> une cryptographie
    forte</a>, qui ne peut &ecirc;tre incluse dans des syst&egrave;mes
    d'exploitation provenant de certains pays.

<li>OpenBSD fait l'objet d'un audit s&eacute;curit&eacute; lourd et
    continu pour s'assurer de la qualit&eacute; (et donc, de la
    s&eacute;curit&eacute;) du code.

<li>Le noyau d'OpenBSD est<tt>/bsd</tt>.

<li>Les noms des disques durs sont du type <tt>/dev/wd</tt> (IDE) et
    <tt>/dev/sd</tt> (SCSI ou &eacute;quipements &agrave;
    &eacute;mulation SCSI)

<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ifconfig&amp;sektion=8">/sbin/ifconfig</a>
    sans arguments sous Linux fournit l'&eacute;tat de toutes les
    interfaces, mais sous OpenBSD (et plusieurs autres syst&egrave;mes
    d'exploitation), vous aurez besoin du drapeau <tt>-a</tt>.

<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=route&amp;sektion=8">/sbin/route</a>
    sans arguments sous Linux fournit l'&eacute;tat de toutes les routes
    actives, mais sous OpenBSD (et plusieurs autres syst&egrave;mes
    d'exploitation), vous aurez besoin du param&egrave;tre
    &quot;<i>show</i>&quot; ou utilisez la commande
    &quot;<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=netstat&amp;sektion=1"><tt>netstat -r</tt></a>&quot;.

<li>OpenBSD NE supporte pas les Syst&egrave;mes de Fichiers &agrave;
    Journaux tels que ReiserFS, JFS d'IBM ou XFS de SGI. Au lieu de
    cela, nous utilisons la fonctionnalit&eacute;
    <a href="../faq14.html#SoftUpdates">Soft Updates</a> du tr&egrave;s
    robuste Unix Fast File System (FFS) pour atteindre les objectifs de
    performance et de stabilit&eacute;.

<li>OpenBSD inclut <a href="../pf/fr/index.html">Packet Filter (PF)</a>,
    et non pas ipfw, ipchains, netfilter, iptables, ou ipf. Ce qui veut
    dire que la Traduction d'Adresses IP (connu sous le nom d'IP-
    Masquerading sous Linux), la gestion de la bande passante et le
    filtrage est effectu&eacute; via
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pfctl&amp;sektion=8">pfctl(8)</a>,
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&amp;sektion=4">pf(4)</a>,
    et
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf.conf&amp;sektion=5">pf.conf(5)</a>.
    Consultez le
    <a href="../pf/fr/index.html">Guide de l'Utilisateur PF</a>
    pour des informations d&eacute;taill&eacute;es sur la configuration.

<li>Les adresses des interfaces sont stock&eacute;es dans les fichiers
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hostname.if&amp;sektion=5">/etc/hostname.&lt;interfacename&gt;</a>
    (par exemple, <tt>/etc/hostname.dc0</tt> pour une interface
    r&eacute;seau utilisant le pilote
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dc&amp;sektion=4">dc(4)</a>).
    Ces fichiers peuvent contenir un nom d'h&ocirc;te (r&eacute;solu
    &agrave; partir de
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=hosts&amp;sektion=5">/etc/hosts</a>)
    au lieu d'une adresse IP.

<li>Le nom de la machine est dans le fichier
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=myname&amp;sektion=5">/etc/myname</a>

<li>La passerelle par d&eacute;faut est stock&eacute;e dans le fichier
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mygate&amp;sektion=5">/etc/mygate</a>

<li>Le shell utilisateur par d&eacute;faut d'OpenBSD est
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sh&amp;sektion=1">/bin/sh</a>,
    qui est <a href="http://web.cs.mun.ca/~michael/pdksh/">pdksh</a>, le
    shell Korn du domaine public en mode Bourne Shell. Les autres shells
    inclus sont
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=csh&amp;sektion=1">csh</a>
    (le <a href="faq10.html#rootshell">shell par d&eacute;faut</a> de <i>root</i>)
    et
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ksh&amp;sektion=1">ksh</a>.
    Les shells tels que <i>bash</i> et <i>tcsh</i> peuvent &ecirc;tre
    ajout&eacute;s &agrave; partir des 
    <a href="../faq8.html#Packages">packages</a> ou install&eacute;s
    &agrave; partir des <a href="../faq8.html#Ports">ports</a>. Les
    utilisateurs familiers avec <i>bash</i> sont encourag&eacute;s
    &agrave; <a href="faq10.html#ksh">essayer ksh(1)</a> avant
    d'installer bash sur leur syst&egrave;me -- il a la plupart des
    fonctionnalit&eacute;s que les utilisateurs utilisent dans
    <i>bash</i>.

<li>La gestion des mots de passe est diff&eacute;rente de celle de la
    plupart des autres syst&egrave;mes d'exploitation Unix-like. Les
    mots de passe sont stock&eacute;s dans le fichier
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=master.passwd&amp;sektion=5">master.passwd(5)</a>
    qui ne peut &ecirc;tre lu que par <i>root</i>.
    Ce fichier ne doit &ecirc;tre modifi&eacute; que par le programme
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vipw&amp;sektion=8">vipw</a>.

<li>Les p&eacute;riph&eacute;riques sont appel&eacute;s selon le pilote
    et pas selon le type. Par exemple, il n'existe pas de
    p&eacute;riph&eacute;riques eth*. Pour une carte Ethernet NE2000,
    &ccedil;a serait ne0 et xl0 pour des p&eacute;riph&eacute;riques
    Ethernet 3Com Etherlink XL ou Fast Etherlink XL etc. Tous ces
    pilotes ont des pages de manuel dans la section 4. Ainsi, pour en
    savoir plus sur les messages que votre pilote 3c905 affiche, vous
    pouvez faire
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=xl&amp;sektion=4">"<tt>man 4 xl</tt>"</a>.

<li>OpenBSD/i386 utilise un syst&egrave;me de partitionnement de disque
    &agrave; "deux couches", o&ugrave; la premi&egrave;re couche est la
    partition <a href="../faq14.html#fdisk">fdisk</a>, visible depuis le
    BIOS, et avec laquelle la plupart des utilisateurs d'ordinateurs
    compatibles IBM sont familiers. La seconde couche est le
    <a href="../faq14.html#disklabel">disklabel</a>, un syst&egrave;me
    de partionnement BSD traditionnel. OpenBSD supporte un maximum de 15
    partitions disklabel sur un disque, toutes dans la m&ecirc;me
    partition fdisk. Ceci permet &agrave; OpenBSD/i386 de coexister avec
    d'autres syst&egrave;mes d'exploitation, y compris d'autres
    syst&egrave;mes d'exploitation Unix-like. OpenBSD doit faire partie
    des 4 partitions &quot;primaires&quot;.

<li>Certains syst&egrave;mes d'exploitation vous encouragent &agrave;
    adapter votre noyau &agrave; votre machine. Les utilisateurs
    d'OpenBSD sont <a href="faq5.html#Why">encourag&eacute;s</a>
    &agrave; utiliser le noyau standard GENERIC fourni et test&eacute;
    par les d&eacute;veloppeurs. Les utilisateurs souhaitant
    &quot;adapter&quot; et &quot;optimiser&quot; causent souvent plus de
    probl&egrave;mes qu'ils n'en r&eacute;solvent et aucun ne leur sera
    fourni par les d&eacute;veloppeurs.

<li>L'&eacute;quipe de d&eacute;veloppement OpenBSD travaille dur pour
    maintenir la
    <a href="../fr/policy.html">politique de copyright</a> et la 
    <a href="../../security.html">securit&eacute;</a> du projet.
    Pour cette raison, certaines nouvelles versions de logiciels qui ne
    remplissent pas les objectifs de licence ou de
    s&eacute;curit&eacute; ne sont pas int&eacute;gr&eacute;es &agrave;
    OpenBSD, et pourraient ne jamais l'&ecirc;tre. La
    s&eacute;curit&eacute; et les licences libres ne seront jamais
    n&eacute;glig&eacute;es au profit d'un num&eacute;ro de version plus
    grand.
 
</ul>
<br>

<p>
<a name= "DualBoot"></a>
<h2>9.2 - Double d&eacute;marrage de Linux et de OpenBSD</h2>

<p>
Oui c'est possible !

<p>
Lisez <a href= "ftp://ftp.openbsd.org/pub/OpenBSD/3.5/i386/INSTALL.linux">INSTALL.linux</a>.

<p>
<a name= "passwd"></a>
<h2>9.3 - Convertir votre fichier de mots de passe de Linux (ou de tout
      autre System-7) au format BSD</h2>

<p>
Tout d'abord, d&eacute;terminez si votre fichier de mots de passe Linux
est en mode shadow ou pas. Si c'est le cas, installez 
<a href="http://www.openwall.com/john/">John the Ripper</a> et utilisez
son utilitaire unshadow pour faire fusionner les fichiers
<tt>passwd</tt> et <tt>shadow</tt> en un seul fichier type System-7.

<p>
En utilisant votre fichier de mots de passe Linux, que nous allons
appeler <tt>linux_passwd</tt>, vous devez rajouter &quot;::0:0&quot;
entre les champs quatre et sept.
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=awk&amp;sektion=1">awk(1)</a>
peut faire cela pour vous.

<blockquote>
<pre>
# <b>cat linux_passwd | awk -F : # '{printf("%s:%s:%s:%s::0:0:%s:%s:%s\n", \</b>
</pre>
</blockquote>

A partir de l&agrave;, vous devriez &eacute;diter le fichier
<tt>new_passwd</tt> et enlever les entr&eacute;es correspondantes
&agrave; root et d'autres entit&eacute;s syst&egrave;me qui sont
d&eacute;j&agrave; pr&eacute;sentes dans le fichier de mots de passe
OpenBSD ou ne sont pas applicables &agrave; OpenBSD (toutes). De
m&ecirc;me, assurez vous qu'il n'y a pas des noms d'utilisateurs ou des
ID utilisateurs dupliqu&eacute;s entre <tt>new_passwd</tt> et le fichier
<tt>/etc/passwd</tt> de la machine OpenBSD. La mani&egrave;re la plus
facile consiste &agrave; utiliser un nouveau<i>
</i><tt>/etc/passwd</tt>.

<blockquote>
<pre>
# <b>cat new_passwd &gt;&gt; /etc/master.passwd</b>
# <b>pwd_mkdb -p /etc/master.passwd</b>
</pre>
</blockquote>

La derni&egrave;re &eacute;tape, <tt>pwd_mkdb</tt>, est
n&eacute;cessaire pour reconstruire les fichiers /etc/spwd.db et
/etc/pwd.db. Cette commande cr&eacute;e aussi un fichier de mots de
passe au format System-7 (sans les mots de passe crypt&eacute;s)
d&eacute;nomm&eacute; /etc/passwd pour les programmes qui l'utilisent.
OpenBSD utilise un algorithme de cryptage plus fort, blowfish, qui est
rarement pr&eacute;sent dans d'autres syst&egrave;mes qui utilisent des
fichiers de mots de passe au format System-7. Pour utiliser cet
algorithme plus solide, dites aux utilisateurs d'utiliser 'passwd' et de
changer leur mot de passe. Le nouveau mot de passe sera crypt&eacute;
avec l'algorithme par d&eacute;faut (blowfish si vous n'avez pas
&eacute;dit&eacute; /etc/passwd.conf). Ou, en utilisateur <i>root</i>,
vous pouvez utiliser <tt>passwd <i>username</i></tt>.


<p>
<a name= "Interact"></a>
<h2>9.4 - Ex&eacute;cution des binaires Linux sous OpenBSD</h2>

<p>
OpenBSD/i386 est capable d'ex&eacute;cuter des binaires Linux lorsque le noyau
est compil&eacute; avec l'option COMPAT_LINUX et le param&egrave;tre sysctl
kern.emul.linux positionn&eacute;.
Si vous utilisez le noyau GENERIC (ce qui devrait &ecirc;tre le cas
normalement), l'option COMPAT_LINUX est incluse et vous aurez juste
besoin de positionner le param&egrave;tre sysctl pr&eacute;cit&eacute; comme suit :

<blockquote>
<pre>
# <b>sysctl kern.emul.linux=1</b>
</pre>
</blockquote>

Pour que cette modification soit prise en compte &agrave; chaque red&eacute;marrage de
la machine, supprimez le caract&egrave;re "#" (commentaire) au d&eacute;but de la
ligne

<blockquote>
<pre>
#kern.emul.linux=1      # enable running Linux binaries
</pre>
</blockquote>

dans le fichier /etc/sysctl.conf. Vous devez alors obtenir : 

<blockquote>
<pre>
kern.emul.linux=1       # enable running Linux binaries
</pre>
</blockquote>

puis red&eacute;marrez votre syst&egrave;me pour que cette modification puisse prendre
effet.

<p>
Pour utiliser des binaires Linux qui ne sont pas statiquement
li&eacute;s (la plupart d'entre eux), vous devez suivre les instructions
de la page du manuel
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&amp;sektion=8">compat_linux(8)</a>. 

<p>
Un moyen simple d'obtenir la plupart des librairies Linux les plus
communes est d'installer <tt>redhat/base</tt> &agrave; partir de la
collection de ports. Pour plus d'informations concernant la collection
de ports, consultez <a href="../faq8.html#Ports">FAQ 8, Ports</a>. Si
vous avez d&eacute;j&agrave; l'arborescence des ports, utilisez les
commandes suivantes pour installer les librairies Linux :

<blockquote>
<pre>
# <b>cd /usr/ports/emulators/redhat/base</b>
# <b>make install</b>
</pre>
</blockquote>

<p>
<a name= "Ext2FS"></a>
<h2>9.5 - Acc&egrave;der &agrave; vos fichiers Linux depuis OpenBSD</h2>

<p>
OpenBSD supporte le syst&egrave;me de fichiers EXT2FS. Utilisez 

<blockquote>
<pre>
# <b>disklabel <i>disk</i></b>
</pre>
</blockquote>

(o&ugrave; <tt><b><i>disk</i></b></tt> est le nom du
p&eacute;riph&eacute;rique correspondant &agrave; votre disque,
<tt><b>wd0</b></tt> par exemple) pour voir o&ugrave; se trouve votre
partition Linux. Cependant, <b>n'utilisez pas</b>
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=disklabel&amp;sektion=8">disklabel (8)</a> 
ou
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fdisk&amp;sektion=8">fdisk (8)</a> 
pour modifier le disklabel.

<p>
Pour plus d'informations concernant disklabel, veuillez consulter
<a href="../faq14.html#disklabel">FAQ 14, Disklabel</a>.

<p>
<font color= "#0000e0">
<a href= "index.html">[Index de La FAQ]</a>
<a href= "../faq8.html">[Section 8 - Questions
G&eacute;n&eacute;rales]</a>
<a href= "faq10.html">[Section 10 - Gestion du syst&egrave;me]</a>
</font>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[back]"></a>
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq9.html,v 1.64 ]<br>
$Translation: faq9.html,v 1.24 2004/08/31 15:39:39 saad Exp $<br>
$OpenBSD: faq9.html,v 1.18 2004/08/31 16:16:23 saad Exp $
</small>

</body>
</html>
