<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Objetivos do projeto OpenBSD</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="the OpenBSD project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2002 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Objetivos do Projeto</font></h2>
<hr>

<p>
Obviamente, cada desenvolvedor trabalhando no OpenBSD possui
seus objetivos e prioridades, por&eacute;m &eacute; poss&iacute;vel classificar
os objetivos que temos em comum:

<p>
<ul>
<li>Promover a melhor plataforma de desenvolvimento poss&iacute;vel.
	<a href="../anoncvs.html">Prover acesso total ao c&oacute;digo fonte
	aos desenvolvedores e usu&aacute;rios, incluindo a habilidade e 
	olhar as altera&ccedil;&otilde;es na &aacute;rvore CVS diretamente.</a>
	Os usu&aacute;rios podem at&eacute; olhar as altera&ccedil;&otilde;es
	de nossa &aacute;rvore de c&oacute;digos fonte
	<a href="http://www.openbsd.org/cgi-bin/cvsweb">diretamente na web!</a><p>
<li>Integrar bons c&oacute;digos de qualquer origem com uma <a href="../policy.html">
	pol&iacute;tica de copyright aceit&aacute;vel (Preferido estilo Berkeley,
	GPL aceito, NDA n&atilde;o)</a>. Queremos tornar dispon&iacute;veis 
	c&oacute;digos fonte que qualquer um possa usar para QUALQUER FIM, sem 
	restri&ccedil;&otilde;es. <strong>Nos esfor&ccedil;amos para fazer nosso 
	software robusto e seguro e encorajamos as empresas a usar qualquer parte 
	dele.</strong> Existem <a href="../products.html">produtos comerciais</a>
	baseados no OpenBSD.<p>
<li>Prestar aten&ccedil;&atilde;o aos <a href="../security.html">
	problemas de seguran&ccedil;a e consert&aacute;-los antes que qualquer
	outro o fa&ccedil;a</a>. (Tentar ser o sistema operacional #1 em seguran&ccedil;a).<p>
<li><a href="crypto.html">Realizar uma boa integra&ccedil;&atilde;o de softwares
	criptogr&aacute;ficos.</a> Isso significa IPsec, IPv6, mecanismos de chaves,
	Kerberos, free-AFS, e outras formas de criptografia forte ou sistemas
	de uso criptogr&aacute;fico. O OpenBSD &eacute; desenvolvido e lan&ccedil;ado no
	Canad&aacute;, e de acordo com as leis canadenses &eacute; permitida a
	exporta&ccedil;&atilde;o de criptografia para o mundo. (De acordo
	<a href="http://www.efc.ca/pages/doc/crypto-export.html">
	com a pesquisa de um cidad&atilde;o canadense</a> e tamb&eacute;m com a 
	<a href="http://axion.physics.ubc.ca/ECL.html">
	lista de Controle de Exporta&ccedil;&atilde;o Canadense</a>).
	Os desenvolvedores do OpenBSD est&atilde;o fazendo pesquisas e desenvolvimentos
	ativos no IPsec.<p>
<li>Seguir e implementar padr&otilde;es (ANSI, POSIX, partes do X/Open, etc.)<p>	
<li>Trabalhar em prol de um c&oacute;digo fonte bastante independente de plataforma.
<a href="plat.html">Suportar o maior n&uacute;mero poss&iacute;vel de sistemas
	e hardware diferentes</a>.<p>
<li>Ser livre de pol&iacute;ticas de sistema; as solu&ccedil;&otilde;es
	devem ser tomadas com base em m&eacute;ritos t&eacute;cnicos.<p>
<li>N&atilde;o deixar problemas s&eacute;rios sem solu&ccedil;&atilde;o.<p>	
<li>Prover um bom sistema de compila&ccedil;&atilde;o/desenvolvimento multi-plataforma.<p>
<li>Importar pacotes externos com modifica&ccedil;&otilde;es m&iacute;nimas tornando
	a atualiza&ccedil;&atilde;o muito mais f&aacute;cil. E tamb&eacute;m enviar aos
	seus desenvolvedores as altera&ccedil;&otilde;es efetuadas no pacote.<p>
<li>Lan&ccedil;ar uma vers&atilde;o baseada em CDROM aproximadamente a cada seis 
	meses, com o objetivo particular de ajudar os fundos do projeto...<p>
</ul>

<a name=funding></a>
<h2><font color="#e00000">Fundos&nbsp;do&nbsp;Projeto</font></h2>

Naturalmente, o projeto OpenBSD necessita de fundos para operar, os
principais agravantes disso s&atilde;o os custos com Internet e 
atualiza&ccedil;&otilde;es de hardware que qualquer projeto enfrenta. 
Por esta raz&atilde;o, o projeto vende CDROMs de nossa mais recente 
vers&atilde;o. O projeto come&ccedil;ou tamb&eacute;m a vender camisetas
para ajudar financeiramente o projeto. Portanto, quando voc&ecirc; compra
um CD ou camiseta do OpenBSD, em uma confer&ecirc;ncia, outras localidades,
ou de nossa <a href="orders.html">p&aacute;gina de pedidos de CDROM</a>, 
voc&ecirc; est&aacute; colaborando para que o projeto continue a 
lan&ccedil;ar novas vers&otilde;es.
<p>
É poss&iacute;vel tamb&eacute;m doar fundos ou <a href="want.html">hardware</a>, 
para que seu nome possa aparecer em nossa 
<a href="donations.html">p&aacute;gina de doa&ccedil;&otilde;es</a>.
Para maiores informa&ccedil;&otilde;es, contate
<a href="mailto:deraadt@openbsd.org">Theo de Raadt</a> ou simplesmente
envie um cheque de doa&ccedil;&atilde;o em moeda canadense ou americana 
para:<p>

OpenBSD<br>
812 23rd Ave SE<br>
Calgary, Alberta<br>
Canad&aacute;<br>
T2G 1N8<br>
(Endosse o cheque a "Theo de Raadt", pois n&atilde;o posso receber cheques
endossados ao "OpenBSD".)<br>

<p>
Adicionalmente, &eacute; poss&iacute;vel tamb&eacute;m doar dinheiro para o projeto de forma
online via
<a href="https://https.openbsd.org/cgi-bin/order">cart&atilde;o de cr&eacute;dito</a> ou
<a href="https://secure.paypal.com/xclick/business=paypal%40openbsd.org&amp;item_name=OpenBSD+Donation&amp;no_shipping=1">PayPal</a>.
<p>
Pelo motivo de que as doa&ccedil;&otilde;es n&atilde;o s&atilde;o 
dedut&iacute;veis como contribui&ccedil;&otilde;es de caridade, elas podem 
ser deduzidas como custos operacionais, e se algu&eacute;m est&aacute; 
t&atilde;o disposto a deduzir seus impostos, essa pessoa deve pedir
aux&iacute;lio ao seu contador. O mesmo se aplica a outros pa&iacute;ses, 
onde as corpora&ccedil;&otilde;es podem realizar doa&ccedil;&otilde;es sob
os termos da "Boa Vontade".

<p>
No in&iacute;cio do projeto, Theo de Raadt gastou mais de $30,000 (CDN) para
iniciar o OpenBSD, a maioria gra&ccedil;as aos altos custos de conectividade
de rede no Canad&aacute; (pelo motivo das restri&ccedil;&otilde;es de 
criptografia, n&atilde;o &eacute; poss&iacute;vel mover o projeto para os
Estados Unidos). Desde ent&atilde;o, nenhum fundo significante ou 
contribui&ccedil;&atilde;o financeira foi recebido de nenhuma companhia ou
institui&ccedil;&atilde;o educacional. Theo trabalha o dia inteiro melhorando
o OpenBSD, e muitos dos fundos do projeto s&atilde;o gastos para adquirir 
novo hardware para os desenvolvedores para que assim eles continuem a 
aprimorar o OpenBSD (por exemplo, mais de 20 tipos de placas de rede 
apareceram no mercado desde que o OpenBSD foi iniciado).
Portanto, os fundos s&atilde;o necess&aacute;rios a todo o momento. As 
cont&iacute;nuas doa&ccedil;&otilde;es de nossa base de usu&aacute;rios 
&eacute; o que garante que o OpenBSD continuar&aacute; a
existir.
<hr>

<h2><font color="#e00000">Aonde&nbsp;nossos&nbsp;desenvolvedores&nbsp;vivem?</font></h2>

Este mapa d&aacute; uma vis&atilde;o aproximada de onde nossos 
desenvolvedores vivem. Tentaremos atualiz&aacute;-lo ocasionalmente, mas por favor 
n&atilde;o conte com isso.

<p>
<center>
<img src="../images/map.jpg" height=508 width=950 alt= "World map">
</center>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: goals.html,v 1.61 ]<br>
$Translation: goals.html,v 1.6 2003/06/22 22:58:53 eduardo Exp $<br>
$OpenBSD: goals.html,v 1.6 2003/06/27 21:31:31 jufi Exp $
</small>
</body>
</html>
