<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>Version 2.3 d'OpenBSD</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="page principale d'OpenBSD">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="Ce document est copyright 2003 d'OpenBSD.">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">

<a href="index.html"><img alt="[OpenBSD]" src="../images/logo23.jpg" 
border=0 width=368 height=80></a>
<hr>

<p>
<a href=../images/openbsd23_cover.gif><img src=../images/cd23-s.gif 
height=90 width=90></a>
<h2><font color=#0000e0>La Version 2.3 d'OpenBSD :</font></h2>
<p> Sortie le 19 mai 1998.<br>
Copyright 1997-1998, Theo de Raadt.
<p>

<a href="../orders.html">Pour commander un CD de la version 2.3 cliquez ici.</a>

<h3><font color=#0000e0>
Pour obtenir les fichiers de cette version :
<ul>
<li><strong>Commander un CDROM depuis notre syst&egrave;me de 
commandes.</strong>
        Si vous voulez qu'un libraire pr&egrave;s de chez vous vous 
	l'obtienne, demandez lui de commander<br>
	<font color=#e00000>ISBN 0-9683637-1-7</font>.
<li>Lisez bri&egrave;vement le reste de ce document.
    <li>Jetez un coup d'oeil &agrave; la <a href="../errata23.html">page des erratas 
      2.3</a> pour une liste des bogues et des solutions. 
  </ul>
</font></h3>

Tous les copyrights applicables et les diff&eacute;rents cr&eacute;dits se 
trouvent dans les fichiers sources se trouvant dans src.tar.gz et
srcsys.tar.gz.
<p> Vous trouverez ci-apr&egrave;s les instructions qui se trouvent sur la jaquette 
  du CDROM (<a
href="../orders.html">http://www.OpenBSD.org/orders.html</a>). Les instructions 
  pour effectuer une installation par FTP (ou autres) sont tr&egrave;s semblables, 
  les instructions pour l'installation par le CDROM sont laiss&eacute;es telles 
  quelles pour vous montrer qu'il est beaucoup plus simple d'installer depuis 
  le CDROM. 
<p>
<hr>
Veuillez consulter les fichiers suivants sur les CDROMs pour plus de
d&eacute;tails quant &agrave; l'installation d'OpenBSD 2.3 sur votre machine :
<p>
<dl>
<li>	CD1:2.3/i386/INSTALL.i386
<li>	CD1:2.3/arc/INSTALL.arc
<li>	CD1:2.3/mac68k/INSTALL.mac68k
<li>	CD1:2.3/pmax/INSTALL.pmax
<li>	CD1:2.3/sparc/INSTALL.sparc
<li>	CD1:2.3/hp300/INSTALL.hp300
<p>
<li>	CD2:2.3/amiga/INSTALL.amiga
<li>	CD2:2.3/alpha/INSTALL.alpha
<li>	CD2:2.3/mvme68k/INSTALL.mvme68k
<li>	CD2:2.3/powerpc/INSTALL.powerpc
</dl>
<hr>
<p>
Informations pour une installation rapide, faites pour les personnes
famili&egrave;res avec OpenBSD, et avec l'utilisation de la nouvelle
commande "disklabel -E". Si vous n'&ecirc;tes pas &agrave; l'aise avec
l'installation d'OpenBSD, lisez les fichiers INSTALL.* correspondants
cit&eacute;s ci-dessus.
<p>
<h3><font color=#e00000>i386 :</font></h3>
<p>
Manipulez les options du BIOS, et voyez si vous pouvez d&eacute;marrer depuis
le CD, en utilisant le CD1. Si ce n'est pas possible, copiez
CD1:2.3/i386/floppy23.fs sur une disquette, et d&eacute;marrez avec ça. Si
vous d&eacute;sirez m&eacute;langer OpenBSD avec un autre syst&egrave;me 
d'exploitation, vous aurez sans doute besoin de lire INSTALL.i386. 
<p> Pour cr&eacute;er une disquette depuis MS-DOS, utilisez /2.3/tools/rawrite.exe. 
  Sous Unix, utilisez "dd if=&lt;fichier&gt; of=/dev/&lt;p&eacute;riph&eacute;rique&gt; 
  bs=32k" (o&ugrave; le p&eacute;riph&eacute;rique devrait &ecirc;tre "floppy", 
  "rfd0c" ou "rfd0a"). Utilisez une disquette correctement format&eacute;e SANS 
  BLOCS D&Eacute;FECTUEUX ou vous n'y arriverez pas. 
<p>
<h3><font color=#e00000>ARC :</font></h3>
<p> En utilisant le CD1, dites &agrave; la ROM de BOOT de lancer le fichier CD1:\2.3\arc\bsd.rd. 
  Si cela ne marche pas, cr&eacute;ez un syst&egrave;me de fichiers MS-DOS en 
  utilisant le programme d'installation de votre revendeur, copiez dessus CD1:2.3/arc/bsd.rd 
  et essayez de le d&eacute;marrer. 
<p>
<h3><font color=#e00000>SPARC :</font></h3>
<p>
Pour d&eacute;marrer depuis le CD1, taper "boot cdrom 2.3/sparc/bsd.rd", ou
"b sd(0,6,0)2.3/sparc/bsd.rd" suivant la version de votre ROM. Vous
pouvez aussi copier CD1:2.3/sparc/floppy23.fs sur une disquette et la
d&eacute;marrer en utilisant "boot fd()" ou "boot floppy" suivant la version
de votre ROM. Une troisi&egrave;me alternative est de copier
CD1:2.3/sparc/kc.fs et CD1:2.3/sparc/inst.fs sur deux disquettes
diff&eacute;rentes. Ins&eacute;rez "kc.fs" et d&eacute;marrez avec la 
proc&eacute;dure d&eacute;crite ci-dessus. Une fois que la disquette 
s'&eacute;jecte, ins&eacute;rez "inst.fs". R&eacute;pondez aux questions. 
Red&eacute;marrer depuis la disquette "kc.fs". Cette fois, quand la 
disquette s'&eacute;jecte, r&eacute;ins&eacute;rez la et r&eacute;pondez 
aux autres questions.
<p>
<h3><font color=#e00000>PMAX :</font></h3>
<p>
Mettez le fichier simpleroot23.fs au d&eacute;but du disque en utilisant dd
sur une autre machine. Apr&egrave;s avoir chang&eacute; le disque de machine, 
utilisez "boot -f rz(0,0,0)/bsd" (2100/3100) ou "boot 5/rz0a/bsd" (5000). 
Autrement, installez via le r&eacute;seau comme d&eacute;crit en d&eacute;tail 
dans INSTALL.pmax.
<p>
<h3><font color=#e00000>AMIGA :</font></h3>
<p>
Cr&eacute;er les partitions BSD suivant les instructions de la section
pr&eacute;paration de INSTALL.amiga. Montez le CD2 sur AmigaOS en tant que
p&eacute;riph&eacute;rique CD0, ensuite ex&eacute;cutez la commande CLI 
suivante : "CD0:2.3/amiga/utils/loadbsd CD0:2.3/amiga/bsd.rd".
<p>
<h3><font color=#e00000>HP300 :</font></h3>
<p>
Vous pouvez d&eacute;marrer depuis le r&eacute;seau en suivant les 
instructions de INSTALL.hp300.
<p>
<h3><font color=#e00000>ALPHA :</font></h3>
<p>
Votre alpha doit utiliser un firmware SRM (pas ARC). Si vous avez un
CDROM, vous pouvez essayer "boot -fi 2.3/alpha/bsd.rd dkaX" (utilisez
"show device" pour trouver l'identifiant de votre lecteur de
CDROM). Sinon, copier CD2:2.3/alpha/floppy.fs sur une disquette et
d&eacute;marrer la en tapant "boot dva0". Si cela ne fonctionne pas, vous
pouvez placer bsd.rd sur un autre p&eacute;riph&eacute;rique et le 
d&eacute;marrer, ou utiliser le simpleroot fourni.
<p>
<h3><font color=#e00000>MAC68K :</font></h3>
<p> D&eacute;marrez MacOS normalement et partitionnez votre disque avec les configurations 
  A/UX appropri&eacute;es. Effectuez une extraction des utilitaires Macside de 
  CD1:2.3/mac68k/utils sur votre disque dur. Lancez Mkfs pour cr&eacute;er votre 
  syst&egrave;me de fichiers sur les partitions A/UX que vous venez de faire. 
  Ensuite utilisez l'installeur BSD/Mac68k pour copier tous les fichiers dans 
  CD1:2.3/mac68k/ sur vos partitions. Pour finir, vous pourrez configurer le booter 
  BSD/Mac68k avec l'emplacement de votre noyau et d&eacute;marrer votre syst&egrave;me. 
<p>
<h3><font color=#e00000>MVME68K :</font></h3>
<p> Theo n'a pas vraiment d'id&eacute;e. Dans l'urgence pour finir tout le reste, 
  les utilitaires d'installation pour le port mvme68k n'ont jamais &eacute;t&eacute; 
  fini. Assez de code est inclu, de cette fa&ccedil;on, une personne avec assez 
  de connaissances pourrait trouver la mani&egrave;re de l'installer; peut-&ecirc;tre 
  via le r&eacute;seau. Bonne chance ! 
<hr>
<p>
<h3><font color=#e00000>REMARQUES A PROPOS DU CODE SOURCE :</font></h3>
<p>
src.tar.gz contient une archive des sources se trouvant dans
/usr/src. Ce fichier contient tout except&eacute; les sources du noyau, qui
sont dans une archive s&eacute;par&eacute;e. Pour l'extraire :
<p>
<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>
<p>
srcsys.tar.gz contient une archive des sources se trouvant dans
/usr/src/sys. Ce fichier contient toutes les sources du noyau
n&eacute;cessaires pour reconstruire un noyau. Pour l'extraire :
<p>
<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>
<p>
Ces deux arborescences sont r&eacute;guli&egrave;rement mises &agrave; 
jour dans le CVS. En utilisant ces arborescences, il est possible d'utiliser 
les serveurs anoncvs imm&eacute;diatement comme d&eacute;crit dans <a
href="anoncvs.html">http://www.OpenBSD.org/fr/anoncvs.html</a>. 
Utiliser ces fichiers est beaucoup plus rapide que d'obtenir la
totalit&eacute; des sources depuis un serveur anoncvs.
<p>
<hr>
<p>
<h3><font color=#e00000>ARBORESCENCE DES PORTS</font></h3>
<p>
Une archive de l'arborescence des ports est &eacute;galement fournie. Pour
l'extraire :
<p>
<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>
<p> Le sous-r&eacute;pertoire ports/ est une version de l'arborescence des ports 
  OpenBSD. Veuillez lire <a
href="ports.html">http://www.OpenBSD.org/ports.html</a> si vous ne savez rien 
  &agrave; leur sujet. Ce document n'est pas un manuel sur l'utilisation des ports. 
  C'est plut&ocirc;t une introduction rapide sur le syst&egrave;me des ports OpenBSD. 
<p>
Bien sur, le syst&egrave;me des ports OpenBSD n'est pas
complet. L'int&eacute;gration compl&egrave;te des ports dans l'environnement 
OpenBSD est encore un projet jeune &agrave; ce jour. Nous pensons que les ports
fournis sont stables mais il est plus important de r&eacute;aliser que les
ports vont continuer &agrave; grossir tout en apportant de nouvelles
fonctionnalit&eacute;s dans le futur.
<p>
Comme nous l'avons dit pr&eacute;c&eacute;demment, les ports vont grossir dans 
le futur. Le r&eacute;pertoire ports/ repr&eacute;sente une version CVS des 
ports (voir la page du manuel cvs(1) si vous n'&ecirc;tes pas familier avec 
CVS). Comme pour l'arborescence des sources, notre arborescence des ports est
disponible par anoncvs. Donc pour mettre &agrave; jour votre arborescence des
ports depuis un media en lecture-&eacute;criture, il suffit de lancer la
commande suivante :
<p>
<pre>
# cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd
</pre>
<p>
[Bien sur, vous devez remplacer le r&eacute;pertoire local et le nom du
serveur ici par l'emplacement de votre collection des ports et le
serveur anoncvs le plus proche.]
<p>
Il est important de lire la page web pour les instructions sp&eacute;cifiques
car il s'agit d'un nouveau service qui n'a pas encore &eacute;t&eacute; 
test&eacute; intensivement.
<p> Mais, malgr&eacute; la jeunesse des ports, vous ne manquerez pas d'aide. Si 
  vous &ecirc;tes int&eacute;ress&eacute; par l'ajout d'un port, vous voulez aider, 
  ou vous voulez juste en savoir plus, la liste de discussion ports@openbsd.org 
  vous sera utile. 
<hr>
<a href="index.html"><img height=24 width=24 src=../back.gif border=0 
alt=OpenBSD></a>
<a href=mailto:www@openbsd.org>www@openbsd.org</a><br>
<small>
<!--
Originally [OpenBSD: 23.html,v 1.29 ]<br>
$Translation: 23.html,v 1.4 2005/01/17 21:29:44 aanriot Exp $<br>
-->
$OpenBSD: 23.html,v 1.4 2005/01/18 09:53:24 jufi Exp $
</small>

</body>
</html>

