<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD version 2.6</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="the main OpenBSD page">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2001 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#24248E">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/fishbowl_sm.jpg"><img align=left hspace="24" src="../images/fishbowl_sm.jpg"></a>
<h2><font color=#0000e0>La version 2.6 d'OpenBSD :</font></h2>
<p>

Sortie le premier d&eacute;cembre 1999.<br>
Copyright 1997-1999, Theo de Raadt.
<p>

<a href=#new>Quoi de neuf ?</a>
<p>

<a href="../orders.html">Pour commander un CD de la version 2.6 cliquez ici.</a>

<h3><font color=#0000e0>
Pour obtenir les fichiers de cette version :
<ul>
    <li><strong>Commander un CDROM depuis notre <a href="../orders.html">syst&egrave;me de commandes</a>.</strong> 
      Si vous voulez qu'un libraire pr&egrave;s de chez vous vous l'obtienne, 
      demandez lui de commander <br>  
	<font color=#e00000>ISBN 0-9683637-4-1</font>.
<li>Voir les informations sur la <a href="ftp.html">page FTP</a> pour
une liste des machines miroirs 
<li>Aller dans le r&eacute;pertoire <font
color=#e00000>pub/OpenBSD/2.6/</font> sur l'un des sites miroirs 
<li>Lisez bri&egrave;vement le reste de ce document. 
<li>Jetez un oeil sur la <a href="../errata26.html">page des erratas
2.6</a> pour une liste des bugs et des solutions. 
</ul>
</font></h3>
<br clear=all>
<br>
<p>

Tous les copyrights applicables et les diff&eacute;rents cr&eacute;dits se trouvent
dans les fichiers sources se trouvant dans src.tar.gz et
srcsys.tar.gz. 
<p>
Ensuite vous allez trouver les instructions qui se trouvent sur la
jaquette du CDROM (<a
href="../orders.html">http://www.OpenBSD.org/orders.html</a>). Les
instructions pour effectuer une installation par FTP (ou autres) sont
tr&egrave;s semblables, les instructions pour l'installation par le CDROM
sont laiss&eacute;es telles quelles pour vous montrer qu'il est beaucoup plus
simple d'installer depuis le CDROM. 
<p>
<hr>
Veuillez consulter les fichiers suivants sur les CDROMs pour plus de
d&eacute;tails quant &agrave; l'installation d'OpenBSD 2.6 sur votre machine : 
<p>
<dl>
<li>	CD1:2.6/i386/INSTALL.i386
<li>	CD1:2.6/sparc/INSTALL.sparc
<p>
<li>	CD2:2.6/alpha/INSTALL.alpha
<li>	CD2:2.6/amiga/INSTALL.amiga
<li>	CD2:2.6/mac68k/INSTALL.mac68k
<li>	CD2:2.6/hp300/INSTALL.hp300
<p>
<li>Une version pmax est disponible sur les sites FTP mais pas sur les CD.
</dl>
<hr>
<p>
Informations pour une installation rapide, faites pour les personnes
famili&egrave;res avec OpenBSD, et avec l'utilisation de la nouvelle
commande "disklabel -E". Si vous n'&ecirc;tes pas &agrave; l'aise avec
l'installation d'OpenBSD, lisez les fichiers INSTALL.* correspondants
cit&eacute;s ci-dessus. 
<p>
<h3><font color=#e00000>i386 :</font></h3>
<p>
Manipuler les options du BIOS, et voyez si vous pouvez d&eacute;marrer depuis
le CD, en utilisant le CD1. Si ce n'est pas possible, copiez
CD1:2.6/i386/floppy26.fs sur une disquette, et d&eacute;marrez avec ça. Si
vous d&eacute;sirez m&eacute;langer OpenBSD avec un autre syst&egrave;me d'exploitation,
vous aurez sans doute besoin de lire INSTALL.i386. 
<p>
Pour cr&eacute;er une disquette depuis MS-DOS, utilisez
/2.6/tools/rawrite.exe. Sous Unix, utilisez "dd if=&lt;fichier&gt;
of=/dev/&lt;p&eacute;riph&eacute;rique&gt; bs=32k" (ou le p&eacute;riph&eacute;rique devrait &ecirc;tre
"floppy", "rfd0c" ou "rfd0a"). Utilisez une disquette correctement
format&eacute;e SANS BLOCS D&Eacute;FECTUEUX ou vous n'y arriverez pas. 
<p>
<h3><font color=#e00000>sparc :</font></h3>
<p>
Pour d&eacute;marrer depuis le CD1, taper "boot cdrom 2.6/sparc/bsd.rd", ou
"b sd(0,6,0)2.6/sparc/bsd.rd" suivant la version de votre ROM. Vous
pouvez aussi copier CD1:2.6/sparc/floppy26.fs sur une disquette et la
d&eacute;marrer en utilisant "boot fd()" ou "boot floppy" suivant la version
de votre ROM. Une troisi&egrave;me alternative est de copier
CD1:2.6/sparc/kc.fs et CD1:2.6/sparc/inst.fs sur deux disquettes
diff&eacute;rentes. Ins&eacute;rez "kc.fs" et d&eacute;marrez avec la proc&eacute;dure d&eacute;crite
ci-dessus. Une fois que la disquette s'&eacute;jecte, ins&eacute;rez
"inst.fs". R&eacute;pondez aux questions. Red&eacute;marrer depuis la disquette
"kc.fs". Cette fois, quand la disquette s'&eacute;jecte, r&eacute;ins&eacute;rez la et
r&eacute;pondez aux autres questions.
<p>
<h3><font color=#e00000>amiga :</font></h3>
<p>
Cr&eacute;er les partitions BSD suivant les instructions de la section
pr&eacute;paration de INSTALL.amiga. Montez le CD2 sur AmigaOS en tant que
p&eacute;riph&eacute;rique CD0, ensuite ex&eacute;cutez la commande CLI suivante :
"CD0:2.6/amiga/utils/loadbsd CD0:2.6/amiga/bsd.rd". 
<p>
<h3><font color=#e00000>hp300 :</font></h3>
<p>
Vous pouvez d&eacute;marrer depuis le r&eacute;seau en suivant les instructions de
INSTALL.hp300. 
<p>
<h3><font color=#e00000>alpha :</font></h3>
<p>
Votre alpha doit utiliser un firmware SRM (pas ARC). Si vous avez un
CDROM, vous pouvez essayer "boot -fi 2.6/alpha/bsd.rd dkaX" (utilisez
"show device" pour trouver l'identifiant de votre lecteur de
CDROM). Sinon, copier CD2:2.6/alpha/floppy.fs sur une disquette et
d&eacute;marrer la en tapant "boot dva0". Si cela ne fonctionne pas, vous
pouvez placer bsd.rd sur un autre p&eacute;riph&eacute;rique et le d&eacute;marrer, ou
utiliser le simpleroot fourni.  
<p>
<h3><font color=#e00000>mac68k :</font></h3>
<p>
D&eacute;marrez MacOS normalement et partitionez votre disque avec les
configurations A/UX appropri&eacute;es. Extrayez les utilitaires
Macside de CD1:2.6/mac68k/utils sur votre disque dur. Lancez Mkfs pour
cr&eacute;er votre syst&egrave;me de fichiers  sur les partitions A/UX que vous
venez de faire. Ensuite utilisez l'installeur BSD/Mac68k pour copier
tous les fichiers dans CD1:2.6/mac68k/ sur vos partitions. Pour finir,
vous pourrez configurer le booter BSD/Mac68k avec l'emplacement de
votre noyau et d&eacute;marrer votre syst&egrave;me. 
<p>
<h3><font color=#e00000>Remarques &agrave; propos du code source :</font></h3>
<p>
src.tar.gz contient une archive des sources se trouvant dans
/usr/src. Ce fichier contient tout except&eacute; les sources du noyau, qui
sont dans une archive s&eacute;par&eacute;e. Pour l'extraire : 
<p>
<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>
<p>
srcsys.tar.gz contient une archive des sources se trouvant dans
/usr/src/sys. Ce fichier contient toutes les sources du noyau
n&eacute;cessaires pour reconstruire un noyau. Pour l'extraire : 
<p>
<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>
<p>
Ces deux arborescences sont r&eacute;guli&egrave;rement mises &agrave; jour dans le CVS. En
utilisant ces arborescences, il est possible d'utiliser les serveurs
anoncvs imm&eacute;diatement comme d&eacute;crit dans <a
href="anoncvs.html">http://www.OpenBSD.org/fr/anoncvs.html</a>. 
Utiliser ces fichiers est beaucoup plus rapide que d'obtenir la
totalit&eacute; des sources depuis un serveur anoncvs. 
<p>
<hr>
<p>
<h3><font color=#e00000>Arborescence des ports</font></h3>
<p>
Une archive de l'arborescence des ports est &eacute;galement fournie. Pour
l'extraire : 
<p>
<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>
<p>
Le sous r&eacute;pertoire ports/ est une version de l'arborescence des ports
OpenBSD. Veuillez lire <a
href="ports.html">http://www.OpenBSD.org/ports.html</a> si vous ne
savez rien &agrave; leur sujet. Ce document n'est pas un manuel sur
l'utilisation des ports. C'est plus une introduction rapide sur le
syst&egrave;me des ports OpenBSD. 
<p>
Bien sur, le syst&egrave;me des ports OpenBSD n'est pas
complet. L'int&eacute;gration compl&egrave;te des ports dans l'environnement OpenBSD
est encore un projet jeune &agrave; ce jour. Nous pensons que les ports
fournis sont stables mais il est plus important de r&eacute;aliser que les
ports vont continuer &agrave; grossir tout en apportant de nouvelles
fonctionnalit&eacute;s dans le futur.  
<p>
Comme nous l'avons dit pr&eacute;c&eacute;demment, les ports vont grossir dans le
futur. Le r&eacute;pertoire ports/ repr&eacute;sente une version CVS des ports (voir
la page du manuel cvs(1) si vous n'&ecirc;tes pas familier avec CVS). Comme
pour l'arborescence des sources, notre arborescence des ports est
disponible par anoncvs. Donc pour mettre &agrave; jour votre arborescence des
ports depuis un media en lecture-&eacute;criture, il suffit de lancer la
commande suivante : 
<p>
<pre>
# cd [r&eacute;pertoire des ports]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd
</pre>
<p>
[Bien sur, vous devez remplacer le r&eacute;pertoire local et le nom du
serveur ici par l'emplacement de votre collection des ports et le
serveur anoncvs le plus proche.] 
<p>
Il est important de lire la page web pour les instructions sp&eacute;cifiques
car il s'agit d'un nouveau service qui n'a pas encore &eacute;t&eacute; test&eacute;
intensivement. 
<p>
Mais, malgr&eacute; la jeunesse des ports, vous ne manquerez pas d'aide. Si
vous &ecirc;tes int&eacute;ress&eacute; par l'ajout d'un port, voulez aider, ou voulez
juste en savoir plus, la liste de discussion ports@openbsd.org vous
sera utile. 

<hr>
<a name=new></a>
<p>
<h3><font color=#e00000>QUOI DE NEUF</font></h3>
<p>
Ci-dessous se trouve une liste partielle des nouvelles fonctionnalit&eacute;s
incluses dans OpenBSD 2.6. Pour une liste compl&egrave;te, voir le <a
href="../plus26.html">journal des changements</a> jusqu'&agrave; la 2.6. 
<p>

<ul>
<li>L'ajout le plus int&eacute;ressant est OpenSSH
(http://www.OpenSSH.com/). Il s'agit d'une version libre et
r&eacute;utilisable de SSH bas&eacute;e sur une version ancienne &eacute;crite par Tatu
Ylonen (1.2.12). Cette version fut la derni&egrave;re avec une licence
libre. OpenSSH a &eacute;t&eacute; mis &agrave; jour jusqu'aux standards actuels et utilise
la biblioth&egrave;que OpenSSL. Il est libre sauf pour les utilisateurs
commerciaux aux USA (&agrave; cause du brevet RSA aux USA). OpenSSH a &eacute;t&eacute;
d&eacute;velopp&eacute; par OpenBSD et a &eacute;t&eacute; port&eacute; sur FreeBSD et Linux.   

<li>Une manipulation astucieuse nous permet de distribuer le m&ecirc;me
CDROM (USA et reste du monde) et de maintenir toute la force de la
cryptographie sans violer le brevet RSA aux USA.  

<li>Beaucoup de changements &agrave; la documentation, notamment les pages du
manuel et la FAQ. Les pages du manuel fournissent maintenant des
exemples clairs &agrave; la place de certaines explications. En gardant la
documentation concise et en deux endroits diff&eacute;rents, nous esp&eacute;rons
&eacute;viter l'explosion des documents de type "How-To" qui ne permettent
pas de centraliser l'information.  

<li>Une collection des "ports" plus compl&egrave;te. Les ports sont la
m&eacute;thode &agrave; utiliser pour t&eacute;l&eacute;charger et compiler des applications
libres depuis le r&eacute;seau (applications, lecteurs de mail, navigateurs,
etc...). Les utilisateurs ont juste besoin d'aller dans le r&eacute;pertoire
correspondant et de taper "make install" pour d&eacute;marrer un processus
qui va r&eacute;cup&eacute;rer les sources, les corriger pour OpenBSD, compiler et
installer le package. La plupart des ports sont aussi disponibles en
packages pr&eacute;-compil&eacute;s. 

<li>Inclus : 
<ul>
<li>XFree86 3.3.5
<li>gcc 2.95
<li>Apache 1.3.9 + Mod_ssl 2.4.5 + OpenSSL 0.9.4, et support DSO
</ul>

<li>De nombreuses am&eacute;liorations pour la s&eacute;curit&eacute; et la fiabilit&eacute; (voir
les lignes en rouge dans la liste compl&egrave;te) 

<li>De nouveaux p&eacute;riph&eacute;riques mat&eacute;riels sont support&eacute;s, notamment sur
l'architecture PC (i386).  
<ul>
<li>support PCI IDE et DMA
<li>USB (universal serial bus)
<li>P&eacute;riph&eacute;riques ATAPISCSI, incluant CD-R et CD-RWs
</ul>
</ul>
<p>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 alt=OpenBSD></a>
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: 26.html,v 1.12 ]<br>
$Translation: 26.html,v 1.21 2003/05/12 11:59:55 saad Exp $<br>
$OpenBSD: 26.html,v 1.12 2003/05/12 19:03:41 jufi Exp $
</small>

</body>
</html>

