<!DOCTYPE HTML PUBLIC  "-//IETF//DTD HTML Strict//EN">
<html>
<head>
<title>OpenBSD version 2.8</title>
<link rev=made href=mailto:www@openbsd.org>
<meta name="resource-type" content="document">
<meta name="description" content="the main OpenBSD page">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2001 by OpenBSD.">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/MangaRamblo.jpg"><img align=left hspace="24" src="../images/MangaRamblo.jpg"></a>
<h2><font color=#0000e0>La version 2.8 d'OpenBSD :</font></h2>
<p>

Sortie le premier décembre 2000<br>
Copyright 1997-2000, Theo de Raadt.<br>
<font color=#e00000>ISBN 0-9683637-6-8</font>
<p>

<a href=#new>Quoi de neuf ?</a><br>
<a href=#install>Comment installer</a><br>
<a href=#ports>Comment utiliser l'arborescence des ports</a><br>
<a href=../orders.html>Commander les CD</a><br>

<p>
<h3><font color=#0000e0>
Pour obtenir les fichiers de cette version :
<ul>
    <li>Commander un CDROM depuis notre <a href="../orders.html">syst&egrave;me de 
      commandes</a>. 
    <li>Voir les informations sur la <a href="ftp.html">page FTP</a> pour
une liste des machines miroirs 
<li>Aller dans le r&eacute;pertoire<font
color=#e00000>pub/OpenBSD/2.8/</font> sur l'un des sites miroirs 
<li>Lisez bri&egrave;vement le reste de ce document.
<li>Jetez un oeil sur la <a href="../errata28.html">page des errata
2.8</a> pour une liste des bugs et des solutions. 
<li>Voir la liste <a href="../plus28.html">d&eacute;taill&eacute;e des
changements</a> entre les version 2.7 et 2.8.  
</ul>
</font></h3>
<br clear=all>
<br>
<p>

<strong>Remarque :</strong> Tous les copyrights applicables et les
diff&eacute;rents cr&eacute;dit se trouvent dans les fichiers sources
se trouvant dans src.tar.gz, srcsys.tar.gz, X11.tar.gz ou dans les
fichiers r&eacute;cup&eacute;r&eacute;s par l'interm&eacute;diaire de
ports.tar.gz. Les fichiers utilis&eacute;s pour construire les
packages composant le fichier ports.tar.gz ne sont pas inclus sur le CDROM par manque de place.  
<p>

<a name=new></a>
<hr>
<p>
<h3><font color=#0000e0>Quoi de neuf ?</font></h3>
<p>
Ceci est une liste partielle des nouvelles fonctionnalit&eacute;s incluses
dans OpenBSD 2.8. Pour une liste compl&egrave;tes, voir le <a
href="../plus28.html">journal des changements</a> jusqu'&agrave; la 2.8.
<p>

<ul>

<li><a href="http://www.OpenSSH.com">OpenSSH</a> (qui supporte les
protocoles SSH1 et SSH2) en est à la version 2.3.0. Un serveur SFTP
est maintenant inclus pour les transfers de fichiers sécurisés.

<li>Étant donné que le brevet RSA a expiré, il n'est plus nécéssaire
d'installer les bibliothèques SSL. Elles sont incluses dans le système.

<li>Beaucoup de changements dans la documentation, notamment les pages
du manuel et la FAQ en ligne. Les pages du manuel incluent maintenant
des exemples utiles pour complèter les explications.

<p>

<li>Une collection de "ports" plus compl&egrave;te et mieux test&eacute;e.
<p>

<li>Environ 500 packages pr&eacute;-compil&eacute;s et test&eacute;s.
<p>

<li>OpenBSD 2.8 fonctionne sur les machines Apple iMac, G3, G4 et G4
Cube.
<p>
 
<li>Le syst&egrave;me comprend les &eacute;l&eacute;ments majeurs
suivants venant de sources ext&eacute;rieures :
<p>
<ul>
<li>XFree86 3.3.6-current
<li>gcc 2.95.3
<li>perl 5.6.0 t quelques correctifs.
<li>Apache 1.3.12 (+correctifs), Mod_ssl 2.6.2 + OpenSSL 0.9.5a, DSO
<li>ipf 3.3.18
<li>groff 1.15
<li>sendmail 8.10.1
<li>lynx 2.8.2 avec l'ajout du support HTTPS
<li>sudo 1.6.3p5
<li>ncurses 5.2
<li>Le dernier KAME IPv6
<li>KTH Kerberos 1.0.2
<li>OpenSSH 2.3.0
</ul>
<p>

<li>Support p&eacute;riph&eacute;rique grandement am&eacute;lior&eacute;.
<p>
<ul>
   <li>Am&eacute;lioration du support cryptographique matériel,
   incluant maintenant les cartes accèlératrices crypto Hifn
   PowerCrypt et Broadcom Bluesteelnet (uBsec).
   <li>Beaucoup de nouveaux périphériques Ehternet sont supportés,
   comme les adaptateurs basés sur le National Semiconductor DP83815,
   les adaptateurs 3Com MiniPCO, les PCMCIA basés sur le 3Com 574, et
   beaucoup de nouveaux périphériques CardBus (Xircom, Intel 21143,
   Intel CardBus II).
   <li>Support pour la plupart des cartes Gigabit Ehternet du marché
   telles que : SysKonnect, Intel, and Alteon.
   <li>Support pour la plupart des périphériques USB, incluant
   Ethernet, imprimantes, audio, etc. Synchronisez votre Handspring
   Visor ou transfèrez vos MP3 vers votre Rio.
   <li>Nouveau support audio, incluant le Cirrus Logic CS4280,
   ForteMedia FM801, et les puces audio intégrées sur les nouvelles
   cartes mères VIA et Intel.
</ul>
<p>

<li>Nombreuses am&eacute;liorations pour la s&eacute;curit&eacute; et
la fiabilit&eacute; (voir les lignes en rouge dans <a
href="../plus28.html">le journal des changements</a>). 
<p>

<li>De nouvelles capacit&eacute;s, incluant :
<p>
<ul>
<li>Support de la souris en mode console sur la plate-forme i386.
<li>Support pour le standard de cryptographie AES.
<li>Import de tcfs, un système de fichiers cryptographique.
<li>Un nouveau sftp-server dans OpenSSH
</ul>
<p>

</ul>
<p>

<a name=install></a>
<hr>
<p>
<h3><font color=#0000e0>Comment installer</font></h3>
<p>
À la suite de ça, vous allez trouver les instructions qui se trouvent sur la
jaquette du CDROM (<a
href="../orders.html">http://www.OpenBSD.org/orders.html</a>). Les
instructions pour effectuer une installation par FTP (ou autre) sont
tr&egrave;s semblables, les instructions pour l'installation par le CDROM
sont laiss&eacute;es telles quelles pour vous montrer qu'il est beaucoup plus
simple d'installer depuis le CDROM. 

<p>

<hr>
Veuillez consulter les fichiers suivants sur les CDROMs pour plus de
d&eacute;tails quant &agrave; l'installation d'OpenBSD 2.8 sur votre machine :
<p>
<dl>
<li>	CD1:2.8/i386/INSTALL.i386
<li>	CD1:2.8/powerpc/INSTALL.powerpc
<li>	CD1:2.8/vax/INSTALL.vax
<p>
<li>	CD2:2.8/sparc/INSTALL.sparc
<li>	CD2:2.8/mvme68k/INSTALL.mvme68k
<li>	CD2:2.8/amiga/INSTALL.amiga
<li>	CD2:2.8/mac68k/INSTALL.mac68k
<li>	CD2:2.8/hp300/INSTALL.hp300
<li>	CD2:2.8/sun3/INSTALL.sun3
<p>
<li>La version pmax est disponible sur les sites FTP mais pas sur les CD.
</dl>
<hr>
<p>
Informations pour une installation rapide, faites pour les personnes
famili&egrave;res avec OpenBSD, et avec l'utilisation de la nouvelles
commande "disklabel -E". Si vous n'&ecirc;tes pas &agrave; l'aise avec
l'installation d'OpenBSD, lisez les fichiers INSTALL.* correspondants
cit&eacute;s ci-dessus. 
<p>
<h3><font color=#e00000>i386 :</font></h3>
<p>
Manipuler les options du BIOS, et voyez si vous pouvez d&eacute;marrez depuis
le CD, en utilisant le CD1. Si ce n'est pas possible, copiez
CD1:2.8/i386/floppy28.fs sur une disquette, et d&eacute;marrez avec ça. Si
vous d&eacute;sirez m&eacute;langer OpenBSD avec un autre
syst&egrave;me d'exploitation, vous aurez sans doute besoin de lire
INSTALL.i386
<p>
Pour cr&eacute;er une disquette depuis MS-DOS, utilisez
/2.8/tools/rawrite.exe. Sous Unix, utilisez "dd if=&lt;fichier&gt;
of=/dev/&lt;p&eacute;riph&eacute;rique&gt; bs=32k" (ou le
p&eacute;riph&eacute;rique devrait &ecirc;tre "floppy" ou "rfd0c" ou
"rfd0a"). Utilisez une disquette correctement format&eacute;e SANS
BLOCS D&Eacute;FECTUEUX ou vous n'y arriverez pas.  
<p>
Si vous avez des problèmes avec les périphériques PCI au démarrage, ou
des "panics" lors de celui-ci, il semble que cela soit relié à <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcibios&sektion=4&manpath=OpenBSD+current&arch=i386">pcibios(4)</a>,
vous aurez peut-être à désactiver le périphériques pcibios pour
contourner le problème. À l'invite du <i>boot&gt;</i>, taper "boot -c"
pour entrer dans le User Kernel Configuration. À l'invite
<i>UKC&gt;</i>, entrez "disable pcibios" puis "quit". Voir <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&sektion=8">config(8)</a>
après avoir démarré correctement pour les instructions sur la façon de
reécrire votre noyau afin de désactiver <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcibios&sektion=4&manpath=OpenBSD+Current&arch=i386">pcibios(4)</a>
de façon permanente.
<h3><font color=#e00000>sparc :</font></h3>
<p>
Pour d&eacute;marrer depuis le CD2, taper "boot cdrom 2.8/sparc/bsd.rd", ou
"b sd(0,6,0)2.8/sparc/bsd.rd" suivant la version de votre ROM. Vous
pouvez aussi copier CD2:2.8/sparc/floppy28.fs sur une disquette et la
d&eacute;marrer en utilisant "boot floppy" ou "boot fd()" suivant la version
de votre ROM.
<p>
<h3><font color=#e00000>amiga :</font></h3>
<p>
Cr&eacute;er les partitions BSD suivant les instructions de la section
pr&eacute;paration de INSTALL.amiga. Montez les CD2 sur AmigaOS en tant que
p&eacute;riph&eacute;rique CD0, ensuite ex&eacute;cutez la commande
CLI suivante : "CD0:2.8/amiga/utils/loadbsd CD0:2.8/amiga/bsd.rd". 
<p>
<h3><font color=#e00000>hp300 :</font></h3>
<p>
Vous pouvez d&eacute;marrer depuis le r&eacute;seau en suivant les
instructions de INSTALL.hp300.
<p>
<h3><font color=#e00000>mac68k :</font></h3>
<p>
D&eacute;marrer MacOS normalement et partitioner votre disque avec les
configurations A/UX appropri&eacute;es. Extrayez les utilitaires
Macside de CD1:2.8/mac68k/utils sur votre disque dur. Lancer Mkfs pour
cr&eacute;er votre syst&egrave;me de fichiers  sur les partitions A/UX que vous
venez de faire. Ensuite utilisez l'installeur BSD/Mac68k pour copier
tous les fichiers dans CD1:2.8/mac68k/ sur vos partitions. Pour finir,
vous pourrez configurer le booter BSD/Mac68k avec l'emplacement de
vitre noyau et d&eacute;marrer votre syst&egrave;me. 
<p>
<h3><font color=#e00000>sun3 :</font></h3>
<p>
R&eacute;cup&eacute;rez la version par FTP. Ensuite vous pouvez soit
configurer un d&eacute;marrage sans disque, soit cr&eacute;er une
bande d'installation comme d&eacute;crit dans INSTALL.sun3.
<p>
<h3><font color=#e00000>Remarques &agrave; propos du code source :</font></h3>
<p>
src.tar.gz contient une archive des sources se trouvant dans
/usr/src. Ce fichier contient tout except&eacute; les sources du noyau, qui
sont dans une archive s&eacute;par&eacute;e. Pour l'extraire : 
<p>
<pre>
# mkdir -p /usr/src
# cd /usr/src
# tar xvfz /tmp/src.tar.gz
</pre>
<p>
srcsys.tar.gz contient une archive des sources se trouvant dans
/usr/src/sys. Ce fichier contient toutes les sources du noyau
n&eacute;cessaires pour reconstruire un noyau. Pour l'extraire : 
<p>
<pre>
# mkdir -p /usr/src/sys
# cd /usr/src
# tar xvfz /tmp/srcsys.tar.gz
</pre>
<p>
Ces deux arborescences sont r&eacute;guli&egrave;rement mises &agrave;
jour dans le CVS. En utilisant ces arborescences, il est possible
d'utiliser les serveurs anoncvs imm&eacute;diatement comme
d&eacute;cris dans <a
href="anoncvs.html">http://www.OpenBSD.org/fr/anoncvs.html</a>.
Utiliser ces fichiers est beaucoup plus rapide que d'obtenir la
totalit&eacute; des sources depuis un serveur anoncvs.
<p>

<a name=ports></a>
<hr>
<p>
<h3><font color=#0000e0>Arborescence des ports</font></h3>
<p>
Une archive de l'arborescence des ports est aussi fournie. Pour l'extraire :
<p>
<pre>
# cd /usr
# tar xvfz /tmp/ports.tar.gz
# cd ports
# ls
...
</pre>
<p>
Le sous r&eacute;pertoire ports/ est une version de l'arborescence des ports
OpenBSD. Veuillez lire <a
href="ports.html">http://www.OpenBSD.org/ports.html</a> si vous ne
savez rien &agrave; leur sujet. Ce document n'est pas un manuel sur
l'utilisation des ports. C'est plus une introduction rapide sur le
syst&egrave;me des ports OpenBSD.
<p>
Bien sur, le syst&egrave;me des ports OpenBSD n'est pas
complet. L'int&eacute;gration compl&egrave;te des ports dans
l'environnement OpenBSD est encore un projet jeune &agrave; ce
jour. Nous pensons que les ports fournis sont stables mais il est plus
important de r&eacute;aliser que les ports vont continuer &agrave;
grossir tout en apportant de nouvelles fonctionnalit&eacute;s dans le futur. 
<p>
Comme nous l'avons dit pr&eacute;c&eacute;demment, les ports vont
grossir dans le futur. Le r&eacute;pertoire ports/ repr&eacute;sente
une version CVS des ports (voir la page du manuel cvs(1) si vous
n'&ecirc;tes pas familier avec CVS). Comme pour l'arborescence des
sources, notre arborescence des ports est disponible par anoncvs. Donc
pour mettre &agrave; jour votre arborescence des ports/ depuis un
media en lecture-&eacute;criture, il suffit de lancer la commande suivante : 
<p>
<pre>
# cd [r&eacute;pertoire des ports]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd
</pre>
<p>
[Bien sur, vous devez remplacer le r&eacute;pertoire local et le nom du
serveur ici par l'emplacement de votre collection des port et le
serveur anoncvs le plus proche.] 
<p>
Il est important de lire la page web pour les instructions
sp&eacute;cifiques car il s'agit d'un nouveau service qui n'a pas
encore &eacute;t&eacute; test&eacute; intensivement. 
<p>
Mais, malgr&eacute; la jeunesse des ports, vous ne manquerez pas
d'aide. Si vous &ecirc;tes int&eacute;ress&eacute; par l'ajout d'un
port, voulez aider, ou voulez juste en savoir plus, la liste de
discussion ports@openbsd.org est quelque chose d'utile.  
<p>
<p>

<hr>
<a href="index.html"><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a> 
<a href=mailto:www@openbsd.org>www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: 28.html,v 1.13 ]<br>
$Translation: 28.html,v 1.10 2004/03/04 18:36:15 saad Exp $<br>
$OpenBSD: 28.html,v 1.10 2004/03/05 07:15:58 jufi Exp $
</small>

</body>
</html>
