<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Version 3.2 d'OpenBSD</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="OpenBSD 3.2">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2002 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#24248E">

<a href="index.html">
<img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/MrPond.gif"><img align="left" width="255" height="323"
hspace="24" src="../images/MrPond.gif" alt="MrPond.gif"></a>
<h2><font color="#0000e0">La version 3.2 d'OpenBSD :</font></h2>
<p> Sortie le 1er Novembre 2002<br>
Copyright 1997-2002, Theo de Raadt.<br>
<font color="#e00000">ISBN 0-9731791-0-4</font>
<p> <a href="#new">Quoi de neuf ?</a><br>
  <a href="#install">Comment installer</a><br>
  <a href="#ports">Comment utiliser l'arborescence des ports</a><br>
  <a href="../orders.html">Commander les CDROM</a><br>

<p>
<h3><font color="#0000e0">
Pour obtenir les fichiers de cette version : 
<ul>
<li>Commandez un CDROM &agrave; partir de notre <a href="../orders.html">syst&egrave;me 
      de commandes</a>. 
<li>Consultez les informations sur la <a href="ftp.html"> 
page FTP</a> pour une liste de machines miroirs ;
<li>Allez dans le r&eacute;pertoire pub/OpenBSD/3.2/ 
sur l'un des sites miroirs ;
<li>Lisez bri&egrave;vement le reste de ce document; 
<li>Jetez un oeil sur la <a href="../errata32.html">page 
      des errata 3.2</a> pour une liste des bugs et des solutions ;
<li>Regardez la liste <a href="../plus32.html">d&eacute;taill&eacute;e 
      des changements </a> entre les versions 3.1 et 3.2.
</ul>
</font></h3>
<br clear=all>
<br>
<p>
<strong>Remarque :</strong> Tous les copyrights applicables et les diff&eacute;rents 
cr&eacute;dits se trouvent dans les fichiers sources contenus dans src.tar.gz, 
srcsys.tar.gz, XF4.tar.gz ou dans les fichiers r&eacute;cup&eacute;r&eacute;s 
par l'interm&eacute;diaire de ports.tar.gz. Les fichiers utilis&eacute;s pour 
construire les packages composant le fichier ports.tar.gz ne sont pas inclus 
sur le CDROM par manque de place. 
<p>

<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Quoi de neuf ?</font></h3>
<p>
Ceci est une liste partielle des nouvelles fonctionnalit&eacute;s pr&eacute;sentes 
dans OpenBSD 3.2. Pour une liste compl&egrave;te, voir le <a
href="../plus32.html">journal des changements</a> jusqu'&agrave; la 3.2. 
<p>

<ul>
<li><a href="http://www.OpenSSH.com">OpenSSH</a> (supportant &agrave; la fois 
les protocoles SSH1 et SSH2) est maintenant &agrave; la version 3.5. La s&eacute;paration 
de privil&egrave;ges est maintenant activ&eacute;e par d&eacute;faut pour 
une meilleure robustess. 
<p> 

<li>Pile non-ex&eacute;cutable sur i386, sparc, sparc64, alpha, powerpc. sections 
de donn&eacute;es non-ex&eacute;cutables sur sparc, sparc64, et alpha. Ceci 
rend certaines classes de futurs d&eacute;passements potentiels de tampons 
inexploitables. 
<p> 

<li>Par d&eacute;faut, Apache s'ex&eacute;cute dans une prison logicielle (chroot) 
. Pour d&eacute;sactiver cette fonctionnalit&eacute;, utilisez la nouvelle 
option <b>-u</b>. 
<p> 

<li>Une r&eacute;duction tr&egrave;s significative des binaires setuid. Plusieurs 
binaires setuid restants ont &eacute;t&eacute; modifi&eacute;s de telle fa&ccedil;on 
&agrave; ce que les op&eacute;rations n&eacute;cessitant les droits root soient 
effectu&eacute;es tr&egrave;s t&ocirc;t et que les privil&egrave;ges soient 
r&eacute;voqu&eacute;s imm&eacute;diatement apr&egrave;s. 
<p> 

<li>Le support de mat&eacute;riel de cryptographie assym&eacute;trique et sym&eacute;trique 
est maintenant activ&eacute; par d&eacute;faut si votre machine contient ce 
type d'&eacute;quipements. 
<p> 

<li>Comme d'habitude, des am&eacute;liorations au niveau de la documentation 
et notamment les pages man et la FAQ Web. Une grande partie du site wen est 
maintenant disponible dans plusieurs langues. 
<p> 

<li>Collection de &quot;ports&quot; plus compl&egrave;te et jeu de &quot;ports&quot; 
mieux test&eacute;s. Les ports utilisant setuid/setgid ports ont &eacute;t&eacute; 
r&eacute;duits de mani&egrave;re significative. Plusieurs de ceux qui restent 
ont &eacute;t&eacute; modifi&eacute;s pour r&eacute;voquer les privil&egrave;ges 
le plus t&ocirc;t possible. 
<p> 

<li>Plus de 1800 packetages test&eacute;s disponibles.
<p> 

<li>Meilleur support video et X11 pour les portages <a href="sparc.html">OpenBSD/sparc</a>, 
<a href="sparc64.html">OpenBSD/sparc64</a> <a href="alpha.html">OpenBSD/alpha</a>. 
<p> 

<li>Beaucoup d'am&eacute;liorations (y compris au niveau de la stabilit&eacute;) 
pour notre filtre de paquets, <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&sektion=4">pf</a>, y compris 
: 
<ul>
<li>un nouveau mot-cl&eacute; &quot;antispoof&quot; : protection facilit&eacute;e 
contre l'usurpation d'adresse
<li>syntaxe du fichier de filtrage fortement simplifi&eacute;e 
<li>capacit&eacute;s de filtrage &eacute;tendues
<li>granularit&eacute; par r&egrave;gle des entr&eacute;es de la table de 
contr&ocirc;le d'&eacute;tat 
<li>support de l'expansion pour les interfaces dynamiques. Il n'y a plus 
besoin de recharger les r&egrave;gles lorsqu'il y a des changements IP.
</ul>
<p> 

<li>Un nouvel outil, <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=systrace&sektion=4">systrace</a>, 
pour controller de mani&egrave;re tr&egrave;s d&eacute;taill&eacute;e le comportement 
et les droits des applications au niveau appel syst&egrave;me. 
<p> 

<li>Le syst&egrave;me comporte les composants majeurs suivants fournis par des 
entit&eacute;s externes :
<p> 
<ul>
<li>XFree86 4.2.1 (i386 contient aussi des serveurs 3.3.X pour assurer un 
support de tous les chipsets)
<li>gcc 2.95.3 (+ correctifs)
<li>perl 5.6.1 (+ correctifs)
<li>Apache 1.3.26, mod_ssl 2.8.10, support DSO
<li>OpenSSL 0.9.7beta3 (+ correctifs)
<li>groff 1.15
<li>sendmail 8.12.6
<li>lynx 2.8.2rel.1 avec support HTTPS
<li>sudo 1.6.6
<li>ncurses 5.2
<li>Latest KAME IPv6
<li>KTH Kerberos 1.0.8
<li>Heimdal 0.4e (+ correctifs)
<li>OpenSSH 3.5
</ul>
<p> 

<li>Plusieurs am&eacute;liorations au niveau de la s&eacute;curit&eacute; et 
de la fiabilit&eacute; (consultez les lignes rouges dans le <a href="../plus32.html">journal 
des changements complet</a>). 
<p> 
</ul>

<a name="install"></a>
<hr>
<p>
<h3><font color="#0000e0">Comment installer </font></h3>
<p> Vous pouvez consulter ci-dessous les instructions figurant sur le livret accompagnant 
  les CDROM, dont vous disposeriez si vous aviez acheté les CDROMs au lieu d'utiliser 
  une des autres possibilités d'installation. Les instructions pour faire une 
  installation par ftp (ou tout autre type d'installation) sont très similaires 
  ; les instructions du CDROM sont reproduites ici telles quelles, de sorte que 
  vous puissiez voir combien cela aurait été plus facile si vous aviez acheté 
  un CDROM. 
<p>

<hr>
Veuillez consulter les fichiers suivants sur les CDROMs pour plus de d&eacute;tails 
quant &agrave; l'installation d'OpenBSD 3.2 sur votre machine&nbsp;: 
<p>
<ul>
<li>	CD1:3.2/i386/INSTALL.i386
<li>	CD1:3.2/alpha/INSTALL.alpha
<p>
<li>	CD2:3.2/macppc/INSTALL.macppc
<li>	CD2:3.2/vax/INSTALL.vax
<p>
<li>	CD3:3.2/sparc/INSTALL.sparc
<li>	CD3:3.2/sparc64/INSTALL.sparc64
</ul>
<hr>
<p> Informations pour une installation rapide, faites pour les personnes famili&egrave;res 
  avec OpenBSD, et l'utilisation de la commande "disklabel -E". Si vous n'&ecirc;tes 
  pas &agrave; l'aise avec l'installation d'OpenBSD, lisez les fichiers INSTALL.* 
  correspondants cit&eacute;s ci-dessus&nbsp;! 
<p>

<h3><font color="#e00000">OpenBSD/i386:</font></h3>
<ul>
   Manipulez les options du BIOS, et voyez si vous pouvez d&eacute;marrer depuis 
    le CDROM. La version OpenBSD/i386 est sur le CD1. Si votre BIOS ne supporte 
    pas l'amorçage depuis le CDROM, vous devrez créer une disquette de boot pour 
    l'installation. Pour faire une disquette de boot, copiez <i>CD1:3.2/i386/floppy32.fs</i> 
    sur une disquette, et d&eacute;marrez dessus. 
  <p> Utilisez <i>CD1:3.2/i386/floppyB32.fs</i> pour un meilleur support des contrôleurs 
    SCSI, ou <i>CD1:3.2/i386/floppyC32.fs</i> pour un meilleur support des ordinateurs 
    portables. 
  <p> Si vous d&eacute;sirez m&eacute;langer OpenBSD avec un autre syst&egrave;me 
    d'exploitation, vous aurez sans doute besoin de lire INSTALL.i386. 
  <p> Pour cr&eacute;er une disquette depuis MS-DOS, utilisez <i>/3.2/tools/rawrite.exe</i>. 
    Sous Unix, utilisez l'utilitaire <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">dd(1)</a>. L'exemple 
    suivant est un exemple d'utilisation de <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">dd(1)</a>, où 
    le périphérique peut être &quot;floppy&quot;, &quot;rfd0c&quot;, ou &quot;rfd0a&quot;. 
  <ul>
    <pre>
# <strong>dd if=&lt;file&gt; of=/dev/&lt;device&gt; bs=32k</strong>
</pre>
  </ul>
  <p> Utilisez une disquette correctement format&eacute;e SANS BLOCS D&Eacute;FECTUEUX 
    ou vous n'y arriverez pas. Pour de plus amples informations sur la création 
    d'une disquette de démarrage et sur l'installation d'OpenBSD/i386, veuillez 
    lire la <a href="../faq/faq4.html#4.1">FAQ4.1</a>. 
</ul>
<p> 
<h3><font color="#e00000">OpenBSD/alpha:</font></h3>
<ul>
  Au prompt SRM, tapez <i>boot -fi 3.2/alpha/bsd.rd dka6</i> où <i>dka6</i> 
    est le nom abrégé du lecteur de CDROM (vous pouvez le vérifier avec <i>show 
    dev</i>). 
  <p>Si vous ne pouvez pas d&eacute;marrer à partir du CDROM, copiez <i>CD1:3.2/alpha/floppy32.fs</i> 
    ou <i>CD1:3.2/alpha/floppyB32.fs</i> (cela dépend de votre machine) sur une 
    disquette et entrez <i>boot dva0</i>. Consultez INSTALL.alpha pour plus de 
    détails. 
  <p> Assurez vous que vous utilisez une disquette correctement formatée et SANS 
    BLOCS D&Eacute;FECTUEUX, ou votre installation échouera très probablement. 
</ul>
<p> 
<h3><font color="#e00000">OpenBSD/macppc:</font></h3>
<ul>
  Placez le CD2 dans votre lecteur de CDROM et allumez votre machine, tout 
    en maintenant la touche <i>C</i> enfonc&eacute;e jusqu'à ce que l'affichage 
    s'allume et affiche <i>OpenBSD/macppc boot</i>. 
  <p> Sinon, au prompt Open Firmware, entrez <i>boot cd:,ofwboot/3.2/macppc/bsd.rd</i> 
</ul>
<p> 


<h3><font color="#e00000">OpenBSD/vax:</font></h3>
<ul>
  Le démarrage à partir du réseau par mopbooting est décrit dans INSTALL.vax. 
</ul>
<p> 
<h3><font color="#e00000">OpenBSD/sparc:</font></h3>
<ul>
  La version 3.2 d'OpenBSD/sparc est située sur le CD3. Pour démarrer à partir 
    du CDROM, vous pouvez utiliser l'une des deux commandes suivantes, en fonction 
    de la version de votre ROM&nbsp;: 
  <ul>
    <pre>
> <strong>boot cdrom 3.2/sparc/bsd.rd</strong>
ou
> <strong>b sd(0,6,0)3.2/sparc/bsd.rd</strong>
</pre>
  </ul>
  <p> Si votre sparc n'a pas de lecteur de CDROM, vous pouvez démarrer depuis 
    la disquette. Pour ce faire, vous devez copier &quot;CD3:3.2/sparc/floppy32.fs&quot; 
    sur une disquette. Pour plus d'information, voir <a href="../faq/faq4.html#4.1">FAQ4.1</a>. 
    Pour démarrer depuis la disquette, utilisez l'une des deux commandes listées 
    ci-dessous, selon la version de votre ROM&nbsp;: 
  <ul>
    <pre>
> <strong>boot floppy</strong>
ou
> <strong>boot fd()</strong>
</pre>
  </ul>
  <p> Assurez vous que vous utilisez une disquette correctement formatée et SANS 
    BLOCS D&Eacute;FECTUEUX, ou votre installation échouera très probablement. 
  <p> Si votre sparc n'a pas de lecteur de CDROM ou de lecteur de disquette, vous 
    pouvez soit installer à l'aide d'une bande de d&eacute;marrage, soit via le 
    réseau, comme indiqué dans le fichier INSTALL.sparc. 
</ul>
<p> 
<h3><font color="#e00000">OpenBSD/sparc64:</font></h3>
<ul>
  Placez le CD3 dans votre lecteur de CDROM et tapez <i>boot cdrom</i>. 
  <p> Si cela ne fonctionne pas ou si vous n'avez pas de lecteur de CDROM, vous 
    pouvez copier <i>CD3:3.2/sparc64/floppy32.fs</i> sur une disquette et la d&eacute;marrer 
    avec <i>boot floppy</i>.<br>
    Assurez vous que vous utilisez une disquette correctement formatée et SANS 
    BLOCS D&Eacute;FECTUEUX, ou votre installation échouera très probablement. 
  <p> Vous pouvez aussi copier <i>CD3:3.2/sparc64/miniroot32.fs</i> sur la partition 
    de swap sur le disque et démarrer avec <i>boot disk:b</i>. 
  <p> Si rien ne fonctionne, vous pouvez démarrer à partir du réseau, comme décrit 
    dans INSTALL.sparc64. 
</ul>
<p> 
<h3><font color=#e00000>Remarques &agrave; propos du code source :</font></h3>
<ul>
  src.tar.gz contient une archive des sources se trouvant dans /usr/src. Ce 
    fichier contient tout except&eacute; les sources du noyau, qui sont dans une 
    archive s&eacute;par&eacute;e. Pour l'extraire&nbsp;: 
  <p> 
  <ul>
    <pre>
# <strong>mkdir -p /usr/src</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/src.tar.gz</strong>
</pre>
  </ul>
  <p> srcsys.tar.gz contient une archive des sources se trouvant dans /usr/src/sys. 
    Ce fichier contient toutes les sources n&eacute;cessaires pour reconstruire 
    un noyau. Pour l'extraire&nbsp;: 
  <p> 
  <ul>
    <pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/srcsys.tar.gz</strong>
</pre>
  </ul>
  <p> Ces deux arborescences sont r&eacute;guli&egrave;rement mises &agrave; jour 
    dans le CVS. En utilisant ces arborescences, il est possible d'utiliser les 
    serveurs anoncvs imm&eacute;diatement comme d&eacute;cris dans <a
href="anoncvs.html">http://www.OpenBSD.org/fr/anoncvs.html</a>. Utiliser ces fichiers 
    est beaucoup plus rapide que d'obtenir la totalit&eacute; des sources depuis 
    un serveur anoncvs. 
</ul>
<ul><p>
</ul>
<a name="ports"></a>
<hr>
<h3><font color="#0000e0">Arborescence des ports</font></h3>
<p> Une archive de l'arborescence des ports est aussi fournie. Pour l'extraire&nbsp;: 
<p> 
<ul>
  <pre>
# <strong>cd /usr</strong>
# <strong>tar xvfz /tmp/ports.tar.gz</strong>
# <strong>cd ports</strong>
</pre>
</ul>
<p> Bien sur le système des ports d'OpenBSD n'est pas complet et ne le sera sans 
  doute jamais. Cependant, il grossit rapidement et devient de plus en plus stable. 
  La plupart des ports fournis avec cette version devraient compiler sans problèmes 
  sur la plupart des architectures (plus de 1500 packages compilés sur i386 par 
  exemple). 
<p> Le r&eacute;pertoire <i>ports/</i> repr&eacute;sente une version CVS des ports 
  (voir la page du manuel <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=cvs&apropos=0&sektion=1&manpath=OpenBSD+Current&arch=i386&format=html">cvs(1)</a> 
  si vous n'&ecirc;tes pas familier avec CVS). Comme pour l'arborescence des sources, 
  notre arborescence des ports est disponible par anoncvs. Donc pour mettre &agrave; 
  jour votre arborescence des <i>ports/</i> depuis un media en lecture-&eacute;criture, 
  il suffit de lancer la commande suivante&nbsp;: 
<p> 
<ul>
  <pre>
# <strong>cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd # -rOPENBSD_3_2</strong>
</pre>
</ul>
<p> [Bien s&ucirc;r, vous devez remplacer le r&eacute;pertoire local et le nom 
  du serveur ici par l'emplacement de votre collection des ports et le serveur 
  anoncvs le plus proche.] 
<p> Remarquez que la plupart des ports sont disponibles en tant que packages via 
  ftp. Des mises à jour de packages pour la version 3.2 seront disponibles si 
  des problèmes surviennent. 
<p> Si vous &ecirc;tes int&eacute;ress&eacute; par l'ajout d'un port, voulez aider, 
  ou voulez juste en savoir plus, la liste de discussion ports@openbsd.org est 
  la liste à connaître. 
<p>
<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0"
alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: 32.html,v 1.23 ]<br>
$Translation: 32.html,v 1.5 2003/09/22 12:08:35 saad Exp $<br>
$OpenBSD: 32.html,v 1.5 2003/09/22 20:09:45 horacio Exp $
</small>

</body>
</html>
