<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Version 3.3 d'OpenBSD</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="OpenBSD 3.3">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 2003 by OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#24248E">

<a href="index.html">
<img alt="[OpenBSD]" height="30" width="141" hspace="24" src="../images/smalltitle.gif" border="0"></a>
<hr>

<p>
<a href="../images/Barbarian.gif"><img align="left" width="255" height="323"
hspace="24" src="../images/Barbarian.gif" alt="logo OpenBSD 3.3"></a>
<h2><font color="#0000e0">La version 3.3 d'OpenBSD :</font></h2>
<p> Sortie le 1er Mai 2003<br>
  Copyright 1997-2003, Theo de Raadt.<br>
  <font color="#e00000">ISBN 0-9731791-1-2</font> 
<p> <a href="#new">Quoi de neuf ?</a><br>
  <a href="#install">Comment installer</a><br>
  <a href="#ports">Comment utiliser l'arborescence des ports</a><br>
  <a href="../orders.html">Commander les CDROM</a><br>

<p>
<h3><font color="#0000e0">
Pour obtenir les fichiers de cette version : 
<ul>
<li>Commandez un CDROM &agrave; partir de notre <a href="../orders.html">syst&egrave;me 
      de commandes</a>. 
<li>Consultez les informations sur la <a href="ftp.html"> 
page FTP</a> pour une liste de machines miroirs ;
    <li>Allez dans le r&eacute;pertoire pub/OpenBSD/3.3/ sur l'un des sites miroirs 
      ; 
    <li>Lisez bri&egrave;vement le reste de ce document; 
    <li>Jetez un oeil sur la <a href="errata.html">page des errata 3.3</a> 
      pour une liste des bugs et des solutions ; 
    <li>Regardez la liste <a href="../plus33.html">d&eacute;taill&eacute;e des 
      changements </a> entre les versions 3.2 et 3.3. 
  </ul>
</font></h3>
<br clear=all>
<br>
<p>
<strong>Remarque :</strong> Tous les copyrights applicables et les
diff&eacute;rents cr&eacute;dits se trouvent dans les fichiers sources
contenus dans src.tar.gz, sys.tar.gz, XF4.tar.gz ou dans les fichiers
r&eacute;cup&eacute;r&eacute;s par l'interm&eacute;diaire de
ports.tar.gz. Les fichiers utilis&eacute;s pour construire les packages
composant le fichier ports.tar.gz ne sont pas inclus sur le CDROM par
manque de place.
<p>

<a name="new"></a>
<hr>
<p>
<h3><font color="#0000e0">Quoi de neuf ?</font></h3>
<p> Ceci est une liste partielle des nouvelles fonctionnalit&eacute;s
    pr&eacute;sentes dans OpenBSD 3.3. Pour une liste compl&egrave;te,
    voir le <a href="../plus33.html">journal des changements</a>
    jusqu'&agrave; la 3.3.
<p>

<ul>
  <li>Int&eacute;gration de la technologie de protection de pile <a hre-
      f="http://www.trl.ibm.com/projects/security/ssp">ProPolice</a>,
      cr&eacute;&eacute;e par Hiroaki Etoh, au compilateur
      syst&egrave;me. Cette protection est activ&eacute;e par
      d&eacute;faut. Avec ce changement, les prologues de fonction sont
      modifi&eacute;s pour r&eacute;arranger la pile : un canari
      al&eacute;atoire est plac&eacute; avant l'adresse de retour, et
      les variables de tampon sont d&eacute;plac&eacute;es pour
      &ecirc;tre plus proches du canari de telle fa&ccedil;on &agrave;
      ce que les variables r&eacute;guli&egrave;res se retrouvent en
      dessous. Leur destruction est alors tr&egrave;s difficile.
      L'&eacute;pilogue de fonction v&eacute;rifie alors si le canari
      est encore intact. Si ce n'est pas le cas, le processus est
      termin&eacute;. Ce changement rend tr&egrave;s difficile la
      modification d'une adresse de retour par un attaquant lors du
      retour d'une fonction.
  <p> 

  <li>W^X (prononc&eacute; : "W xor X") pour les architectures capables
      du support fin du bit d'ex&eacute;cution dans l'unit&eacute; MMU
      (sparc, sparc64, alpha, hppa). C'est un m&eacute;canisme de
      permissions m&eacute;moire fines dans lequel des programmes
      applicatifs y &eacute;crivant ne peuvent pas &ecirc;tre
      ex&eacute;cut&eacute;es et vice-versa. Cela a pour effet
      d'&eacute;lever la barre pour les d&eacute;passements de tampon
      potentielle et les autres attaques : Comme r&eacute;sultat, un
      attaquant n'est pas capable d'&eacute;crire du code n'importe
      o&ugrave; en m&eacute;moire o&ugrave; il peut &ecirc;tre
      ex&eacute;cut&eacute;. (REMARQUE : i386 et powerpc ne supportent
      pas W^X en 3.3; cependant, 3.3-current le supporte
      d&eacute;j&agrave; sur i386, et ces deux processeurs devraient
      normalement supporter ce changement dans la version 3.4).
  <p> 

  <li>Encore plus de r&eacute;duction des binaires setuid et setgid, et
      plus d'utilisation de chroot dans le syst&egrave;me. Plusieurs
      binaires setuid restants ont &eacute;t&eacute; modifi&eacute;s de
      telle fa&ccedil;on &agrave; ce que les op&eacute;rations
      n&eacute;cessitant les droits root soient effectu&eacute;es
      tr&egrave;s t&ocirc;t et que les privil&egrave;ges soient
      r&eacute;voqu&eacute;s imm&eacute;diatement apr&egrave;s.

  <p> 

  <li>Le syst&egrave;me X window et xconsole utilisent la
      s&eacute;paration de privil&egrave;ges, pour une meilleure
      s&eacute;curit&eacute;. xterm a aussi &eacute;t&eacute;
      modifi&eacute; pour faire de la r&eacute;vocation de
      privil&egrave;ges. xdm s'ex&eacute;cute en tant
      qu'utilisateur/groupe sp&eacute;cial pour limiter les choses qui
      peuvent mal tourner.
  <p> 

  <li>Comme d'habitude, des am&eacute;liorations au niveau de la
      documentation et notamment les pages man et la FAQ Web. Une grande
      partie du site web est maintenant disponible dans plusieurs
      langues.
  <p> 

  <li>Collection de &quot;ports&quot; plus compl&egrave;te et jeu de
      &quot;ports&quot; mieux test&eacute;s. Les ports utilisant
      setuid/setgid ports ont &eacute;t&eacute; r&eacute;duits de
      mani&egrave;re significative. Plusieurs de ceux qui restent ont
      &eacute;t&eacute; modifi&eacute;s pour r&eacute;voquer les
      privil&egrave;ges le plus t&ocirc;t possible.
  <p> 

  <li>Plus de 2000 packetages test&eacute;s disponibles. 

  <p> 

  <li>Am&eacute;liorations significatives apport&eacute;es &agrave; la
      librairie pthread.

  <p> 

  <li>Beaucoup d'am&eacute;liorations (y compris au niveau de la
      stabilit&eacute;) pour notre filtre de paquets, <a href="http://w-
      ww.openbsd.org/cgi-bin/man.cgi?query=pf&sektion=4">pf</a>, y
      compris : 
    <ul>
      <li>Queue, un syst&egrave;me de gestion de la bande passante
          (utilise altq en dessous)

      <li>Anchors, permettant d'utiliser des sous-ensembles de
          r&egrave;gles pouvant &ecirc;tre ind&eacute;pendamment
          charg&eacute;s et modifi&eacute;s

      <li>Tables, une mani&egrave;re tr&egrave;s efficace de
          g&eacute;rer de grandes listes d'adresses dans les
          r&egrave;gles

      <li>Address pools, redirection/NAT vers de multiples adresses et
          donc partage de charge

      <li>Le langage de configuration a &eacute;t&eacute; modifi&eacute;
          pour &ecirc;tre beaucoup plus flexible

      <li>Support de l'&eacute;chelonnage des fen&ecirc;tres TCP 

      <li>Support CIDR complet 

      <li>Retour t&ocirc;t des v&eacute;rifications de checksum sur les
          paquets invalides

      <li>Augmentation des performances : les grands ensembles de
          r&egrave;gles se chargent beaucoup plus rapidement maintenant

      <li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=spamd">
          spamd</a>, un service de retardement du courriel
          ind&eacute;sirable, auquel les connexions SMTP peuvent
          &ecirc;tre redirig&eacute;es. Ce service g&egrave;re les
          connexions en se basant sur des listes noires et des listes
          blanches, &eacute;trangle les connexions, et s'assure que les
          exp&eacute;diteurs de courriel ind&eacute;sirable sachent
          pourquoi leur courriel n'a pas &eacute;t&eacute;
          accept&eacute;. 
    </ul>
    <p> 

  <li>Support <a href="sparc64.html">sparc64</a> grandement
      am&eacute;lior&eacute; : support de plus de mod&egrave;les et
      plusieurs bogues majeurs &eacute;radiqu&eacute;s.
  <p> 

  <li>Le syst&egrave;me comporte les composants majeurs suivants fournis
      par des entit&eacute;s externes : 

    <ul>
      <li>XFree86 4.2.1 (i386 contient aussi des serveurs 3.3.X pour
          assurer un support de tous les chipsets)
      <li>Gcc 2.95.3 (+ correctifs) 
      <li>Perl 5.8.0 (+ correctifs) 
      <li>Apache 1.3.27, mod_ssl 2.8.12, support DSO (+ correctifs) 
      <li>OpenSSL 0.9.7beta3 (+ correctifs) 
      <li>Groff 1.15 
      <li>Sendmail 8.12.9 
      <li>Bind 9.2.2 (+ correctifs) 
      <li>Lynx 2.8.2rel.1 avec support HTTPS (+ correctifs) 
      <li>Sudo 1.6.7 
      <li>Ncurses 5.2 
      <li>Dernier KAME IPv6 
      <li>KTH Kerberos 1.1.1 
      <li>Heimdal 0.4e (+ correctifs) 
      <li>OpenSSH 3.6 

    </ul>
  <p> 

  <li>Plusieurs am&eacute;liorations au niveau de la
      s&eacute;curit&eacute; et de la fiabilit&eacute; (consultez les
      lignes rouges dans le <a href="../plus33.html">journal des
      changements complet</a>).

  <p> 
</ul>

<a name="install"></a>
<hr>
<p>
<h3><font color="#0000e0">Comment installer </font></h3>
<p> 
Vous pouvez consulter ci-dessous les instructions figurant sur le livret
accompagnant les CDROM, dont vous disposeriez si vous aviez
achet&eacute; les CDROMs au lieu d'utiliser une des autres
possibilit&eacute;s d'installation. Les instructions pour faire une
installation par ftp (ou tout autre type d'installation) sont
tr&egrave;s similaires ; les instructions du CDROM sont reproduites ici
telles quelles, de sorte que vous puissiez voir combien cela aurait
&eacute;t&eacute; plus facile si vous aviez achet&eacute; un CDROM.
<p>

<hr>
Veuillez consulter les fichiers suivants sur les CDROMs pour plus de
d&eacute;tails quant &agrave; l'installation d'OpenBSD 3.3 sur votre
machine&nbsp;:
<p>
<ul>
  <li> CD1:3.3/i386/INSTALL.i386 
    <p> 
  <li> CD2:3.3/macppc/INSTALL.macppc 
  <li> CD2:3.3/vax/INSTALL.vax 
    <p> 
  <li> CD3:3.3/sparc/INSTALL.sparc 
  <li> CD3:3.3/sparc64/INSTALL.sparc64 
<p>
<li>    FTP:.../OpenBSD/3.3/alpha/INSTALL.alpha
<li>    FTP:.../OpenBSD/3.3/hp300/INSTALL.hp300
<li>    FTP:.../OpenBSD/3.3/hppa/INSTALL.hppa
<li>    FTP:.../OpenBSD/3.3/mac68k/INSTALL.mac68k
<li>    FTP:.../OpenBSD/3.3/mvme68k/INSTALL.mvme68k
</ul>
<hr>
<p> 
Informations pour une installation rapide, faites pour les personnes
famili&egrave;res avec OpenBSD, et l'utilisation de la commande
"disklabel -E". Si vous n'&ecirc;tes pas &agrave; l'aise avec
l'installation d'OpenBSD, lisez les fichiers INSTALL.* correspondants
cit&eacute;s ci-dessus&nbsp;!
<p>

<h3><font color="#e00000">OpenBSD/i386 :</font></h3>
<ul>
  Manipulez les options du BIOS, et voyez si vous pouvez d&eacute;marrer
  depuis le CDROM. La version OpenBSD/i386 est sur le CD1. Si votre BIOS
  ne supporte pas l'amor&ccedil;age depuis le CDROM, vous devrez
  cr&eacute;er une disquette de boot pour l'installation. Pour faire une
  disquette de boot, copiez <i>CD1:3.3/i386/floppy33.fs</i> sur une
  disquette, et d&eacute;marrez dessus.
  <p> Utilisez <i>CD1:3.3/i386/floppyB33.fs</i> pour un meilleur support
      des contr&ocirc;leurs SCSI, ou <i>CD1:3.3/i386/floppyC33.fs</i>
      pour un meilleur support des ordinateurs portables.
  <p> Si vous d&eacute;sirez m&eacute;langer OpenBSD avec un autre
      syst&egrave;me d'exploitation, vous aurez sans doute besoin de
      lire INSTALL.i386.
  <p> Pour cr&eacute;er une disquette depuis MS-DOS, utilisez
      <i>/3.3/tools/rawrite.exe</i>. Sous Unix, utilisez l'utilitaire <a
      href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">-
      dd(1)</a>. L'exemple suivant est un exemple d'utilisation de <a
      href="http://www.openbsd.org/cgi-bin/man.cgi?query=dd&sektion=1">-
      dd(1)</a>, o&ugrave; le p&eacute;riph&eacute;rique peut &ecirc;tre
      &quot;floppy&quot;, &quot;rfd0c&quot;, ou &quot;rfd0a&quot;. <ul>
      <pre>
# <strong>dd if=&lt;file&gt; of=/dev/&lt;device&gt; bs=32k</strong>
</pre>
  </ul>
  <p> Utilisez une disquette correctement format&eacute;e SANS BLOCS
      D&Eacute;FECTUEUX ou vous n'y arriverez pas. Pour de plus amples
      informations sur la cr&eacute;ation d'une disquette de
      d&eacute;marrage et sur l'installation d'OpenBSD/i386, veuillez
      lire la <a href="../faq/fr/faq4.html#MkFlop">FAQ4.1</a>. </ul>
<p> 
<h3><font color="#e00000">OpenBSD/macppc :</font></h3>
<ul>
  Placez le CD2 dans votre lecteur de CDROM et allumez votre machine,
  tout en maintenant la touche <i>C</i> enfonc&eacute;e jusqu'&agrave;
  ce que l'affichage s'allume et affiche <i>OpenBSD/macppc boot</i>.
  <p> Sinon, au prompt Open Firmware, entrez <i>boot cd:,ofwboot/3.3/macppc/bsd.rd</i> 
</ul>
<p> 


<h3><font color="#e00000">OpenBSD/vax :</font></h3>
<ul>
  Le d&eacute;marrage &agrave; partir du r&eacute;seau par mopbooting
  est d&eacute;crit dans INSTALL.vax. </ul>
<p> 
<h3><font color="#e00000">OpenBSD/sparc :</font></h3>
<ul>
  La version 3.3 d'OpenBSD/sparc est situ&eacute;e sur le CD3. Pour
  d&eacute;marrer &agrave; partir du CDROM, vous pouvez utiliser l'une
  des deux commandes suivantes, en fonction de la version de votre
  ROM&nbsp;: <ul> <pre>
<strong>boot cdrom 3.3/sparc/bsd.rd</strong>
ou
<strong>b sd(0,6,0)3.3/sparc/bsd.rd</strong>
</pre>
  </ul>
  <p> Si votre sparc n'a pas de lecteur de CDROM, vous pouvez
      d&eacute;marrer depuis la disquette. Pour ce faire, vous devez
      copier &quot;CD3:3.3/sparc/floppy33.fs&quot; sur une disquette.
      Pour plus d'information, voir <a
      href="../faq/fr/faq4.html#4.1">FAQ4.1</a>. Pour d&eacute;marrer
      depuis la disquette, utilisez l'une des deux commandes
      list&eacute;es ci-dessous, selon la version de votre ROM&nbsp;:
      <ul> <pre> <strong>boot floppy</strong> ou <strong>boot
      fd()</strong> </pre> </ul>
  <p> Assurez vous que vous utilisez une disquette correctement
      format&eacute;e et SANS BLOCS D&Eacute;FECTUEUX, ou votre
      installation &eacute;chouera tr&egrave;s probablement.
  <p> Si votre sparc n'a pas de lecteur de CDROM ou de lecteur de
      disquette, vous pouvez soit installer &agrave; l'aide d'une bande
      de d&eacute;marrage, soit via le r&eacute;seau, comme
      indiqu&eacute; dans le fichier INSTALL.sparc. </ul>
<p> 
<h3><font color="#e00000">OpenBSD/sparc64 :</font></h3>
<ul>
  Placez le CD3 dans votre lecteur de CDROM et tapez <i>boot cdrom</i>.
  <p> Si cela ne fonctionne pas ou si vous n'avez pas de lecteur de
      CDROM, vous pouvez copier <i>CD3:3.3/sparc64/floppy33.fs</i> sur
      une disquette et la d&eacute;marrer avec <i>boot floppy</i>.<br>
      Assurez vous que vous utilisez une disquette correctement
      format&eacute;e et SANS BLOCS D&Eacute;FECTUEUX, ou votre
      installation &eacute;chouera tr&egrave;s probablement.
  <p> Vous pouvez aussi copier <i>CD3:3.3/sparc64/miniroot33.fs</i> sur la partition 
    de swap sur le disque et d&eacute;marrer avec <i>boot disk:b</i>. 
  <p> Si rien ne fonctionne, vous pouvez d&eacute;marrer &agrave; partir
      du r&eacute;seau, comme d&eacute;crit dans INSTALL.sparc64. </ul>
<p>
<h3><font color="#e00000">OpenBSD/alpha :</font></h3>
<ul>
  <p>Mettez<i>FTP:3.3/alpha/floppy33.fs</i> ou
     <i>FTP:3.3/alpha/floppyB33.fs</i> (selon votre machine) sur une
     disquette et saisissez <i>boot dva0</i>. Veuillez consulter
     INSTALL.alpha pour de plus amples informations..
  <p> Assurez vous que vous utilisez une disquette correctement
      format&eacute;e et SANS BLOCS D&Eacute;FECTUEUX, ou votre
      installation &eacute;chouera tr&egrave;s probablement. </ul>
<p> 
<h3><font color="#e00000">OpenBSD/hp300 :</font></h3>
<ul>
  <p> D&eacute;marrez via le r&eacute;seau en suivant les instructions
      incluses dans INSTALL.hp300. </ul>

<p>
<h3><font color="#e00000">OpenBSD/hppa :</font></h3>
<ul>
  <p> D&eacute;marrez via le r&eacute;seau en suivant les instructions
      incluses dans INSTALL.hppa ou sur la 
      <a href="hppa.html#netboot">page de la plate-forme hppa</a>.
</ul>
<p> 
<h3><font color="#e00000">OpenBSD/mac68k :</font></h3>
<ul>
  <p> D&eacute;marrez MacOS normalement et partitionner votre disque
      avec les configurations A/UX appropri&eacute;es. Ensuite, faites
      une extraction des utilitaires Macside &agrave; partir de
      FTP:3.3/mac68k/utils vers votre disque dur. Ex&eacute;cutez Mkfs
      pour cr&eacute;er vos syst&egrave;mes de fichiers sur les
      partitions A/UX que vous venez faire. Puis utilisez le "programme
      d'installation BSD/Mac68k" pour copier tous les ensembles de
      FTP:3.3/mac68k/ sur vos partitions. Vous serez finalement en
      mesure de configurer le programme de d&eacute;marrage BSD/Mac68k
      avec l'emplacement de votre noyau et de d&eacute;marrer le
      syst&egrave;me. </ul>
<p> 
<h3><font color="#e00000">OpenBSD/mvme68k :</font></h3>
<ul>
  <p> Vous pouvez cr&eacute;er une bande d'installation initialisable ou
      d&eacute;marrer &agrave; partir du r&eacute;seau. <br> Le
      d&eacute;marrage &agrave; partir du r&eacute;seau une version de
      MVME68K BUG qui supporte les commandes de d&eacute;boggage
      <i>NIOT</i> et <i>NBO</i>. Suivez les instructions dans
      INSTALL.mvme68k pour plus de d&eacute;tails. </ul>
<p> 
<h3><font color=#e00000>Remarques &agrave; propos du code source :</font></h3>
<ul>
  src.tar.gz contient une archive des sources se trouvant dans /usr/src.
  Ce fichier contient tout except&eacute; les sources du noyau, qui sont
  dans une archive s&eacute;par&eacute;e. Pour l'extraire&nbsp;:
  <p> 
  <ul>
    <pre>
# <strong>mkdir -p /usr/src</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/src.tar.gz</strong>
</pre>
  </ul>
  <p> sys.tar.gz contient une archive des sources se trouvant dans
      /usr/src/sys. Ce fichier contient toutes les sources
      n&eacute;cessaires pour reconstruire un noyau. Pour
      l'extraire&nbsp;:
  <p> 
  <ul>
    <pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /usr/src</strong>
# <strong>tar xvfz /tmp/sys.tar.gz</strong>
</pre>
  </ul>
  <p> Ces deux arborescences sont r&eacute;guli&egrave;rement mises
      &agrave; jour dans le CVS. En utilisant ces arborescences, il est
      possible d'utiliser les serveurs anoncvs imm&eacute;diatement
      comme d&eacute;crit <a href="anoncvs.html">ici</a>. Utiliser ces
      fichiers est beaucoup plus rapide que d'obtenir la totalit&eacute;
      des sources depuis un serveur anoncvs. </ul> <ul><p> </ul> <a
      name="ports"></a> <hr>
<h3><font color="#0000e0">Arborescence des ports</font></h3>
<p> Une archive de l'arborescence des ports est aussi fournie. Pour
    l'extraire&nbsp;:
<p> 
<ul>
  <pre>
# <strong>cd /usr</strong>
# <strong>tar xvfz /tmp/ports.tar.gz</strong>
# <strong>cd ports</strong>
</pre>
</ul>
<p> 
Le sous-rep&eacute;rtoire <i>ports/</i> est un &quot;checkout&quot; de
l'arborescence des ports OpenBSD. Veuillez lire la page concernant les
<a href="ports.html">ports</a> si vous ne savez pas de quoi il
s'agit. Ce texte n'est pas un manuel pour utiliser les ports. C'est
plut&ocirc;t un ensemble de notes permettant &agrave; l'utilisateur de
commencer rapidement &agrave; utiliser le syst&egrave;mes de ports
OpenBSD.
<p> 
Bien sur le syst&egrave;me des ports d'OpenBSD n'est pas complet et ne
le sera sans doute jamais. Cependant, il grossit rapidement et devient
de plus en plus stable. La plupart des ports fournis avec cette version
devraient compiler sans probl&egrave;mes sur la plupart des
architectures (plus de 1500 packages compil&eacute;s sur i386 par
exemple).
<p> 
Le r&eacute;pertoire <i>ports/</i> repr&eacute;sente une version CVS des
ports (voir la page du manuel <a href="http://www.openbsd.org/cgi-bin/m-
an.cgi?query=cvs&apropos=0&sektion=1&manpath=OpenBSD+Current&arch=i386&-
format=html">cvs(1)</a> si vous n'&ecirc;tes pas familier avec CVS).
Comme pour l'arborescence des sources, notre arborescence des ports est
disponible par anoncvs. Donc pour mettre &agrave; jour votre
arborescence des <i>ports/</i> depuis un media en
lecture-&eacute;criture, il suffit de lancer la commande suivante&nbsp;:
<p> 
<ul>
  <pre>
# <strong>cd [portsdir]/; cvs -d anoncvsserver.openbsd.org:/cvs update -Pd # -rOPENBSD_3_3</strong>
</pre>
</ul>
<p> 
[Bien s&ucirc;r, vous devez remplacer le r&eacute;pertoire local et le
nom du serveur ici par l'emplacement de votre collection des ports et le
serveur anoncvs le plus proche.]
<p> 
Remarquez que la plupart des ports sont disponibles en tant que packages
via ftp. Des mises &agrave; jour de packages pour la version 3.3 seront
disponibles si des probl&egrave;mes surviennent.
<p> 
Si vous &ecirc;tes int&eacute;ress&eacute; par l'ajout d'un port, voulez
aider, ou voulez juste en savoir plus, la liste de discussion
ports@openbsd.org est la liste &agrave; conna&icirc;tre.
<p>
<p>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0"
alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: 33.html,v 1.29 ]<br>
$Translation: 33.html,v 1.11 2003/06/18 20:43:38 xsa Exp $<br>
$OpenBSD: 33.html,v 1.8 2003/06/21 11:54:31 jufi Exp $
</small>

</body>
</html>
