<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="document">
<meta name="description" CONTENT="How to make/update an OpenBSD port.">
<meta name="keywords" content="openbsd,ports">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1998-2002 by OpenBSD.">

<title>Portage logiciel sous OpenBSD</title>
</head>
 
<body text=Black bgcolor=White link="#23238E">
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<h2><font color="#e00000">Points &agrave; v&eacute;rifier pour chaque portage 
  logiciel sous OpenBSD</font></h2>

Ce document d&eacute;crit comment concevoir ou mettre &agrave; jour un &quot;port&quot;. 
Il s'agit essentiellement d'une liste utile &agrave; consulter &agrave; chaque 
fois, mais elle n'est ni complete, ni parfaite. Nous vous invitons donc 
&agrave; proposer vos commentaires et questions &agrave; l'adresse suivante :<a href="mailto:ports@openbsd.org"> 
ports@openbsd.org</a>. 
<hr>
<ol>
  <li> Si vous voulez prendre en charge la gestion d'un portage logiciel, inscrivez-vous 
    via : <a href="mailto:ports@openbsd.org"> ports@openbsd.org.</a> 
    <ul>
      <li>Cette liste est consacr&eacute;e &agrave; toutes les discussions et 
        votre inscription y est fortement recommand&eacute;e. 
      <li>La lecture des envois pr&eacute;c&eacute;dents sur cette liste est 
        essentiel : des annonces ou explications cruciales s'y trouvent. 
      <li> Vous pourrez y cotoyer des personnes exp&eacute;riment&eacute;es dans 
        ce domaine. Ils pourront vous offrir des conseils ou tester vos portages. 
    </ul>
    <br>
  <li>Prendre en charge la gestion d'un portage signifie <b>beaucoup plus </b>que 
    de proposer des logiciels. Pour chaque logiciel, vous vous engagez &agrave; 
    maintenir vos portages <b>&agrave; jour</b> et r&eacute;pondre aux questions 
    des utilisateurs qui les utiliseront : comment activer ou d&eacute;sactiver 
    certaines fonctionalit&eacute;s, etc. <br>
    <br>
  <li>Votre d&eacute;cision prise, vous devez obtenir une copie locale sur votre 
    disque de l'arbre des ports &agrave; l'aide de <b>cvs</b>. Comment le faire 
    ? Vous trouverez toutes les informations requises sur cette page : <a href="http://www.openbsd.org/anoncvs.html"> 
    http://www.openbsd.org/anoncvs.html</a>. <br>
    <br>
  <li> Choisissez o&ugrave;, dans quel dossier, sera plac&eacute; votre portage 
    et cr&eacute;ez l'infrastructure de base requise. Utilisez le fichier Makefile 
    modele <code>/usr/ports/infrastructure/templates/Makefile.template</code>. 
    NEED_VERSION est consid&eacute;r&eacute; <b>obsol&egrave;te </b>et vous ne 
    devez pas l'utiliser pour tous les nouveaux portages d&eacute;sormais : vous 
    devez mettre &agrave; jour votre arbre local de ports, ceci <b>incluant bsd.port.mk</b> 
    <ul>
      <li> Cr&eacute;ez le r&eacute;pertoire <code>pkg</code>. 
      <li> Cr&eacute;ez des fichiers vides <code>pkg/DESCR, pkg/PLIST</code>. 
    </ul>
    <br>
  <li> Ajoutez les portions &quot;fetch&quot; (de r&eacute;cup&eacute;ration) 
    au Makefile. 
    <ul>
      <li> Modifiez EXTRACT_SUFX si le suffixe des fichiers n'est pas .tar.gz. 
        D'autres exemples sont .tar.Z ou .tgz. 
      <li> Modifiez DISTNAME : cette variable locale doit contenir le nom du fichier, 
        sans son suffixe. Par exemple si votre portage logiciel est foo-1.0.tar.gz 
        alors DISTNAME doit contenir la cha&icirc;ne : foo-1.0. 
      <li> Modifiez MASTER_SITES pour contenir l'URL des r&eacute;pertoires qui 
        contiennent un exemplaire du fichier portant les sources. Par exemple 
        il peut s'agir de l'adresse ftp://ftp.openbsd.org/pub/OpenBSD/distfiles/. 
        <strong>N'oubliez pas la barre finale de l'adresse !</strong> Essayez 
        d'avoir au moins trois sites diff&eacute;rents pour chacun de vos portages. 
        Le site le plus fiable et rapide doit se trouver en premi&egrave;re position. 
      <li> Gardez &agrave; l'esprit que les variables locales suivantes sont utilis&eacute;es 
        pour identifier le fichier &agrave; r&eacute;cup&eacute;rer et dans cet 
        ordre : ${MASTER_SITES}${DISTNAME}${EXTRACT_SUFX}. Toutes ces variables 
        seront utilis&eacute;es. Il ne faut pas que DISTNAME contienne en cons&eacute;quence 
        le nom complet du fichier. 
      <li> Vous pourrez v&eacute;rifier que vous avez fix&eacute; correctement 
        ces variables en utilisant la commande : <b>make fetch-all</b>. 
    </ul>
    <p> Certains portages logiciels sont complexes et pour simplifier votre t&acirc;che, 
      des outils suppl&eacute;mentaires sont &agrave; votre disposition : 
    <ul>
      <li> Vous pouvez utiliser la variable locale PATCHFILES. Cette derni&egrave;re 
        doit contenir une liste de patch propos&eacute;s par l'origine du logiciel 
        (et non OpenBSD). On y trouve g&eacute;n&eacute;ralement des correctifs 
        de fiabilit&eacute; ou de s&eacute;curit&eacute;. 
      <li> Si vos portages sont disponibles au sein de sites miroirs majeurs tels 
        que GNU, SunSite ou CPAN, nous en proposons une liste de sitesau sein 
        du fichier /usr/ports/infrastructure/templates/network.conf.template. 
        Modifiez MASTER_SITES par : ${MASTER_SITE_GNU} ou ${MASTER_SITE_SUNSITE}, 
        etc. Pour simplifier ce processus, utilisez la construction ${MASTER_SITE_FOO:=subdir/} 
        pour rajouter le sous-r&eacute;pertoire contenant la distribution. 
      <li> Chaque portage contient une version sp&eacute;cifique d'un logiciel. 
        Une fois les fichiers r&eacute;cup&eacute;r&eacute;s, on v&eacute;rifie 
        un hachage pour s'assurer de leur int&eacute;grit&eacute; et la comparaison 
        sera effectu&eacute;e &agrave; partir des hachages que <b>vous </b>aurez 
        calcul&eacute;s. Pour &eacute;viter toute confusion, DISTFILES et PATCHFILES 
        doivent avoir des num&eacute;ros de version clairement identifiables : 
        ne r&eacute;cup&eacute;rez pas de fichier foo-latest.tar.gz s'il existe 
        un lien vers foo-1.0.5.tar.gz. Si c'est n&eacute;cessaire, contacter l'auteur 
        du logiciel afin de lui demander conseil et expliquez poliment pourquoi 
        vous devez pouvoir identifier clairement un num&eacute;ro de version dans 
        le fichier contenant les sources de votre portage en devenir. 
      <li> Si votre portage logiciel requiert plus de 5 DISTFILES + PATCHFILES 
        pour fonctionner, utilisez la variable locale DIST_SUBDIR pour &eacute;viter 
        de polluer et de rendre complexe la lecture de /usr/ports/distfiles par 
        les utilisateurs (et d&eacute;terminer qui fait partie de quoi). 
      <li> DIST_SUBDIR ne <b>doit pas </b>r&eacute;f&eacute;rencer de num&eacute;ros 
        de version. Lorsque le portage sera mis &agrave; jour vers une nouvelle 
        version, seuls les fichiers contenant les sources doivent &ecirc;tre modifi&eacute;s 
        : si DIST_SUBDIR est modifi&eacute;, tous les fichiers seront &agrave; 
        nouveau r&eacute;cup&eacute;r&eacute;s. Il faut penser &agrave; l'utilisateur 
        qui doit maintenir son syst&egrave;me, tout du moins pouvoir en consulter 
        l'&eacute;tat sans se perdre. 
      <li> A la fois DISTFILES et PATCHFILES ne proviennent pas n&eacute;cessairement 
        des m&ecirc;mes sites MASTER_SITES. Il est possible de d&eacute;finir 
        des sites suppl&eacute;mentaires &agrave; l'aide des variables locales 
        MASTER_SITES0 &agrave; MASTER_SITES9. Il vous suffit d'&eacute;crire DISTFILES=foo-1.0.5.tar.gz:5 
        pour r&eacute;cup&eacute;rer le fichier depuis le site contenu dans MASTER_SITES5 
        (notez le &quot;:5&quot;). 
      <li> Certains portages n'ont pas besoin de r&eacute;cup&eacute;rer tous 
        les fichiers en toute circonstance. Par exemple, les options de compilation 
        de certains portages logiciels d&eacute;finissent ce qui doit &ecirc;tre 
        compil&eacute; ou non, des sortes de &quot;modules&quot; optionnels. Si 
        une fonctionalit&eacute; pr&eacute;sente dans un module n'est pas utilis&eacute;e, 
        alors il n'est pas n&eacute;cessaire de r&eacute;cup&eacute;rer tous les 
        fichiers mais uniquement ceux qui sont requis. Certains composants sont 
        &eacute;galement sp&eacute;cifiques &agrave; certaines architectures mat&eacute;rielles 
        : tous ces fichiers optionnels doivent &ecirc;tre r&eacute;f&eacute;renc&eacute;s 
        dans la variable locale SUPDISTFILES. Lorsque des cibles de compilation 
        telles que makesum ou mirror-distfiles sont utilis&eacute;es, le syst&egrave;me 
        des Ports veillera &agrave; r&eacute;cup&eacute;rer tous les fichiers 
        optionnels qui ne sont pas toujours requis par l'utilisateur classique. 
    </ul>
    <br>
  <li> Cr&eacute;ez des hachages dans <i>distinfo</i> en tapant <b>make makesum</b>. 
    Vous <b>devez </b>ensuite v&eacute;rifier que ces hachages sont valides en 
    tapant <b>make checksum</b>. 
    <ul>
      <li> Dans certains cas, rares, il n'est pas possible de disposer de hachages 
        pour tester l'int&eacute;grit&eacute; des sources. Il est de votre <b>responsabilit&eacute; 
        </b>d'essayer de trouver par tout moyen possible un site d'archive fiable. 
        Communiquer avec l'auteur ou les auteurs du logiciel et la ou les personnes 
        en charge des sites contenant les archives du logiciel est fondamental 
        et tr&egrave;s d&eacute;sirable. Dans le pire des cas, vous pourrez utiliser 
        la variable locale IGNOREFILES pour marquer les fichiers pour lesquels 
        il n'est pas possible de disposer de hachages d'int&eacute;grit&eacute; 
        fiables. 
      <li> Tous les fichiers de DISTFILES seront trait&eacute;s durant la phase 
        d'extraction. EXTRACT_ONLY peut-&ecirc;tre utilis&eacute;e pour limiter 
        l'extraction aux seuls fichiers requis (peut &ecirc;tre vide). L'usage 
        habituel de cette variable est de personnaliser l'extraction : par exemple, 
        si certains DISTFILES doivent subir un traitement particulier, il seront 
        retir&eacute;s de EXTRACT_ONLY et g&eacute;r&eacute;s manuellement apr&egrave;s 
        la phase d'extraction. Pour des raisons historiques, make extract fixe 
        le r&eacute;pertoire de travail pendant l'extraction des fichiers. Ainsi, 
        il est tr&egrave;s inhabituel de fournir des chemins de pr&eacute;-extraction 
        et post-extraction diff&eacute;rents (et c'est m&ecirc;me un comportement 
        suspect, indiquant un camouflage important au sein du portage). 
      <li> Les patch qui demandent un traitement particulier doivent &ecirc;tre 
        mentionn&eacute;s dans DISTFILES et retir&eacute;s de EXTRACT_ONLY, pour 
        des raisons historiques. 
    </ul>
    <br>
  <li> Testez l'extraction du portage &agrave; l'aide de la commande <b>make extract</b>. 
    Vous devez v&eacute;rifier avec soin o&ugrave; se trouve la base des sources. 
    Il s'agit normalement de <i>w-${PKGNAME}${FLAVOR_EXT}/${DISTNAME}</i>. Vous 
    aurez peut-&ecirc;tre besoin de modifier la variable WRKDIST du Makefile si 
    cette base de sources est diff&eacute;rente. <br>
    <br>
  <li>Lisez la documentation d'installation et notez que la construction de port 
    doit se compl&eacute;ter et prendre en compte toute option sp&eacute;ciale 
    requise. <br>
    <br>
  <li>Maintenant vous devez prendre le temps de consid&eacute;rer s&eacute;rieusement 
    et avec un grand soin les licences (ou la licence) qui couvre votre portage 
    logiciel. Certains logiciels peuvent &ecirc;tre redistribu&eacute;s librement, 
    mais pas tous. Afin de vous aider, vous devez r&eacute;pondre &agrave; quatre 
    questions. Il s'agit des variables PERMIT_* que vous trouverez au sein du 
    fichier Makefile. 
    <ul>
      <li> PERMIT_PACKAGE_CDROM indique si le portage peut &ecirc;tre distribu&eacute; 
        sur support CD-Rom. 
      <li> PERMIT_PACKAGE_FTP indique si le portage peut &ecirc;tre plac&eacute; 
        sur des sites FTP. 
      <li> PERMIT_DISTFILES_CDROM indique si nous avons le droit de placer en 
        miroir les distfiles sur support CD-Rom. 
      <li> PERMIT_DISTFILES_FTP indique si nous avons le droit de placer les distfiles 
        en miroir sur des sites FTP. 
    </ul>
    <p> A chaque fois que l'un de ces usages est autoris&eacute;, indiquez &quot;Yes&quot;. 
      Si ce n'est pas le cas, vous devez expliquer pourquoi dans une cha&icirc;ne 
      commentaire. Soyez <b>attentif (attentive) </b>aux conditions sp&eacute;ciales 
      qui sont impos&eacute;es <b>apr&egrave;s </b>l'installation du logiciel. 
      Par exemple, une s&eacute;rie de logiciels impose qu'un exemplaire de leur 
      licence soit install&eacute;e et mentionn&eacute;e &agrave; l'utilisateur. 
      Dans ce cas, nous vous recommandons de regrouper toutes les licences au 
      m&ecirc;me endroit pour que l'utilisateur puisse tout lire sans rien oublier 
      et rester bien inform&eacute; : <code>/usr/local/share/DISTNAME/</code>. 
      <br>
      <br>
  <li>Ajoutez les options de configuration au Makefile et cr&eacute;ez un script 
    de configuration au besoin. 
    <ul>
      <li> Vous pouvez ajouter un script de configuration de votre portage nomm&eacute; 
        `configure' et le situer dans un r&eacute;pertoire <code>scripts/</code>. 
        Ce script sera ex&eacute;cut&eacute; avant toute configuration sp&eacute;cifi&eacute;e 
        par la variable locale CONFIGURE_STYLE. 
      <li> Si le configure GNU est utilis&eacute;, vous devriez utiliser ./configure 
        --help afin de d&eacute;terminer quelles options sont disponibles. 
      <li> Tout ce que vous pourriez &ecirc;tre amen&eacute;(e) &agrave; modifier 
        peut &ecirc;tre modifi&eacute; en utilisant le drapeau de configuration 
        -option dans le param&egrave;tre CONFIGURE_ARGS du fichier Makefile. 
      <li> Utilisez CONFIGURE_ARGS+= pour rajouter une ou des options &agrave; 
        cette variable locale. Si vous utilisez CONFIGURE_ARGS= vous risquez d'en 
        &eacute;craser tout contenu pr&eacute;alable. 
    </ul>
    <br>
  <li> Essayez de construire le portage logiciel &agrave; l'aide de la commande 
    <b>make build</b>. 
    <ul>
      <li> Si vous avez de la chance, tout sera construit sans la moindre erreur 
        (bonne chance !) 
      <li> Si vous obtenez une erreur, vous devrez g&eacute;n&eacute;rer un ou 
        plusieur patch qui seront utili&eacute;s par votre portage, afin de permettre 
        sa compilation et installation sous OpenBSD. D&eacute;terminez ce qui 
        doit &ecirc;tre modif&eacute;, et cr&eacute;ez un patch. 
      <li> Les patch doivent toujours s'appliquer depuis la base ${WRKDIST}. 
      <li> Le moyen le plus facile de v&eacute;rifier que le patch fonctionne 
        est de tout &quot;nettoyer&quot; &agrave; l'aide de <b>make clean patch</b>. 
        Cette commande va nettoyer le r&eacute;pertoie de travail de tous fichiers, 
        faire &agrave; nouveau l'extraction et appliquer votre patch. 
    </ul>
    <br>
  <li> Commencez un cycle de <b>make build</b>, puis produisez un patch (ou utilisez 
    <b>make update-patches</b>) puis <b>make clean patch</b>. 
    <ul>
      <li> Les patch doivent &ecirc;tre plac&eacute;s dans <i>patches/</i> et 
        doivent &ecirc;tre nomm&eacute;s patch-* o&ugrave; vous remplacerez * 
        par quelque chose de compr&eacute;hensible. Nous vous recommandons de 
        nommer vos patch patch-FILENAME o&ugrave; FILENAME est le nom du fichier 
        qui sera modifi&eacute; par le patch. (<tt>make update-patches</tt> le 
        fait automatiquement pour vous) 
      <li> Appliquer PATCHFILES est la premi&egrave;re &eacute;tape du stade des 
        patch. Vous pouvez l'invoquer s&eacute;par&eacute;ment &agrave; l'aide 
        de make distpatch, une cible utile pour les porteurs d'applications. Vous 
        pouvez ignorer cette &eacute;tape si vous n'avez pas fix&eacute; de valeur 
        &agrave; cette variable. 
      <li>Chaque fichier de patch ne doit modifier qu'un seul fichier &agrave; 
        la fois. S'il-vous-pla&icirc;t. 
      <li>Utilisez <b>make update-patches</b> pour g&eacute;n&eacute;rer les patch, 
      <li> Tous les patch DOIVENT &ecirc;tre relatifs &agrave; ${WRKDIST}, 
      <li> V&eacute;rifiez que les patch <b>NE CONTIENENT PAS </b>de tags qui risquent 
        d'&ecirc;tre modifi&eacute;s par cvs. Si c'est le cas, vos patch ne pourront 
        plus s'appliquer apr&egrave;s une mise &agrave; jour via cvs. Vous pouvez 
        v&eacute;rifier les changements potentiels &agrave; l'aide de -kk pour 
        l'&eacute;viter. 
      <li> Ajouter une petite explication sur le r&ocirc;le du patch dans le fichier 
        lui-m&ecirc;me et ajoutez un tag OpenBSD CVS <code>&#36;OpenBSD&#36;</code>. 
      <li> <b>Veuillez fournir un exemplaire </b>de vos patch &agrave; l'auteur 
        du logiciel. 
    </ul>
    <br>
  <li> Essayez de fixer <code>SEPARATE_BUILD</code>. 
    <ul>
      <li> Si le portage peut construire des fichiers objets en-dehors de l'arbre 
        des sources, cela est pr&eacute;f&eacute;rable et permet de conserver 
        l'arbre des sources dans un &eacute;tat plus &quot;propre&quot; (de nombreux 
        programmes qui utilisent <code>CONFIGURE_STYLE=gnu</code> le peuvent) 
        et cela simplifie en outre la gestion de l'arbre de sources sur plusieurs 
        architectures. 
      <li> Cela peut vous &eacute;pargner des efforts, et vous permet de relancer 
        facilement un cycle de construction du portage depuis le <code>configure</code>. 
    </ul>
    <br>
  <li> Parcourez avec attention la sortie obtenue (s'il y en a) et modifiez toute 
    option utile dans le Makefile. Pour r&eacute;p&eacute;ter la commande utilisez 
    `<b>make clean configure</b>'. 
    <p> Note: v&eacute;rifiez que les fichiers d&eacute;pendants de l'h&ocirc;te 
      soient plac&eacute;s soit dans <i>/etc</i> ou <i>/etc/&lt;name&gt;</i>, mais 
      <strong>NE REMPLACEZ NI NE MODIFIEZ JAMAIS<b> </b></strong>de fichiers existants 
      dans /etc. Il vaut mieux placer ces fichiers dans <i>/usr/local/share/&lt;name&gt;</i> 
      puis copiez vers <i>/etc</i> ou <i>/etc/&lt;name&gt;</i> seulement si les 
      fichiers n'existent pas. Si les fichiers existent, affichez un message et 
      indiquez &agrave; l'utilisateur du syst&egrave;me quels fichiers doivent 
      &ecirc;tre modifi&eacute;s. Cela permet &eacute;galement de garantir que 
      les fichiers seront inclus dans le paquetage puisque tout ce qui se trouve 
      dans <i>/usr/local</i> sera inclus dans PLIST. Une fois un paquetage install&eacute;, 
      le contenu de <code>pkg/MESSAGE</code> sera affich&eacute; et le cycle de 
      construction du paquetage sera termin&eacute;. 
    <p> OpenBSD situe les fichiers comme suit : 
    <pre>
       ex&eacute;cutables utilisateur :					/usr/local/bin
       ex&eacute;cutables de l'administrateur :				/usr/local/sbin
       programmes ex&eacute;cutables :						/usr/local/libexec
       librairies :							/usr/local/lib
       donn&eacute;es ind&eacute;pendantes de l'architecture :			/usr/local/lib/&lt;nom&gt;
       fichiers inclus install&eacute;s :					/usr/local/include ou
									/usr/local/include/&lt;nom&gt;
       donn&eacute;es sp&eacute;cifiques &agrave; la machine :				/etc ou /etc/&lt;nom&gt;
       &eacute;tat local :							/var/run
       fichiers contenant les scores des jeux :				/var/games
       fichiers info GNU :						/usr/local/info
       pages man :							/usr/local/man/...
       donn&eacute;es ind&eacute;pendantes de l'architecture en lecture seule :	/usr/local/share/&lt;nom&gt;
       documentations diverses :					/usr/local/share/doc/&lt;nom&gt;
    </pre>
    Commencez un cycle de compilations jusqu'&agrave; ce que le portage soit termin&eacute;. 
    Patchez (voir ci-dessus), puis clean et make jusqu'&agrave; la production 
    du portage. Vous devez <b>&eacute;liminer tous les "warning"</b> obtenus en 
    particulier ceux en rapports avec la s&eacute;curit&eacute; du code produit.<br>
    <br>
  <li> Controllez la s&eacute;mantique de SEPARATE_BUILD. Vous ne devez le faire 
    que si votre portage utilise la variable locale SEPARATE_BUILD. Id&eacute;alement, 
    le portage ne doit pas modifier de fichiers dans ${WRKSRC} <b>apr&egrave;s 
    l'application de votre patch</b>. Vous pouvez le v&eacute;rifier en retirant 
    vos droits d'&eacute;criture &agrave; cette &eacute;tape sur ${WRKSRC}. Ensuite 
    vous pouvez utiliser <code>SEPARATE_BUILD=concurrent</code> -- et v&eacute;rifier 
    qu'une autre personne peut, sur une autre architecture, obtenir la m&ecirc;me 
    compilation. Sinon, utilisez <code>SEPARATE_BUILD=simple</code> -- si la construction 
    du portage sur plusieurs architectures peut provoquer des probl&egrave;mes, 
    &agrave; mesure que certains fichiers seront r&eacute;g&eacute;n&eacute;r&eacute;s 
    &agrave; certains moments. <br>
    <br>
  <li> Ajoutez une ligne <i>COMMENT</i> dans le Makefile. COMMENT est une <b>COURTE 
    </b>description du portage (au maximum 60 caract&egrave;res) Vous ne <b>DEVEZ 
    PAS INCLURE </b>le nom du paquetage dans la description ou son num&eacute;ro 
    de version. Vous ne devez pas faire d&eacute;buter cette ligne de commentaire 
    par un caract&egrave;re en majuscule sauf si la signification s&eacute;mantique 
    doit &ecirc;tre sans aucune ambigu&iuml;t&eacute; et <b>NE TERMINEZ PAS CETTE 
    LIGNE </b>par un point. <b>EN AUCUN CAS VOUS NE DEVEZ COMMENCER PAR UN ARTICLE 
    INDETERMINE COMME 'un' OU 'une' ; retirez tout article au d&eacute;but</b><strong>.</strong> 
    <br>
    <br>
  <li>Editez <i>pkg/DESCR et pkg/PLIST</i>. 
    <ul>
      <li> DESCR est une description plus &eacute;tendue du portage. Il peut s'agir 
        d'un ou plusieurs paragraphes expliquant de mani&egrave;re consise en 
        quoi consiste le logiciel. Nous vous invitons &agrave; terminer chaque 
        ligne apr&egrave;s 72 caract&egrave;res ce que vous pouvez faire apr&egrave;s 
        l'&eacute;criture de ce fichier en utilisant la commande suivante : fmt 
        -w 72
      <li> PLIST doit rester vide pour l'instant. 
    </ul>
    <br>
  <li>Si l'application a besoin de cr&eacute;er un utilisateur ou un groupe,
  choisissez le plus petit identifiant libre dans 
  <code>/usr/ports/infrastructure/db/user.list</code> afin de l'utiliser
  pour votre port et soyez certain que celui-ci soit ajout&eacute; &agrave; ce 
  m&ecirc;me fichier lors de son entr&eacute;e dans l'arbre.
  <br><br>
  <li> Installez l'application en utilisant la commande <b>make install</b>. Si 
    votre portage logiciel utilise des librairies dynamiques, v&eacute;rifiez 
    leur table de symboles &agrave; l'aide de la commande <code>nm</code>, car 
    parfois un logiciel ne les r&eacute;f&eacute;rence pas correctement ce qui 
    va provoquer le dysfonctionnement du logiciel par la suite une fois que le 
    binaire &agrave; fait l'objet d'un strip alors qu'ils fonctionnent parfaitmenent 
    avant le strip. Toutefois, les binaires DEVRAIENT faire l'application d'un 
    strip avant leur installation ; utilisez la commande <code>file</code> pour 
    d&eacute;terminer si le binaire a fait ou non l'objet d'un strip. Si le portage 
    contient d&eacute;j&agrave; des instructions pour r&eacute;aliser un strip 
    du binaire avant son installation (par exemple 'install-strip') utilisez ce 
    dernier; dans le cas contraire, ajoutez cette option dans le Makefile afin 
    de rendre l'application d'un strip sur les binaires possible. <br>
    <br>
  <li><b>V&eacute;rifier une nouvelle fois et avec le plus grand soin que votre 
    portage ne contient pas de trous de s&eacute;curit&eacute; potentiels</b>. 
    Les programmes qui fonctionnent en setiud o&ugrave; qui acc&egrave;dent au 
    r&eacute;seau doivent faire l'objet d'un audit complet et de grand soin. Nous 
    vous invitons &agrave; &eacute;tudier nos <a href="../porting.html#Security">recommandations 
    quant &agrave; la s&eacute;curit&eacute;</a> pour mener &agrave; bien cette 
    &eacute;tape tr&egrave;s importante. Vous devez tout enregistrer et &eacute;tudier 
    en ce qui concerne tout changement, et l'inscrire au sein du fichier <code>/SECURITY</code>. 
    Ce fichier doit lister avec pr&eacute;cision tout probl&egrave;me de s&eacute;curit&eacute; 
    potentiel introduit par votre portage, avec les patch qui accompagnent les 
    programmes afin que quiconque qui prenne votre portage en main puisse savoir 
    ce qu'il reste &agrave; v&eacute;rifier. Par exemple : 
    <pre>&#36;OpenBSD&#36;

      ${WRKDIR}/receiver.c
         l'appel de la fonction mktemp (fonction wrapper &agrave; do_mktemp) me semble incorrecte.

      Ce serveur utilise une grande quantit&eacute; de fonctions strlcpy/strlcat/snprintf.
</pre>
  <li> Cr&eacute;ez le fichier pkg/PLIST. Une fois l'installation compl&egrave;te, 
    utilisez la commande pour d&eacute;veloppeurs <b>make plist</b> qui permet 
    de g&eacute;n&eacute;rer le fichier PLIST au sein du r&eacute;pertoire <i>pkg</i>. 
    Ce fichier est le candidat pour toute cr&eacute;ation de liste de paquetages. 
    <p> Attention! Les fichiers sont trouv&eacute;s par datation. Ceci signifie 
      que le syst&egrave;me ne r&eacute;alise PAS les t&acirc;ches suivantes : 
    <ul>
      <li> lister les fichiers install&eacute;s par 'tar' car leur datation ne 
        sera pas modifi&eacute;e et ne seront pas trouv&eacute;s par 'find'. 
      <li> mise &agrave; jour de <code>info/dir</code> si des fichiers .info sont 
        ajout&eacute;s. Egalement, v&eacute;rifiez que <code>info/dir</code> ne 
        fait pas partie du PLIST. 
      <li> tenter de faire quoi que ce soit de sp&eacute;cial avec des liens ou 
        liens symboliques.Un test avec tar montre que ce dernier traite les liens 
        et liens symboliques correctement, mais nous pr&eacute;f&eacute;rons la 
        prudence pour tout ce qui touche aux paquetages.
    </ul>
    <p> Consultez attentivement le fichier `PLIST' et v&eacute;rifiez que tout ce qui est 
      install&eacute; a &eacute;t&eacute; fait correctement et au bon endroit. 
      Tout ce qui n'est pas install&eacute; mais qui doit l'&ecirc;tre doit &ecirc;tre 
      list&eacute; dans une r&egrave;gle 'post-install' au sein du Makefile. 
    <p> Les portages qui installent des librairies partag&eacute;es auront un 
      fichier suppl&eacute;mentaire, nomm&eacute; PFRAG.shared. 
    <ul>
      <li> PLIST d&eacute;crit les fichiers indiquant, pour chaque architecture, 
        si les librairies partag&eacute;es sont ou non support&eacute;es. 
      <li> PFRAG.shared ne d&eacute;crit que les fichiers qui sont install&eacute;s 
        de mani&egrave;re additionnelle sur les architectures qui supportent les 
        librairies partag&eacute;es.
      <li> PFRAG.noshared ne d&eacute;crit que les fichiers qui sont install&eacute;s 
        de mani&egrave;re suppl&eacute;mentaire sur les architectures qui ne supportent 
        pas les librairies partag&eacute;es. 
    </ul>
    <br>
  <li> Continuez &agrave; retirer le paquetage install&eacute; et installez &agrave; 
    nouveau encore et encore jusqu'&agrave; la <b>perfection</b>. Par &quot;perfection&quot; 
    nous voulons dire que le portage logiciel s'installe parfaitement et qu'il 
    peut &eacute;galement &ecirc;tre retir&eacute; sans aucun probl&egrave;me 
    ou conflit. `pkg_delete &lt;nom de paquetage&gt;' sera utilis&eacute; pour 
    retirer le logiciel tandis que `sudo make reinstall' sera utilis&eacute; pour 
    effectuer une r&eacute;installation. Consultez la page man de `pkg_create' 
    pour &eacute;tudier les diff&eacute;rentes commandes disponibles qui peuvent 
    &ecirc;tre ajout&eacute;es &agrave; PLIST pour vous assurer que tout est nettoy&eacute; 
    correctement. Apr&egrave;s avoir retir&eacute; le portage, la commande suivante 
    : 
    <pre>
$ find /usr/local -newer w-${PKGNAME}${FLAVOR_EXT}/fake-${MACHINE_ARCH}[-${FLAVOR}]/.install_started -print
</pre>
    ne doit lister que les noms standards de r&eacute;pertoires. <br>
    <br>
  <li> Testez le paquetage lui-m&ecirc;me. Apr&egrave;s l'installation du portage, 
    la commande <code>make package</code> est utilis&eacute;e pour cr&eacute;er 
    un paquetage. Pour tester le paquetage, utilisez d'abord la commande <code>pkg_delete</code> 
    puis utilisez <code>pkg_add</code> Les r&eacute;sultats obtenus doivent correspondre 
    <b>EXACTEMENT </b>aux r&eacute;sultats obtenus par l'utilisation de la commande 
    `make install'. <br>
    <br>
  <li> Envoyez un email &agrave; l'adresse <a href="mailto:ports@openbsd.org">ports@openbsd.org</a> 
    avec une courte note indiquant vos commentaires et les tests men&eacute;s. 
    Attachez le portage &agrave; cet email et envoyez-le. 
    <p> Essayez de faire tester votre portage sur le plus grand nombre de plates-formes 
      possibles. 
    <ul>
      <li> La plateforme DEC Alpha est excellente car elle n'utilise que des librairies 
        statiques et que <code>sizeof(int) != sizeof(long)</code>. 
      <li> Sun SPARC est aussi une excellente plateforme de test car elle est 
        facile &agrave; trouver, et que son ordre d'octets est &agrave; l'inverse 
        de celui de la plateforme i386 ; de la m&ecirc;me mani&egrave;re, si vous 
        r&eacute;alisez votre portage sur SPARC la plateforme i386 sera la meilleure 
        plateforme de test pour vous.
    </ul>
    <br>
  <li>Incorporez toutes les informations obtenues en retour que vous obtiendrez 
    d'autres testeurs. Testez &agrave; nouveau sur votre plateforme. Ensuite, 
    r&eacute;pondez &agrave; toute personne et proposez-leur votre nouveau portage. 
    <br>
    <br>
  <li>Enfin, incorporez votre logiciel dans l'abre des "ports" d'OpenBSD. Si vous 
    ne disposez pas de droits d'&eacute;criture CVS, demandez &agrave; quelqu'un 
    qui en dispose sur <a href="mailto:ports@openbsd.org">ports@openbsd.org</a> 
    de le faire pour vous. <br>
    <br>
  <li> Si vous &ecirc;tes un d&eacute;veloppeur disposant d'un acc&egrave;s CVS, 
    ins&eacute;rez votre portage logiciel. Nous pr&eacute;f&eacute;rons l'utilisation 
    de "import" pour importer votre nouveau port, plut&ocirc;t que d'ajouter des 
    centaines (ou plus) de fichiers de mani&egrave;re individuelle. Import utilise 
    des num&eacute;ros de version de type &quot;branche vendeur&quot; comme 1.1.1.1 
    mais ne vous inqui&eacute;tez pas &agrave; ce sujet ! :-)<br>
    Si vous modifiez un fichier de mani&egrave;re sp&eacute;cifique (&eacute;dition 
    puis cvs commit), la nouvelle version sera alors 1.2
    <p> En r&eacute;sum&eacute;, l'importation sera utilis&eacute;e &agrave; la 
      cr&eacute;ation du portage logiciel. A partir de ce stade, &quot;cvs add&quot; 
      et &quot;cvs rm&quot; seront utilis&eacute;s pour ajouter ou retirer des 
      fichiers, tandis que le cycle classique d'&eacute;dition puis commit sera 
      utilis&eacute;. Vous pouvez utiliser quelque chose comme ceci :
    <pre>
$ cd kaffe1
$ make clean	# &eacute;vitez d'envoyer vos fichiers de travail dans le CVS !
$ cvs -d cvs.openbsd.org:/cvs import -m 'kaffe port' ports/lang/kaffe1 \
	<I>VotreNom</I> VotreNom<I>_YYYY-MMM-DD</I>
</pre>
    <ul>
      <li> -d cvs.openbsd.org:/cvs indique o&ugrave; se trouve le cvs. Vous pouvez 
        l'ignorer si vous avez une variable locale CVSROOT d&eacute;finie. 
      <li> -m 'kaffe port' est votre message de login. Vous pouvez indiquer ce 
        que vous voulez
      <li> ports/lang/kaffe1 est le chemin relatif o&ugrave; votre portage sera 
        plac&eacute; par rapport au /cvs
      <li> <i>VotreNom</i> (remplac&eacute; par votre nom de login) est le 'tag 
        vendeur'. Vous &ecirc;tes le vendeur puisque vous l'importez. 
      <li> <i>VotreNom_YYYY-MMM-DD</i> (e.g., ian_2000-Jan-01) est le 'tag de 
        distribution vendeur'. Valeur informative. 
    </ul>
    <br>
    Comme exemple r&eacute;el, voici la sortie obtenue par la mise en place d'un 
    portage que nous avons r&eacute;alis&eacute; le 8 septembre 1998: 
    <pre>
$ cd kaffe1
$ make clean >/dev/null
$ cvs import -m 'kaffe1.0(==JDK1.1) port' ports/lang/kaffe1 ian ian_1998-Sep-08
ian@cvs.openbsd.org's password: (not shown, obviously)
I ports/lang/kaffe1/CVS
I ports/lang/kaffe1/files/CVS
I ports/lang/kaffe1/pkg/CVS
N ports/lang/kaffe1/Makefile
cvs server: Importing /cvs/ports/lang/kaffe1/files
N ports/lang/kaffe1/files/md5
cvs server: Importing /cvs/ports/lang/kaffe1/pkg
N ports/lang/kaffe1/pkg/COMMENT
N ports/lang/kaffe1/pkg/DESCR
N ports/lang/kaffe1/pkg/PLIST

No conflicts created by this import
$ 
</pre>
  <li> Enfin, ajoutez une entr&eacute;e d'une ligne pour le nouveau portage dans 
    le Makefile du r&eacute;pertoire parent; par exemple si nous ajoutons le portage 
    de ports/lang/kaffe1, nous l'ajoutons &eacute;galement au fichier ports/lang/Makefile. 
    <br>
    <br>
  <li>Vous <b>devez maintenir le portage ! </b>Si jamais un probl&egrave;me survient, 
    une nouvelle version ou quoi que ce soit, vous devez tout faire pour maintenir 
    votre portage &agrave; jour. En d'autres mots, cycle de construction du portage, 
    mise &agrave; jour, re-cycle de construction, etc.<br>
    <br>
  <li>Lors de la mise &agrave; jour d'un portage, n'oubliez pas de traiter les 
    d&eacute;pendances ! Vous ne devez pas provoquer un disfonctionnement en modifiant 
    votre portage, dont d'autres logiciels peuvent d&eacute;pendre ! En cas de 
    probl&egrave;me si votre portage demande la mise &agrave; jour d'autres portages 
    sous la charge d'autres personnes, contactez ces derniers. De la m&ecirc;me 
    mani&egrave;re, surveillez tout portage pouvant affecter les v&ocirc;tres et pr&eacute;parez 
    vous &agrave; des mises &agrave; jour sans &ecirc;tre toujours pr&eacute;venu(e) 
    &agrave; l'avance.
</ol>
Enfin, nous tenons &agrave; vous remercier pour tous les efforts que cela r&eacute;pr&eacute;sente 
et que vous acceptez de prendre en charge pour am&eacute;liorer l'arbre des &quot;ports&quot; 
d'OpenBSD qui sans tous ces efforts n'existerait pas : merci !
<hr>
<a href="../porting.html"><img height="24" width="24" src="../back.gif"
 border="0" alt="Porting"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: checklist.html,v 1.51 ]<br>
$Translation: checklist.html,v 1.3 2003/07/18 20:40:38 xsa Exp $<br>
$OpenBSD: checklist.html,v 1.3 2003/07/19 11:53:11 jufi Exp $
</small>
</body>
</html>
