<!DOCTYPE HTML PUBLIC  "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>CTM</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="document">
<meta name="description" content="the OpenBSD/CTM page">
<meta name="keywords" content="openbsd,ctm">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2004 by OpenBSD.">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#23238E">

<center>
<img alt="CTM for OpenBSD" src="../images/bsdctm.gif" width=401 height=126>
</center>

<h3><font color="#0000e0">Qu'est ce que CTM ? </font></h3>

<p>
CTM est un syst&egrave;me con&ccedil;u par Poul-Henning Kamp pour
distribuer, de fa&ccedil;on r&eacute;guli&egrave;re et par courrier
&eacute;lectronique, les changements effectu&eacute;s sur une
arborescence de sources. C'est un bon moyen de rester &agrave; jour avec
les sources actuelles ou l'arbre CVS si vous avez une mauvaise connexion
Internet (par exemple un modem).

<p>
Le CTM d'OpenBSD distribue tous les modules du d&eacute;p&ocirc;t CVS
OpenBSD ainsi que des versions extraites de plusieurs de ces modules.
CTM utilise tr&egrave;s peu de bande passante pour distribuer les
changements dans les sources et les compresse en utilisant <tt><b>gzip
-9</b></tt>. En comparaison avec <a href="cvsup.html">CVSup</a>, CTM est
&eacute;crit en langage C et est donc dispnible pour toutes les plates-
formes support&eacute;es par OpenBSD.

<p>
Pour <b>tous</b> probl&egrave;mes, suggestions et questions ayant un
rapport avec CTM, veuillez contacter le mainteneur de CTM
<a href="mailto:hgw@d1906.inka.de">Hans G&uuml;nter Weigand</a>.
<small>(Veuillez ne pas demander &agrave; d'autres personnes du projet
OpenBSD une aide sur CTM, elles sont occup&eacute;es &agrave; d'autres
choses. Merci).</small>


<h3><font color="#0000e0">Comment est-ce que cela fonctionne&nbsp;?
    </font></h3>

<p>
L'id&eacute;e de CTM est que vous vous inscrivez &agrave; une liste de
discussion sp&eacute;cifique &agrave; un module CVS ou &agrave; une
arborescence donn&eacute;e. Chaque jour, vous recevez un message
&eacute;lectronique contenant les changements sur l'arbre pendant cette
p&eacute;riode. Une s&eacute;rie de diff&eacute;rences est appel&eacute;
un <b>delta</b>. Le serveur de CTM g&eacute;n&egrave;re des deltas
toutes les douzes heures.

<p>
Vous commencer avec une s&eacute;rie de base sur laquelle vous
appliquerez les deltas ult&eacute;rieurs. Pour commencer avec CTM vous
devez t&eacute;l&eacute;charger la derni&egrave;re s&eacute;rie de base
ainsi que tous les deltas g&eacute;n&eacute;r&eacute;s apr&egrave;s
elle. Une fois que vous avez trait&eacute; tout &ccedil;a, vous pouvez
appliquer les deltas ult&eacute;rieurs au fur et &agrave; mesure de leur
r&eacute;ception. La s&eacute;rie de base est d&eacute;coup&eacute;e en
morceaux de 1400k chacun pour permettre un t&eacute;l&eacute;chargement
ais&eacute; au travers des mauvaises connexions.

<p>
Les s&eacute;ries de base sont g&eacute;n&eacute;r&eacute;es environ
tous les 50 deltas, ce qui fait que vous n'avez jamais plus de 50 deltas
&agrave; r&eacute;cup&eacute;rer.

<p>
Il y a pour l'instant deux types de fichiers de base. Pendant un certain
temps, nous avons fait des fichiers <tt><b>tar.gz</b></tt> &agrave; la
main, mais nous sommes maintenant revenus &agrave; de vrais deltas CTM
de base. Ceux- ci contiennent une somme
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=md5&amp;sektion=1">md5(1)</a>
et sont g&eacute;n&eacute;r&eacute;s automatiquement, les rendants donc
plus s&ucirc;rs. Vous pouvez distinguer les deux types de sets de base
gr&acirc;ce &agrave; leurs noms. Un example pour un fichier
<tt><b>tar.gz</b></tt> est <tt><b>OpenBSD-cvs.1450.tar.gz</b></tt> alors
qu'un delta CTM de base serait nomm&eacute; <tt><b>OpenBSD-
cvs.1500A.gz</b></tt>. Voir ci-dessous pour des instructions
d&eacute;taill&eacute;es.

<h3><font color="#0000e0">Quel est la bande passante utilis&eacute;e par
    CTM ? </font></h3>

<p>
Vous obtenez la s&eacute;rie de base ainsi que tous les deltas par ftp
depuis les sites donn&eacute;s ci-dessous. Les tailles sont :

<ul>
<li>Environ 215 Mo pour OpenBSD-cvs
<li>Environ 40 Mo pour OpenBSD-cvs-x11
<li>Environ 65 Mo pour OpenBSD-cvs-xf4
<li>Environ 83 Mo pour OpenBSD-src
<li>Environ 36 Mo pour OpenBSD-src-x11
<li>Environ 4 Mo pour OpenBSD-ports
<li>Gardez &agrave; l'esprit qu'il s'agit de tailles compress&eacute;es.
    Comptez environ 5 fois ces valeurs pour les fichiers
    d&eacute;compress&eacute;s.
<li>La taille des deltas varie de 10k &agrave; 100k et parfois quelques
    Mo.
<li>CTM d&eacute;coupe les deltas en messages de 100k qui sont r&eacute;-
    assembl&eacute;s automatiquement.
<li>Si un delta est plus gros que 5MB, il n'est pas envoy&eacute; par
    courrier &eacute;l&eacute;ctronique. À la plce, vous recevrez des
    instructions sur comment le r&eacute;cup&egrave;rer par FTP. De
    larges mises &agrave; jour par CTM sont rares et ne se produisent
    que lorsqu'un composant majeur du syst&egrave;me est mis &agrave;
    jour, tel que binutils, Perl, XFree86, etc, ou lorsqu'un tag CVS est
    appliqu&eacute; au d&eacute;p&ocirc;t CVS.
</ul>

<h3><font color="#0000e0">Comment utiliser CTM ?</font></h3>

<ul>
<li>Inscrivez vous aux listes de diffusion CTM pour les s&eacute;ries
    que vous voulez.
<p>
   Il y a plusieurs listes de diffusion pour CTM. Il y a une liste pour
   les mises &agrave; jour des mises &agrave; jour de l'arborescence
   cvs, une liste pour l'arborescence des sources, deux pour X11
   (sources et cvs), une pour les ports et une pour les messages du
   g&eacute;n&eacute;rateur de delta ctm.
   <p>
   Les commandes suivantes vous inscrirons aux listes appropri&eacute;es
   :
<p>
Pour l'arborescence CVS (les modules CVSROOT, ports, src et www, mais
sans les modules X11 et XF4) :
<pre>
      echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org
</pre>
Pour le module X11 de l'arborescence CVS :
<pre>
      echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org
</pre>
Pour le module XF4 du d&eacute;p&ocirc;t CVS :
<pre>
      echo subscribe OpenBSD-cvs-xf4 | mail majordomo@OpenBSD.org       
</pre>
Pour une copie du module src :
<pre>
      echo subscribe-OpenBSD-src | mail majordomo@OpenBSD.org
</pre>
Pour une copie du module X11 :
<pre>
      echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org
</pre>
Pour une copie du module des ports :
<pre>
      echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org
</pre>
Pour les journaux CTM :
<pre>
      echo subscribe ctm-log | mail majordomo@OpenBSD.org
</pre>


<p>
<li>Installez le programme CTM depuis un package ou depuis les ports.
    Vous trouverez le port dans
<tt><b>/usr/ports/devel/ctm</b></tt>.

</ul>
<b>Remarque :</b> Les exemples ci-dessous ne couvrent que OpenBSD-cvs
   pour plus de clart&eacute;. Les autres sources sont &agrave;
   g&eacute;rer de la m&ecirc;me fa&ccedil;on.

<p><ul>

<li>R&eacute;cup&eacute;rez la s&eacute;rie de base depuis un site FTP.
    Vous le trouverez dans le sous r&eacute;pertoire <b>base/OpenBSD-
    cvs</b>. R&eacute;cup&eacute;rez tous les fichiers dans ce
    r&eacute;pertoire, et une fois que vous les avez tous, vous pouvez
    cr&eacute;er votre arborescence des sources avec les commandes
    suivantes en fonction du type de fichier que vous avez :

<pre>
       cat split/OpenBSD-cvs.1500A.gz.* &gt; OpenBSD-cvs.1500A.gz
       cd cible
       ctm -v -v -v .../OpenBSD-cvs.1500A.gz
</pre>
 <p>
ou

<pre>
       cat split/OpenBSD-cvs.1500.tar.gz.* &gt; OpenBSD-cvs.1500.tar.gz
       cd cible
       tar -xzvf .../OpenBSD-cvs.1500.tar.gz
</pre>

<p>
o&ugrave; <tt><b>split</b></tt> est le r&eacute;pertoire dans lequel
vous aurez plac&eacute; les fichiers t&eacute;l&eacute;charg&eacute;s et
<tt><b>cible</b></tt> est l'endroit choisit pour d&eacute;compresser les
sources.

<p>
Il n'est pas n&eacute;cessaire de garder ces fichiers, si vous
&ecirc;tes sur d'avoir une arborescence compl&egrave;te. Mais vous
pouvez garder les fichiers de base pour des besoins de sauvegarde.
Cependant, assurez vous de noter le num&eacute;ro de la base avant de
continuer.

<p>
<li>Maintenant, vous avez besoin de r&eacute;cup&eacute;rer les deltas
    qui ont &eacute;t&eacute; g&eacute;n&eacute;r&eacute;s depuis la
    cr&eacute;ation de la s&eacute;rie de base. Allez sur des sites FTP
    list&eacute;s &ccedil;i-dessous, dans le sous-r&eacute;pertoire 
    <tt><b>OpenBSD-cvs</b></tt> et r&eacute;cup&eacute;rez tous les
    fichiers dont le num&eacute;ro est <it>plus grand</it> que le
    num&eacute;ro de la base utilis&eacute;e. Ensuite appliquer ces
    deltas :

<pre>
       cd cible
       ctm -v -v -v deltas/OpenBSD-cvs.*
</pre>

<p>
o&ugrave; <tt><b>cible</b></tt> est le r&eacute;pertoire o&ugrave; se
trouvent vos sources, et <tt><b>deltas</b></tt> l'endroit o&ugrave; vous
avez plac&eacute; vos deltas.


<p>
<li>Attendez d'obtenir votre premier delta de la liste.
<p>
<li>D&eacute;compressez, assemblez et appliquez le delta CTM en
    utilisant <tt><b>ctm_rmail</b></tt>.
<p>

<pre>
       ctm_rmail -p /tmp -d deltas -b cible folder
</pre>

<p>
o&ugrave; <tt><b>folder</b></tt> est le r&eacute;pertoire de mails
contenant les messages de delta. Ceci va d&eacute;coder les deltas CTM
et les sauvegardera dans le r&eacute;pertoire <tt><b>deltas</b></tt>. Un
delta ser aun fichier de la forme <tt><b>OpenBSD-
cvs.<var>XXXX</var>.gz</b></tt>, o&ugrave; <var>XXXX</var> est le
num&eacute;ro du delta. Ensuite le delta sera apppliqu&eacute; dans
l'arbre local situ&eacute; dans <tt><b>target</b></tt>, l'endroit
o&ugrave; vous avez d&eacute;compress&eacute; le set de base.

<p>
R&eacute;petez cette op&eacute;ration &agrave; chaque fois que vous
recevez un delta de la liste. Si vous voulez, vous pouvez automatiser
cette t&acirc;che &agrave; l'aide de procmail, maildrop o&ugrave; tout
autre programme similaire de la <a href="ports.html">collection des
ports</a>.
</ul>

<p>
Voici la liste des serveurs FTP contenant les deltas CTM :

<ul>
<li>Le serveur FTP primaire est :
<p>
<a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/
</a>.
Ce serveur est automatiquement mis &agrave; jour par le processus de
g&eacute;n&eacute;ration des deltas. Les sets de base sont disponibles
en tant que gros fichiers dans le r&eacute;pertoire
<tt><b>base</b></tt>. Les fichiers &eacute;clat&eacute;s sont dans
<tt><b>base-split</b></tt>.
</ul>

<ul>
<li><a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
<p>
Ce serveur est mis &agrave; jour par les deltas CTM re&ccedil;us par la
liste de discussion. De plus, il poss&egrave;de les deltas de base dans
le sous-r&eacute;pertoire <tt><b>base</b></tt>, dupliqu&eacute; &agrave;
partir de
<a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/</a>.
</ul>

<ul>
<li><a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
<p>
est identique &agrave;
<p>
<li><a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
<p>
et est un miroir de
<a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.se.OpenBSD.org
</a>
.
</ul>

<p>
<b>REMARQUE</B> <a href="mailto:hgw@d1906.inka.de">Je suis</a>
   tr&egrave;s interess&eacute; pour trouver d'autres sites &agrave;
   travers le monde qui voudraient faire un miroir de ces deltas.
<p>

<h3><font color="#0000e0">Dois-je utiliser l'arborescence src ou
    cvs ? </font> </h3>

<p>
Cela d&eacute;pend de votre place disque entre autre. Étant donn&eacute;
que CTM n'agit pas sur des fichiers qui ont &eacute;t&eacute;
modifi&eacute; en dehors du processus ctm, le meilleur choix est sans
doute l'arborescence <a href="anoncvs.html">CVS</a>. De cette
fa&ccedil;on, vous pouvez r&eacute;cup&eacute;rer une arborescence src
depuis votre arborescence CVS, suivre une branche stable et conserver
vos modifications locales dans votre arborescence des sources. CVS est
assez "intelligent" pour int&eacute;grer vos changements locaux. Vous
pouvez aussi utiliser toutes les commandes CVS &agrave; l'exception des
commandes telles que <tt><b>cvs commit</b></tt> et <tt><b>cvs
tag</b></tt>.

<p>
Le d&eacute;savantage par contre, est la quantit&eacute; de place disque
que cela prend. Une arborescence des sources est d'environ 370Mo, mais
si vous avez une arborescence CVS, vous aurez besoin de 1Go pour celle-
ci, <b>en plus</b> des 370Mo pour les sources. Ceci ne compte pas les
100Mo pour les fichiers g&eacute;r&eacute;r&eacute;s lors d'une
compilation (cela d&eacute;pend de l'architecture).

<p>
Si vous venez juste d'obtenir l'arborescence des source, vous aurez
besoin de g&eacute;rer les modifications locales. Une mani&egrave;re de
faire ceci est d'utiliser le syst&egrave;me de fichiers <b>union</b>
(voir
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_union&amp;sektion=8">mount_union(8)</a>),
bien qu'il ait &eacute;t&eacute; rapport&eacute; que le syst&egrave;me
de fichiers <b>union</b> peut &ecirc;tre instable si les couches
inf&eacute;rieures et sup&eacute;rieures r&eacute;sident sur le
m&ecirc;me syst&egrave;me de fichiers physique. Si vous placez vos
couches sup&eacute;rieures et inf&eacute;rieures sur des syst&egrave;mes
de fichiers diff&eacute;rents vous ne devriez avoir aucun
probl&egrave;me. Un exemple :

<p>
Supposons que votre arborescence mise &agrave; jour de CTM se trouve
dans <tt><b>/usr/src-ctm</b></tt> et que votre v&eacute;ritable
arborescence des sources (&agrave; partir de laquelle vous faites vos
modifications et compilations) se trouve dans <tt><b>/usr/src</b></tt>.
<tt><b>/usr/src</b></tt> doit initialement &ecirc;tre un
r&eacute;pertoire vide. La commande suivante va configurer votre union
mount :

<pre>
       mount -t union -o -b /usr/src-ctm /usr/src
<pre>

<p>
Les modifications faites aux fichiers se trouvant dans
<tt><b>/usr/src</b></tt> deviendront un fichier contenu dans
<tt><b>/usr/src</b></tt>, masquant celui dans
<tt><b>src-ctm</b></tt>. Si des changements sont faits via CTM dans
l'arborescence <tt><b>src-ctm</b></tt> sous jacente, ces changements
ne seront <b>pas</b> vus s'il y a un fichier dans la couche
sup&eacute;rieure les masquant.

<p>
Vous devriez d&eacute;monter p&eacute;riodiquement l'union et chercher
les fichiers locaux au syst&egrave;me de fichiers union.
<pre>
    umount /usr/src
    find /usr/src -type f
<pre>
Les commandes <tt><b>ls -W</b></tt> et <tt><b>rm -W</b></tt> seront
utiles aussi, car les objets nomm&eacute;s "whiteouts" dans
<tt><b>/usr/src</b></tt> cacheront aussi des fichiers dans
<tt><b>src-ctm</b></tt>. 

<p>
Si vous avez l'arborescence CVS, vous pouvez utiliser la commande
<tt><b>cvs checkout</b></tt> pour en r&eacute;cup&eacute;rer une
arborescence des sources, et &agrave; chaque fois que vous mettez
&agrave; jour avec CTM, vous pouvez utiliser <tt><b>cvs update</b></tt>
pour mettre &agrave; jour votre arborescence des sources.
 
<p>
Pour obtenir votre arborescence src originelle :
<pre>
    cd /usr
    cvs -qd VOTRE_DEPOT_CVS checkout -P src
</pre>
<p>
apr&egrave;s chaque mise &agrave; jour CTM :
<pre>
    cd /usr/src
    cvs -q update -Pd
</pre>

<h3><font color="#0000e0">Est-ce que ctm est stable sous OpenBSD ?
    </font></h3>

CTM est utilis&eacute; depuis plus de cinq ans par OpenBSD, et par
FreeBSD depuis encore plus longtemps. CTM est stable et solide.

<h3><font color="#0000e0">Quel futur pour CTM ? </font></h3>

Il y a un certain nombre de changements et optimisations possibles
(bien que petits). Parmi ceux-ci :

<ul>
<li> CTM n'envoie jamais un delta de plus de 5Mo par email. Cela
     pourrait &ecirc;tre chang&eacute; de deux fa&ccedil;ons : la taille
     maximale des deltas pourrait &ecirc;tre chang&eacute;es, ou une
     file pourrait &ecirc;tre install&eacute;e, depuis laquelle, seuls
     un certain nombre de messages seraient envoy&eacute;s
     journali&egrave;rement. Par exemple, si un delta a une taille de
     6Mo, il est d&eacute;coup&eacute; en 96 emails. Le premier jour,
     les 50 premiers messages sont envoy&eacute;s, et le second jour,
     les 46 restants sont envoy&eacute;s, ainsi que les 4 messages du
     delta suivant.
<li> Le logiciel CTM pourrait &ecirc;tre r&eacute;&eacute;crit, ou au
     moins corrig&eacute;. Sa mise ne oeuvre en C n'est pas un exemple
     de bonne programmation. Ça serait de plus une bonne
     opportunit&eacute; pour ajouter de nouvelles fonctionnalit&eacute;s
     comme la signature des deltas CTM avec PGP.
</ul>

Envoyez <a href="mailto:hgw@d1906.inka.de">moi</a> un courrier
&eacute;lectronique pour me donner vos avis et souhaits&nbsp;!


<h3><font color="#0000e0">Plus d'informations</font></h3>

Si vous voulez en savoir plus sur CTM, un bon endroit pour
d&eacute;marrer est le manuel FreeBSD :

<ul>
<li> <a href="http://www.FreeBSD.org/handbook/ctm.html">
         http://www.FreeBSD.org/handbook/ctm.html
     </a>
</ul>

Il y a aussi des pages de manuel pour les utilitaires CTM.

<h3><font color="#0000e0">R&eacute;sum&eacute;&nbsp;: </font></h3>

<p>

<ul>
<li> Listes de discussion :

   <ul>
   <li> <tt>echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org</tt>
   <li> <tt>echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org</tt>
   <li> <tt>echo subscribe OpenBSD-cvs-xf4 | mail majordomo@OpenBSD.org</tt>
   <li> <tt>echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org</tt>
   <li> <tt>echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org</tt>
   <li> <tt>echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org</tt>
   <li> <tt>echo subscribe ctm-log | mail majordomo@OpenBSD.org</tt>
   </ul>

<li> FTP (pour la s&eacute;rie de base et les deltas)

   <ul>
   <li> <a href="ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/">
        ftp://openbsd.rug.ac.be:/pub/OpenBSD-ctm/</a>
   <li> <a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/">
         ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/</a>
   <li> <a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/">
        ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/</a>
   <li> <a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
         ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/</a>
   </ul>
</ul>

<p>
Les annonces et remarques importantes &agrave; propos de CTM seront
post&eacute;es sur la liste de diffusion announce@OpenBSD.org.

<p>

<h3><font color="#0000e0">Remerciements</font></h3>

<ul>
<li> Poul-Henning Kamp (phk@FreeBSD.org) pour avoir rendu CTM possible
     et avoir aid&eacute; dans le processus de g&eacute;n&eacute;ration
     de deltas.

<li> Theo de Raadt (deraadt@theos.com) pour avoir rendu OpenBSD possible
     et avoir donn&eacute; les ressources n&eacute;cessaires pour
     cr&eacute;er les premiers deltas ctm sur cvs.OpenBSD.org
     (maintenant ils sont g&eacute;n&eacute;r&eacute;s ailleurs) et pour
     la magie du serveur de noms.

<li> Todd C. Miller (millert@OpenBSD.org) pour la mise en place et
     l'entretien des listes de discussion CTM.

<li> Bob Beck (beck@OpenBSD.org), Artur Grabowski (art@OpenBSD.org),
     Magnus Holmberg (mho@OpenBSD.org) et Wolfram Schneider
     (wosch@FreeBSD.org) pour la mise en place de l'espace ftp pour les
     s&eacute;ries de base et les deltas sur ctm.*OpenBSD.org

<li>  Thomas Graichen (graichen@OpenBSD.org) pour avoir commenc&eacute;
      CTM pour OpenBSD et l'avoir maintenu pendant des ann&eacute;es

<li> Wim Vandeputte (wvdputte@OpenBSD.org) pour l'h&eacute;bergement de
     CTM

<li> ... et tous les autres qui ont contribu&eacute; indirectement
</ul>

<p>
Le logo OpenBSD/CTM a &eacute;t&eacute; dessin&eacute; pour le projet
OpenBSD par <a href="mailto:flipk@openbsd.org">Phillip F Knaack</a>.
<p>
<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"
 /></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
<!--
Originally [OpenBSD: ctm.html,v 1.26 ]<br>
$Translation: ctm.html,v 1.21 2005/01/17 21:29:45 aanriot Exp $<br>
-->
$OpenBSD: ctm.html,v 1.17 2005/01/18 09:53:24 jufi Exp $
</small>

</body>
</html>
