<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
   <TITLE>CTM</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<center>
<img alt="CTM for OpenBSD" src="../images/bsdctm.gif" width=401 height=126>
</center>

<H3>Qu' est ce que CTM?</H3>

<P>
Ctm est est un syt&eacute;me mis au point par Poul-Henning Kamp.
Le but est de permettre la mise &aacute; jour de sources par m&eacute;l.
C'est  un bon moyen de se tenir a jour des &eacute;volutions du syst&eacute;me,
en particulier si vous avez une mauvaise connection &aacute; internet.
(Connection par modem par exemple).

<P>
Ctm est tr&eacute;s peut gourmand en bande passante, et compresse
l' arborescence des sources avec gzip -9.

<H3>Comment cela fonctionne?</H3>

<P>
Vous devez vous abonnez a une mailing list pour un projet donn&eacute;.
Chaque jour vous recevrez par m&eacute;l un message contenant tous les changements
survenus sur ce projet.
un ensemble de changements est appel&eacute; un <b>&quot;delta&quot;.</b>

<P>
Vous d&eacute;butez avec une arborescence , qui sera plus tard patch&eacute;
avec les deltas.
Pour commencer vous devez donc r&eacute;cup&eacute;rer la derni&eacute;re arborescence
et tous les deltas qui l'ont suivi.
L'arborescence de base est d&eacute;coup&eacute; en bloques de 1400k
La taille des bloques vous permettra de les archiver sur disquette.

<P>
Une arborescence est g&eacute;n&eacute;r&eacute; a peut pr&eacute;s tout les 100 deltas.
Vous n' avez donc jamais a rappatrier plus de 100 deltas pour mettre a jour votre arborescence.

<H3>Combien de bande passante les Ctm utilisent ils?</H3>

<P>

Comme dis plus haut l'arborescence de base contiens toute les sources au format tar.
Vous devez les r&eacute;cuperer par ftp, ainsi que tous les deltas qui y sont associ&eacute;s.
Vous pouvez les r&eacute;cuperer sur les sites qui sont list&eacute;s ci-dessous.
Les tailles sont:

<ul>
<li> approximativement 115Mb pour OpenBSD-cvs
<li> approximativement 37Mb pour OpenBSD-cvs-x11
<li> approximativement 65Mb pour OpenBSD-src
<li> approximativement 35Mb pour OpenBSD-src-x11
<li> approximativement 2Mb pour OpenBSD-ports
<li> Il s agit de sources compress&eacute;s.vous devez multipliez par cinq 
	les tailles pour obtenir la taille d&eacute;compress&eacute;s.
<li> les deltas relatif a chaque arborescences varient entre 10k et 100k.
	quelquefois ils peuvent atteidre quelque Mb
<li> ctm d&eacute;coupe les deltas en bloques de 100k qui sont r&eacute;assembl&eacute;s automatiquement.

</ul>

<P>

Il arrive quelquefois que des mises a jour de ctm soient plus larges.
G&eacute;n&eacute;ralement apr&eacute;s des mises a jour majeurs.
Cela est assez rare.

<H3>Comment dois-je utiliser ctm?</H3>

<UL>
<LI>Abonnez vous a la mailing list associez a l arborescence que vous d&eacute;sirez.
<p>
   Il y a plusieur mailing list assoc&eacute;s aux ctm.
   Il y a une liste pour les mises &aacute; jour, une liste pour l arborescence des sources,
   une liste concerant X11 et une liste pour les ports.
   Il y &eacute;galement une liste permettant de voir les logs g&eacute;n&eacute;r&eacute;s par les
   changements.

   <p>
   Les commandes suivantes vous permettront de vous abonnez &aacute; la mailing list appropri&eacute;e:	
<br><br><tt>
Pour l'arborescence des cvs (sans la partie concernant X11):<br>
    <b>echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org</b><br>
Pour la partie concernant X11 de l'arborescence cvs:<br>
    <b>echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org</b><br>
Pour l' arborescence des sources(sans la partie concernant X11):<br>
    <b>echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org</b><br>
Pour la partie concernant X11 de l arborescence:<br>
    <b>echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org</b><br>
Pour l'arborecences des ports:<br>
    <b>echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org</b><br>
Pour l' arborescence des logs ctm:<br>
    <b>echo subscribe ctm-log | mail majordomo@OpenBSD.org</b><br>
</tt><br>

<LI>Patientez jusqu' &aacute; ce que vous receviez votre premier delta.

<LI>D&eacute;compressez et assemblez les ctm deltas en utilisant ctm_rmail.
<br>
<br>
<tt>
    <b>ctm_rmail -p. -d. -b. r&eacute;pertoire</b>
</tt>
<br><br>
o&uacute; <b>r&eacute;pertoire</b> est le  r&eacute;pertoire de mail contenant  les deltas
<br>
Cela va d&eacute;coder les deltas et les placer dans vos r&eacute;pertoire de travail.
Les deltas sont de la forme  OpenBSD-XXX.YYYY.gz, ou XXX est sois  "src" ou  "cvs",
et  YYYY est le num&eacute;ro du delta.

<p>

<li>R&eacute;cuperer l arborescence de base sur le site ftp.Ils sont situ&eacute;s dans 
le sous r&eacute;pertoire
<b>base/OpenBSD-cvs</b> (pour OpenBSD-cvs) ou <b>base/OpenBSD-src</b>
(pour OpenBSD-src).  R&eacute;cuperer tous les fichiers dans ces r&eacute;pertoire, et une 
fois que vous les avez vous pouvez creer l arborescence de base des sources
avec les commandes:

<br><br>
<tt>
    <b>cd target <br>
    cat /split/OpenBSD-* | tar zxf - <br>
</b></tt><br>

ou <b>split</b>  est le r&eacute;pertoire dans lequel vous avez placez les fichiers que vous avez r&eacute;cup&eacute;r&eacute;.

<p>
Vous n' avez pas besoin de conserver ces fichiers une fois que vous avez reconstituez l' arborescence compl&eacute;te.Toutefois notez le numero de l' arborescence de base avant d'aller plus loin.
<p>
Vous devez r&eacute;cuperer les deltas qui ont &eacute;t&eacute; g&eacute;n&eacute;r&eacute;s depuis
la cr&eacute;ation de cette arborescence de base.
Allez  sur le site ftp cit&eacute; plus bas dans le sous r&eacute;pertoire
<b>OpenBSD-cvs</b> ou <b>OpenBSD-src</b> pour recuperer tous les fichiers dont le num&eacute;ro
est plus  <it>large</it>  que les num&eacute;ros de l arborescence de base que vous utilisez.

<p>
Les addresses pour les bases et deltas sont:

<ul>
<li><a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
</ul>

<ul>
<li><a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
</ul>

<ul>
<li><a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/">
     ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm/
</a>
</ul>

<p>
<ul>
<li><b>NOTE:</b> Je suis tr&eacute;s int&eacute;rress&eacute; par d autres sites qui pourraient 
mirror&eacute;s ces deltas.
</ul>
<p>

<LI> Lancer ctm.
<br>
  <br>
  <tt>
     <b>cd target<br>
     ctm -v -v /deltas/OpenBSD-cvs.*</b><br></tt>
ou<br><tt>
ou  <b>target</b>  est le r&eacute;pertoire ou vous voulez que votre arborescence cvs se trouve,
et <b>deltas</b> est le r&eacute;pertoire ou vous voulez que vos deltas soient sauvegard&eacute;s.
<p>
</ul>

<h3>dois-je choisir les sources ou l' arborescence cvs?</h3>

<P>
Cela d&eacute;pend de votre espace disque et d'autres facteurs.
Si on consid&eacute;re que ctm ne prend pas en compte les fichiers qui ont &eacute;t&eacute; modifi&eacute;s
en dehors du processus ctm, le &quot;meilleur&quot; choix est probablement l' arborescence cvs.
Vous pouvez ensuite comparez votre arborescence de sources avec  votre arborescence cvs  et conserver vos modifications locales dans votre arborescences de sources,laissant ainsi uniquement ctm modifier votre  arborescence cvs.

<p>
Le d&eacute;savantage est l' espace disque utilis&eacute;.
Une arborescence de sources prend &aacute; peut pre&eacute;s 300Mb, mais si vous avez votre 
propre arborescence cvs vous aurez besoin de 400Mb ce a quoi il faut ajouter 300Mb pour 
votre arborescence de sources.

<p>
Cela ne prend pas en compte les 100Mb dont vous aurez besoin pour construire ces arborescences

<p>
Si vous r&eacute;cup&eacute;rez uniquement l' arborescence des sources vous devrez g&eacute;rer vous m&ecirc;me
vos modifications locales.
Une solution pour palier &aacute; ce probl&eacute;me serais d' utiliser les <b>unions</b> du syst&eacute;me de fichier.
Un exemple d'utilisation pourrais &ecirc;tre comme suis:
<p>
supposez que votre arborescence de mise a jour ctm se trouve dans le r&eacute;pertoire
<b>/usr/src-ctm</b>, et que votre arborescence de sources ,celle dans laquelle vous avez effectu&eacute;
vos modifications se trouve dans le r&eacute;pertoire <b>/usr/src</b>.
<b>/usr/src</b> devrais &ecirc;tre initialement un r&eacute;pertoire vide.
Les commandes suivantes vont mettre en place votre syst&eacute;me d' unions:
<br><br>
<tt>
    <b>mount -t union -o -b /usr/src-ctm /usr/src</b>
</tt>
<br><br>
Les modifications effectu&eacute;s sur les fichiers se trouvant dans le r&eacute;pertoire /usr/src seront &eacute;galement
visiblent dans le r&eacute;pertoire /usr/src-ctm.
Si des changements sont &eacute;ffectu&eacute;s par ctm dans le r&eacute;pertoire src-ctm, ces changements
ne <b>seront</b> pas visiblent dans le r&eacute;pertoire src, si il y a d&eacute;ja un fichier pr&eacute;sent.

<p>
Vous devriez r&eacute;guli&eacute;rement d&eacute;monter (umount) les unions et chercher les fichiers qui sont locales
au syst&eacute;me d'union.
<br><br>
<tt>
    <b>umount /usr/src <br>
    find /usr/src -type f</b> <br>
</tt>
<br><br>
Les commandes <b>ls -W </b> et <b>rm -W</b> seront &eacute;galements utiles.
En effet des fichiers pr&eacute;sents dans /usr/src peuvent masquer de nouveaux fichiers import&eacute;s par ctm.

<p>
Si vous r&eacute;cup&eacute;rez une arborescence cvs vous pouvez &eacute;galement utiliser le &quot;cvs checkout&quot;
pour v&eacute;rifier votre arborescence de sources.
A chaque mise a jour  de votre arborescence ctm vous pouvez utiliser la commande &quot;cvs update&quot; pour mettre
a jour votre arborescence de sources.

<br><br>
Pour avoir une arborescence de source de d&eacute;part:<br>
<tt>
    <b>cd /usr <br>
    cvs -qd YOUR_CVS_TREE checkout src</b> <br><br>
</tt>
et apr&eacute;s chaque mise a jour ctm:<br>
<tt>
    <b>cd /usr/src <br>
    cvs -q update -PAd</b> <br>
</tt>

<H3>Les ctm sous OpenBSD sont ils stablent?</H3>

Les Ctm sont utilis&eacute;s depuis quelques ann&eacute;es sous OpenBSD et FreeBSD.
Ils sont stablent et surs.

<H3>Plus d' informations</H3>

Si vous avez des probl&eacute;mes avec les ctm , cette url peut vous &ecirc;tre utile
(Il s' agit du FreeBSD handbook):
<ul>
<li> <a href="http://www.FreeBSD.org/handbook/ctm.html">
         http://www.FreeBSD.org/handbook/ctm.html
     </a>
</ul>

Il y a &eacute;galement des manuels (man(1)) disponibles pour les ctm.
Ces manuels sont inclus dans les sources de ctm.
Si vous avez un syst&eacute;me OpenBSD vous devez d&eacute;ja avoir les man et binaires de ctm install&eacute;s.
Si ce n'est pas le cas vous pouvez les obtenir sur le m&ecirc;me ftp que celui ou se trouve les deltas
cit&eacute; plus bas.

<p>
Vous pouvez &eacute;galement contacter une des mailing list d' OpenBSD ou moi m&ecirc;me si vous rencontrez
des difficult&eacute;s avec ctm.
Toutefois mon temps libre est assez tend a &ecirc;tre assez limit&eacute;.

<p>
R&eacute;sum&eacute;:

<p>

<ul>
<li> Mailing lists:

   <ul>
   <li> <b>echo subscribe OpenBSD-cvs | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-cvs-x11 | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-src | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-src-x11 | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe OpenBSD-ports-ctm | mail majordomo@OpenBSD.org</b>
   <li> <b>echo subscribe ctm-log | mail majordomo@OpenBSD.org</b>
   </ul>

<li> FTP (pour base et les deltas relatifs; OpenBSD poss&eacute;de les  ctm dans son arborescence de sources , 
	mais si vous n' avez ni les sources ni les binaires les sources sont &eacute;galement sur le ftp):

   <ul>
   <li> <a href="ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm">
         ftp://ctm.OpenBSD.org:/pub/OpenBSD-ctm
	   </a>
   <li> <a href="ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm">
         ftp://ctm.ca.OpenBSD.org:/pub/OpenBSD-ctm
	   </a>
   <li> <a href="ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm">
         ftp://ctm.se.OpenBSD.org:/pub/OpenBSD-ctm
	   </a>
   </ul>
</ul>

<p>
Je ferais toute les remarques importantes et annonces dans:
<ul>
<li> misc@OpenBSD.org
<li> announce@OpenBSD.org
</ul>

<p>
<b>NOTE:</b> Si vous utilisez les ctm pour OpenBSD envoyez moi un mail,cela me permettra de savoir combien
de personnes utilisent les ctm.

<H3>Remerciements:</H3>

<li> Poul-Henning Kamp (phk@FreeBSD.org) pour avoir permis la r&eacute;alisation des ctm et m'avoir aid&eacute; a faire marcher la g&eacute;n&eacute;ration des deltas.

<li> Theo de Raadt (deraadt@theos.com) pour avoir permis la r&eacute;alisation du projet OpenBSD et m'avoir offert les
	ressources dont j'avais besoin pour cr&eacute;er les deltas de ctm sur cvs.OpenBSD.org (maintenant ils sont g&eacute;ner&eacute;s ailleurs).
<li> Todd C. Miller (millert@OpenBSD.org) pour avoir mis en place et maintenir la mailing-lists ctm.

<li> Bob Beck (beck@OpenBSD.org), Artur Grabowski (art@OpenBSD.org),
     Magnus Holmberg (mho@OpenBSD.org) et
     Wolfram Schneider (wosch@FreeBSD.org) pour avoir mis en place un espace ftp permettant d'heberger les bases et deltas
	sur ctm.OpenBSD.org
<li> ... et tous ceux qui ont contribu&eacute;s indirectement...
</ul>

<P>
Good luck!

<P>
t

<HR>

<ADDRESS><A HREF="mailto:graichen@OpenBSD.org">Thomas Graichen</A></ADDRESS>
<br>
OpenBSD/CTM logo designed pour the OpenBSD Project by 
   <a href="mailto:flipk@openbsd.org">Phillip F Knaack</a>.
<size=-1>(c)Open.BSDFR.org [traduction]</size>
<P>
<br><small>
Originally [OpenBSD: ctm.html,v 1.11 ]
<br>
$Translation: ctm.html,v 1.3 2000/05/15 05:08:35 wim Exp $
<br>
$OpenBSD: ctm.html,v 1.1 2000/06/11 16:20:13 wvdputte Exp $</small>


</BODY>
</HTML>
