<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Buts du projet OpenBSD</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="the OpenBSD project goals page">
<meta name="keywords" content="openbsd,goals">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2002 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Buts du projet</font><hr></h2>

<p> &Eacute;videmment, chaque d&eacute;veloppeur travaillant sur OpenBSD a ses 
  buts et priorit&eacute;s propres, mais il est possible de classer les buts que 
  nous partageons : 
<p>

<ul>
  <li>Fournir la meilleure plate-forme de d&eacute;veloppement possible. <a
href="anoncvs.html">Donner acc&egrave;s &agrave; la totalit&eacute; du code source 
    aux d&eacute;veloppeurs et utilisateurs, y compris la possibilit&eacute; de 
    consulter directement les changements dans l'arborescence CVS</a>. Les utilisateurs 
    peuvent m&ecirc;me consulter les sources et les changements <a href="http://www.openbsd.org/cgi-bin/cvsweb">directement 
    sur le web !</a> 
    <p> 
<li>Int&eacute;grer du code &eacute;crit correctement venant de n'importe quelle
source avec un copyright <a href="../policy.html">acceptable (Licence
BSD pr&eacute;f&eacute;r&eacute;e, GPL accept&eacute;e, mais pas de NDA)</a>. Nous voulons fournir
le code source &agrave; tous pour N'IMPORTE QUEL USAGE, sans restrictions.
<strong>Nous nous effor&ccedil;ons de rendre nos logiciels robustes et s&ucirc;rs,
et encourageons les soci&eacute;t&eacute;s &agrave; en utiliser n'importe quelle
partie.</strong> Il existe plusieurs <a href="../products.html">produits commerciaux d&eacute;riv&eacute;s</a> d'OpenBSD.<p>
<li>Prendre garde aux <a href="../security.html">probl&egrave;mes de s&eacute;curit&eacute;
et les corriger avant n'importe qui d'autre</a> (essayer d'&ecirc;tre le
syst&egrave;me d'exploitation le plus s&ucirc;r).<p> 
<li><a href="crypto.html">Une plus grande int&eacute;gration des logiciels
cryptographiques</a>. Cela comprend IPsec, IPv6, des syst&egrave;mes de
gestion de cl&eacute;s, Kerberos, un AFS libre, et toute autre forme de
cryptographie forte ou de syst&egrave;me utilisant la cryptographie. OpenBSD
est d&eacute;velopp&eacute; et export&eacute; depuis le Canada et gr&acirc;ce aux lois
Canadiennes, il est tout &agrave; fait l&eacute;gal d'exporter de la cryptographie
dans le reste du monde (Comme le montre <a
href="http://www.efc.ca/pages/doc/crypto-export.html">les
recherches</a> faites par un Canadien ainsi que la documentation de <a
href="http://axion.physics.ubc.ca/ECL.html">la liste de contr&ocirc;le des
exportations du Canada</a>).  Certains d&eacute;veloppeurs OpenBSD sont
pr&eacute;sents dans la recherche et le d&eacute;veloppement d'IPsec.<p> 
<li>Suivre et mettre en oeuvre les normes (ANSI, POSIX, certaines
parties de X/Open, etc...)<p> 
<li>Rendre le code source ind&eacute;pendant de l'architecture. <a
href="plat.html">Supporter le plus de plates-formes possibles</a><p> 
<li>Être ind&eacute;pendant de tout choix politique, dans la mesure du
possible; les solutions doivent &ecirc;tre choisies d'un point de vue technique.<p> 
<li>Ne pas laisser de probl&egrave;mes importants en suspens.<p>
<li>Fournir une bonne plate-forme de d&eacute;veloppement/compilation
crois&eacute;s.<p> 
<li>Importer des logiciels externes avec un minimum de modifications,
rendant ainsi la mise &agrave; jour plus simple. Ceci inclut le renvoi des
modifications effectu&eacute;es aux auteurs du logiciel.<p>
<li>Sortir un CDROM environ tous les six mois, en particulier pour financer le
projet...<p> 
</ul>

<a name="funding"></a>
<h2><font color="#e00000">Financement du projet</font></h2>

Naturellement, le projet OpenBSD a besoin de fonds pour pouvoir
exister, du au co&ucirc;t des lignes Internet et des mises &agrave; jour du
mat&eacute;riel que tout le monde conna&icirc;t. Pour cette raison, le projet vend
des CDROM pour toutes les versions r&eacute;centes. Le projet vend aussi des
T-shirts pour se financer. Donc, quand vous achetez un CD ou un
T-shirt (lors d'une conf&eacute;rence ou par notre syst&egrave;me de commande de <a
href="../orders.html">CD/T-Shirts</a>), vous augmentez les chances
d'existence des futures versions d'OpenBSD.

<p>
Il est aussi possible de donner de l'argent ou <a
href="want.html">du mat&eacute;riel</a>, auquel cas, votre nom sera
inscrit sur la page <a href="donations.html">des dons</a>.  Pour plus
d'informations, veuillez contacter <a
href="mailto:deraadt@openbsd.org">Theo de Raadt</a> ou envoyer un
ch&egrave;que de dons en dollars Canadiens ou US &agrave; :<p>

OpenBSD<br>
812 23rd Ave SE<br>
Calgary, Alberta<br>
Canada<br>
T2G 1N8<br>
(Le ch&egrave;que doit &ecirc;tre &eacute;tabli &agrave; l'ordre de «Theo de Raadt», les ch&egrave;ques
&agrave; l'ordre d'OpenBSD ne peuvent &ecirc;tre encaiss&eacute;s.)<br>

<p>
De plus, il est maintenant possible d'effectuer des dons financiers au projet en
ligne par 
<a href="https://https.openbsd.org/cgi-bin/order">carte de cr&eacute;dit</a> ou
<a href="https://secure.paypal.com/xclick/business=paypal%40openbsd.org&item_name=OpenBSD+Donation&no_shipping=1">PayPal</a>.
<p> Alors que les dons ne sont pas d&eacute;taxables au niveau des douanes US 
  (en tant qu'oeuvre de charit&eacute;), ils peuvent &ecirc;tre d&eacute;duits 
  en tant que d&eacute;pense op&eacute;rationnelle, et si quelqu'un en a la possibilit&eacute;, 
  il devrait demander &agrave; son comptable pour de plus amples informations. 
  La m&ecirc;me chose s'applique aux autres pays, et les soci&eacute;t&eacute;s 
  devraient pouvoir d&eacute;duire les dons sous les termes de "Bonne Volont&eacute;". 
<p>
Au d&eacute;but, Theo de Raadt a d&eacute;pens&eacute; plus de 30000 $CAN pour d&eacute;marrer
OpenBSD, principalement &agrave; cause du co&ucirc;t &eacute;lev&eacute; des connexions r&eacute;seaux
au Canada (&agrave; cause de la politique am&eacute;ricaine sur l'exportation de la
cryptographie, il ne fut pas possible de d&eacute;placer le projet aux
&Eacute;tats-Unis). Depuis, aucune soci&eacute;t&eacute; ou organisation &eacute;ducative n'a propos&eacute;
un financement ou un partage des charges s&eacute;rieux.
Theo travaille &agrave; temps plein &agrave; l'am&eacute;lioration d'OpenBSD, et la plupart
des fonds du projets sont d&eacute;pens&eacute;s pour acheter aux d&eacute;veloppeurs de
nouveaux mat&eacute;riels pour qu'ils puissent continuer &agrave; am&eacute;liorer OpenBSD
(par exemple, plus de 20 nouveaux types de cartes Ethernet sont sortis
depuis les d&eacute;buts d'OpenBSD).  Donc, des financements sont n&eacute;cessaires
constamment. Les dons venant de notre base d'utilisateurs sont ce qui
permettra &agrave; OpenBSD de continuer d'exister.
<hr>

<h2><font color="#e00000">O&ugrave; vivent nos d&eacute;veloppeurs ?</font></h2>

Cette carte indique approximativement o&ugrave; nos d&eacute;veloppeurs vivent. Nous essaierons de la mettre &agrave; jour de temps &agrave; autre mais ne comptez pas trop dessus.

<p>
<center>
<img src="../images/map.jpg" height="508" width="950" alt= "Carte du monde">
</center>


<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: goals.html,v 1.61 ]<br>
$Translation: goals.html,v 1.28 2003/04/24 09:16:28 saad Exp $<br>
$OpenBSD: goals.html,v 1.15 2003/04/24 19:39:21 jufi Exp $
</small>

</body>
</html>
