<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Page dédiée aux PCs portables OpenBSD/i386 </title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="OpenBSD laptop">
<meta name="keywords" content="openbsd,main">
<meta name="distribution" content="global">
<meta ="copyright" content="This document copyright 1997-2002 by OpenBSD.">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141"
src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Etat du support des PCs portables i386</font></h2>
<hr>

<p>
Voici une liste d'ordinateurs portables fonctionnant sous OpenBSD 2.9.

<p>
Si le v&ocirc;tre n'y apparait pas, cela ne signifie pas qu'il ne
fonctionnera pas et vous devriez trouver dans la liste un mod&egrave;le
similaire. Depuis la version 2.6, la plupart des portables supportent
bien OpenBSD. Ne subsistent que quelques probl&egrave;mes mineurs. Les
versions plus r&eacute;centes d'OpenBSD n'ont fait qu'am&eacute;liorer
les choses.

<p>
Concernant les probl&egrave;mes encore rencontr&eacute;s :
<ul>
<li>Quelques portables supportent mal l'APM (NdT : &eacute;conomie
    d'&eacute;nergie) : la commande <strong>apm -S</strong>
    &eacute;choue mais ce n'est pas un probl&egrave;me majeur.
<li>D'autres perdent le support du son.
<li>Il reste quelques bogues en mati&egrave;re de support PCMCIA et
    CardBus sur un petit nombre d'appareils.
<li>Certains &eacute;crans ont du mal avec XFree86. Parfois la vesion
    4.x de XFree86 r&eacute;soud ou am&eacute;liore cela.
<li>Quelques p&eacute;riph&eacute;riques int&eacute;gr&eacute;s (NdT :
    built-in) ne fonctionnent pas.
<li>Certains portables enfin rencontrent des probl&egrave;mes avec les
    interruptions d'&eacute;jection de cartes PCMCIA.
</ul>

<p>
Si vous poss&eacute;dez un portable fonctionnant (ou non) sous OpenBSD
et non list&eacute; ci-dessous, vous pouvez nous contacter à cette
adresse <a href="mailto:www@openbsd.org">www@openbsd.org</a> pour que
nous l'y ajoutions. Essayez de fournir le plus d'informations possibles
sur votre configuration.

<p>
Les probl&egrave;mes rencontr&eacute;s avec l'APM peuvent faire l'objet
de rapports &agrave; adresser aux d&eacute;veloppeurs concern&eacute;s :
<a href="mailto:mickey@openbsd.org">Michael Shalayeff</a> et <a
href="mailto:weingart@openbsd.org">Tobias Weingartner</a>.

<p>
<table border=1>
<tr>
        <th>Mod&egrave;le</th>
        <th>Notes</th>
</tr>
<tr>
    <td>
        Acer TravelMate 345
    </td><td>
        L'APM fonctionne depuis la version 2.7-CURRENT.<p>
        XFree86 aussi (800x600 16bpp).<p>
        ... ainsi que le son.<p>
        Le modem Lucent ne fonctionne pas.<p>
        Personne &agrave; contacter : <a href="mailto:kevlo@openbsd.org">Kevin Lo</a>.
    </td>
</tr>
<tr>
        <td>
                Acer Travelmate 524TEV
        </td>
        <td>
        <p>L'APM est enti&egrave;rement support&eacute; (tant en mode console que sous X)
        <p>La carte PCMCIA (ne0) fonctionne.
        <p>La carte r&eacute;seau interne Intel Ethernet Express Pro 10/100 aussi.
        <p>XFree86 fonctionne en mode 1024x768 en 16bpp avec la carte ATI Rage Mobility AGP.
        <p>Le son et le winmodem ne fonctionnent pas.
        <p>Personne &agrave; contacter : Matthias Schmidt &lt;xhr@gmx.net&gt;
        </td>
</tr>

<tr>
        <td>
                Asus L8400<p>
        </td>
        <td>
        L'APM est enti&egrave;rement support&eacute; (tant en mode console que sous X).<br>
        La carte r&eacute;seau interne Realtek 8139 10/100 fonctionne tout comme 
        la carte graphique S3 Savage MX-MV sous XFree86 4.1.0.
        <p>
        La carte Son fonctionne (ESS ES1989) mais pas le winmodem.
        <p>
        Le reste (PCMCIA, Infrarouge, USB) n'a pas &eacute;t&eacute; test&eacute;.
        <p>
        Personne &agrave; contacter : <a href="mailto:jufi@openbsd.org">Jan-Uwe Finck</a>.
</tr>

<tr>
    <td>
        Compaq Armada M700<p>
    </td><td>
        L'APM fonctionne sauf sous X. La mise en veille doit se faire depuis la console.
        CardBus fonctionne.<p>
        La carte r&eacute;seau interne Ethernet 10/100 (pour ceux qui en ont une) fonctionne merveilleusement bien avec le pilote <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fxp&amp;sektion=4">fxp(4)</a>. <p>

        Pas de son support&eacute; pour le moment mais on y travaille.<p>
  
        Le modem interne (winmodem) ne fonctionne pas.
        Il existe un pilote binaire pour Linux. Il y a aussi le projet 
        <a href="http://linmodems.org">linmodem</a> qui essaie de fournir un pilote winmodem en OpenSource.<p>
        Un fichier de configuration XF86Config est disponible <a href="../xf86configs/armadam700">ici</a>.<p>
        Personne &agrave; contacter : <a href="mailto:nate@openbsd.org">Nathan Binkert</a>.
    </td>
</tr>
<tr>
    <td>
        Dell Inspiron 3200 D233XT (Version du Bios : A10)
    </td><td>
        L'APM fonctionne parfaitement.<p>
        La mise en veille ne fonctionne pas sous X (le serveur X ne
        restaure pas l'affichage apr&egrave;s la reprise) mais la mise
        en veille de l'&eacute;cran par DPMS fonctionne (l'&eacute;cran
        est &eacute;teint apr&egrave;s un d&eacute;lai
        d'inactivit&eacute; de la machine). Les param&egrave;tres du
        BIOS interf&egrave;rent avec le serveur X et devraient
        &ecirc;tre d&eacute;sactiv&eacute;s.<p> La mise en veille sur
        disque requiert une partition DOS (FAT16) nomm&eacute;e
        "SAVE2DSK.BIN". Ce fichier est cr&eacute;&eacute; &agrave;
        l'aide des utilitaires Dell pour Windows 98 (pr&eacute;sents en
        sortie d'usine) et sa taille doit &ecirc;tre &eacute;gale
        &agrave; celle de la RAM plus 2 ou 3 Mo. Une partition DOS ad
        hoc est requise (ce doit &ecirc;tre la premi&egrave;re partition
        du disque).<p> Le PCMCIA fonctionne exception faite de
        l'insertion et de l'&eacute;jection &agrave; chaud de
        p&eacute;riph&eacute;riques (gel de la machine
        n&eacute;cessitant son red&eacute;marrage).<p> L'USB ne
        fonctionne pas : s'il est activ&eacute;, le noyau g&egrave;le au
        d&eacute;marrage lors de la d&eacute;tection du
        contr&ocirc;leur.<p>

        Personne &agrave; contacter : <a
        href="mailto:b1000@softhome.net">Dan Carlsson</a>.

    </td>
</tr>
<tr>
    <td>
        Dell Latitude CPt<p>
    </td><td>
        Les commandes apm -z et -S fonctionnent.<p>
        Le son fonctionne.<p>
        XFree86 version 3 fonctionne en 1024x768x24bpp. Le rendu est
        meilleur en 16bpp avec XF4.<p>

        Les emplacements (NdT: slots) PCMCIA fonctionnent.<p>

        L'USB est d&eacute;tect&eacute; mais non test&eacute;. Il semble
        que cela ne fonctionne plus apr&egrave;s une mise en veille.<p>

        Un fichier de configuration pour XF4 est disponible <a
        href="../xf86configs/latitudecpt">ici</a>.<p>

        Personne &agrave; contacter : <a
        href="mailto:op21@squish.org">Paul Wang</a>.

    </td>
</tr>
<tr>
    <td>
        Dell Lattitude LMP-133ST
    </td><td>
        Le noyau g&eacute;n&eacute;rique fonctionne. L'APM aussi dans la
        plupart des cas. XFree86 version 3 fonctionne bien (uniquement
        en 8 bits). XF4.0 fonctionne malgr&eacute; quelques
        probl&egrave;mes : une bande de pixels est d&eacute;cal&eacute;e
        vers le bas et il y a des probl&egrave;mes de lecture lors de
        l'utilisation des consoles virtuelles (probl&egrave;me
        apparemment r&eacute;solu par la version courante d'XF4 mais non
        test&eacute; sur cette machine).
        <p>
        Un fichier de configuration pour XF4 est disponible 
        <a href="../xf86configs/latitudelmp">ici</a> et un pour XFree86 R3
        <a href="../xf86configs/latitudelmp-xf3">ici</a>.
        <p>
        Personne &agrave; contacter : Ian Darwin.
        </td>
</tr>
<tr>
    <td>
        Digital HiNote VP735
    </td><td>
        L'APM fonctionne.<p>
        Tout fonctionne sur cette machine.<p>
        Un fichier de configuration utilisable avec XFree86 3.3.X 
        est disponible <a href="../xf86configs/hinotevp700">ici</a>.
        <p>
        Personne &agrave; contacter : <a
        href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</tr><tr>
    <td>
        Fujitsu Lifebook C325
    </td><td>
        L'APM fonctionne.<p>

        Le son fonctionne quand l'&eacute;mulation SB est activ&eacute;e
        dans le BIOS. Tout le reste fonctionne sur cette machine.<p>
        Personne &agrave; contacter : <a
        href="mailto:tom@knienieder.com">Tom Knienieder</a>.

    </td>
</tr><tr>
    <td>
        Fujitsu Stylistic 500
    </td><td>
        L'APM fonctionne.<p>
        Le port série ne fonctionne pas.<p>
        Quelques param&eacute;trages subtiles sont n&eacute;ssaires pour
        les petites m&eacute;moires (4Mb).<p> X 'works' (thrashes like
        crazy). <p> Personne &agrave; contacter : <a
        href="mailto:d@openbsd.org">David Leonard</a>.
    </td>
</tr>
<tr>
    <td>
        IBM Thinkpad 701C
    </td><td>
        Toutes les fonctionnalit&eacute;s marchent y compris l'APM.<p>
        Personne &agrave; contacter : <a
        href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad 770Z
    </td><td>
        <p>Depuis la version 2.8 presque tout fonctionne correctement.</p>
        <p>Ce portable ne poss&egrave;de pas vraiment de BIOS : la plupart des param&egrave;trages comme les affectations d'IRQ doivent &ecirc;tre faits depuis Windows.</p>
        <p>Les ports s&eacute;rie et infrarouge peuvent &ecirc;tre d&eacute;clar&eacute;s en tant que ports com* en jouant avec les IRQ sous Windows. Il en va de m&ecirc;me pour le port parall&egrave;le (lpt2).</p>
        <p>Pour que l'APM fonctionne, vous devez ajouter cette ligne dans le fichier de configuration du noyau :</p>

<pre>
option         APM_DISABLE_INTERRUPTS=0
</pre>

        <p>L'hibernation (sauvegarde sur disque) fonctionne bien tant qu'il existe une partition Windows disposant de suffisamment d'espace disque (un peu plus que la taille de la RAM). Les fonctions mise en veille/reprise/arr&ecirc;t fonctionnent. Cependant, l'hibernation sous X (test&eacute; sous XFree86 3.3.6) engendrent une corruption de framebuffer et la seule chose &agrave; faire pour en sortir est de quitter et relancer le serveur X. La bascule entre terminaux virtuels ne r&eacute;soud pas ce probl&egrave;me. Il a &eacute;t&eacute; sugg&eacute;r&eacute; que la bascule entre diff&eacute;rents niveaux de r&eacute;solution pourrait arranger cela. XFree86 4.0 r&eacute;soud cela. La meilleure solution de contournement consiste &agrave; basculer en mode texte avant l'hibernation.</p>

        <p>Si vous activez le moniteur externe (Fn+F7), XFree86 3.3.6
        affiche des motifs barriol&eacute;s et parfois g&egrave;le le syst&egrave;me (jusqu'&agrave; ce que vous basculiez en mode texte ou que vous stoppiez le serveur dans un d&eacute;lai de quelques secondes). Si vous basculez en mode texte, vous devrez stopper (kill) le serveur X (rebasculer en mode graphique causera un crash du syst&egrave;me). Activer un moniteur externe en mode video n'engendre aucun effet de bord. Vous pouvez alors d&eacute;marrer X ou  y rester s'il tournait d&eacute;j&agrave.</p>

        <p>Le pilote <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=clcs&amp;sektion=4">clcs(4)</a> est un petit peu instable, vous feriez donc mieux de le d&eacute;sactiver. Cela n'a que peu d'importance dans la mesure o&ugrave; la carte soundblaster (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Curren&amp;arch=i386">sb(4)</a>) est reconnue et fonctionne bien. Vous aurez peut-&ecirc;tre &agrave; jouer avec les IRQs pour faire marcher tout ça.</p>

        Un fichier de configuration XF86Config est disponible <a href="../xf86configs/thinkpad770z">ici</a>.<p>

        Personne &agrave; contacter :  <a href="mailto:angelos@openbsd.org">Angelos Keromytis</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad A21p
    </td><td>
        Reportez-vous au paragraphe sur le T21. Tout est identique &agrave; l'exception de la carte video qui est une ATI Rage 128 Mobility LF. OpenBSD 2.8 avec XFree86 4.0.2 fonctionne &agrave; merveille en mode 1600x1200 en 24bpp.
        Pour cela vous devez utiliser cette commande :
        <pre>
                sysctl -w machdep.allowaperture=2
        </pre>
        et entrer les gammes de fr&eacute;quence correctes dans la section Monitor du fichier XF86Config. Un exemple de fichier de configuration fonctionnant est disponible <a href="../xf86configs/thinkpada21p">ici</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad A30p
    </td><td>
        <p>Sur mon mod&egrave;le, la plupart des choses fonctionnent bien avec OpenBSD 3.1. et sup&eacute;rieures.</p>
        <p>Notez toutefois qu'IBM envoie des variantes du mod&egrave;le de base.</p>
        <p>Le param&egrave;trage habituel tel que sur les autres mod&egrave;les de Thinkpad est n&eacute;cessaire si vous voulez conserver Windows. Le choix multiple au d&eacute;marrage (NdT : multiboot) Windows NT fonctionne. J'ai conserv&eacute; la partition de restauration pour le moment et je recommande de sauvegarder celle de r&eacute;cup&eacute;ration en la gravant sur CD.
        <p>La carte video (ATI Radeon Mobility) doit &ecirc;tre explicitement d&eacute;clarer pour pouvoir fonctionner en 1600x1200 (ce qui se r&eacute;sume à l'ajout de deux lignes dans le fichier XF86Config).
Parfois, le serveur X ne d&eacute;marre pas correctement et doit &ecirc;tre tu&eacute; puis red&eacute;marr&eacute;.
L'extension XVideo fonctionne ce qui permet la lecture de DVD en plein &eacute;cran.
        Dans la version -current d'OpenBSD, mplayer prend aussi en charge d'autres formats de video.</p>
<p>Le son fonctionne, la carte Ethernet int&eacute;gr&eacute;e aussi, ainsi que la carte WiFi Prism. La mise en veille marche.
Les touches sp&eacute;ciales (r&egrave;glage du volume, de la luminosit&eacute; de l'&eacute;cran...) sont g&eacute;r&eacute;es par le mat&eacute;riel et fonctionnent sous OpenBSD, tout comme le graveur de CD.</p>
<p>L'IDE dma n'est pas reconnu en 3.1 car la puce est une version r&eacute;vis&eacute;e de l'Intel 82801. Ce qui a &eacute;t&eacute; r&eacute;solu juste apr&egrave;s la r&eacute;ception de mon portable.
Je n'ai m&ecirc;me pas essay&eacute; le modem infrarouge.</p>
        Personne &agrave; contacter :  <a href="mailto:espie@openbsd.org">Marc Espie</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad T21
    </td><td>
        <p>Depuis la version 2.8 d'OpenBSD, tout fonctionne.</p>

        <p>Voici la sortie de la commande fdisk. La meilleure fa&ccedil;on d'arriver &agrave; cela est de redimensionner la partition Windows (j'utilise PartitionMagic) et de la d&eacute;placer en fin de disque, puis de cr&eacute;er une partition OpenBSD (en ignorant le redimensionnement des partitions que fait fdisk : il faut cr&eacute;er les syst&egrave;mes de fichiers que vous souhaitez avec la commande disklabel).</p>
<pre>
         Starting        Ending
 #: id  cyl  hd sec -   cyl  hd sec [     start -       size]
-------------------------------------------------------------------------
 0: 1C 1023   1   1 -  1023 239  63 [  42003423 -   20502657] &lt;Unknown ID&gt;
*1: A6    0   1   1 -  1021 239  63 [        63 -   15452577] OpenBSD     
 2: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
 3: 00    0   0   1 -     0   0   0 [         0 -          0] unused      
</pre>

        <p>Pour faire fonctionner les ports s&eacute;rie et infrarouge (en com*) vous devrez jouer avec les affectations d'IRQ dans le BIOS : positionnez-les &agrave; des valeurs par d&eacute;faut telles que celles que vous trouverez dans le fichier de configuration GENERIC. M&ecirc;me chose pour le port parall&egrave;le (OpenBSD reconnait lpt2). Vous devrez peut-&ecirc;tre jouer sous Windows.</p>

        <p>Il y a au moins deux carte miniPCI disponibles : une (non support&eacute;e) WinModem et une combo ethernet/modem. La carte Ethernet fonctionne (d&eacute;tect&eacute;e comme une carte fxp/inphy), le modem ressemble &agrave; un vrai mais n'est pas encore support&eacute;.</p>

<p>Le son fonctionne (CS4614). Pour &eacute;viter un gel du syst&egrave;me lors de l'utilisation simultan&eacute;e des cartes Cardbus et audio, vous *pouvez* avoir besoin de param&egrave;trer au moins deux IRQs pour les p&eacute;riph&eacute;riques PCI dans le BIOS. J'utilise les IRQs 9 et 11. Il vous faudra aussi d&eacute;sactiver la gestion d'alimentation (NdT: Power Management) PCI dans le BIOS (c'est le seul menu d&eacute;roulant : faites bien attention d'aller jusqu'en bas de la page :-)</p>

<p>L'APM marche &agrave; l'exception de l'hibernation (qui n&eacute;cessite le support de l'OS). Pour que la commande "halt -p" fonctionne, vous devez positionner la variable machdep.apmhalt &agrave; 1 &agrave; l'aide de la commande sysctl (il vous faut une version 2.8-current de mi-janvier ou plus d'OpenBSD avec les sources). Ajoutez la ligne suivante dans le fichier de configuration du noyau pour que l'APM soit pris en charge :</p>
<pre>
option         APM_DISABLE_INTERRUPTS=0
</pre>

<p>Bien que la carte video soit suppos&eacute;e fonctionner avec XFree86 3.3.6pl8, je n'ai r&eacute;ussi &agrave; la faire marcher qu'avec XFree86 4.0.1 avec les correctifs (NdT: patches) <a href="http://www.probo.com/timr/savagemx.html">suivants</a> (vous y trouverez aussi des versions binaires du pilote pour OpenBSD 2.8). Votre noyau doit avoir &eacute;t&eacute; compil&eacute; avec l' "option INSECURE" et positionner le niveau de s&eacute;curit&eacute; &agrave; -1 dans le fichier /etc/rc.securelevel (pour que le serveur X puisse ouvrir /dev/mem et mmap() le BIOS). Avec cette configuration, il est possible d'obtenir une r&eacute;solution de 1400x1050 en 16bpp (avec la version 1.1.13 du pilote Savage une r&eacute;solution en 24bpp fonctionne aussi).</p>

        <p><b>Mise &agrave; jour :</b> les correctifs mentionn&eacute;s ci-dessus ont &eacute;t&eacute; incorpor&eacute;s dans XFree86 4.0.2. Il n'est plus n&eacute;cessaire de positionner l'option INSECURE. Positionnez le param&egrave;tre sysctl machdep.allowaperture &agrave; 2 dans /etc/sysctl.conf si vous avez une version 2.8 ou plus d'OpenBSD mise &agrave; jour d'apr&egrave;s les sources post&eacute;rieures au 15 d&eacute;cembre 2000.</p>

<p>Notez que quelques mod&egrave;les ne fonctionnent qu'en mode 1024x768. Ceux qui supportent le 1400x1050 peuvent aussi fonctionner en 1600x1200 en utilisant un &eacute;cran virtuel (dans lequel l'affichage disparait quand vous vous d&eacute;placez en dehors de l'&eacute;cran). Je n'ai pas test&eacute; si cela fonctionne sous OpenBSD (&ccedil;a marche sous Windows).</p>

<p>Si vous fermez l'&eacute;cran du portable le syst&egrave;me est mis en veille. Sous XFree86 4.0 la reprise se passe bien en ce qui concerne l'affichage, ce que XFree86 n'&eacute;tait pas capable de faire sur le ThinkPad 770Z).</p>
<p>Un fichier de configuration pour XFree86 4.0 est disponible <a
        href="../xf86configs/thinkpadt21">ici</a>.</p>

<p><b>Mise &agrave; jour : </b> apparemment, les T21s r&eacute;cents sont &eacute;quip&eacute;s d'une carte video ATI Rage 3D Mobility. Un fichier de configuration pour XFree86 4.0 pour cette carte est disponible <a href="../xf86configs/thinkpadt21-2">ici</a>.</p>

<p>Une chose ennuyante se produit lors du retrait de p&eacute;riph&eacute;riques UltraBay 2000 : le syst&egrave;me se met &agrave; bipper et la seule mani&egrave;re d'arr&ecirc;ter cela est de suspendre l'activit&eacute; puis de brancher un p&eacute;riph&eacute;rique dans l'emplacement UltraBay 2000 (pas n&eacute;cessairement le m&ecirc;me). Notez que le changement &agrave; chaud (NdT: hot-swap) de p&eacute;riph&eacute;rique UltraBay 2000 n'est pas actuellement support&eacute; par OpenBSD (2.8). Seul le changement de batteries &agrave; chaud est s&ucirc;r.</p>

        <p>Personne &agrave; contacter : <a href="mailto:angelos@openbsd.org">Angelos Keromytis</a>.</p>
    </td>
</tr><tr>
    <td>
        IBM Thinkpad 760
    </td><td>
        Avec la version 2.6 d'OpenBSD, XFree86 et l'APM ne fonctionnent pas.</p>
        Les versions plus r&eacute;centes d'XFree86 permettent le support d'X et des correctifs sont disponibles.</p>
La carte modem/son MWave ne fonctionne pas.</p>
Le support de l'APM a &eacute;t&eacute; corrig&eacute; apr&egrave;s la 2.6 et des correctifs sont attendus.</p>
         Personne &agrave; contacter : <a href="mailto:todd@openbsd.org">Todd Fries</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad T20
    </td><td>
    Avec les versions 2.7 et sup&eacute;rieures d'OpenBSD, l'APM fonctionne presque normalement. Pour pouvoir utiliser la commande "halt -p" il faut positionner &agrave; 1 la variable sysctl machdep.apmhalt (avec une 2.8-current et les sources de mi-janvier et supra). Le portable se met en veille quand l'&eacute;cran est ferm&eacute;. Le reprise se fait tr&egrave;s bien &agrave; la r&eacute;ouverture.<p>
Le modem int&eacute;gr&eacute; est un winmodem... Oubliez-le. Actuellement c'est une carte 'mini-PCI' qui doit donc pouvoir &ecirc;tre enlev&eacute;e.<p>
Le son fonctionne &agrave; condition que le mode veille PCI soit d&eacute;sactiv&eacute; dans le BIOS.<p>
OpenBSD 2.8 supporte X11 mais il y a beaucoup de parasites en 32bpp. L'image est correcte en 16bpp. Un fichier de configuration pour X4 est disponible <a href="../xf86configs/thinkpadt20">ici</a><p>

        Consulter <a href="http://www.snafu.org/t20/">http://www.snafu.org/t20/</a>
        pour de plus amples informations.<p>

        Personne &agrave; contacter : <a href="mailto:marc@snafu.org">Marco S Hyman</a>.
    </td>
</tr><tr>
    <td>
        IBM Thinkpad T23
    </td><td>
 Test&eacute; avec OpenBSD 3.1-beta et supra. Probl&egrave;me au d&eacute;marrage avec la disquette : passage oblig&eacute; par "boot -c" et "disable ahc" sous peine de voir la machine geler durant la phase de d&eacute;marrage. Ce n'est pas un probl&egrave;me avec un noyau GENERIC.<p> 
L'APM fonctionne partiellement : la mise en veille est OK mais pas l'hibernation (support OS requis). Les tentatives d'hibernation ne donnent rien d'autre qu'un bip du clavier. La puce audio (auich) est support&eacute;e. Remarque : il existe 16 mutes diff&eacute;rents dont la plupart positionn&eacute;s par d&eacute;faut. La meilleure fonctionnalit&eacute; : le 802.11b int&eacute;gr&eacute;e et la carte Ethernet fxp. Le WiFi utilise une puce PRISM 2.5 ISL3874A(PCI), version du firmware 1.0.7  (primaire), 1.3.6 (station).<p>
X fonctionne (XF4). Un fichier de configuration pour XF4/OpenBSD est disponible <a href="../xf86configs/thinkpadt23">ici</a>. Toutes les applications X test&eacute;es jusqu'&agrave; pr&eacute;sent marchent. Ogle (lecteur DVD) ne fonctionne pas en mode 24 bpp. Il marche bien en mode 16 bpp.<p>
        Consulter <a href="http://www.snafu.org/t23/">http://www.snafu.org/t20/</a>
        pour de plus amples informations.<p>

        Personne &agrave; contacter : <a href="mailto:marc@snafu.org">Marco S Hyman</a>.
    </td>
</tr>
<tr>
    <td>
        NEC Versa 2000
    </td><td>
        Toutes les fonctionnalit&eacute;s de l'APM fonctionnent.<p>
        Tout marche sur cette machine.<p>
        Personne &agrave; contacter : <a href="mailto:mickey@openbsd.org">Michael Shalayeff</a>.
    </td>
</tr>
<tr>
    <td>
        Siemens SCENIC Mobile 360
    </td><td>
        Toutes les fonctionnalit&eacute;s de l'APM fonctionnent.<p>
        Le son fonctionne en utilisant OSS.<p>
        Personne &agrave; contacter : <a href="mailto:b1000@softhome.net">Dan Carlsson</a>.
    </td>
</tr>
<tr>
    <td>
        Sony VAIO F430
    </td><td>
        Avec la version OpenBSD 2.6-Current (17 F&eacute;vrier 2000)<p>
 
        APM : la mise en veille "<strong>zzz</strong>" fonctionne tout comme celle du clavier. "<strong>halt -p</strong>" et "<strong>apm -S</strong>" ne fonctionnent pas (mais je dois bient&ocirc;t investiguer avec les utilitaires phdisk).<p>

        Le lecteur DVD marche, ainsi que toutes les fonctions du lecteur de disquette. Le support Ethernet fonctionne apr&egrave;s reprise avec la carte que j'utilise (3Com 3c589).<p>
        
        Personne &agrave; contacter : <a href="mailto:beck@openbsd.org">Bob Beck</a>.
    </td>
</tr>
<tr>
    <td>
        Sony VAIO z505r
    </td><td>
        Support APM : "<strong>zzz</strong>", mise en veille et hibernation
        via le clavier, "<strong>halt -p</strong>", tout fonctionne.
        "<strong>apm -S</strong>" r&eacute;active tout imm&eacute;diatement.<p>

L'hibernation utilise un bloc &agrave; la fin du disque, dont la taille est approximativement de 3 &agrave; 5 Mo plus grande que celle de la m&eacute;moire de votre machine. Pour r&eacute;parer cet espace, utilisez "<strong>phdisk.exe /create /partition</strong>" pour initialiser la partition.  L'utilitaire phdisk est disponible sur la disquette de d&eacute;marrage fournie sur le premier CD recovery.<p>
La carte Ethernet int&eacute;gr&eacute;e fonctionne bien mais n&eacute;cessite parfois une r&eacute;initialisation apr&eacute;s une mise en veille :
        "<strong>ifconfig fxp0 down; ifconfig fxp0 up</strong>".<p>
Apr&egrave;s une mise en veille, l'horloge de profilage ne tourne plus. Des correctifs sont en cours de r&eacute;alisation.<p>

Le son est support&eacute; en utilisant le pilote <a
        href="http://www.openbsd.org/cgi-bin/man.cgi?query=neo&amp;sektion=4">
        neo(4)</a>.  Le syst&egrave;me g&egrave;le parfois au d&eacute;marrage lors de la reconnaissance du mixer AC97.<p>

Quand l'emplacement de la m&eacute;moire amovible (NdT: memory stick) est vide, il peut se produire des erreurs g&eacute;n&eacute;rant un d&eacute;bordement du tampon dmesg et perturber le programme d'installation d'OpenBSD. L'utilitaire de configuration du BIOS (accessible par la touche F2) dispose d'une option permettant de d&eacute;sactiver le support de la m&eacute;moire amovible.<p>

Un fichier de configuration XF86Config pour XFree86 3.3.X est disponible <a href="../xf86configs/vaioz505r">ici</a>.
        <p>

        Personne &agrave; contacter : <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr>
<tr>
    <td>
        Sony VAIO z505s
    </td><td>
    Ce mod&egrave;le est similaire au VAIO z505r mis &agrave; part le fait qu'il y a des probl&egrave;mes avec le lecteur de disquette USB.<p>
        Personne &agrave; contacter : <a href="mailto:provos@openbsd.org">Niels Provos</a>.
    </td>
</tr><tr>
    <td>
        Sony VAIO 747</td>
    <td>
    Depuis la version 2.6 incluse, XFree86 et l'APM fonctionnent.<p>
Fourni avec une carte modem PCMCIA (COM One MCC220 Platinum Card) qui fonctionne.<p>
Le son fonctionne (uniquement en 8 bits).<p>
Le comportement de l'APM est similaire &agrave; celui du VAIO z505r &agrave; 
l'exception de l'hibernation qui n'a pas &eacute;t&eacute; test&eacute;e.<p>
L'USB ne fonctionne pas.<p>
Un fichier de configuration XF86Config est disponible <a href="../xf86configs/vaio747">ici</a>.<p>

        Personne &agrave; contacter : <a href="mailto:markus@openbsd.org">Markus Friedl</a>.
    </td>
</tr>
<tr>
    <td>
        Sony VAIO PCG 505-FX
    </td><td>
        Inconnu.
    </td>
</tr>
<tr>
        <td>Sony VAIO PCG XG700K</td>
        <td>
        <p>OpenBSD 2.9 fonctionne mais rencontre quelques probl&egrave;mes similaires &agrave; ceux d&eacute;crits pour le Thinkpad T21 avec les commandes disklabel et fdisk.

        <p>Requiert sysctl machdep.apmhalt=1 pour que l'arr&ecirc;t fonctionne.

        <p>apm -z met le syst&egrave;me en veille l&eacute;g&egrave;re (doit pouvoir &ecirc;tre r&eacute;solu avec phdisk); apm -s ne fait rien.

        <p>
        XFree86 4.0 fonctionne en 1024x768 avec le pilote S3 savage. Une r&eacute;solution de 1200x1024 devrait &ecirc;tre possible mais je ne l'ai pas test&eacute;e.
        Mon fichier de configuration XF86Config pour XFree86 4.0 est disponible 
        <a href="../xf86configs/vaioxg700k">ici</a>.

        <p>Le son et l'USB fonctionnent bien.

        <p>Les trois emplacements cardbus sont configur&eacute;s une fois ins&eacute;r&eacute;s (deux &agrave; l'&eacute;jection). Se bloque parfois lorsque je retire ma carte NE.
        
        <p>Le modem interne WinModem n'est pas support&eacute;. Il n'y a pas encore de support pour Firewire ni le "Jog Dialer".

        <p>Personne &agrave; contacter : Ian Darwin.
        </td>
</tr>
<tr>
        <td>Sony VAIO PCG-SRX77</td>
        <td>
        <p>OpenBSD 3.3 fonctionne mais il y a n&eacute;anmoins quelques petits 
	probl&egrave;mes.
        <ul>
        <li>XFree86 fonctionne, j'utilise ce fichier
        <a href="../xf86configs/sonysrx77">XF86Config</a>.
        <li>Le son fonctionne, en utilisant le pilote
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=auich&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">auich(4)</a>.
        <li>La carte ethernet int&eacute;gr&eacute;e fonctionne, en 
	utilisant le pilote
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=fxp&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">fxp(4)</a>.
        <li>Le cardbus et le wireless int&eacute;gr&eacute; ne fonctionnent
	<strong>pas</strong> sans ce  
        <a href="ftp://ftp.courtesan.com/pub/millert/OpenBSD/srx77/cardbus.diff">hack</a>.
        <li>Les ports USB et cartes m&eacute;moire fonctionnent.
        <li>Le Firewire est actuellement non test&eacute;.
        <li>Le "jog dial" n'est actuellement pas support&eacute;.
        <li>Le modem int&eacute;gr&eacute; ne fonctionne pas.
        <li>APM ne fonctionne pas; le portable se met bien en veille mais ne se
	reveille pas.
        <li>"halt -p" &eacute;teint la machine.
        </ul>

        Personne &agrave; contacter : <a href="mailto:millert@openbsd.org">Todd Miller</a>.
        </td>
</tr>
<tr>
    <td>
        Toshiba Libretto 50CT
    </td><td>
    L'APM fonctionne mais vous devez veiller &agrave; ne pas utiliser les 32 derniers mégaoctets du disque car l'image du BIOS (NdT: BIOS dump) y est archivée en cas d'hibernation prolong&eacute;e. Vous pouvez examiner la g&eacute;om&eacute;trie du BIOS avec disklabel pour savoir le nombre exact de secteurs requis pour le BIOS. Un &eacute;chec engendrera la corruption du syst&egrave;me de fichiers durant la veille.
        <p>
        Le Libretto n'utilise qu'une seul IRQ pour 
        <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">sb(4)</a>
        et <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wss&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">wss</a>.
        La meilleure solution consiste &agrave; en choisir une et d&eacute;sactiver l'autre dans le noyau.
Le lecteur de disquette externe PCMCIA n'est actuellement pas reconnu par OpenBSD mais peut &ecirc;tre utilis&eacute; durant l'installation.
        <p>
L'installation peut se r&eacute;v&egrave;ler subtile quand il n'y a qu'un emplacement PCMCIA. La meilleure solution consiste &agrave; faire une installation par r&eacute;seau. Pour cela, utilisez la disquette de d&eacute;marrage et à l'invite (NdT: boot prompt) entrez 
<em>boot -c</em>.  Quand vous obtenez l'invite <em>UKC</em>, d&eacute;branchez le lecteur de disquette, branchez la carte r&eacute;seau puis tapez exit. Le noyau testera la carte et vous devriez pouvoir effectuer une installation r&eacute;seau standard. Vous devrez peut-&ecirc;tre d&eacute;sactiver les p&eacute;riph&eacute;riques audio dans le BIOS pour que la disquette de d&eacute;marrage reconnaisse correctement votre carte r&eacute;seau.
        <p>
        Des fichiers XF86Config sont disponibles pour 
        <a href="../xf86configs/libretto50ct">XFree86 4.X</a> et
        <a href="../xf86configs/libretto50ct-xf3">XFree86 3.3.X</a>.
        <p>
        Notez que le pilote de puces graphiques de la version 4.1 d'XFree86 ne fonctionnait pas
        (cela a &eacute;t&eacute; r&eacute;solu avec la version 4.2). Par cons&eacute;quent, la version d'XFree86 livr&eacute;e avec OpenBSD 3.0 ne fonctionne pas sur le Libretto. J'ai compil&eacute; un vieux pilote XFree86 4.01 (qui fonctionne) pour XFree86 4.1.
        Vous pouvez le t&eacute;l&eacute;charger <a
        href="ftp://ftp.courtesan.com/pub/todd/OpenBSD/chips_drv.o">
        ici</a> et le copier l&agrave; :
        <pre>
            /usr/X11R6/lib/modules/drivers/chips_drv.o
        </pre>
        Ce qui fera marcher XFree86 4.1 sur les mod&egrave;les 50CT et 70CT.
        <p>
        Personne &agrave; contacter : <a href="mailto:millert@openbsd.org">Todd Miller</a>.
    </td>
</tr><tr>
    <td>
        Toshiba Libretto 100CT
    </td><td>
    La plupart des informations donn&eacute;es pour le Libretto 50CT s'appliquent au 100CT.
        <p>
        X11 fonctionne en mode 800x600. 
        Des fichiers XF86Config sont disponibles pour 
        <a href="../xf86configs/libretto100ct">XFree86 4.X</a> et
        <a href="../xf86configs/libretto100ct-xf3">XFree86 3.3.X</a>.
        <p>
        Personne &agrave; contacter : <a href="mailto:millert@openbsd.org">Todd Miller</a>.
    </td>
</tr><tr>
    <td>
        Toshiba Portege 2000
    </td><td>
        Les cartes int&eacute;gr&eacute;es wavelan et Ethernet 10/100 (fxp) fonctionnent.<p>
        Le son n'est pas reconnu.<p>
        L'APM fonctionne ("<strong>zzz</strong>") tout comme "<strong>halt -p</strong>".
        Cependant, le taux de charge de la batterie est erron&eacute; et indique tout le temps que le portable est connect&eacute; au secteur.<p>
        Les ports USB sont reconnus mais actuellement non test&eacute;s.<p>
        Le lecteur de CD-ROM PCMCIA ne fonctionne pas pour le moment.<p>
        XFree86 en version 4.2 et supra marche. Un exemple de fichier XFConfig est disponible <a href="../xf86configs/portege2000">ici</a>.
        La taux de r&eacute;p&eacute;tition du clavier est un petit peu trop rapide.
    </td>
</tr><tr>
    <td>
        Toshiba Portege 660CDT
    </td><td>
        L'APM ne fonctionne pas du tout.<p>
Le m&eacute;lange <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sb&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">sb(4)</a>
        et <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wss&amp;sektion=4%2fi386&amp;apropos=0&amp;manpath=OpenBSD+Current&amp;arch=i386">wss(4)</a> au niveau du son peut causer quelques probl&egrave;mes. Les versions plus r&eacute;centes du BIOS sont pires encore dans la mesure o&ugrave; elles sont encore moins souples dans ce qu'elles autorisent de faire avec les interruptions.<p>

        Personne &agrave; contacter : <a href="mailto:deraadt@openbsd.org">Theo de Raadt</a>.
    </td>
</tr><tr>
    <td>
        Toshiba Satellite 320CDS
    </td><td>
        <p>
        Bon vieux mod&egrave;le. Conservez une installation minimaliste de Windows car le BIOS est g&eacute;rer par logiciel &agrave; l'aide du programme <code>TSETUP</code>.</p>
        <p>X fonctionne bien en 800x600, 16 bits.</p>  
        <p>La carte son peut &ecirc;tre trait&eacute;e comme un clone de carte windows sound system
        (wss). Cela n&eacute;cessite de d&eacute;sactiver la reconnaissance des clones SoundBlaster. Le param&egrave;trage du BIOS doit s&eacute;parer les canaux pour la lecture et l'enregistrement. Je n'ai pas test&eacute; l'enregistrement.</p>
        <p>
        Les cartes PCMCIA fonctionnent. Les Cardbus aussi sous r&eacute;serve que le mode cardbus soit param&eacute;tr&eacute; dans le BIOS et non l'auto-d&eacute;tection.</p>
        
        Personne &agrave; contacter : <a href="mailto:espie@openbsd.org">Marc Espie</a>.
    </td>
</tr>
<tr>
        <td>
           Toshiba Tecra 500CS
        </td><td>
        L'APM ne fonctionne pas mais la commande <b>halt -p</b> si.<p>
        Le son fonctionne par d&eacute;faut avec un noyau GENERIC mais &eacute;tant donn&eacute;e la qualit&eacute; des hauts-parleurs, cela n'en vaut pas la peine. X marche bien.<p>

        Personne &agrave; contacter : <a href="mailto:ericj@monkey.org">Eric Jackson</a>.
        </td>
</tr><tr>
        <td>
           Toshiba Tecra 500CDT
        </td><td>
        L'APM est totalement inop&eacute;rant (et peut crasher votre disque).<p>

        XFree86 fonctionne (800x600 16bpp).<p>

        Le son aussi (21739 Hz, half duplex stereo).<p>

        <!-- Serial IR is said to work, needs verification. -->

        Personne &agrave; contacter : <a href="mailto:d@openbsd.org">David Leonard</a>.
        </td>
</tr><tr>
        <td>
           Toshiba Tecra 550CDT
        </td><td>
        La mise en veille profonde (NdT: deep sleep) APM (<b>zzz</b>) fonctionne mais <b>-S</b> provoque une reprise imm&eacute;diate.<p>

        XFree86 fonctionne très bien.<p>

        Le son fonctionne apr&egrave;s tripatouillage de quelques IRQs dans le BIOS.<p>

        L'USB marche : au moins ai-je p&ucirc; brancher une cam&eacute;ra num&eacute;rique que le pilote <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ugen&amp;sektion=4">ugen(4)</a> a correctement d&eacute;tect&eacute;e et configur&eacute;e.<p>

Le modem int&eacute;gr&eacute; ne fonctionne pas car il n&eacute;cessite un logiciel ne tournant que sous Windows. Ce qui signifie qu'il n'impl&eacute;mente pas un vrai port RS232.<p>

        Le pcic ne marche pas sur cette machine, donc je ne peux donner aucun avis sur le branchement ou le d&eacute;branchement de p&eacute;riph&eacute;riques PCMCIA.<p>

        Personne &agrave; contacter : <a href="mailto:aaron@openbsd.org">Aaron Campbell</a>.
        </td>
</tr>
</table>

<hr>
<a href="i386.html"><img height=24 width=24 src="../images/back.gif" border=0 alt=OpenBSD></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: i386-laptop.html,v 1.80 ]<br>
$Translation: i386-laptop.html,v 1.4 2004/02/13 23:04:14 saad Exp $<br>
$OpenBSD: i386-laptop.html,v 1.4 2004/02/15 17:57:26 jufi Exp $
</small>

</body>
</html>
