<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Listes de diffusion OpenBSD</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "page des listes de diffusion OpenBSD">
<meta name= "keywords"      content= "openbsd,mail">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "Ce document est sous copyright
1996-2004 OpenBSD.">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#23238E">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" 
src="../images/smalltitle.gif" border="0"></a>
<p>
<h1><font color="#e00000">Listes De Diffusion</font></h1> 
<hr> 

Les listes de diffusion sont des moyens importants pour la communication
entre les utilisateurs et les d&eacute;veloppeurs OpenBSD. A l'exception
de <i>announce</i> et de <i>security-announce</i>, les listes ne sont
pas mod&eacute;r&eacute;es. Nous restreignons d&eacute;lib&eacute;rement
le nombre de listes de diffusion diff&eacute;rentes. Cela aide &agrave;
r&eacute;duire la quantit&eacute; d'envois dupliqu&eacute;s et &agrave;
s'assurer que l'information soit distribu&eacute;e &agrave; une large
audience.

<p>
<a name="Netiquette"></a>
<h2><font color="#e00000">Netiquette</font></h2>
<p>
Soyez pr&eacute;venant &agrave; l'&eacute;gard des autres personnes
inscrites aux listes de diffusion.
<dl>
<dt><b>Texte simple, 72 caract&egrave;res par ligne</b>
<dd>Beaucoup de personnes inscrites et de d&eacute;veloppeurs lisent
    leur courrier avec des clients en mode texte (mail(1), emacs, Mutt)
    et pour eux, les messages compos&eacute;s en HTML ou avec des lignes
    de plus de 72 caract&egrave;res sont souvent illisibles. La plupart
    des listes de diffusion OpenBSD d&eacute;pouillent les messages de
    leur contenu MIME avant de les envoyer au reste de la liste. Si vous
    n'utilisez pas du texte simple, vos messages seront
    recompos&eacute;s ou, si ils ne peuvent pas l'&ecirc;tre, seront
    sommairement rejet&eacute;s. La seule liste qui autorise les
    attachements est la liste <em>ports</em>. Ils seront
    supprim&eacute;s dans les messages adress&eacute;s aux autres listes
    de diffusion.

<dt><b>Faites votre travail avant de poster</b>
<dd>Si vous avez une question d'installation, assurez-vous d'avoir lu
    les documents appropri&eacute;s tels que les fichiers INSTALL.*
    situ&eacute;s dans les r&eacute;pertoires d'installation sur le FTP,
    la <a href="../faq/fr/index.html">FAQ</a> et les manuels
    appropri&eacute;s (commencez avec 
    <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8">afterboot(8)</a>), et
    v&eacute;rifiez les <a href="#Archives">archives</a> des listes de
    diffusion. Nous voulons vous aider, mais nous ne voulons pas vous
    priver d'une exp&eacute;rience d'apprentissage enrichissante.

<dt><b>Incluez un Objet utile</b>
<dd>Les messages sans Objet seront envoy&eacute;s au responsable de la
    liste et donc, mettrons plus de temps &agrave; &ecirc;tre
    distribu&eacute;s. Inclure un Objet appropri&eacute; au message va
    assurer le fait qu'un plus grand nombre de personnes va lire ce que
    vous avez &eacute;crit. De plus, &eacute;vitez l'emploi abusif des
    majuscules dans votre Objet. "Au secours !" ou "Je ne peux le faire
    marcher !" ne sont pas des objets utiles. Ne changez pas l'objet
    lorsque vous &eacute;crivez sur le m&ecirc;me sujet. VOUS savez peut-
    &ecirc;tre de quoi il s'agit mais ce n'est pas le cas pour le reste
    d'entre nous qui re&ccedil;oivent des centaines de messages par
    jour.

<dt><b>R&eacute;duisez votre signature</b>
<dd>Limitez la taille de votre signature &agrave; un nombre raisonnable
    de lignes. Les signatures PGP et les cartes de visite automatiques
    sont ennuyeuses. Elles sont supprim&eacute;es. Les
    d&eacute;n&eacute;gations et notices l&eacute;gales sont tr&egrave;s
    ennuyeuses et innapropri&eacute;es sur les listes de diffusion
    publiques.

<dt><b>Suivez le sujet</b>
<dd>Gardez l'Objet de votre message appropri&eacute; pour les
    utilisateurs d'OpenBSD.

<dt><b>Incluez les informations importantes</b>
<dd>Ne faites pas perdre &agrave; tout le monde du temps avec une
    question incompl&egrave;te. Vous &ecirc;tes le/la seul(e) &agrave;
    avoir l'information n&eacute;cessaire &agrave; la r&eacute;solution
    de votre probl&egrave;me. C'est mieux de fournir plus d'informations
    que n&eacute;cessaire que trop peu d'informations. Toute question
    doit au moins comporter la <a
    href="../faq/fr/faq5.html#Flavors">version</a> 
    d'OpenBSD (par exemple, "3.2- stable", "3.3-current datant du 20
    Juillet 2003"). Toute question relative &agrave; du mat&eacute;riel
    doit aussi mentionner la plateforme (sparc, alpha, etc.) et
    fournissez un
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a> complet.
    Malheureseument, Les num&eacute;ros de mod&egrave;le mat&eacute;riel
    ne donnent pratiquement aucune information sur le contenu d'une
    machine ou d'un accessoire donn&eacute;. Ils sont inutiles pour
    toute personne n'ayant pas exactement le m&ecirc;me mat&eacute;riel
    que vous. dmesg(8) nous dit exactement ce que contient votre
    machine. Ce qui n'est pas le cas des autocollants affich&eacute;s
    sur le bo&icirc;tier.

<dt><b>Respectez les diff&eacute;rences d'opinion et de philosophie</b>
<dd>Des personnes intelligentes peuvent regarder le m&ecirc;me ensemble
    de faits et arriver &agrave; des conclusions tr&egrave;s
    diff&eacute;rentes. R&eacute;p&eacute;ter les m&ecirc;mes
    d&eacute;tails qui n'ont pas r&eacute;ussi &agrave; convaincre
    quelqu'un ne sert &agrave; rien et irrite les autres lecteurs.

<dt><b>Ne pas faire de "cross-post" ou r&eacute;p&eacute;ter un post</b>
<dd>Poster le m&ecirc;me message &agrave; de multiples listes et/ou
    plusieurs fois n'augmente pas la probabilit&eacute; d'obtenir une
    r&eacute;ponse utilise. Cependant, cette action risque d'irriter les
    personnes qui veulent vous venir en aie. Si vous n'obtenez pas de
    r&eacute;ponse satisfaisante la premi&egrave;re fois que vous avez
    &eacute;crit &agrave; une liste de diffusion appropri&eacute;e,
    alors vous n'avez pas fourni d'informations suffisantes ou
    suffisamment claires. Ne vous contentez pas de repostez le
    m&ecirc;me message.

</dl>

<p>
<a name="spam"></a>
<h2><font color="#e00000">Messages Non Sollicit&eacute;s</font></h2>
<p>
Les listes de diffusion OpenBSD utilisent 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=spamd&amp;sektion=8">spamd(8)</a>
en mode "liste grise" ainsi que 
<a href="http://www.spamassassin.org">SpamAssassin</a> pour diminuer le
volume des messages non sollicit&eacute;s mais parfois, il est possible
que certains messages non sollicit&eacute;s arrivent &agrave; se glisser
&agrave; travers les mailles du filet. Pour cela, le serveur des listes
de diffusion utilise aussi des r&egrave;gles bas&eacute;es sur des
expressions r&eacute;guli&egrave;res pour rejeter tout tout courrier
contenant des indicateurs habituels de messages non sollicit&eacute;s.
Si vous recevez du spam via une des listes de diffusion OpenBSD, vous
avez la possibilt&eacute; de le signaler &agrave; <a
href="http://spamcop.net">spamcop</a>. De mani&egrave;re
g&eacute;n&eacute;rale, vous ne devez pas en envoyer une copie au
responsable de la liste &eacute;tant donn&eacute; qu'il y ait des
chances qu'il l'ait d&eacute;j&agrave; remarqu&eacute;. Notez bien que
se plaindre d'un message non sollict&eacute; et faire des commentaires
&agrave; ce sujet dans les listes est improductif et
g&eacute;n&egrave;re plus de trafic que le message non sollicit&eacute;
lui-m&ecirc;me.
Si vous envoyez vos messages &eacute;lectroniques &agrave; partir d'une
adresse IP dynamique, vous ne serez probablement <b>pas</b> capable de
poster sur les listes de diffusion. Dans ce cas, vous devriez utiliser
la configuration <em>smart host</em> de sendmail qui utilise le serveur
mail du FAI. Lisez les commentaires du fichier
<tt>/usr/share/sendmail/cf/openbsd-proto.mc</tt> pour comprendre comment
faire &ccedil;a.

<a name="Lists"></a>
<h2><font color="#e00000">Les Listes De Diffusion</font></h2>

<h3>Listes de diffusion g&eacute;n&eacute;rales</h3>
Ces listes sont int&eacute;ressantes pour la plupart des utilisateurs
OpenBSD.
<dl>

<dt><b>misc</b>
<dd>Questions et r&eacute;ponses des utilisateurs, questions
    g&eacute;n&eacute;rales. C'est la liste la plus active. Avant de
    poster un message, veillez &agrave; <a href="../faq/fr/index.html">lire la
    FAQ</a> et les documents d'installation et consultez <a
    href="../report.html">Comment signaler un probl&egrave;me</a>

<dt><b>advocacy</b>
<dd>Promouvoir l'utilisation d'OpenBSD. Les discussions non-techniques
    de <em>misc</em> sont souvent redirig&eacute;es ici.

<dt><b>announce</b>
<dd>Annonces importantes. Cette liste de faible trafic est excellente
    pour les personnes qui d&eacute;sirent recevoir des nouvelles
    occasionnelles con&ccedil;ernant le projet.

<dt><b>security-announce</b>
<dd>Annonces de s&eacute;curit&eacute;. Cette liste de faible trafic
    re&ccedil;oit les rapports de s&eacute;curit&eacute; OpenBSD et des
    liens vers les correctifs d&egrave;s que ceux-ci deviennent
    disponibles.

<dt><b>ports</b>
<dd>Discussions concernant l'utilisation et la contribution aux 'ports'.

<dt><b>ports-security</b>
<dd>Annonces s&eacute;rit&eacute; concernant les ports et les packages.
Cette liste de faible trafic re&ccedil;oit les rapports de
s&eacute;curit&eacute; de l'arborescence des ports OpenBSD ainsi que des
packages avec des informations sur les vuln&eacute;rabilit&eacute;s et
les correctifs. patches.

<dt><b>www</b>
<dd>Discussion concernant le site web OpenBSD.</dd>
</dl>

<h3>Listes pour d&eacute;veloppeurs</h3>
Ces listes sont utilis&eacute;es pour les discussions techniques des
aspects d'OpenBSD. Elles ne doivent pas &ecirc;tre utilis&eacute;es par
les utilisateurs d&eacute;butants ou initi&eacute;s, ou pour signaler un
probl&egrave;me (sauf si vous incluez un bon correctif), ou pour des
probl&egrave;mes d'installation. Si on se demande si on devrait pas
poster une question dans ces listes, la r&eacute;ponse est presque
toujours non. Utilisez <b>misc</b> comme indiqu&eacute; ci-dessus.
<b>S'il vous pla&icirc;t</b>, ne faites pas de cross-posts sur plusieurs
listes.

<dl>
<dt><b>bogues</b>
<dd><a href="../report.html">Rapports de bogues</a> tels qu'ils sont
envoy&eacute;s via 
<a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a>
et les discussions qui s'en suivent. Si vous souhaitez que votre message
soit enregistr&eacute; dans le syst&egrave;me de suivi de bogues 
<a href="../query-pr.html">GNATS</a>, r&eacute;pondez &agrave; <i>gnats@openbsd.org</i>,
gnats@ va alors faire suivre votre message &agrave; <i>bugs@</i>.

<dt><b>ipv6</b>
<dd>Discussion autour d'IPv6 et d'IPsec dans OpenBSD

<dt><b>ports-bugs</b>
<dd>Discussion concernant les bogues &agrave; l'int&eacute;rieur de
    l'arborescence des ports OpenBSD

<dt><b>smp</b>
<dd>D&eacute;veloppement du support 
    <a href="../faq/faq8.html#SMP">multi-processeur</a> 
    pour OpenBSD. Les offres d'aide &agrave; test et les plaintes
    concernant le manque de support SMP ne sont pas les bienvenues.
    Cependant, du code est le bienvenu.

<dt><b>tech</b>
<dd>Discussion de sujets techniques pour d&eacute;veloppeurs OpenBSD et
    utilisateurs aguerris. Ce <b>n'est pas</b> un forum de "support
    technique", alors ne l'utilisez pas en tant que tel.

<dt><b>x11</b>
<dd>Discussion du d&eacute;veloppement X11 sous OpenBSD
</dl>

<h3>Listes sp&eacute;cifiques aux plates-formes</h3>
Ces listes portent sur les probl&egrave;mes utilisateur et le
d&eacute;veloppement sp&eacute;cifiques &agrave; des plates-formes
individuelles.
<dl>
<dt><b>alpha</b>
<dd>Port OpenBSD/alpha 

<dt><b>arm</b>
<dd>Port OpenBSD/cats et autres efforts de portage ARM

<dt><b>hppa</b>
<dd>Port OpenBSD/hppa 

<dt><b>mac68k</b>
<dd>Port OpenBSD/mac68k (pas les syst&egrave;mes PowerPC Macintosh)

<dt><b>ppc</b>
<dd>Ports OpenBSD/macppc et autres architectures PowerPC en cours de
portage.

<dt><b>sparc</b>
<dd>Ports OpenBSD/sparc et OpenBSD/sparc64

<dt><b>vax</b>
<dd>Port OpenBSD/vax
</dl>

<h3>Listes de diffusion des modifications CVS</h3>
A chaque fois qu'un d&eacute;veloppeur modifie un fichier dans
l'arborescence <a href="why-cvs.html">CVS</a> d'OpenBSD, un message est
envoy&eacute; &agrave; tous les inscrits &agrave; ces listes, contenant
les commentaires de modification.

<dl>
<dt><b>source-changes</b>
<dd>Syst&egrave;me automatique de courriers concernant les changements
    effectu&eacute;s &agrave; l'arborescence des sources (CVS) dans tous
    les d&eacute;p&ocirc;ts &agrave; l'exception de <i>ports</i>.

<dt><b>ports-changes</b>
<dd>Syst&egrave;me automatique de courriers concernant les changements
    effectu&eacute;s dans les ports de l'arborescence des sources (CVS).
</dl>

<h3>Listes CTM</h3>
Un certain nombre de listes de diffusion sont utilis&eacute;es par le <a
href="ctm.html">CTM</a>, un syst&egrave;me alternatif de distribution
des modifications apport&eacute;es aux sources. Consultez la <a
href="ctm.html">page CTM</a> pour plus de d&eacute;tails.

<a name="Majordomo"></a>
<h2><font color="#e00000">Gestion Des Inscriptions Aux Listes De
Diffusion Via Majordomo</font></h2>
<p>
Si vous voulez recevoir la liste compl&egrave;te des listes de diffusion
disponibles sur openbsd.org, envoyez la commande "<tt>lists</tt>" dans
le corps d'un message &agrave; <a
href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a>.

<p>
Pour vous inscrire &agrave; une liste donn&eacute;e, envoyez un message
&agrave; <a
href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> avec un
corps de message contenant &quot;<b>subscribe nom-liste-de-
diffusion</b>&quot;.

<p>
Pour plus d'aide, envoyez un corps de message contenant "<b>help</b>"
&agrave; to <a
href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> et vous
receverez en retour un message vous indiquant toutes vos options. Votre
domaine <b>DOIT</b> pouvoir &ecirc;tre r&eacute;solu sinon le message ne
vous parviendra jamais !

<a name="Web"></a>
<h2><font color="#e00000">Gestion Des Inscriptions Aux Listes De
Diffusion Par Interface Web</font></h2>
Vos inscriptions aux listes de diffusion OpenBSD peuvent aussi
&ecirc;tre g&eacute;r&eacute;es par une interface Web disponible
&agrave; l'adresse : <blockquote> <a
href="http://lists.openbsd.org/">http://lists.openbsd.org/</a>
</blockquote>


<a name="Tricks"></a>
<h2><font color="#e00000">Astuces Pour Les Listes De Diffusion</font></h2>
Il existe un certain nombre d'options tr&egrave;s utiles qui peuvent
&ecirc;tre s&eacute;lectionn&eacute;s soit par le biais de <a
href="http://lists.openbsd.org">l'interface web</a> ou via <a
href="mailto:majordomo@openbsd.org">Majordomo</a>. Vous avez par exemple
la possibilit&eacute; de modifier votre adresse email sans devoir vous
d&eacute;sinscire et vous r&eacute;inscrire. Vous pouvez aussi
d&eacute;sactiver temporairement la livraison de messages &agrave; votre
adresse pour quelques jours lorsque vous &ecirc;tes en vacances. Nous
vous invitons &agrave; explorer ces options. Pour recevoir la liste
compl&egrave;te des options, envoyez un message dont le corps contient
"<tt>help</tt>" &agrave; <a
href="mailto:majordomo@openbsd.org">Majordomo</a> ou utilisez l'onglet
"<tt>Help</tt>" de <a href="http://lists.openbsd.org">l'interface
web</a>

<p>
Par exemple, supposons que vous partez en vacances durant deux semaines
et vous ne souhaitez pas revenir et trouver des milliers de messages
dans votre bo&icirc;te aux lettres &eacute;lectronique. Vous pourrez
d&eacute;sactiver l'envoi de messages &agrave; votre adresse pendant vos
vacances et configurer le serveur de messagerie pour reprendre l'envoi
une fois vos vacances termin&eacute;es. Pour cela, utilisez la commande
: 
<pre>
     set ALL nomail-14d
</pre>
Cette commande aura pour effet de suspendre votre inscription &agrave;
toutes les listes de diffusion pour une p&eacute;riode de 14 jours (<tt>-
14d</tt>). Pour plus de d&eacute;tails et d'options, consultez la 
<a href="http://lists.openbsd.org/cgi-bin/mj_wwwusr?&user=&passw=&list=GLOBAL&func=help&extra=overview">page
pr&eacute;sentant une vue d'ensemble de Majordomo</a>.


<h3>R&eacute;sum&eacute;s</h3>
Si vous pr&eacute;f&eacute;rez recevoir un r&eacute;sum&eacute; (dit
aussi "digest", listing consolid&eacute; de tous les messages pour une
p&eacute;riode donn&eacute;e), au lieu de recevoir les messages
individuellement en "temps r&eacute;el", vous pouvez utiliser les
commandes :

<pre>
     set misc digest-daily
     set source-changes digest-weekly
</pre>
pour avoir des r&eacute;sum&eacute;s quotidiens de la liste <b>misc</b>,
et des r&eacute;sum&eacute;s hebdomadaires de la liste <b>source-
changes</b>. Vous pouvez utiliser plusieurs commandes dans un seul
message envoy&eacute; &agrave; Majordomo.


<a name="OtherLists"></a>
<h2><font color="#e00000">Autres Listes De Diffusion</font></h2>
<p>
Les sympathiques gars de <a
href="http://www.squish.net/openbsd/">squish.net</a> maintiennent des
listes de diffusion avec des r&eacute;sum&eacute;s quotidiens et
hebdomadaires des listes <strong>source-changes</strong> et <b>ports-
changes</b> d'OpenBSD. Tr&egrave;s utile si vous n'aimez pas le gros
trafic de ces listes.

<p> 
Les singes intelligents de 
<a href="http://www.monkey.org/openbsd-mobile/">monkey.org</a> 
maintiennent la liste <strong>openbsd-mobile</strong> pour ceux qui
utilisent OpenBSD sur des ordinateurs portables. Pour s'abonner : <br> 
echo subscribe | mail openbsd-mobile- request@monkey.org

<p> 
L'insomniaque de <a
href="http://www.benzedrine.cx/pf/">benzedrine.cx</a> maintient la liste
<strong>pf</strong> pour les utilisateurs du filtre de paquets
d'OpenBSD. Pour s'abonner : <br>
echo subscribe | mail pf-request@benzedrine.cx

<p>
Une liste de diffusion pour les responsables de mirroirs FTP, Web,
AnonCVS et CVSup d'OpenBSD, est disponible sur 
<a href="http://rt.fm/openbsd-mirrors/">rt.fm</a>.

<a name="nonEnglish"></a>
<h2><font color="#e00000">Listes Non-Anglophones</font></h2>

Plusieurs listes de diffusion non-anglophones concernant OpenBSD sont
disponibles s&eacute;par&eacute;ment. Voici une liste des listes connues
&agrave; ce jour :

  <!-- 
 VEILLEZ A GARDER CETTE LISTE CLASSEE PAR ORDRE ALPHABETIQUE
 SAUF POUR LES TRADUCTIONS OU ELLE DEVRA ETRE CLASSE EN FONCTION
 DE VOTRE LANGUE
 -->
<!--
<p>
Chinese:
<b>openbsd@shellhung.org</b>
<br>To subscribe, visit the URL at:
<a href="http://www.shellhung.org/mailman/listinfo/openbsd/">http://www.shellhung.org/mailman/listinfo/openbsd/</a>.
-->

<p>
Allemand :
<b>liste@openbsd.de</b>
<br> Pour vous abonner, allez &agrave; l'adresse suivante : 
<a href="https://www.openbsd.de/listen/listinfo/liste">https://www.openbsd.de/listen/listinfo/liste</a>.

<p>
Espagnol :
<b>misc@openbsd.org.mx</b>, maintenue au Mexique.
<br>Pour vous abonner, envoyez un message &agrave;
<a href="mailto:misc-request@openbsd.org.mx?body=subscribe">misc-request@openbsd.org.mx</a>. 
<p>
Fran&ccedil;ais :
<b>openbsd-france-misc@openbsd-france.org</b>
<br> Pour vous abonner, allez &agrave; l'adresse suivante : 
<a href="http://www.openbsd-france.org/mailing-list.php">http://www.openbsd-france.org/mailing-list.php</a>.

<p>
Gr&egrave;c :
<b>openbsd@bsd.gr</b>
<br>Pour vous abonner, allez &agrave; l'adresse suivante :
<a href="http://www.bsd.gr/mailman/listinfo/openbsd/">http://www.bsd.gr/mailman/listinfo/openbsd/</a>.

<p>
Italien :
<a href="http://www.sikurezza.org/">sikurezza.org</a>, un portail
s&eacute;curit&eacute; non-commercial en Italien an Italian language
h&eacute;berge
<b>openbsd@sikurezza.org</b>.
<br>Pour vous abonner, il suffit d'envoyer un message vide &agrave; <a
href="mailto:openbsd-subscribe@sikurezza.org">openbsd-subscribe@sikurezza.org</a>.

<p>
Japonais : Pour plus d'informations, allez &agrave; l'adresse suivante :
<a href="http://www.openbsd.ics.nara-wu.ac.jp/wakakusa">http://www.openbsd.ics.nara-wu.ac.jp/wakakus</a>

<p>
Polonais : Pour vous inscrire, envoyez un message &agrave;
<a href="mailto:OpenBSD-request@bsdzine.org">OpenBSD-request@bsdzine.org</a>.

<p>
Portuguais :
<b>openbsd@neei.uevora.pt</b>
<br> Pour vous abonner, allez &agrave; l'adresse suivante : 
<a href="http://neei.uevora.pt/mailman/listinfo/openbsd/">http://neei.uevora.pt/mailman/listinfo/openbsd/</a>.

<p>
Russe : 
<b>openbsd@openbsd.ru</b>
<br>Pour vous abonner, envoyer un message &agrave;
<a href="mailto:minimalist@openbsd.ru">minimalist@openbsd.ru</a> avec
l'objet &quot;<b>subscribe openbsd</b>&quot;.

<p>
Slovaque :
Pour vous inscrire, visitez la page 
<a href="http://obsd.17slon.org/mailinglist.php"
>http://obsd.17slon.org/mailinglist.php</a>

<p> 
Tch&egrave;que : 
<b>users@openbsd.cz</b> 
<br> Pour vous abonner, allez &agrave; l'adresse suivante : 
<a href="http://openbsd.cz/mailman/listinfo/users/">http://openbsd.cz/mailman/listinfo/users/</a>. 

<p>
<a name="Archives"></a>
<h2><font color="#e00000">Archives des Listes de Diffusion :</font></h2>
Ces archives de listes de diffusion ne sont pas g&eacute;r&eacute;es par
le projet OpenBSD. Prenez le temps d'en consultez quelques unes --
chacune est l&eacute;g&eacute;rement diff&eacute;rente des autres et
poss&egrave;de des capacit&eacute;s de recherche diff&eacute;rentes. Si
vous ne trouvez pas la r&eacute;ponse dans une archive, essayez une
autre.

<p>
Des moteurs de recherche g&eacute;n&eacute;raux, tels que <a
href="http://www.google.com">Google</a> sont aussi tr&egrave;s efficaces
pour trouver des r&eacute;ponses &agrave; des questions OpenBSD.

<ul>
<li><a href="http://www.sigmasoft.com/~openbsd/">USA</a>
<!-- seemingly not working any longer
<li><a href="http://www.geocrawler.com/lists/4/OpenBSD">Geocrawler Archive</a>
-->
<li><a href="http://www.monkey.org/openbsd/">Les primates de monkey.org</a>
<li><a href="http://marc.theaimsgroup.com/">MARC</a>
<li><a href="http://bsdsearch.com/eao/phorum/index.php?f=2">BSDSearch.com</a>
<li><a href="http://www.netsys.com/archives.html">@netsys.com</a>
<li>Neohapsis has a
<a href="http://archives.neohapsis.com/archives/openbsd/">m&eacute;lange 
d'archives pour tech@, misc@ and ports@</a> et un
<a
href="http://archives.neohapsis.com/archives/openbsd/cvs/">m&eacute;lange 
d'archives pour les changements effectu&eacute;s dans l'arborescence des
sources (CVS)</a>
</ul>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 
alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: mail.html,v 1.83 ]<br>
$Translation: mail.html,v 1.18 2004/09/06 16:24:24 saad Exp $<br>
$OpenBSD: mail.html,v 1.16 2004/09/06 16:41:27 saad Exp $
</small>

</body>
</html>
