<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Listes de diffusion OpenBSD</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "page des listes de diffusion OpenBSD">
<meta name= "keywords"      content= "openbsd,mail">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "Ce document est sous copyright 2003
OpenBSD.">
</head>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#23238E">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" 
src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Listes de diffusion</font></h2>
<hr>
Les listes de diffusion sont des moyens importants pour la communication entre 
les utilisateurs et les d&eacute;veloppeurs OpenBSD. A l'exception de <i>announce</i>, 
les listes ne sont pas mod&eacute;r&eacute;es. Nous restreignons d&eacute;lib&eacute;rement 
le nombre de listes de diffusion diff&eacute;rentes. Cela aide &agrave; r&eacute;duire 
la quantit&eacute; d'envois dupliqu&eacute;s et &agrave; s'assurer que l'information 
soit distribu&eacute;e &agrave; une large audience. 
<p>
<h3><font color="#e00000">Netiquette</font></h3>
<p>
Soyez pr&eacute;venant &agrave; l'&eacute;gard des autres personnes inscrites
aux listes de diffusion.
<dl>
<dt><u>Texte simple, 72 caract&egrave;res par ligne</u>
  <dd>Beaucoup de personnes inscrites lisent leur courrier avec des clients en 
    mode texte (mail(1), emacs) et pour eux, les messages compos&eacute;s en HTML 
    ou avec des lignes de plus de 72 caract&egrave;res sont souvent illisibles. 
    La plupart des listes de diffusion OpenBSD d&eacute;pouillent les messages 
    de leur contenu MIME avant de les envoyer au reste de la liste. Si vous n'utilisez 
    pas du texte simple, vos messages seront recompos&eacute;s ou, si ils ne peuvent 
    pas l'&ecirc;tre, seront sommairement rejet&eacute;s. La seule liste qui autorise 
    les attachements est la liste <em>ports</em>. Ils seront supprim&eacute;s 
    dans les messages adress&eacute;s aux autres listes de diffusion. 
  <dt><u>Faites votre travail avant de poster</u>
  <dd>Si vous avez une question d'installation, assurez-vous d'avoir lu les documents 
    appropri&eacute;s tels que les fichiers INSTALL.* situ&eacute;s dans les r&eacute;pertoires 
    d'installation sur le FTP, la <a href="../faq/fr/index.html">FAQ</a> et les manuels 
    appropri&eacute;s (commencez avec <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&amp;sektion=8">afterboot(8)</a>). 
    Assurez-vous d'inclure les d&eacute;tails (version, mat&eacute;riel, <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=dmesg&amp;sektion=8">dmesg(8)</a>) 
    qui vont aider &agrave; la r&eacute;solution de votre probl&egrave;me. Nous 
    vous aiderons, mais nous ne voulons pas vous priver d'une exp&eacute;rience 
    d'apprentissage enrichissante. 
  <dt><u>Incluez un Objet utile</u>
  <dd>Les messages sans Objet seront envoy&eacute;s au responsable de la liste 
    et donc, mettrons plus de temps &agrave; &ecirc;tre distribu&eacute;s. Inclure 
    un Objet appropri&eacute; au message va assurer le fait qu'un plus grand nombre 
    de personnes va lire ce que vous avez &eacute;crit. De plus, &eacute;vitez 
    l'emploi abusif des majuscules dans votre Objet. 
  <dt><u>R&eacute;duisez votre signature</u>
  <dd>Limitez la taille de votre signature &agrave; un nombre raisonnable de lignes. 
    Les messages adress&eacute;s aux listes contiennent rarement des donn&eacute;es 
    confidentielles au point de n&eacute;cessiter une signature PGP, les cartes 
    de visites automatiques sont &eacute;galement g&ecirc;nantes. 
  <dt><u>Gardez le sujet</u>
<dd>Gardez l'Objet de votre message appropri&eacute; aux utilisateurs
d'OpenBSD.</dl>

<p>
<h3><font color="#e00000">Messages non sollicit&eacute;s</font></h3>
<p> Les messages non sollicit&eacute;s sont filtr&eacute;s mais il arrive parfois 
  qu'un message non sollicit&eacute; passe au travers des mailles du filet. Si 
  vous recevez du spam via une des listes de diffusion OpenBSD, vous avez la possibilt&eacute; 
  de le signaler &agrave; <a href="http://spamcop.net">spamcop</a>. De mani&egrave;re 
  g&eacute;n&eacute;rale, vous ne devez pas en envoyer une copie au responsable 
  de la liste &eacute;tant donn&eacute; qu'il y ait des chances qu'il l'ait d&eacute;j&agrave; 
  remarqu&eacute;. Notez bien que se plaindre d'un message non sollict&eacute; 
  dans les listes est improductif et g&eacute;n&egrave;re plus de trafic que le 
  message non sollicit&eacute; lui-m&ecirc;me... <br>
  Les listes de diffusion OpenBSD refusent les courriers venant des h&ocirc;tes 
  repris sur les listes noires de <a href="http://www.mail-abuse.org/rbl/">MAPS 
  RBL</a>, <a href="http://www.mail-abuse.org/dul/">MAPS Dialup</a> ou <a href="http://www.mail-abuse.org/rss/">MAPS 
  RSS</a>. En outre, le serveur des listes de diffusion utilise des r&egrave;gles 
  bas&eacute;es sur des expressions r&eacute;guli&egrave;res afin de refuser tout 
  courrier contenant des indicateurs habituels de messages non sollicit&eacute;s. 
<h3><font color="#e00000">Les Listes de Diffusion</font></h3>
<p> Pour s'inscrire &agrave; une liste particuli&egrave;re, envoyez un courrier 
  &agrave; <a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> avec 
  comme contenu &quot;<strong>subscribe nom-de-la-liste-de-diffusion</strong>&quot;. 
<dl>
<dt><strong>announce</strong>
  <dd>Annonces importantes. Cette liste de faible trafic est excellente pour les 
    personnes qui d&eacute;sirent recevoir des nouvelles occasionnelles con&ccedil;ernant 
    le projet. 
  <dt><strong>security-announce</strong>
  <dd>Annonces de s&eacute;curit&eacute;. Cette liste de faible trafic re&ccedil;oit 
    les rapports de s&eacute;curit&eacute; OpenBSD et des liens vers les correctifs 
    d&egrave;s que ceux-ci deviennent disponibles. 
  <dt><strong>misc</strong>
  <dd>Questions et r&eacute;ponses de l'utilisateur, questions g&eacute;n&eacute;rales. 
    Cette liste est la plus active. Veillez &agrave; <a
href="../faq/fr/index.html">lire 
    la FAQ</a> ainsi que les documents d'installation avant de poster un message. 
  <dt><strong>tech</strong>
  <dd>Sujets techniques pour d&eacute;veloppeurs OpenBSD et utilisateurs aguerris. 
    <strong>Veillez</strong> &agrave; diriger les questions de types 'nouvel utilisateur' 
    et installation vers <em>misc</em>. <strong>Veillez &agrave; ne pas faire</strong> 
    d'envois multiples vers <em>misc</em> et <em>tech</em> en m&ecirc;me temps. 
  <dt><strong>bugs</strong>
<dd><a href="../report.html">Rapports de bogues</a> envoy&eacute;s via 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sendbug&amp;sektion=1">sendbug(1)</a> et discussions de suivi.
<dt><strong>source-changes</strong>
  <dd>Syst&egrave;me automatique de courriers concernant les changements effectu&eacute;s 
    dans l'arborescence des sources (CVS). 
  <dt><strong>ports</strong>
  <dd>Discussions concernant l'utilisation et la contribution aux 'ports'. 
  <dt><strong>ports-changes</strong>
  <dd>Syst&egrave;me automatique de courriers concernant les changements effectu&eacute;s 
    dans les ports dans l'arborescence des sources (CVS). 
  <dt><strong>ipv6</strong>
  <dd>Discussions concernant la version 6 d'IP sous OpenBSD. 
  <dt><strong>advocacy</strong>
<dd>Promouvoir l'utilisation d'OpenBSD. Les discussions non-techniques de
<em>misc</em> sont souvent redirig&eacute;es ici.
<dt><strong>smp</strong>
  <dd>Discussions concernant la conception et l'impl&eacute;mentation du support 
    multi-processeur dans OpenBSD. 
</dl>

<p>
OpenBSD maintient &eacute;galement plusieurs listes sp&eacute;cifiques 
&agrave; certaines architectures et projets sp&eacute;ciaux. Ces
listes sont publiques dans le sens ou quiconque peut s'y abonner mais il
faut bien garder &agrave; l'esprit qu'elles sont principalement 
destin&eacute;es aux d&eacute;veloppeurs et aux testeurs. En restant dans 
le m&ecirc;me esprit, ouvert, qu'OpenBSD, il n'y a pas de listes de diffusion 
priv&eacute;es.<br>
Si vous d&eacute;sirez re&ccedil;evoir une liste compl&egrave;te des
listes de diffusion disponibles sur openbsd.org, envoyez un courrier &agrave; 
<a href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> avec la
commande "<strong>lists</strong>" dans le corps de votre message.

<p> Si vous avez besoin d'aide, envoyez un courrier &agrave; <a 
href="mailto:majordomo@OpenBSD.org">majordomo@OpenBSD.org</a> avec en guise de 
  corps, la commande "<strong>help</strong>" et vous recevrez une r&eacute;ponse 
  d&eacute;crivant toutes les options qui vous sont propos&eacute;es. Votre nom 
  de domaine <strong>DOIT</strong> pouvoir &ecirc;tre r&eacute;solu sinon le mail 
  n'arrivera pas! 
<p> Les sympathiques gars de <a 
href="http://www.squish.net/openbsd/">squish.net</a> maintiennent des listes de 
  diffusion avec des r&eacute;sum&eacute;s quotidiens et hebdomadaires de la liste 
  <strong>source-changes</strong> d'OpenBSD. Tr&egrave;s utile si vous n'aimez 
  pas le gros trafic de cette liste. 
<p> Les singes intelligents de <a 
href="http://www.monkey.org/openbsd-mobile/">monkey.org</a> maintiennent la liste 
  <strong>openbsd-mobile</strong> pour ceux qui utilisent OpenBSD sur des ordinateurs 
  portables. Pour s'abonner : <br>
echo subscribe | mail openbsd-mobile-request@monkey.org 

<p> L'insomniaque de <a href="http://www.benzedrine.cx/pf/">benzedrine.cx</a> 
  maintient la liste <strong>pf</strong> pour les utilisateurs du filtre de paquets 
  d'OpenBSD. Pour s'abonner : <br>
echo subscribe | mail pf-request@benzedrine.cx

<p>
Une liste de diffusion pour les reponsables de mirroirs FTP, Web, AnonCVS et
CVSup d'OpenBSD, est disponible sur <a 
href="http://rt.fm/openbsd-mirrors/">rt.fm</a>.

<h3><font color="#e00000">Listes Non-Anglophones</font></h3>

<p> Plusieurs listes de diffusion non-anglophones concernant OpenBSD sont disponibles 
  s&eacute;par&eacute;ment. Voici une liste des listes connues &agrave; ce jou 
  r: 
  <!-- 
 VEILLEZ A GARDER CETTE LISTE CLASSEE PAR ORDRE ALPHABETIQUE
 SAUF POUR LES TRADUCTIONS OU ELLE DEVRA ETRE CLASSE EN FONCTION
 DE VOTRE LANGUE
 -->
<p> Chinois : <strong>openbsd@shellhung.org</strong> <br>
  Pour s'abonner, allez sur:
<a href="http://www.shellhung.org/mailman/listinfo/openbsd/">http://www.shellhung.org/mailman/listinfo/openbsd/</a>.

<p> Espagno l: <strong>misc@openbsd.org.mx</strong>, maintenue au Mexique. <br>
  Pour s'abonner, envoyez un courrier vide &agrave; <a 
href="mailto:misc-request@openbsd.org.mx">misc-request@openbsd.org.mx</a>. 

<p> Grec : <strong>openbsd@bsd.gr</strong> <br>
  Pour s'abonner, envoyez un courrier &agrave;
<a href="mailto:majordomo@bsd.gr">majordomo@bsd.gr</a> avec comme contenu
&quot;<strong>subscribe openbsd</strong>&quot;.

<p> Italien : <a href="http://www.sikurezza.org/">sikurezza.org</a>, un portail 
  italien non-commercial de s&eacute;curit&eacute; h&eacute;berge <strong>openbsd@sikurezza.org</strong>. 
  <br>
  Pour s'abonner, envoyez un courrier vide &agrave; <a 
href="mailto:openbsd-subscribe@sikurezza.org">openbsd-subscribe@sikurezza.org</a>.

<p> Japonais : Allez sur : <a href="http://www.openbsd.ics.nara-wu.ac.jp/wakakusa">http://www.openbsd.ics.nara-wu.ac.jp/wakakus</a> 
  pour de plus amples informations. 
<p> Polonais : Pour s'abonner, envoyez un courrier &agrave; <a 
href="mailto:OpenBSD-request@bsdzine.org">OpenBSD-request@bsdzine.org</a>. 
<p> Portuguais : <strong>openbsd@neei.uevora.pt</strong> <br>
  Pour s'abonner, allez sur: <a 
href="http://neei.uevora.pt/mailman/listinfo/openbsd/">http://neei.uevora.pt/mailman/listinfo/openbsd/</a>.

<p> Russe : <strong>openbsd@openbsd.ru</strong> <br>
  Pour s'abonner, envoyez un courrier &agrave; <a 
href="mailto:minimalist@openbsd.ru">minimalist@openbsd.ru</a> avec un Objet 
&quot;<strong>subscribe openbsd</strong>&quot;.

<p> Tch&egrave;que : <strong>users@openbsd.cz</strong> <br>
  Pour s'abonner, allez sur : <a href="http://openbsd.cz/mailman/listinfo/users/">http://openbsd.cz/mailman/listinfo/users/</a>. 
<p>
<h3><font color="#e00000">Archives des Listes de Diffusion:</font></h3>
<ul>
<li><a href="http://www.sigmasoft.com/~openbsd/">Etas-Unis</a>
<!-- 404
<li><a href="http://www.tryc.on.ca/obsd-lists.html">Canada</a>
 -->
<li><a href="http://www.geocrawler.com/lists/4/OpenBSD">Archive Geocrawler</a>
<!-- unknown server
<li><a href="http://lists.openresources.com/OpenBSD/">Open Resources</a>
 -->
<li><a href="http://www.monkey.org/openbsd/">Les primates de monkey.org</a>
<li><a href="http://marc.theaimsgroup.com/">MARC</a>
<li><a href="http://bsdsearch.com/eao/phorum/index.php?f=2">BSDSearch.com</a>
<li><a href="http://www.netsys.com/archives.html">@netsys.com</a>
<li>Neohapsis &agrave; un
<a href="http://archives.neohapsis.com/archives/openbsd/">m&eacute;lange 
d'archives pour tech@, misc@ and ports@</a> et un 
<a href="http://archives.neohapsis.com/archives/openbsd/cvs/">m&eacute;lange 
d'archives pour les changements effectu&eacute;s dans l'arborescence des
sources (CVS)</a>
</ul>

<hr>
<a href="index.html"><img height=24 width=24 src="../back.gif" border=0 
alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: mail.html,v 1.62]<br>
$Translation: mail.html,v 1.1 2003/02/27 16:25:51 saad Exp $<br>
$OpenBSD: mail.html,v 1.1 2003/02/27 18:17:52 jufi Exp $
</small>

</body>
</html>
