<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Politique de Copyright d'OpenBSD</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="description" content="la page de politique de copyright d'OpenBSD">
<meta name="keywords" content="openbsd,copyright">
<meta name="distribution" content="global">
<meta name="copyright" content="Ce document est sous copyright 1996-2002 d'OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141"
src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Politique de Copyright</font></h2>
<hr>

<ul>
<li><h3><font color="#e00000">Objectif</font></h3><p>
La loi sur le copyright est complexe, bien que la politique
d'application du projet OpenBSD soit simple &agrave; son &eacute;gard.
OpenBSD cherche &agrave; maintenir l'esprit originel des copyright du
Berkeley Unix.

<p>
OpenBSD existe sous sa forme actuelle gr&acirc;ce &agrave; l'exemple
illustr&eacute; par le groupe "Computer Systems Research Group" de
Berkeley et les batailles que son fondateurs, et d'autres, ont du mener
pour disposer d'une distribution de sources Unix relativement libres.

<p>
La capacit&eacute; &agrave; disposer d'un Unix Berkeley
<strong>librement distribuable</strong> permet d'avancer sur une base
comp&eacute;titive par rapport aux autres syst&egrave;mes
d'exploitation, mais d&eacute;pend directement de la volont&eacute; des
diff&eacute;rents groupes de d&eacute;veloppement qui &eacute;changent
des sources, entre-eux et entre projets. Comprendre les implications
l&eacute;gales qui entourrent le concept de "copyright" est fondamental
afin de pouvoir &eacute;changer et redistribuer du code source, et somme
toute de promouvoir la coop&eacute;rations des personnes
impliqu&eacute;es.

<p>

<li><h3><font color="#e00000">Le Copyright Berkeley</font></h3><p>
Le copyright Berkeley ne pose aucune restriction sur l'usage
priv&eacute; ou commercial des logiciels qu'il concerne. Le seul besoin
impos&eacute; est la mention du copyright originel couvrant le logiciel,
dans toutes ses versions distribu&eacute;es, et citer le ou les auteurs
des sources mais <strong>uniquement</strong> dans la documentation.

<p>
Par exemple :
<p>
<pre>
 * Copyright (c) 1982, 1986, 1990, 1991, 1993
 *      The Regents of the University of California.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. All advertising materials mentioning features or use of this software
 *    must display the following acknowledgement:
 *      This product includes software developed by the University of
 *      California, Berkeley and its contributors.
 * 4. Neither the name of the University nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
</pre>
<p>
Berkerley a annul&eacute; la 3&egrave;me clause (clause de
publicit&eacute;) le 22 Juillet 1999. Les copies en mot pour mot de la
licence Berkeley dans l'arborescence OpenBSD ne contiennent plus cette
clause. De plus, plusieurs licences tierces de type BSD ne contiennent
que les deux premi&egrave;res clauses.

<p>
Comme le copyright couvrant OpenBSD n'impose pas de conditions allant
au-del&agrave; de celles du copyright Berkeley, OpenBSD esp&egrave;re
pouvoir distribuer ses sources avec la m&ecirc;me libert&eacute; et
densit&eacute; de propagation que les distributions Berkeley. De la
m&ecirc;me mani&egrave;re, OpenBSD ne peut permettre d'int&eacute;grer
dans sa distribution des &eacute;l&eacute;ments aux licences plus
restrictives que le copyright de Berkeley, ou bien diff&eacute;rencier
ces mat&eacute;riaux et ne proposer leur obtention que de mani&egrave;re
s&eacute;par&eacute;e : ainsi OpenBSD est globalement libre de
distribution, mais certains composants ne peuvent l'&ecirc;tre.

<p>

<li><h3><font color="#e00000">La loi de Copyright</font></h3>

<p>
Bien que le sujet principal couvert par le copyright d&eacute;passe le
cadre de ce document, certaines bases doivent &ecirc;tre acquises pour
une bonne compr&eacute;hension. Sous sa forme actuelle, la loi de
copyright donne des droits implicites lors de la cr&eacute;ation d'une
nouvelle oeuvre &agrave; son cr&eacute;ateur, sauf mention contraire
exprim&eacute;e par ce dernier. En g&eacute;n&eacute;ral, le copyright
ne s'applique qu'au cr&eacute;ateur et aux nouvelles oeuvres et non les
mat&eacute;riaux sur lesquels sont &eacute;ventuellement bas&eacute;s
ses nouvelles cr&eacute;ations, ni les portions int&eacute;gr&eacute;es
qui proviennent de la cr&eacute;ation d'un autre auteur.

<p>
La loi sur le copyright admet trois cat&eacute;gories
g&eacute;n&eacute;rales de travaux :

<dl>
<dt>Une oeuvre originelle
<dd>Une oeuvre nouvelle qui n'est pas d&eacute;riv&eacute;e d'une oeuvre
    existante.
<dt>Une oeuvre d&eacute;riv&eacute;e
<dd>Une oeuvre d&eacute;riv&eacute;e d'une oeuvre d&eacute;j&agrave;
    existante, ou un ajout sur une oeuvre existante.
<dt>Une compilation
<dd>Une oeuvre qui est une compilation d'oeuvres d&eacute;j&agrave;
    existantes, ou de nouvelles oeuvres. </dl>
<p>
Le concept fondamental est celui de la primaut&eacute; du copyright, ce
qui signifie qu'un copyright sur une oeuvre d&eacute;riv&eacute;e d'une
autre ne s'applique qu'&agrave; l'extension ou la nouvelle forme de
l'oeuvre : le copyright originel de la premi&egrave;re oeuvre ne peut
&ecirc;tre affect&eacute; d'aucune mani&egrave;re, et les droits du
d&eacute;tenteur originel sont maintenus. Un copyright portant sur une
compilation ne modifie donc pas le copyright de chaque oeuvre qu'il
comporte : seule la compilation comme "nouvelle entit&eacute;" est
dot&eacute;e de son copyright propre, tandis que chaque oeuvre qu'il
contient d&eacute;tient le copyright de son auteur.

<p>
Comprendre que les copyrights sont une protection globale d&eacute;finie
par le droit international et des formes nationales propre &agrave;
chaque pays est vital. Les "notices de copyright" qui accompagnent les
codes sources ne sont pas des copyright au sens propre mais des notices
qui signifient que ces sources font partie d'une oeuvre qui elle, dans
sa globalit&eacute; (et tout son ensemble de sources) fait l'objet d'un
copyright. Ces notices sont g&eacute;n&eacute;ralement associ&eacute;es
avec une licence d'utilisation qui d&eacute;taille les droits et
restrictions qui s'appliquent &agrave; vous si vous d&eacute;cidez
d'utiliser un logiciel, sous le couvert de la loi de copyright et des
mentions qui pr&eacute;cisent le statut de l'auteur et du distributeur
vis &agrave; vis des garanties qui concernent (ou ne concernent pas) les
mat&eacute;riaux et leur utilisation.

<p>

<li><h3><font color="#e00000">Les permissions, une face cach&eacute;e</font></h3><p>

Comme le copyright provient de la cr&eacute;ation d'un nouveau travail,
une nouvelle "oeuvre" et non d'une forme d'enregistrement, il faut qu'il
existe un moyen pratique d'&eacute;tendre les permissions d'une oeuvre
existante au-del&agrave; de ce que permettent les mentions de "fair use"
contenus dans la loi de copyright.

<p>
Cette permission prend g&eacute;n&eacute;ralement la forme d'une
"licence" ou "notice de distribution" int&eacute;gr&eacute;e dans
l'oeuvre et qui attribue &agrave; l'utilisateur des droits
suppl&eacute;mentaires &agrave; ceux qui font d&eacute;j&agrave; partie
du copyright, avec une vari&eacute;t&eacute; de conditions. Nous avons
&agrave; une extr&eacute;mit&eacute; les logiciels et sources dit du
"domaine public" o&ugrave; le cr&eacute;ateur annonce explicitement
qu'il n'impose aucune restriction sur les usages de son oeuvre. Ce type
de distribution se d&eacute;gage &eacute;galement de toute
responsabilit&eacute; (normalement partie int&eacute;grante du
copyright). Ces clauses n'apportent pas plus de droits, et n'imposent
pas de restrictions discriminatoires ou peu pratiques pour utiliser
l'oeuvre.

<p>
Une nouvelle fois, il y a un point important &agrave; comprendre : les
conditions de distribution ne s'appliquent qu'&agrave; une portion de
l'oeuvre d'origine. Un auteur dont l'oeuvre d&eacute;rive d'une
premi&egrave;re oeuvre ne peut pas imposer de restrictions en conflit
avec les droits du copyright originel, ni m&ecirc;me offrir des droits
suppl&eacute;mentaires en conflit avec le prime copyright.

<p>
Comme le copyright proc&egrave;de de la cr&eacute;ation d'une oeuvre et
non d'un texte ou d'un processus d'enregistrement de l'oeuvre, retirer
ou modifier une notice de copyright et ses termes associ&eacute;s n'a
aucune incidence sur l'existence et la port&eacute;e du copyright de
l'oeuvre concern&eacute;e. De la m&ecirc;me mani&egrave;re, ajouter des
termes ou conditions en conflit avec les termes et conditions
originelles n'a aucune primaut&eacute; : cela ne fait qu'ajouter un
doute sur les droits suppos&eacute;s de la personne qui a apport&eacute;
ces ajouts, et la confusion quand aux usages possibles de la nouvelle
oeuvre n'en seront que plus importants.

<p>
Enfin, les distributions sont g&eacute;n&eacute;ralement li&eacute;es
aux mat&eacute;riaux qui sont utilis&eacute;s pour leur propagation.
Ceci signifie que si l'auteur (la source) d'une oeuvre donne certaines
permissions, ces derni&egrave;res s'appliquent telles quelles, sans
discrimination, &agrave; toute personne qui d&eacute;tient de
mani&egrave;re l&eacute;gitime un exemplaire de l'oeuvre. Une fois une
permission accord&eacute;e par le d&eacute;tenteur d'un copyright, ce
dernier ne peut la modifier de mani&egrave;re r&eacute;tro-active en
expliquant qu'un individu ou que certaines utilisations de son logiciel
ne "sont plus" autoris&eacute;es. Si la licence ou les permissions sont
modifi&eacute;es, elles ne pourront affecter que les nouvelles formes de
l'oeuvre. Ainsi, si le cr&eacute;ateur d'un logiciel librement
distribu&eacute; veut passer &agrave; un mode de distribution
"commercial" et ferm&eacute;, il ne peut pas retirer aux gens qui
utilisent son logiciel avant sa version commerciale les droits dont ils
disposent : ces droits ne peuvent &ecirc;tre r&eacute;voqu&eacute;s, y
compris par le d&eacute;tenteur du copyright une fois la distribution
r&eacute;alis&eacute;e. Il ne peut que modifier les droits de ses
oeuvres futures.

<p>

<li><h3><font color="#e00000">Cas particuliers</font></h3><p>

Cette section tente de couvrir la position d'OpenBSD vis-&agrave;-vis de
copyright que l'on rencontre souvent.

<p>

<dl>
<dt>Berkeley<dd><p>
Le copyright Berkeley est consid&eacute;r&eacute; par le projet OpenBSD
comme son mod&egrave;le de copyright. Il permet &agrave; l'auteur de
conserver des droits &eacute;l&eacute;mentaires tout en autorisant
l'usage de son oeuvre en imposant un minimum de restrictions. Les
mat&eacute;riaux couverts par une licence Berkeley ou dont la licence
est consid&eacute;r&eacute;e comme proche de ce dernier peuvent
&ecirc;tre incorpor&eacute;s dans OpenBSD.

<p>

<dt>AT&amp;T<dd><p>
Suivant son accord avec AT&amp;T, Berkeley a inclus une note de
copyright AT&amp;T dans certains fichiers de 4.4BSD lite et lite2. Les
clauses de cette licence sont identiques &agrave; celles de la licence
Berkeley classique.
<p>

<dt>Caldera<dd><p>
Caldera (connue maintenant sous le nom de SCO group) est le
propri&eacute;taire actuel des copyrights sur le clode Unix. Le 22
Janvier 2002, le code Unix d'origine (versions 1 &agrave; sept, y
compris 32V) a &eacute;t&eacute; "lib&eacute;r&eacute;" par Caldera. Le
code est d&eacute;sormais disponible sous une licence 
<a href="http://www.tuhs.org/Archive/Caldera-license.pdf">
de type BSD &agrave; 4 clauses</a>. Par cons&eacute;quence,
il est maintenant possible d'int&eacute;grer du vrai code Unix &agrave;
OpenBSD (m&ecirc;me si ce code est assez ancien et n&eacute;cessite
plusieurs modifications significatives pour le mettre &agrave; jour).
<p>

<dt>DEC, Sun et d'autres fabriquants<dd>

<p>
En g&eacute;n&eacute;ral, OpenBSD ne comporte aucun mat&eacute;riau sous
copyright d'un fabriquant de mat&eacute;riel ou d'un logiciel
quelconque. Ces &eacute;l&eacute;ments ne peuvent &ecirc;tre
incorpor&eacute;s au sein du projet que si l'auteur a autoris&eacute;
l'usage de ses sources sans aucune restriction ou conditions, avec des
termes similaires ou identiques &agrave; ceux du copyright Berkeley, ou
bien si le travail est le fruit d'un employ&eacute; et que son employeur
mentionne de mani&egrave;re explicite et pr&eacute;cise que son travail
est libre de toute condition quand &agrave; son usage.

<p>

<dt>Carnegie-Mellon (CMU, Mach)<dd><p>
Le copyright de Carnegie-Mellon est similaire &agrave; celui de
Berkeley, avec pour exception que ce copyright conseille que toute
oeuvre d&eacute;riv&eacute;e soit &eacute;galement plac&eacute;e sous
copyright Carnegie-Mellon. Comme il s'agit seulement d'une
recommandation et non d'une condition absolue, ces mat&eacute;riaux
peuvent &ecirc;tre incorpor&eacute;s dans OpenBSD. Il doit &ecirc;tre
not&eacute; que les versions existantes de Mach font encore aujourd'hui
l'objet de copyright AT&T ce qui emp&ecirc;che toute distribution des
sources de Mach.

<p>

<dt>Apache<dd><p>
Le copyright Apache est proche du copyright Berkeley, mais il stipule
que les produits d&eacute;riv&eacute;s ne peuvent contenir le mot
"Apache" dans leur nom. L'objectif de cette clause est d'emp&ecirc;cher
une situation o&ugrave; une tierce partie distribuerait une version
diff&eacute;rente d'Apache en conservant le m&ecirc;me nom, ce qui
risque de provoquer une confusion dans l'esprit des utilisateurs. Comme
OpenBSD est plus une <strong>compilation</strong> de logiciels et non
une oeuvre <strong>d&eacute;riv&eacute;e</strong> ce type de copyright
ne pose aucun probl&egrave;me.
<p>

<dt>ISC<dd><p>
Le copyright ISC est fonctionnellement &eacute;quivalent &agrave; une
licence BSD &agrave; deux clauses sans le langage rendu non
n&eacute;cessaire par la convention Berne. C'est la licence
pr&eacute;fer&eacute;e pour le nouveau code incorpor&eacute; &agrave;
OpenBSD. Une licence type est inclue &agrave; l'arborescence du code
source dans le fichier <tt>/usr/src/share/misc/license.template</tt>.
<p>

<dt>GNU General Public License, GPL, LGPL, copyleft, etc.<dd><p>
La licence GNU impose comme restriction que les codes sources soient
distribu&eacute;es ou disponibles pour tout oeuvre qui d&eacute;rive de
code sous copyright GNU.

<p>
Bien qu'il s'agisse d'une noble strat&eacute;gie de distribution et de
partage de logiciels, cette condition est consid&eacute;r&eacute;e comme
non-acceptable pour des usages commerciaux. En cons&eacute;quence, les
logiciels qui sont sous copyright GPL ne peuvent &ecirc;tre
incorpor&eacute;s au sein du kernel ou de binaires composant OpenBSD
bien que ces logiciels sous copyright GPL puissent faire partie d'outils
de d&eacute;veloppement ou de composants "optionels" du syst&egrave;me
d'exploitation tant que le syst&egrave;me OpenBSD dans son ensemble ne
fasse pas l'objet des termes du copyright GPL.

<p>
Comme exemple, certains ports contiennent une &eacute;mulation de
virgule flottante sous copyright GNU : ces composants sont optionnels et
ne font pas partie du syst&egrave;me d'exploitation OpenBSD. Ce dernier
peut &ecirc;tre construit sans ces composants GNU, ou recevoir une autre
forme non GNU d'&eacute;mulation de virgule flottante. Un autre exemple
est l'utilisation de GCC et d'autres outils GNU au sein de la
cha&icirc;ne de compilation : OpenBSD peut &ecirc;tre distribu&eacute;
et utilis&eacute; avec une autre cha&icirc;ne d'outils de compilation,
qu'elle fasse ou non l'objet d'un copyright GPL.

<p>

<dt>NetBSD<dd><p>
Une grande partie d'OpenBSD se base originellement sur le projet NetBSD
(il en provient sous la forme d'une &eacute;volution
s&eacute;par&eacute;e) sans compter qu'une partie des
d&eacute;veloppeurs d'OpenBSD travaillaient sur le projet NetBSD. Les
termes de la licence NetBSD sont compatibles avec la licence Berkeley.
<strong>Seuls</strong> les mat&eacute;riaux de NetBSD faisant l'objet de
la licence g&eacute;n&eacute;rale NetBSD peuvent &ecirc;tre inclus dans
OpenBSD.

<p>
Dans le pass&eacute;, NetBSD a incorpor&eacute; des mat&eacute;riaux
faisant l'objet de copyright d'individus divers, qui souvent ont
impos&eacute; des conditions particuli&egrave;res quand &agrave; l'usage
possible de leur code, allant souvent bien au-del&agrave; des termes de
la licence NetBSD. La fondation NetBSD disposait
g&eacute;n&eacute;ralement des droits de distribution des sources, afin
d'en permettre l'incorporation dans le projet. Ces mat&eacute;riaux ne
peuvent pas &ecirc;tre incorpor&eacute;s dans OpenBSD si ces conditions
entrent en conflit avec les termes de la licence d'OpenBSD ou si les
termes contiennent la moindre base discriminatoire envers quiconque.

<p>

<dt>FreeBSD<dd><p>
La majorit&eacute; des sources de FreeBSD est couverte par une licence
Berkeley ou contient des notices de copyright bas&eacute; sur le
mod&egrave;le Berkeley. Ces mat&eacute;riaux peuvent &ecirc;tre
incorpor&eacute;s dans OpenBSD, tandis que les parties qui sont
couvertes par la licence GPL ou d'individus proposant leur propre termes
de copyright qui sont en contradiction avec les termes de la licence
OpenBSD ne peuvent &ecirc;tre int&eacute;gr&eacute;s.

<p>

<dt>Linux<dd><p>
La majorit&eacute; des sources composant Linux se trouve sous une
licence GPL et ils ne peuvent faire l'objet d'une inclusion ou
importation vers OpenBSD. Des composants individuels peuvent &ecirc;tre
&eacute;tudi&eacute;s si les termes originels du copyright de leurs
auteurs en permettent l'inclusion dans OpenBSD. Il faut &eacute;galement
souligner le fait que certains logiciels "GPL" subissent des conditions
suppl&eacute;mentaires dans certaines distributions de la part de ceux
qui pr&eacute;parent la distribution, que ce soit sous la forme d'une
compilation ou bien de mat&eacute;riaux incorpor&eacute;s qui ne font
pas partie du coeur de Linux.

<p>

<dt>X, XFree86<dd><p>
X et XFree86 ne sont pas des composants faisant partie d'OpenBSD. X et
XFree86 sont distribu&eacute;s avec OpenBSD afin d'en faciliter l'usage
par l'utilisateur, mais conservent leurs termes de licences respectifs.

<p>

<dt>Shareware, Charityware, Freeware, etc.<dd><p>
La plupart des logiciels "shareware" et leurs notices de copyright
imposent des conditions suppl&eacute;mentaires sur la distribution,
l'usage ou la visibilit&eacute; qui sont souvent en conflit avec les
objectifs du projet OpenBSD. Une &eacute;tude au cas par cas sera
requise pour ce type de composants afin de d&eacute;terminer si leur
copyright ou licence permet une incorporation ou m&ecirc;me distribution
avec OpenBSD.

<p>

<dt>Domaine public<dd>

<p>
Bien que les mat&eacute;riaux qui soient v&eacute;ritablement
entr&eacute;s dans le "domaine public" peuvent &ecirc;tre
incorpor&eacute;s dans OpenBSD, une &eacute;tude au cas par cas est
requise. Souvent, le concept de "domaine public" est propos&eacute; par
quelqu'un qui, apr&egrave;s &eacute;tude, ne d&eacute;tient pas toujours
tous les droits sur son logiciel. Pour qu'une oeuvre soit
v&eacute;ritablement dans le "domaine public" il faut que tous les
droits soient effectivement abandonn&eacute;s par l'auteur et ce sans
aucune restriction.

<p>

</dl>

</ul>

<hr>
<a href="index.html"><img height="24" width="24" src="../images/back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: policy.html,v 1.20 ]<br>
$Translation: policy.html,v 1.3 2003/09/09 08:12:51 saad Exp $<br>
$OpenBSD: policy.html,v 1.2 2003/09/10 08:24:23 horacio Exp $
</small>

</body>
</html>
