<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
  <head>
    <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
    <meta name="resource-type" content="document">
    <meta name="description" content="Guide de Tests des Ports d'OpenBSD">
    <meta name="keywords" content="openbsd,ports, test">
    <meta name="distribution" content="global">
    <meta name="copyright" content="copyright 2002-2004 par OpenBSD.">
    <title>Guide de Tests des Ports d'OpenBSD</title>
  </head>

  <body text="#000000" bgcolor="#FFFFFF" link="#23238E">
    <a href="index.html"><img alt="[OpenBSD]" height="30" width="141" 
    src="../images/smalltitle.gif" border="0"></a> 

    
<h2><font color="#e00000">Guide de Tests des Ports</font></h2>
    <hr>

    <h2><font color="#0000e0">Sommaire</font></h2>

    <ul>
      <li><a href="#Introduction">Introduction</a></li>

      <li><a href="#How">Comment</a></li>

      <li><a href="#First">Premier pas</a></li>

      <li><a href="#Testing">Tests</a></li>

      <li><a href="#Commenting">Commentaires</a></li>

      <li><a href="#More">Plus de tests</a></li>
    </ul>
    <hr>

    <h2><a name="Introduction"><font color=
    "#0000e0">Introduction</font></a></h2>

    
<p>L'arborescence <a href="ports.html">des ports</a> est un dispositif cons&eacute;quent 
  qui permet aux utilisateurs d'OpenBSD d'utiliser des applications tierces sans 
  perdre du temps &agrave; appliquer des correctifs, configurer ces applications 
  et les installer s&eacute;parement. Tout ce travail est effectu&eacute; par 
  un groupe de volontaires qui passent leur temps &agrave; porter et &agrave; 
  tester des applications sur les diff&eacute;rentes plates-formes support&eacute;es 
  par OpenBSD. Beaucoup de gens pensent qu'ils ne peuvent pas contribuer &agrave; 
  ce processus car ils n'ont pas les connaissances suffisantes; c'est faux car 
  ils peuvent toujours aider les responsables de ports &agrave; travailler mieux 
  et plus vite.</p>

    <h2><a name="How"><font color="#0000e0">Comment</font></a></h2>

    
<p>Tester les nouveaut&eacute;s ou les nouveaux ports soumis sur la <a 
    href="mail.html">liste de diffusion des ports</a>. En faisant cela, vous r&eacute;duisez 
  la latence des changements effectu&eacute;s et vous augmentez &eacute;galement 
  le nombre de ports qui vont &ecirc;tre rajout&eacute;s (beaucoup de ports ne 
  sont pas rajout&eacute;s car ils ne sont pas assez test&eacute;s !).</p>

    <h2><a name="First"><font color="#0000e0">Premier pas</font></a></h2>

    
<p>L'arborescence des ports est developp&eacute;e pour <a 
    href="../plus.html">OpenBSD-current</a>; il n'y a aucune garantie que les 
  nouveaux ports fonctionneront correctement sur les autres branches. Cela signifie 
  &eacute;galement que vous devez mettre &agrave; jour votre syst&egrave;me ainsi 
  que l'arborescence des ports en -current (des instructions pour savoir comment 
  faire peuvent &ecirc;tre trouv&eacute;es dans la page <a 
    href="anoncvs.html">anoncvs</a> et dans la <a 
    href="../faq/upgrade-minifaq.html">FAQ</a>). Il est &eacute;galement recommand&eacute; 
  de vous abonner aux <a 
    href="mail.html">listes de diffusion</a> ports et ports-changes. De cette 
  fa&ccedil;on vous serez averti des nouveaux ports ou des ports mis &agrave; 
  jour ainsi que des changements effectu&eacute;s dans l'arborescence des ports.</p>
        
    <h2><a name="Testing"><font color="#0000e0">Tests</font></a></h2>

    
<p>Il y a deux types de soumission dans les listes de diffusion; les nouveaux 
  ports et les mises &agrave; jour. Les nouveux ports sont g&eacute;n&eacute;ralement 
  post&eacute;s comme pi&egrave;ces jointes ou des urls. Le plus facile est d'extraire 
  les ports dans le r&eacute;pertoire <tt>/usr/ports/mystuff/</tt> et de les tester 
  l&agrave;. Les mises &agrave; jour sont habituellement des changements effectu&eacute;s 
  dans l'arborescence -current des ports, le mieux est donc de copier le port 
  dans <tt>mystuff/</tt> et d'appliquer les changements afin d'&eacute;viter tous 
  probl&egrave;mes dans l'arborescence des ports.</p>

    <p>La conception pas-&agrave;-pas de ports est indispensable afin de
    v&eacute;rifier que chaque &eacute;tape, voir <a 
    href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&amp;sektion=7&amp;">ports(7)</a>, est accomplie correctement :</p>

    <ul>
      <li><i>fetch</i>
        <ul>
         
      <li>N&eacute;cessaire afin de v&eacute;rifier que le(s) fichier(s) devant 
        &ecirc;tre install&eacute;(s) se t&eacute;l&eacute;charge(nt) correctement. 
        Essayez de tester tous les <tt>MASTER_SITES</tt> sp&eacute;cifi&eacute;s 
        afin de s'assurer que ce sont des sources valides.</li>
        </ul>

      <li><i>checksum</i>
        <ul>
         
      <li>Verifiez que le(s) fichier(s) devant &ecirc;tre install&eacute;(s) correspond(ent) 
        aux 'checksums' pr&eacute;-enregistr&eacute;es dans le fichier <tt>distinfo</tt>.</li>
        </ul>

      <li><i>extract</i>
        <ul>
      <li>Chaque fichier devant &ecirc;tre install&eacute; doit installer au pr&eacute;alable 
        tout (tous) programme(s) dont il d&eacute;pend (bzip2 par exemple).</li>
    </ul>

      <li><i>patch</i>
        <ul>
         
      <li>Les correctifs doivent s'appliquer sans produire d'avertissements. 
      <li>Plus aucun fichier <tt>.orig</tt> ne doit rester dans le
	 r&eacute;pertoire <tt>patches/</tt>.
         
      <li>Une erreur habituelle est d'inclure les balises RCS dans un correctif; 
        cela entrainera des probl&egrave;mes lors de l'ajout du port dans l'arborescence 
        et de l'expansion de la balise RCS.
</ul>

      <li><i>configure</i>
        <ul>
         
      <li>V&eacute;rifiez que les scripts de configuration d&eacute;tectent correctement 
        les sp&eacute;cificit&eacute;s de votre plate-forme. 
      <li>GNU libtool est c&eacute;l&egrave;bre pour des 'options' non-d&eacute;sir&eacute;es 
        sur OpenBSD, d&egrave;s lors veillez &agrave; ce que le port utilise une 
        version r&eacute;cente qui cr&eacute;e des librairies correctes sur votre 
        architecture. 
      <li>Le script de configuration ne doit pas d&eacute;tecter les applications 
        install&eacute;es au pr&eacute;alable sur votre syst&egrave;me sans en 
        avoir sp&eacute;cifier les d&eacute;pendences dans le port. 
    </ul>

      <li><i>build</i>
        <ul>
         
      <li>V&eacute;rifiez d'&eacute;ventuelles erreurs de conceptions et d'avertissements 
        suspects. 
      <li>Les avertissements &agrave; propos de probl&egrave;mes avec <a 
	 href= "http://www.openbsd.org/cgi-bin/man.cgi?query=tmpnam&amp;sektion=3&amp;"> 
        tmpnam(3)</a> doivent pouvoir se r&eacute;soudre &agrave; en utilisant 
        <a 
	 href="http://www.openbsd.org/cgi-bin/man.cgi?query=mkstemp&amp;sektion=3&amp;"> 
        mkstemp(3)</a>.</li>
         <li>Essayez de d&eacute;finir la variable <tt>SEPARATE_BUILD</tt> 
	 &agrave; 'concurrent' et testez si le port se compile toujours.
         
      <li>Assurez vous que les d&eacute;pendences avec GNU make sont vraiment 
        n&eacute;cessaires. 
    </ul>

      <li><i>regress</i>
        <ul>
          
      <li>V&eacute;rifiez d'&eacute;ventuelles erreurs (les tests vides signifient 
        que tout est bon). 
    </ul>


      <li><i>fake</i>
        <ul>
         
      <li>Cette option instalel l'application dans un faux r&eacute;pertoire afin 
        d'&ecirc;tre certain que les fichiers peuvent &ecirc;tre empaquet&eacute;s 
        sans affecter le syst&egrave;me de base. 
      <li>Le port ne doit <b>jamais</b> installer de fichiers en dehors
	 du faux r&eacute;pertoire (comme dans <tt>/usr/local</tt> par
	 exemple).
         <li>GNU libtool a occasionellement des probl&egrave;mes quant il 
	 s'agit de lier des librairies pendant la proc&eacute;dure de fausse
	 installation sur certaines architectures.
        </ul>

      <li><i>package</i>
        <ul>
         
      <li>La cr&eacute;ation d'un 'package' peut &eacute;chouer si pkg/PLIST* 
        et/ou pkg/PFRAG* sont incorrects.</li>
        </ul>

      <li><i>install</i>
        <ul>
         
      <li>Les packages doivent installer avec succ&egrave;s et avec les bonnes 
        permissions tous les fichiers figurant dans leur liste de conditionnement. 
        Soyez extr&ecirc;mement prudent avec les fichiers ayant le bit suid d&eacute;fini. 
      <li> Assurez vous que le script<tt> INSTALL</tt> du packag' fonctionne correctement 
        et n'&eacute;crase aucun fichier dans <tt>/etc</tt>. 
    </ul>

      <li><i>deinstall</i>
        <ul>
         
      <li>Ceci devrait enlever tous les fichiers install&eacute;s par le package, 
        except&eacute; ceux pr&eacute;sent dans <tt>/etc</tt>. 
      <li>Soyez certain que le script<tt> DEINSTALL</tt> fonctionne comme pr&eacute;vu. 
    </ul>
    </ul>

    <p>Les fichiers restant dans <tt>pkg/</tt> comme DESCR et MESSAGE 
    doivent &ecirc;tre v&eacute;rifi&eacute;s au niveau de la grammaire et
    de l'orthographe. Les paragraphes doivent &ecirc;tre 
    formatt&eacute;s en utilisant <a 
    href="http://www.openbsd.org/cgi-bin/man.cgi?query=fmt&amp;sektion=1&amp;format=html">fmt(1)</a> et limit&eacute;s &agrave; 70 caract&egrave;res.</p>

    <h2><a name="Commenting"><font color="#0000e0">Commentaires</font></a></h2>

    
<p>Une fois les tests termin&eacute;s vient la chose la plus importante : les 
  commentaires. M&ecirc;me si le port fonctionne parfaitement, des commentaires 
  doivent &ecirc;tre effectu&eacute;s. Si nous avons dix personnes rapportant 
  que le port fonctionne correctement sur plusieurs architectures diff&eacute;rentes, 
  son incorporation dans l'arborescence est effectu&eacute;e plus rapidement. 
  Si il ne fonctionne pas, certaines informations doivent &ecirc;tre fournies. 
  Certains outils existent et peuvent vous aider dans cette t&acirc;che, comme 
  par exemple <a href="http://www.openbsd.org/cgi-bin/cvsweb/ports/infrastructure/build/portslogger">portslogger</a> 
  qui est une sorte de "tee intelligent" et redirige les donn&eacute;es dans un 
  fichier journal.</p>

    <p>Exemple :<br>
    </p>

    <div style="margin-left: 2em">
      <table border="0" cellpadding="3" width="90%">
        <tr>
          <td nowrap bgcolor="#EEEEEE">
<pre>
    # make install 2&gt;&amp;1 | /usr/ports/infrastructure/build/portslogger .
</pre>
          </td>
        </tr>
      </table>
    </div>
    <br>
     <br>
     

    
<p>Ceci va rediriger les donn&eacute;es dans un fichier journal se trouvant dans 
  le r&eacute;pertoire courant.</p>

    <h2><a name="More"><font color="#0000e0">Plus de tests</font></a></h2>

    
<p>V&eacute;rifiez le Makefile du port au niveau des fautes de typographie, des 
  liens incorrects, des variables inutiles ou manquantes, des licences correctes 
  et des cat&eacute;gories. Pour ceux qui poss&egrave;dent plus de comp&eacute;tences, 
  d'autres options peuvent &ecirc;tre test&eacute;es comme <i>lib-depends-check</i>, 
  examiner les correctifs, ainsi que fournir des fichiers diff pour corriger des 
  bogues, rajouter des saveurs ('flavors') au port ou encore d'autres am&eacute;liorations.</p>
    
<p>Ces fichiers diff doivent &ecirc;tre cr&eacute;es avec les options <tt>-uNr 
  --exclude=CVS</tt>. <tt>cvs diff -uN</tt> peut &eacute;galement &ecirc;tre employ&eacute; 
  pour g&eacute;n&eacute;rer des correctifs par rapport d&eacute;p&ocirc;t CVS.</p>
<hr>
<a href="index.html"><img src="../back.gif" height="24" width="24" alt="OpenBSD" border="0"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a><br>
<small>
Originally [OpenBSD: porttest.html,v 1.18 ]<br>
$Translation: porttest.html,v 1.6 2004/01/02 20:51:56 saad Exp $<br>
$OpenBSD: porttest.html,v 1.6 2004/01/03 19:43:21 jufi Exp $
</small>
</body>
</html>
