<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="resource-type" content="document">
<meta name="description" content="The OpenBSD Ports and Packages Collection">
<meta name="keywords" content="openbsd,ports">
<meta name="distribution" content="global">
<meta name="copyright" content="copyright 1997-2002 by OpenBSD.">
<title>Les Ports et les Packages OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
</head>

<body text="#000000" bgcolor="#FFFFFF" link="#23238E">

<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<h2><font color="#e00000">La collection de ports et de packages</font></h2>

<hr>

<h3><font color="#0000e0">Index</font></h3>
<ul>
<li><a href="#Motivation">Motivations</a></li>
<li><a href="#Get">Obtenir des packages</a></li>
<li><a href="#stable"> Mise &agrave; jour des ports et des packages pour une version finale d'OpenBSD</a></li>
<li><a href="#Manage">G&eacute;rer les packages install&eacute;s</a></li>
<li><a href="#Use">Utiliser les ports</a></li>
<li><a href="#Life">Cycle de vie de l'arborescence des ports</a></li>
<li><a href="#XFree86">Ports et XFree86</a></li>
<li><a href="#Example">Exemple d'utilisation de l'arborescence des ports</a></li>
<li><a href="#Advanced">Utilisation avanc&eacute;e de l'arborescence des ports</a></li>
<li><a href="#Create">Cr&eacute;er de nouveaux ports</a></li>
<li><a href="#Lag">Quand un port traine derri&egrave;re la version principale</a></li>
<li><a href="#Help">Probl&egrave;mes et contacts</a></li>
</ul>

<hr>

<h3><font color="#0000e0"><a name="Motivation">Motivations</a></font></h3>

OpenBSD est de lui-meme un syst&egrave;me assez complet, mais il y a
toujours beaucoup de packages que l'on pourrait vouloir voir
ajout&eacute;s. Cependant, il y a le probl&egrave;me d'o&ugrave; tracer
la ligne quant &agrave; quoi inclure, aussi bien que les
probl&egrave;mes occasionnels de licence et de restriction
d'exportation. Etant donn&eacute; qu'OpenBSD est cens&eacute; &ecirc;tre un
petit syst&egrave;me d'exploitation autonome de type UNIX, certaines
choses ne peuvent justement pas &ecirc;tre fournis avec le
syst&egrave;me.

<p>
<strong><font color="#e00000">
La collection de ports et de packages NE passe PAS par l'audit complet
de s&eacute;curit&eacute; dont OpenBSD fait l'objet. Bien que nous
t&acirc;chions de maintenir la qualit&eacute; de la collection de
packages &agrave; un haut niveau, nous n'avons malheureusement pas
assez de ressources humaines pour assurer le m&ecirc;me niveau de
robustesse et de s&eacute;curit&eacute;.
</font></strong>

<p>
La collection de ports, &agrave; l'origine emprunt&eacute;e &agrave;
<a href="http://www.freebsd.org/">FreeBSD</a>, comble ce vide.
Le concept doit avoir, pour chaque logiciel de conception
ind&eacute;pendante, un fichier "makefile" qui commande
<ul>
<li>o&ugrave; le rechercher,
<li>comment le rechercher,
<li>ce qui en d&eacute;pend (s'il y a lieu),
<li>comment changer les sources (si n&eacute;cessaire),
<li>et comment le configurer, le compiler et l'installer.
</ul>
Ces informations sont maintenues dans l'arborescence du
r&eacute;pertoire /usr/ports.

<p>
Les packages sont l'&eacute;quivalent binaire des ports. Un port
compil&eacute; devient un package qui peut &ecirc;tre enregistr&eacute;
dans le syst&egrave;me en utilisant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&amp;format=html">pkg_add(1)</a>

<p>
<strong><font color="#e00000">
Les packages ressemblent &agrave; de simples paquets .tgz, mais ils
devraient toujours &ecirc;tre ajout&eacute;s en utilisant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&amp;format=html">pkg_add(1)</a>,
car il pourrait y avoir des informations suppl&eacute;mentaires que seul
 <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&amp;format=html">pkg_add(1)</a>
sait manipuler.
</font></strong>
Astuce : vous pouvez distinguer les packages des paquets
<strong>.tgz</strong> en utilisant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1&amp;format=html">pkg_info(1)</a>.

<h3><font color="#0000e0"><a name="Get">Obtenir des packages</a></font></h3>

Une large collection de packages pr&eacute;-compil&eacute;s est
disponible pour la plupart des architectures communes.

<ul>
<li>Sur le CD-Rom (que vous pouvez commander <a href="../orders.html">ici</a>),
<li>Sur les <a href="ftp.html">sites ftp miroirs</a>.
<li>Par navigation et recherche &agrave; partir de la liste web des
    packages :
<ul>
<li><a href="http://www.openbsd.org/3.2_packages/">Packages pour OpenBSD 3.2</a>
<li><a href="http://www.openbsd.org/3.1_packages/">Packages pour OpenBSD 3.1</a>
<li><a href="http://www.openbsd.org/3.0_packages/">Packages pour OpenBSD 3.0</a>
<li><a href="http://www.openbsd.org/2.9_packages/">Packages pour OpenBSD 2.9</a>
<li><a href="http://www.openbsd.org/2.8_packages/">Packages pour OpenBSD 2.8</a>
<li><a href="http://www.openbsd.org/2.7_packages/">Packages pour OpenBSD 2.7</a>
</ul>
</ul>

Ajouter un package est aussi facile que
<code>pkg_add pkgname.tgz</code>.
Si vous prenez les packages d'une unique source (un d&eacute;p&ocirc;t
de packages), r&eacute;glez PKG_PATH sur l'URL de ce d&eacute;p&ocirc;t,
afin d'en saisir les d&eacute;pendances.

<p>
Par exemple, pour installer le package Gimp pour la version 3.2 sur une
machine i386 &agrave; partir du site ftp (incluant les
d&eacute;pendances), faites:

<pre>
    # setenv PKG_PATH ftp://ftp.openbsd.org/pub/OpenBSD/3.2/packages/i386/
    # pkg_add ${PKG_PATH}gimp-1.2.3.tgz
</pre>

<h3><font color="#0000e0"><a name="stable"> Mise &agrave; jour des ports
    et des packages pour une version finale d'OpenBSD </a></font></h3>

<p>
La version 2.7 a vu l'introduction d'une branche stable pour
l'arborescence des ports.
<p>
Par exemple, pour saisir la branche stable de la version 3.2 :
<pre>
    $ cd /usr/ports
    $ cvs -q -d anoncvs@some.anon.server:/cvs up -r OPENBSD_3_2 -Pd
</pre>
<p>
Commen&ccedil;ant avec la version 2.8, les binaires choisis sont
&eacute;galement disponibles. Veuillez vous r&eacute;f&eacute;rer
&agrave; la <a href="pkg-stable.html">page des packages stables</a> pour
vous informer sur la mis &agrave; jour des packages et sur les mises
&agrave; jour importantes de la branche stable.

<p>
Les noms des packages sont <strong>toujours</strong> chang&eacute;s en
cas de mise &agrave; jour du logiciel, pour &eacute;viter tout risque de
confusion entre un logiciel de la version finale et un logiciel
corrig&eacute; de ses bogues.

<h3><font color="#0000e0"><a name="Manage">G&eacute;rer les packages
    install&eacute;s</a></font></h3>

La page 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=packages&amp;sektion=7&amp;format=html">Packages(7)</a>
du manuel d&eacute;tient des informations utiles sur les mani&egrave;res
de g&eacute;rer les packages install&eacute;s, r&eacute;soudre les
conflits (fichiers d&eacute;j&agrave; existant) et manipuler les
d&eacute;pendances.

<p>
A partir d'OpenBSD 2.8, pour mettre &agrave; jour un logiciel vous devez
:

<ul>
<li>Enlevez l'ancien logiciel en utilisant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_delete&amp;sektion=1&amp;format=html">pkg_delete(1)</a>
<li>Ajoutez le nouveau logiciel en utilisant
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_add&amp;sektion=1&amp;format=html">pkg_add(1)</a>
</ul>
Ceci est l&eacute;g&egrave;rement incommode, car les packages peuvent
d&eacute;clencher des d&eacute;pendances, et vous aurez peut-&ecirc;tre
&agrave; enlever un grand sous-ensemble de packages pour une mise
&agrave; jour.

<h3><font color="#0000e0"><a name="Use">Utiliser des
    ports</a></font></h3>

Si un logiciel donn&eacute; n'existe pas pour votre architecture, vous
pouvez encore compiler le port. En outre, certains utilisateurs voudront
tout compiler &agrave; partir des sources pour diff&eacute;rentes
raisons.

<p>
Vous pouvez t&eacute;l&eacute;charger par ftp la version finale
souhait&eacute;e &agrave; partir du r&eacute;pertoire
pub/OpenBSD/[version] (o&ugrave; [version] est le num&eacute;ro de la version
finale) sur n'importe lequel des <a href="ftp.html">sites ftp
miroirs</a>. Les versions finales sont celles que nous livrons sur notre
CDROM, et sont pass&eacute;es par plus de tests que n'importe quel
"snapshot". Davantage d'informations sont disponibles dans la page
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ports&amp;sektion=7&amp;format=html">ports(7)</a> du manuel.


<h3><font color="#0000e0"><a name="Life">Cycle de vie de l'arborescence
    des ports</A></font></h3>

<p>
L'arborescence des ports, comme le reste d'OpenBSD, change constamment.

<p>
L'arborescence courante des ports <strong>ne devrait pas</strong>
&ecirc;tre employ&eacute; avec la version finale
pr&eacute;c&eacute;dente. Ceci est d&ucirc; aux changements, typiques du
processus de construction du port, qui exigent du code bas&eacute; sur
l'arborescence courante des sources d'OpenBSD.

<p>
L'arborescence des ports fonctionne comme une seule entit&eacute;. La
mise &agrave; jour d'un seul r&eacute;pertoire n'est pas garantie de
fonctionner, car les d&eacute;pendances du logiciel peuvent vous forcer
&agrave; mettre &agrave; jour et recomplier de vastes parties de
l'arborescence des ports. Il est fortement conseiller aux gens de ne pas
suivre les ports courants &agrave; moins qu'ils soient pr&eacute;parer
&agrave; traiter des probl&egrave;mes vari&eacute;s. Des <a
href="mail.html">listes de discussion</a> comme
<code>ports-changes@openbsd.org</code> ou <code>tech@openbsd.org</code>
seront probablement d'une valeur inestimable.

<p>
Vous &ecirc;tes avis&eacute; de suivre les ports stables sur une machine
de production : nous essayerons de garder l'arborescence des ports
stables &agrave; jour en respects des probl&egrave;mes, et aussi de
fournir les mises &agrave; jour de binaires opportunes.

<p>
Notez que de faire disparaitre les "distfiles" n'est pas une issue, car
ftp.openbsd.org contient le d&eacute;p&ocirc;t complet. M&ecirc;me le
changement des "cheksums" n'est pas un probl&egrave;me : vous pouvez utiliser la
commande

<pre>
        make checksum REFETCH=true
</pre>
pour vous assurer de saisir la "distfile" correcte pour votre
arborescence des ports. Pour des d&eacute;finitions de <i>courant</i> et
de <i>stable</i>, voir la <a
href="../faq/upgrade-minifaq.html#1.1">Mini-FAQ de mise &agrave;
niveau</a>.


<p>
Une liste des <a href="../portsplus/index.html">changements
quotidiens</a> des ports et des ports-current est disponible.

<p>
L'arborescence des ports-courrants peut &ecirc;tre retrouv&eacute; via:

<ul>
<li><a href="anoncvs.html">CVS anonyme</a> (voir le lien).
La commande est essentiellement <strong>cvs get ports</strong>.
<li>FTP anonyme &agrave; partir de
<a href="ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz">
ftp://ftp.openbsd.org/pub/OpenBSD/snapshots/ports.tar.gz</a>.
        Ces archives sont mises &agrave; jour de nuit.
<li><a href="cvsup.html">CVSup</a>. Voyez l'exemple pour l'usage de CVSup dans
    <a href="cvsup.html#checkout">checkout mode</a>.
<li> Votre navigateur web en utilisant l'<a href="http://www.openbsd.org/cgi-bin/cvsweb/ports/">interface web de CVS</a>.
</ul>

<h3><font color="#0000e0"><a name="XFree86">Ports et
    XFree86</a></font></h3>

Il y a quelque chose de magique dans les fichiers de configuration
Xfree86 d'OpenBSD qui permet &agrave; l'arborescence des ports
d'installer des applications bas&eacute;es sur "imake" dans /usr/local.

<p>
A partir de la 2.9, OpenBSD est livr&eacute; avec XFree86 4.0.3. Si vous
utilisez une distribution pr&eacute;c&eacute;dente, avec des binaires
XFree86 du projet XFree86, vous pouvez devoir appliquer le "patch" de
<code> /usr/ports/infrastructure/patches/patch-xfree-4.0</code> &agrave;
la distribution binaire par d&eacute;faut de XFree86 4.0.x afin qu'elle
puisse fonctionner avec l'arborescence des ports d'OpenBSD.


<h3><a name="Example"></a><font color="#0000e0">Exemple d'utilisation de
    l'arborescence des ports</font></h3>

<p>
Disons que vous prevoyez d'obtenir un arborescence des ports et de
compiler, installer l'utilitaire d'archivage <strong>unzip</strong>.
Vous devriez pouvoir faire quelque chose comme ceci :

<pre>
    % cd /usr/ports/archivers/unzip
    % su
    # make
    # make install
    # exit
</pre>

Facile, non ? Particuli&egrave;rement vu tout ce qui s'est produit en
arri&egrave;re-plan :

<ul>
<li>Recherche des sources de unzip &agrave; partir d'un site ftp,
<li>V&eacute;rification de l'int&eacute;grit&eacute; de l'archive des
    sources,
<li>Extraction des sources de unzip,
<li>Application des "patchs" sp&eacute;cifiques d'OpenBSD,
<li>Configuration et compilation du programme,
<li>Cr&eacute;ation d'un binaire dans /usr/ports/packages,
<li>Installation de ce logiciel.
</ul>

<p>
Avec OpenBSD 3.0, presque tous les ports construisent automatiquement
les packages pendant l'installation.

<p>
Quand les ports sont construits, le r&eacute;pertoire
/usr/ports/distfiles est rempli avec les sources des programmes, et
/usr/ports/packages avec les binaires. Les utilisateurs dot&eacute;s d'une
connexion &agrave; faible d&eacute;bit 
peuvent se r&eacute;f&eacute;rer &agrave;
 <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mirroring-ports&amp;sektion=7&amp;format=html">mirroring-ports(7)</a>
pour saisir imm&eacute;diatement d'une mani&egrave;re efficace tous les
"distfiles". Dans la version OpenBSD-current, vous pouvez employer le
script /usr/ports/infrastructure/fetch/clean-old pour suivre les
vieilles "distfiles". Notez que le CD d'OpenBSD inclue seulement
l'arborescence des ports et les packages choisis. Si vous souhaitez
avoir les "distfiles", vous devrez les obtenir d'une mani&egrave;re
ind&eacute;pendante.

<h3><font color="#0000e0"><a name="Advanced"></a>Utilisation
    avanc&eacute;e de l'arborescence des ports</font></h3>

<p>
L'arborescence des ports poss&egrave;de beaucoup de dispositifs pour
l'utilisateur avanc&eacute; qui lui en feront un pr&eacute;cieux outil
au del&agrave; de l'installation de base. Les utilisateurs
avanc&eacute;s peuvent souhaiter trifouiller dans les fichiers
"makefile" (vous devriez d'abord lire la page
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=make&amp;sektion=1&amp;format=html">make(1)</a>
du manuel) ou assigner diverses variables &agrave; partir de la ligne de
commande oubien dans <tt>/etc/mk.conf</tt>. Ces variables sont
d&eacute;crites en d&eacute;tail dans la page
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=bsd.port.mk&amp;sektion=5&amp;format=html">bsd.port.mk(5)</a>
du manuel et dans les documents "porting" ci-dessous.

<h3><font color="#0000e0"><a name="Create">Cr&eacute;er de nouveaux
    ports</a></font></h3>
<p>
Si vous &ecirc;tes int&eacute;ress&eacute; pour aider &agrave; augmenter
l'arborescence des ports d'OpenBSD, vous devriez d'abord lire <a
href="../porting.html">porting.html</a>. Cette page fait
r&eacute;f&eacute;rence au
<a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/porters-handbook/index.html"> FreeBSD Porter's Handbook</a>
aussi bien qu'&agrave; la politique et aux conseils sp&eacute;cifiques
&agrave; OpenBSD.


<h3><font color="#0000e0"><a name="Lag"> Quand un port tra&icirc;ne
    derri&egrave;re la version principale </a></font></h3>

<p>
La collection de ports est un projet volontaire. Parfois le projet n'a
simplement pas les ressources en devellopeurs pour maintenir tout
&agrave; jour. Les devellopeurs reprennent majoritairement ce qu'ils
consid&egrave;rent int&eacute;ressant et peuvent le tester dans leur
environnement. Vos <a href="goals.html#funding">donations</a> comptent
pour les plateformes dont les ports peuvent &ecirc;tre test&eacute;s
dessus. </p>

<p>
Quelques diff&eacute;rents ports peuvent tra&icirc;ner derri&egrave;re
les versions principales pour cette raison. La collection de ports peut
r&eacute;cup&eacute;rer une version d'un programme de janvier tandis
qu'une nouvelle version du programme a &eacute;t&eacute; lanc&eacute;es par ses
devellopeurs en mai il y a trois mois. Souvent c'est une d&eacute;cision
consciente ; la nouvelle version peut avoir des probl&egrave;mes sur
OpenBSD que le "maintainer" essaye de r&eacute;soudre, ou qui ont
simplement fait pire que la version pr&eacute;c&eacute;dente : OpenBSD peut avoir
diff&eacute;rents <a href="goals.html">buts</a> que les principaux
devellopeurs d'autres projets, qui ont parfois comme cons&eacute;quence
des dispositifs et des choix de conception ou d'ex&eacute;cution qui
sont ind&eacute;sirables du point de vue des devellopeurs d'OpenBSD. La
mise &agrave; jour peut &eacute;galement &ecirc;tre remise &agrave; plus
tard parce que la nouvelle version n'est pas consid&eacute;r&eacute;e
comme une mise &agrave; jour cruciale. 

<p>
Si vous avez vraiment besoin d'une nouvelle version d'un port, vous
devriez demander au <tt>MAINTAINER</tt> du port de mettre &agrave; jour
le port (voir <a href="#Help">ci-dessous</a> comment d&eacute;couvrir
qui est le "maintainer"); si vous pouvez envoyer des "patchs" pour ceci,
c'est encore mieux. Pour cr&eacute;er les "patchs" appropri&eacute;es,
vous devriez vous r&eacute;f&eacute;rer &agrave; la <a
href="../porting.html">documentation de fabriquation des ports</a>.

<h3><font color="#0000e0"><a name="Help">Probl&egrave;mes et
    contacts</a></font></h3>

<p>
Si vous avez des ennuis avec un port existant, envoyez, s'il vous plait,
un e-mail au "maintainer". Pour voir qui est le "maintainer" du port,
tapez, par exemple : 
<pre>
       % cd /usr/ports/archivers/unzip
       % make show VARNAME=MAINTAINER
</pre>

Alternativement, s'il n'y a pas de "maintainer" ou vous ne pouvez pas
le/la joindre, envoyez un mail &agrave; la liste de discussion des ports
d'OpenBSD, <a href="mailto:ports@openbsd.org">ports@openbsd.org</a>.
Veuillez ne pas utiliser la liste de discussion misc@openbsd.org pour
des questions au sujet des ports. Les corrections sont toujours les
bienvenues, mais dans tous les cas fournissez :
<ul>
<li>La sortie de <code>uname -a</code>,
<li>Votre version d'OpenBSD, y compris tous les "patchs" que vous avez
    pu appliquer,
<li>Une description compl&egrave;te du probl&egrave;me.
</ul>
Pour les ports qui ne se compilent pas correctement, une transcription
compl&egrave;te est presque toujours exig&eacute;e. Pour ceci, vous
pouvez employer le script de "portslogger", trouv&eacute; dans
/usr/ports/infrastructure/build. Une utilisation de "portslogger"
pourrait etre :

<pre>
       % cd /usr/ports/archivers/unzip
       % su
       # mkdir -p ~/portslogs
       # make clean install 2>&amp;1 | /usr/ports/infrastructure/build/portslogger \
               ~/portslogs
</pre>

Apr&egrave;s ceci, vous devriez avoir un fichier de logs de compilation
dans votre dossier ~/portslogs que vous pouvez envoyer au "maintainer"
du port. En outre, assurez-vous que vous n'employez aucune option
sp&eacute;ciale dans votre compilation, par exemple dans /etc/mk.conf.

<p>
Alternativement, vous pouvez
<ul>
<li>Utilisez
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=script&amp;sektion=1&amp;format=html">script(1)</a>
pour cr&eacute;er une transcription compl&egrave;te.
N'enlevez pas les informations de configuration.
<li>Attachez la sortie de  
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pkg_info&amp;sektion=1&amp;format=html">pkg_info(1)</a>
si elle semble appropri&eacute;e m&ecirc;me &agrave; distance.
<li>Les erreurs du compilateur internes de
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gcc&amp;sektion=1&amp;format=html">gcc(1)</a>
vous demandent de rapporter le bogue &agrave; la lise de discussion de
gcc. Cela sauvra du temps si vous suivez leurs directives, et fournissez
au moins les divers fichiers produits par <tt>gcc -save-temps</tt>.
</ul>

<hr>
<a href="index.html"><img height=24 width=24 src=../back.gif border=0 alt=OpenBSD></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: ports.html,v 1.71 ]<br>
$Translation: ports.html,v 1.1 2003/05/12 11:59:56 saad Exp $<br>
$OpenBSD
</small>

</body>
</html>
