<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Couverture d'OpenBSD par la presse</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1996-2002 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<a href="index.html"><img alt="[OpenBSD]" 
height="30" width="141" src="../images/smalltitle.gif" border="0"></a>

<h2><font color="#e00000">Couverture par la presse</font></h2>

<hr>

<h2>Juin, 2003</h2>
<ul>

 <li><font color="#009000"><strong>
[ALLEMAND] &quot;We don't do politics, we write software&quot;, c't 13/03, p. 106.
</strong></font><br>
Interview avec Theo &agrave; propos des fonds, hackathons, et 
la s&eacute;curit&eacute; dans OpenBSD.
<p>

<li><font color="#009000"><strong>
<a href="http://www.eweek.com/article2/0,3959,1111894,00.asp">
OpenBSD gets harder to crack</a>,
page 58, eWeek,
2 juin 2003.
</strong></font><br>
Timothy Dyck passe en revue la derni&egrave;re version d'OpenBSD, 3.3,
et met l'accent sur les nouveaut&eacute;s: PF et l'int&eacute;gration 
d'ALTQ et les m&eacute;chanismes de protection de la pile de donn&eacute;es
&eacute;tendus au syst&egrave;me.
Certaines critiques dans cet article sont &eacute;galement adress&eacute;es 
&agrave; la version -current.
<p>

</ul>


<h2>Mai 2003</h2>
<ul>
<li><font color="#009000"><strong>
<a href="http://www.net-security.org/article.php?id=499">
Interview avec Ivan Arce, CTO de Core Security Technologies</a>
Help Net Security, 29 mai 2003.
</strong></font><br>
Berislav Kucan interview Ivan Arce, CTO de <a
href="http://www.corest.com">Core Security Technologies</a>. 
Plusieurs personnes de chez Core ont &eacute;t&eacute; impliqu&eacute;es
dans de d&eacute;veloppement d'OpenBSD, et utilisent 
g&eacute;n&eacute;ralement OpenBSD en tant que l'une de leurs 
plates-formes de d&eacute;ploiement. Dans l'interview, Ivan est
cit&eacute; comme disant "... from a purely
security perspective. I would say that OpenBSD is still the king of the
hill." ("... dans une pure optique de s&eacute;curit&eacute;. Je dirais
qu'OpenBSD est toujours le roi de la colline.") PF est &eacute;galement
un des cinq outils de s&eacute;curit&eacute; pr&eacute;f&eacute;r&eacute;s
d'Ivan.
<p>

<li><font color="#009000"><strong>
<a href="http://www.infoworld.com/article/03/05/23/21OPconnection_1.html">
Beyond Linux</a>,
InfoWorld,
23 mai 2003.
</strong></font><br>
Le chroniqueur Chad Dickerson parle de plusieurs projets "Open Source" 
comme alternatives &agrave; Linux. OpenBSD a droit &agrave; une 
br&egrave;ve mention en tant qu'OS gratuitement disponible le plus 
s&eacute;curis&eacute;. Il parle &eacute;galement de la license 
BSD de facon positive par rapport &agrave; la GPL. 
<p>

<li><font color="#009000"><strong>
<a href="http://www.canada.com/search/story.aspx?id=dd4eb943-192f-4e5a-8d7f-e2a93a4e7b43">
Elite Programmers `Hack' to Help Others</a>,
pages A1/D1/D4, Calgary Herald,
17 mai 2003.
</strong></font><br>
Tamara Gignac est venue au hackathon et a pass&eacute; la plupart
de la journ&eacute;e &agrave; discuter avec les membres de 
l'&eacute;quipe; son article prend la moiti&eacute; de la 
premi&egrave;re page de la partie affaires et une autre 
moiti&eacute; sur une page int&eacute;rieure (plus un filet
sur la premi&egrave;re page). 
"We're addicted to making good stuff that works" ("Nous sommes
passionn&eacute;s dans la r&eacute;alisation de choses de
qualit&eacute; qui fonctionnent") &eacute;crit Tamara, citant Theo, 
parlant de l'histoire du projet et de ses buts. 
L'article passe en revue la gamme des significations du terme
"hacker" - incluant le "hackerdom" des premiers temps de MIT et
des citations de Tim Berners-Lee - et comment ce terme s'est
d&eacute;grad&eacute; dans l'esprit du publique apr&egrave;s 
le film <i>War Games</i>. Photos de dhartmei, jason et 
des autres. 
<br>
Cet article peut &eacute;galement &ecirc;tre lu en ligne dans : 
<ul>
<li><font color="#009000"><strong>
<a href="http://www.canada.com/saskatoon/starphoenix/info/business/story.html?id=F5F23FF7-E0EE-4C54-BBED-7B523C6AFBF2">
Hackers Try for a Good Rap</a>,
Saskatoon StarPhoenix,
17 mai 2003
</strong></font>
(version l&eacute;g&egrave;rement raccourcie).</li>
<li><font color="#009000"><strong>
<a href="http://www.canada.com/montreal/specials/business/story.html?id=4C8B848C-8772-4C2E-B8F7-60CDAC678303">
Hackers try to buff their image</a>,
Montreal Gazette,
21 mai 2003
</strong></font></li>
</ul>
<p>

<li><font color="#009000"><strong>
Funding cut linked to antiwar remarks, page E5,
Calgary Herald,
7 mai 2003.
</strong></font><br>
Un article ne se trouvant pas encore sur le "net" &eacute;crit par 
Tamara Gignac parle une fois encore de la coupure des fonds du DARPA
et du fait que cela n'aura aucune influence sur le d&eacute;roulement
du Hackathon d&eacute;butant &agrave; Calgary le 9. 
<p>


<li><font color="#009000"><strong> <a href="http://www.osopinion.com/perl/story/21438.html"> 
Shame on DARPA for Pulling OpenBSD Funding</a>, OsOpinion, 6 mai 2003. </strong></font><br>
Joe Brockmeier a r&eacute;dig&eacute; un article f&eacute;roce sur la perception 
des mauvais agissements du DARPA et de l'Air Force et la coupure des fonds 
attribu&eacute;s &agrave; OpenBSD. L'article peut &ecirc;tre lu en ligne &agrave; 
l'adresse suivante :<br>
<ul>
<li><font color="#009000"><strong> <a href="http://www.newsfactor.com/perl/story/21438.html"> 
Shame on DARPA for Pulling OpenBSD Funding</a>, NewsFactor Network. </strong></font> 
</li>
</ul>
<p> </p>
</li>
<li><font color="#009000"><strong> <a href="http://www.itbusiness.ca/index.asp?theaction=61&amp;sid=52131"> 
    OpenBSD, closed doors</a>, ITBusiness, 2 mai 2003. </strong></font><br>
    Shane Schick a &eacute;tudi&eacute; la situation quand au financement du DARPA, 
    et la sortie de la version 3.3 d'OpenBSD et ses nouvelles capacit&eacute;s 
    dont ses protections contre les d&eacute;passements de tampons. Malgr&eacute; 
    quelques erreurs, la fin de l'article est int&eacute;ressante et sugg&egrave;re 
    que le gouvernement canadien puisse aider le projet dans son d&eacute;veloppement.</li>
  <li><font color="#009000"><strong> <a href="http://www.infoworld.com/article/03/05/01/HNopenbsd33_1.html"> 
    OpenBSD launches latest release</a>, InfoWorld, 1er mai 2003. </strong></font><br>
    Carly Suppa d&eacute;taille les nouveaut&eacute;s de la version 3.3 d'OpenBSD.<br>
    Cet article peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante 
    : 
    <ul>
      <li><font color="#009000"><strong> <a href="http://www.idg.com.sg/idgwww.nsf/unidlookup/15D00CA80554E2B648256D1A000F9270?OpenDocument"> 
        OpenBSD launches latest release</a>, IDG Singapore. </strong></font> </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://zdnet.com.com/2100-1104_2-999200.html"> 
    OpenBSD 3.3 prevails despite funding cut</a>, ZDNet, 1er mai 2003. </strong></font><br>
    Un article truff&eacute; d'erreurs, et qui semble avoir &eacute;t&eacute; 
    construit maladroitement &agrave; partir d'anciens articles.</li>
  <li>Cet article peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante 
    :<br>
    <ul>
      <li><font color="#009000"><strong> <a href="http://www.businessweek.com/technology/cnet/stories/999200.htm"> 
        Developers give OpenBSD to public</a>, BusinessWeek.com. </strong></font> 
      </li>
      <li><font color="#009000"><strong> <a href="http://news.com.com/2100-1016_3-999200.html"> 
        Developers give OpenBSD to public</a>, CNET News.com. </strong></font> 
      </li>
      <li><font color="#009000"><strong> <a href="http://news.zdnet.co.uk/story/0,,t269-s2134164,00.html?rtag=zdnetukhompage"> 
        OpenBSD releases version 3.3</a>, ZDNet UK. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.net-security.org/article.php?id=480"> 
        OpenBSD 3.3 has been released</a>, Help Net Security, Croatia. </strong></font> 
      </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://marc.theaimsgroup.com/?l=openbsd-announce&amp;m=105175475006905&amp;w=2"> 
    OpenBSD 3.3 Released</a>, Todd Miller dans <a href="http://www.openbsd.org/mail.html">openbsd-announce</a>, 
    1er mai 2003. </strong></font><br>
    L'annonce officielle de la version 3.3, qui liste toutes les nouveaut&eacute;s 
    ajout&eacute;es dans la version 3.3 dont ProPolice, W^X, une r&eacute;duction 
    du nombre de programmes setuid/setgid, plus de privsep, des am&eacute;liorations 
    de s&eacute;curit&eacute; et de fonctionnement majeures dans pf, un meilleur 
    support mat&eacute;riel dont la plateforme HPPA, spamd, de nouveaux &quot;portages&quot; 
    et quelques am&eacute;liorations, de nombreuses mises &agrave; jour int&eacute;gr&eacute;es 
    et bien plus encore. Nous vous recommandons l'achat d'un CD-Rom et de T-Shirts 
    pour apporter un financement constant au projet (ce qui est d'autant plus 
    vital que les fonds du DARPA sont maintenant supprim&eacute;s). Comme toujours, 
    OpenBSD reste un logiciel libre et vous pouvez le t&eacute;l&eacute;charger 
    par FTP gratuitement.</li>
</ul>
<p>
</p>
<h2>Avril 2003</h2>
<ul>
  <li><font color="#009000"><strong><a href="http://www.techrepublic.com/article.jhtml?id=r00220030428mco01.htm&amp;page=1&amp;vf=tt">Can 
    OpenBSD really eliminate buffer over-runs?</a>, TechRepublic, 28 avril 2003.</strong></font><br>
    John McCormick a r&eacute;dig&eacute; un article sur les r&eacute;cents efforts 
    port&eacute;s sur W^X et ProPolice dans la derni&egrave;re version 3.3 et 
    note que les autres vendeurs devraient &eacute;tudier ces apports avecsoin.<br>
    Cet article peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante 
    : 
    <ul>
      <li><font color="#009000"><strong> <a href="http://techupdate.zdnet.co.uk/story/0,,t481-s2133935,00.html"> 
        Can OpenBSD really eliminate buffer over-runs?</a>, ZDNet UK. </strong></font> 
      </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.idg.net/ic_1309735_9677_1-5043.html"> 
    OpenBSD contract suspended due to 'world events'</a>, IDG, 24 avril 2003. 
    </strong></font><br>
    Grant Gross provides propose un autre r&eacute;sum&eacute; des informations 
    au sujet des fonds attribu&eacute;s du DARPA. Comme les autres journalistes, 
    il rencontre un mur de silence puisque le DARPA refuse de &quot;commenter 
    plus avant&quot; la situation.<br>
    Cet article peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante 
    :<br>
    <ul>
      <li><font color="#009000"><strong> <a href="http://www.infoworld.com/article/03/04/24/HNdarpaopen_1.html"> 
        OpenBSD contract suspended due to 'world events</a>, InfoWorld. </strong></font> 
      </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://slate.msn.com/id/2081943/"> 
    The Fix Is In: Programmers can stop Internet worms. Will they?</a>, Slate, 
    24 avril 2003. </strong></font><br>
    Paul Boutin se demande dans combien de temps des techniques que l'on trouve 
    dans OpenBSD 3.3 seront int&eacute;gr&eacute;es au sein de syst&egrave;mes 
    d'exploitation commerciaux tels que Windows, o&ugrave; ces apports auraient 
    peut &ecirc;tre stopp&eacute; des failles majeures exploit&eacute;es par Slammer, 
    Code Red et Nimda.<br>
  </li>
  <li><font color="#009000"><strong> <a href="http://lwn.net/Articles/29186/">OpenBSD 
    Funding</a>, LWN.net Weekly Edition, 24 avril 2003. </strong></font><br>
    (paiement requis pour consulter l'article ; gratuit apr&egrave;s le 1er mai 
    2003). <br>
    Une discussion plus d&eacute;taill&eacute;e sur les raisons derri&egrave;re 
    la coupure des fonds du DARPA, pourquoi, par qui et quand. La conclusion est 
    que l'arr&ecirc;t des fonds &quot;n'est pas aussi dramatique qu'il semble&quot; 
    puisque OpenBSD dispose d'autres sources de financement.</li>
  <li><font color="#009000"><strong> [ITALIEN] <a href="http://webnews.html.it/focus/290.htm">La 
    DARPA ritira i fondi per OpenBSD</a>, WebNews online, 24 avril 2003. </strong></font><br>
    Cet article note que la coupure des fonds du DARPA est un geste qui a frapp&eacute; 
    toute la communaut&eacute; des logiciels libres. L'article d'AP mentionn&eacute; 
    ci-dessous est cit&eacute;, et cet article contient de nombreux liens vers 
    d'autres articles sur ce sujet.</li>
  <li><font color="#009000"><strong> <a href="http://www.nytimes.com/2003/04/24/politics/24HACK.html?ex=1051761600&amp;en=87a56d5c962b64e4&amp;ei=5062">Canadian 
    Programmer Says U.S. Cut Funding After Comments</a>, New York Times, 24 avril 
    2003. </strong></font><br>
    Un autre article qui se consacre &agrave; la saga OpenBSD/DARPA en cours et 
    qui propose quelques remarques int&eacute;ressantes. La journaliste Jennifer 
    Lee explique que la controverse &quot;met en valeur la d&eacute;licate balance 
    entre les militaires et les vues anti-&eacute;tatiques d'une partie de la 
    communaut&eacute; technologique. Ce fait montre &eacute;galement que l'ensemble 
    des programmeurs, r&eacute;partis internationalement et hackers qui d&eacute;tiennent 
    une vaste expertise technologique ne partagent pas les vues des militaires 
    am&eacute;ricains et leur r&ocirc;le au sein des affaires mondiales&quot;. 
    Il faut &eacute;galement noter le gouffre entre la position pr&eacute;tendue 
    du DARPA et ce qui a &eacute;t&eacute; dit aux gens qui travaillent au sein 
    du projet UPenn.<br>
    L'article d&eacute;crit Theo de Raadt comme un &quot;programmeur canadien 
    respect&eacute;... le fondateur de 35 ans d'un projet logiciel de collaboration 
    internationale connu sous le nom d'OpenBSD&quot; et le cite au sujet du Hackathon 
    qui aura lieu quoi qu'il arrive : &quot;nous sommes des individus libres, 
    et nous le faisons pour notre propre plaisir&quot; indique-t-il. &quot;Nous 
    le faisons par amusement&quot;.<br>
    Cet article peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante 
    : <br>
    <ul>
      <li><font color="#009000"><strong> <a href="http://www.commondreams.org/headlines03/0424-08.htm"> 
        Canadian Programmer Says U.S. Cut Funding After Comments</a>, Common Dreams 
        NewsCenter </strong></font> </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.wired.com/news/business/0,1367,58602,00.html">Organizer: 
    'Hackathon' Will Go On</a>, Wired, 24 avril 2003. </strong></font><br>
    Un autre article semblable par son contenu &agrave; l'article du NTYimes.com 
    ci-dessus. Il cite Theo : &quot;Le hackathon va se poursuivre&quot;, &quot;Il 
    est hors de question de g&acirc;cher les billets d'avions sur fonds propres 
    de 60 personnes&quot;.<br>
    Cet article peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante 
    : <br>
    <ul>
      <li> <font color="#009000"><strong>[JAPONAIS] <a href="http://www.hotwired.co.jp/news/news/20030425302.html">Wired 
        News Japan</a>  </strong></font> </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://yro.slashdot.org/yro/03/04/23/0256240.shtml">Open 
    Source Enables Terrorist States</a>, Slashdot, 23 avril 2003. </strong></font><br>
    Reportage et commentaire sur l'annulation des fonds du DARPA et les implications 
    pour les logiciels libres.</li>
  <li><font color="#009000"><strong> <a href="http://www.dailypennsylvanian.com/vnews/display.v/ART/2003/04/23/3ea643207f30d">Federal 
    funding abruptly cut for research project</a>, dailypennsylvanian.com, 23 
    avril 2003. </strong></font><br>
    Un article de l'universit&eacute; de Pennsylvanie qui commente la coupure 
    des fonds du DARPA et l'implication de l'universit&eacute;.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> [ALLEMAND] <a href="http://www.heise.de/newsticker/data/hps-23.04.03-000/">OpenBSD 
    in Ungnade</a>, Heise online, 23 avril 2003. </strong></font><br>
    OpenBSD en disgrace - Les actions d'UPenn contre le hackathon. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> [AUTRICHIEN] <a href="http://www.webwereld.nl/nieuws/14830.phtml">Defensie 
    VS stopt subsidie OpenBSD</a>, WebWereld NL, 22 avril 2003. </strong></font><br>
    Cet article utilise l'information de l'article publi&eacute; par CNET.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.smh.com.au/articles/2003/04/21/1050777197498.html"> 
    OpenBSD loses funding due to anti-war statements</a>, Sydney Morning Herald, 
    21 avril 2003. </strong></font><br>
    Un autre article sur le comportement du DARPA, cette fois plus en profondeur. 
    Plusieurs jours avant l'annulation des fonds, Jonathan M. Smith a indiqu&eacute; 
    &agrave; Raadt que &quot;les perceptions d'un mauvais comportement&quot; &eacute;taient 
    importantes pour UPENN. Alors que articles se propagent dans le monde entier 
    afin d'expliquer &agrave; tous les mauvais comportements d'UPENN et du DARPA, 
    qu'en pensent-ils d&eacute;sormais ?<br>
    Cet article peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante 
    : 
    <ul>
      <li><font color="#009000"><strong> <a href="http://www.theage.com.au/articles/2003/04/21/1050777197498.html"> 
        OpenBSD loses funding due to anti-war statements</a>, The Age. </strong></font> 
      </li>
      <li><font color="#009000"><strong> [INDONESIEN] <a href="http://www.detikinet.com/net/2003/04/21/20030421-105803.shtml"> 
        OpenBSD Terhambat Anti-Perang</a>, detiki-Net, Indonesia. </strong></font> 
      </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> [TURQUE] <a href="http://www.olympos.org/article/articleview/1047/1/1"> 
    DARPA OpenBSD'ye Destegini Geri Çekiyor...</a>, Olympos Security, 20 avril 
    2003. </strong></font><br>
    Le responsable du portail de s&eacute;curit&eacute; turc mentionne la coupure 
    des fonds du DARPA. Des discussionsau sujet du financement du DARPA CHATS 
    du programme POSSE et des b&eacute;n&eacute;fices &agrave; la communaut&eacute; 
    open source sont d&eacute;taill&eacute;s. Des citations de Raadt au sujet 
    de ses vues contre la guerre et son objectif &agrave; maintenir le hackathon 
    proche sont pr&eacute;sentes. Cet article couvre plusieurs contributions au 
    syst&egrave;me OpenBSD qui illustrent son attachement &agrave; la s&eacute;curit&eacute; 
    et la s&eacute;curit&eacute; pro-active.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.globeandmail.com/servlet/ArticleNews/TPStory/LAC/20030419/RMILI/TPScience/"> 
    Researcher feels anti-war views cost him U.S. funding</a>, Globe &amp; Mail, 
    18 avril 2003. </strong></font><br>
    David Akin a r&eacute;dig&eacute; un second article au sujet de la situation 
    concernant le DARPA et OpenBSD. Son premier article, accessible plus bas, 
    serait &agrave; l'origine de la col&egrave;re des officiels d'UPENN et du 
    DARPA. <br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> [FRANCAIS] <a href="http://www.weblmi.com/news_store/2003_04_18_La_DARPA_coupe_les_v_32/News_view">La 
    DARPA coupe les vivres a OpenBSD</a>, Le Monde Informatique, France 18 avril 2003. </strong></font><br>
    Un petit article dans la presse fran&ccedil;aise. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> [ALLEMAND] <a href="http://www.heise.de/newsticker/data/hps-18.04.03-002/">Aus 
    der Traum: Keine US-Gelder für OpenBSD</a>, Heise News-Ticker, 18 avril 2003. 
    </strong></font><br>
    Le DARPA annule le financement accord&eacute; &agrave; OpenBSD apr&egrave;s 
    des commentaires. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/onlamp/2003/04/18/darpa.html"> 
    Soldiers Renege on Hackers</a>, OnLamp.com, 18 avril 2003. </strong></font><br>
    Ian Darwin a &eacute;crit un &eacute;ditorial au sujet de l'histoire du DARPA, 
    les relations entre le Canada et les Etats-Unis et les &eacute;v&eacute;nements 
    imm&eacute;diats qui entourrent l'arr&ecirc;t du financement du projet POSSE.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://arstechnica.com/archive/news/1050693906.html"> 
    DARPA pulls OpenBSD funding</a>, Ars Technica Newsdesk, 18 avril 2003. </strong></font><br>
    Semi On couvre l'arr&ecirc;t brutal du financement du DARPA aupr&egrave;s 
    d'OpenBSD. Cet article regrette que les chercheurs doivent, selon le DARPA, 
    se montrer sous un jour &quot;d'hommes du parti fid&egrave;les et d&eacute;vou&eacute;s&quot; 
    pour recevoir des fonds au sein du nouveau si&egrave;cle en Am&eacute;rique.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.computerworld.com/securitytopics/security/story/0,10801,80473,00.html"> 
    DARPA pulls funding for OpenBSD, leader says</a>, IDG News Service, 18 avril 
    2003. </strong></font><br>
    Grant Gross a r&eacute;dig&eacute; un article sur l'annulation soudaine du 
    financement du projet OpenBSD par le DARPA. L'article contient un historique 
    l&eacute;ger ainsi que la r&eacute;ponse qu'il a pu obtenir apr&egrave;s plusieurs 
    appels t&eacute;l&eacute;phoniques pour se renseigner au sujet de l'annulation. 
    Cet article peut &ecirc;tre &eacute;galement lu aux adresses suivantes : <br>
    <ul>
      <li><a href="http://www.nwfusion.com/news/2003/0418darpapulls.html">Network 
        Fusion</a> </li>
      <li><a href="http://www.infoworld.com/article/03/04/18/HNdarpa_1.html">Info 
        World</a> </li>
      <li><a href="http://www.computerworld.com/securitytopics/security/story/0,10801,80473,00.html">Computerworld</a> 
      </li>
      <li><a href="http://www.idg.com.sg/idgwww.nsf/unidlookup/4EB7D1016D5B4E7548256D0F0019F8A5?OpenDocument">IDG 
        Singapore</a> </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://seattlepi.nwsource.com/business/aptech_story.asp?category=1700&amp;slug=Grant%20Canceled"> 
    DARPA Cancels OS Project After Comments</a>, (title changed to "Programmer 
    Claims Agency Dropped Funding" later) Associated Press, 18 avril 2003. </strong></font><br>
    Matthew Fordahl de l'Associated press couvre l'annulation du financement du 
    DARPA. Il y a eu plusieurs &eacute;ditions de cet article, dont le titre n'aura 
    cess&eacute; d'&eacute;voluer. Plusieurs journaux locaux ont repris l'information, 
    dont :<br>
    <ul>
      <li><font color="#009000"><strong> <a href="http://www.nytimes.com/aponline/technology/AP-Grant-Canceled.html"> 
        DARPA Cancels OS Project After Comments</a>, New York Times. </strong></font>(enregistrement 
        gratuit pour consulter) </li>
      <li><font color="#009000"><strong> <a href="http://abcnews.go.com/wire/Business/ap20030418_1015.html"> 
        DARPA Cancels OS Project After Comments</a>, ABC News. </strong></font> 
      </li>
      <li><font color="#009000"><strong> <a href="http://seattlepi.nwsource.com/business/aptech_story.asp?category=1700&amp;slug=Grant%20Canceled"> 
        Programmer Claims Agency Dropped Funding</a> Seattle Post Intelligencer, 
        WA. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.theledger.com/app:s/pbcs.dll/article?Date=20030418&amp;Category=APF&amp;ArtNo=304180815&amp;Ref=AR"> 
        [Article was pulled]</a>, Lakeland Ledger, FL. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.salon.com/tech/wire/2003/04/18/darpa/index.html"> 
        DARPA cancels open-source software project after anti-war comments</a>, 
        Salon. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.timesdaily.com/apps/pbcs.dll/article?Date=20030418&amp;Category=APF&amp;ArtNo=304180815&amp;Ref=AR"> 
        DARPA Cancels OS Project After Comments</a> Times Daily, AL. </strong></font> 
      </li>
      <li><font color="#009000"><strong> <a href="http://boston.com/dailynews/108/economy/Military_drops_project_s_fundi%3A.shtml"> 
        Military drops project's funding after anti-war comments</a> Boston.com, 
        MA. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.heraldtribune.com/apps/pbcs.dll/article?Date=20030418&amp;Category=APF&amp;ArtNo=304180815&amp;Ref=AR&amp;cachetime=5"> 
        Programmer Claims Agency Dropped Funding</a> Sarasota Herald-Tribune, 
        FL. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.rapidcityjournal.com/articles/2003/04/18/ap/HiTech/apnews42743-03.txt"> 
        [Article was pulled]</a> Rapid City Journal, SD. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.infoshop.org/inews/stories.php?story=03/04/18/9696550"> 
        DARPA cancels open-source software project after anti-war ...</a>, Infoshop 
        News. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.bayarea.com/mld/mercurynews/news/local/5666795.htm"> 
        Military drops project's funding after anti-war comments</a>, San Jose 
        Mercury News, CA. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://newsobserver.com/24hour/technology/story/859765p-6012789c.html"> 
        Military cancels OS project after programmer's comments</a>, Raleigh News, 
        NC. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.napanews.com/templates/index.cfm?template=story_full&amp;id=22677BFE-1AD7-4969-B4B6-C33A2D214DAE"> 
        Military cancels project's funding after programmer's anti-war comments</a>, 
        Napa News, CA. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.zwire.com/site/news.cfm?newsid=7759788&amp;BRD=2212&amp;PAG=461&amp;dept_id=465812&amp;rfi=6"> 
        Military drops project's funding after anti-war comments</a>, NEPA News, 
        PA. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.wired.com/news/technology/0,1282,58553,00.html"> 
        Peace Talk Halts Defence OS Job</a>, Wired News. </strong></font> <br>
      </li>
      <li> <font color="#009000"><strong> [JAPONAIS] <a href="http://www.hotwired.co.jp/news/news/culture/story/20030423205.html"> 
        Wired News Japan</a> </strong></font> </li>
    </ul>
    <p> Puis sur quelques sites, l'histoire se modifie. Une porte-parole du DARPA 
      est cit&eacute;e : &quot;Nous sommes d&eacute;sol&eacute;s que ce processus 
      de r&eacute;vision apparaisse ainsi sur plusieurs sites d'information et 
      qu'il soit interpr&eacute;t&eacute; comme un effort pour supprimer l'effort 
      de d&eacute;veloppement&quot; (si ce n'est pas une annulation, alors pourquoi 
      Mark West de l'UPENN a t&eacute;l&eacute;phon&eacute; &agrave; Hyatt Calgary 
      pour annuler toutes les r&eacute;servations, avant m&ecirc;me qu'OpenBSD 
      ne soit inform&eacute; de cette d&eacute;cision par Jonathan Smith dont 
      le courrier &eacute;lectronique indique que &quot;Penn a &eacute;t&eacute; 
      contact&eacute; par l'Air Force et QU'AUCUN COUT SUPPLEMENTAIRE NE SERA 
      DESORMAIS COUVERT, effectif aujourd'hui, 17 avril 2003&quot; et &quot;tous 
      les sous-contrats sont annul&eacute;s, A COMPTER D'AUJOURD'HUI&quot; et 
      que &quot;Penn doit mettre un terme imm&eacute;diat aux contrats et obligations 
      tels que le r&eacute;servations aux Hyatt et les frais de d&eacute;placements. 
      Mark, veuillez suivre ces instructions aussi t&ocirc;t que possible afin 
      de satisfaire nos engagements vis-&agrave;-vis du gouvernement&quot;. Les 
      articles qui suivent ont repris les &quot;informations&quot; propag&eacute;es, 
      d'autres continuant sur l'ancienne histoire :</p>
  </li>
  <li> 
    <ul>
      <li><font color="#009000"><strong> <a href="http://customwire.ap.org/dynamic/stories/G/GRANT_CANCELED?SITE=ININS&amp;SECTION=BUSINESS&amp;TEMPLATE=DEFAULT"> 
        Programmer Claims Agency Dropped Funding</a>, Indianapolis Star, IN. </strong></font> 
      </li>
      <li><font color="#009000"><strong> <a href="http://www.miami.com/mld/miamiherald/business/5666795.htm"> 
        Agency denies dropping project's funding after anti-war comments</a>, 
        Miami Herald, FL. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.portervillerecorder.com/articles/2003/04/18/ap/HiTech/apnews42749-03.txt">Programmer 
        Claims Agency Dropped Funding</a>, The Porterville Recorder, CA. </strong></font> 
      </li>
      <li><font color="#009000"><strong> <a href="http://www.kansas.com/mld/kansas/business/5666795.htm"> 
        Agency denies dropping project's funding after anti-war comments</a>, 
        Wichita Eagle, KS. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://abcnews.go.com/wire/Business/ap20030418_1329.html"> 
        Programmer Claims Agency Dropped Funding<br>
        Programmer of Secure, Free Operating System Claims U.S. Research Agency 
        Cut Off Grant Money</a>, ABC News. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.rapidcityjournal.com/articles/2003/04/18/ap/HiTech/apnews42748-03.txt"> 
        [Article was pulled]</a>, Rapid City Journal, SD. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.wilmingtonstar.com/apps/pbcs.dll/article?Date=20030418&amp;Category=APF&amp;ArtNo=304180871&amp;Ref=AR&amp;cachetime=5"> 
        Agency denies dropping project's funding after anti-war comments</a>, 
        Wilmington Star, NC. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.bayarea.com/mld/cctimes/business/5670981.htm"> 
        Project wasn't dropped over anti-war stance, agency says</a>, The Contra 
        Costa Times, Northern California. </strong></font> </li>
      <li><font color="#009000"><strong> <a href="http://www.globetechnology.com/servlet/story/RTGAM.20030421.gtprog0421/GTStory"> 
        Programmer says criticism of military cost him contract</a>, Globe Technology. 
        </strong></font> </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://theregister.co.uk/content/55/30332.html"> 
    Getting realistic in the war on hackers</a>, TheRegister/SecurityFocus, 18 
    avril 2003. </strong></font><br>
    John Lasser discute des d&eacute;g&acirc;ts provoqu&eacute;s par la loi DMCA 
    am&eacute;ricaine et les lois similaires et leur impact sur les libert&eacute;s 
    civiles ; il recommande comme meilleure option le d&eacute;veloppement de 
    technologies de s&eacute;curit&eacute;. Une couverture succinte des fonctionalit&eacute;s 
    d'OpenBSD 3.3 se trouve dans l'article.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.theinquirer.net/?article=9030"> 
    OpenBSD loses DARPA money for hackathon</a>, The Inquirer, 18 avril 2003. 
    </strong></font><br>
    Un article important sur les critiques de Theo au sujet de la guerre am&eacute;ricaine 
    en Iraq et ses implications sur la source des fonds, ce qui a pouss&eacute; 
    le DARPA a annul&eacute; son financement. Le moment de l'annulation est critique 
    pour le projet OpenBSD car il correspond &agrave; l'un de ses rassemblements 
    de d&eacute;veloppeurs, le hackathon, qui devait &ecirc;tre financ&eacute; 
    en partie par les fonds du DARPA. Cet article a &eacute;t&eacute; &eacute;crit 
    sans aucune information de la part d'OpenBSD ou du DARPA et se base uniquement 
    sur les autres articles de presse disponibles.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.osnews.com/story.php?news_id=3307"> 
    DARPA Pulls OpenBSD Funding</a>, OS News, 18 avril 2003. </strong></font><br>
    OS News a une discussion &agrave; ce sujet. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://theregister.co.uk/content/4/30333.html"> 
    US military shuns BSD for hopping landmines</a>, The Register, 18 avril 2003. 
    </strong></font><br>
    Un autre rapport sur les financements du DARPA. Celui-ci concerne des mines 
    sautantes... Il faut le lire pour le croire. Vos dollars d'imp&ocirc;ts (am&eacute;ricains) 
    &agrave; l'oeuvre. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://techupdate.zdnet.co.uk/story/0,,t481-s2133221,00.html"> 
    IT Anthems: OpenBSD</a>, ZDNet UK Tech Update, 17 avril 2003. </strong></font><br>
    Peter Judge, qui maintient les imposantes archives du <a href="http://techupdate.zdnet.co.uk/story/0,,t481-s2122414,00.html"> 
    Tech Anthems</a>, propose un petit r&eacute;sum&eacute; sur les chansons d'OpenBSD, 
    quatre au total. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://news.com.com/2100-1016-997393.html?tag=fd_top"> 
    DARPA pulls OpenBSD Funding</a>, news.com.com, 17 avril 2003. </strong></font><br>
    "Une partie non-utilis&eacute; de fonds fournis par le DARPA (Defense Advanced 
    Research Projects Agency) utilis&eacute;s pour financer le d&eacute;veloppement 
    du projet open source de syst&egrave;me d'exploitation OpenBSD ont &eacute;t&eacute; 
    supprim&eacute;s pour des raisons non sp&eacute;cifi&eacute;es&quot;. L'article 
    cite l'email de Theo qui annonce la courpure des fonds. L'article &eacute;voque 
    l'utilisation d'argent pour payer des chercheurs &quot;&eacute;trangers&quot; 
    et continue ainsi : &quot;qui plus est, de Raadt pense que le gouvernement 
    am&eacute;ricain n'a pas appr&eacute;ci&eacute; ses commentaires indiquant 
    que l'argent d&eacute;pens&eacute; sur son projet ne servirait pas &agrave; 
    construire d'autres missiles de croisi&egrave;re...&quot;, &quot;Aux Etats-Unis 
    aujourd'hui, la libert&eacute; de parole n'est qu'un mythe&quot;. Cet article 
    peut &ecirc;tre &eacute;galement lu &agrave; l'adresse suivante :<br>
    <ul>
      <li><font color="#009000"><strong> <a href="http://www.businessweek.com/technology/cnet/stories/997393.htm"> 
        BusinessWeek.com</a>, DARPA pulls OpenBSD Funding. </strong></font><br>
      </li>
      <li><font color="#009000"><strong> <a href="http://zdnet.com.com/2100-1104-997393.html"> 
        ZDnet</a>, DARPA pulls OpenBSD Funding. </strong></font><br>
      </li>
      <li><font color="#009000"><strong> <a href="http://www.zdnet.com.au/newstech/os/story/0,2000024997,20273830,00.htm"> 
        ZDnet Australia</a>, US Defence pulls open source funding. </strong></font><br>
      </li>
    </ul>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://bsd.slashdot.org/bsd/03/04/17/2332233.shtml?tid=122&amp;tid=98&amp;tid=172"> 
    DARPA Grant Cancelled for OpenBSD and U-Penn</a>, Slashdot, 17 avril 2003. 
    </strong></font><br>
    Un rapport de Slashdot (et les commentaires) sur l'annulation du financement 
    du DARPA. Des liens vers l'email originel de Theo (voir ci-dessous) qui annonce 
    que le DARPA supprime les fonds attribu&eacute;s au financement du projet 
    (au-travers de fonds attribu&eacute;s &agrave; l'universit&eacute; de Pennsylvanie) 
    sans aucune explication ou avertissement.<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://marc.theaimsgroup.com/?l=openbsd-misc&amp;m=105061580500738&amp;w=2"> 
    DARPA Cancellation</a>, MARC (Mailing list Archives), 17 avril 2003. </strong></font><br>
    L'email originel de Theo qui annonce l'annulation arbitraire du financement 
    du DARPA. &quot;Il a &eacute;t&eacute; port&eacute; &agrave; mon attention 
    que le DARPA a annul&eacute; le programme POSSE avec UPENN (affectant OpenBSD 
    et une petite partie d'OpenSSL) pour des raisons non-divulgu&eacute;es, effectif 
    d&egrave;s aujourd'hui et sans le moindre avertissement...&quot;<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.robtv.com/"> TV appearance</a>, 
    CTV Report on Business, 16 avril 2003. </strong></font><br>
    Aujourd'hui Theo est pass&eacute; &agrave; la t&eacute;l&eacute;vision pendant 
    5 minutes pour une entrevue diffus&eacute;e &agrave; 13h15. Visiblement, le 
    journaliste n'arrivait pas &agrave; r&eacute;aliser ou comprendre qu'un groupe 
    d'individus soit capable de faire des choses pour leur amusement, de produire 
    du code de qualit&eacute; qui plus est (il n'a sans doute jamais entendu le 
    mot &quot;artisants&quot;).<br>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.sans.org/newsletters/newsbites/vol5_15.php"> 
    OpenBSD Release Protected Against Buffer Overflow Attacks</a>, SANS Newsbytes, 
    16 avril 2003. </strong></font><br>
    Une description des travaux r&eacute;alis&eacute;s dans la version 3.3 pour 
    r&eacute;duire les possibilit&eacute;s d'attaques par d&eacute;passement de 
    tampon. Les &eacute;diteurs parlent visiblement en faveur des efforts r&eacute;alis&eacute;s 
    par l'&eacute;quipe afin d'offrir un logiciel de qualit&eacute;, exempt de 
    bogues. On peut ainsi citer :<br>
    (Ranum): C'est EXCELLENT de voir qu'il y a des gens assez intelligents pour 
    essayer de s'attaquer aux probl&egrave;mes avec cet aspect aussi syst&eacute;matique, 
    plut&ocirc;t que de rester coinc&eacute;s dans la boucle infernale &quot;p&eacute;n&eacute;trations 
    suivies de correctifs&quot;. C'est ainsi que progresse au mieux la s&eacute;curit&eacute; 
    : des protections fondamentales.<br>
    (Shpantzer): Ce genre d'initiatives devrait &ecirc;tre &eacute;tudi&eacute; 
    comme l'exemple m&ecirc;me de choix de d&eacute;veloppement logiciel, et ce 
    d&egrave;s le niveau sous-universitaire.<br>
    <br>
  </li>
  <li><font color="#009000"><strong> [AUTRICHIEN] <a href="http://www.automatiseringsgids.nl/news/default.asp?nwsId=21776"> 
    Project OpenBSD strijdt tegen bufferoverflows</a>, Automatiserings Gids Webeditie, 
    14 avril 2003. </strong></font><br>
    Une description de trois nouvelles techniques incorpor&eacute;es dans OpenBSD 
    pour se pr&eacute;munir contre les d&eacute;passements de tampon. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> [ALLEMAND] <a href="http://www.heise.de/newsticker/data/odi-13.04.03-000/">OpenBSD 
    mit neuem Sicherheitskonzept</a>, Heise News-Ticker, 13 avril 2003. </strong></font><br>
    Nouveaux concepts de s&eacute;curit&eacute; dans OpenBSD. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://news.com.com/2100-1002-996584.html"> 
    Open-source team fights buffer overflows</a>, CNET News.com, 11 avril 2003. 
    </strong></font><br>
    "Le projet OpenBSD esp&egrave;re que les am&eacute;liorations propos&eacute;es 
    dans sa derni&egrave;re version permettront d'&eacute;liminer les &quot;d&eacute;passements 
    de tampon&quot;, un probl&egrave;me logiciel qui frappe depuis de nombreuses 
    ann&eacute;es le monde informatique.&quot; L'article contient &eacute;galement 
    une couverture de la pr&eacute;sentation r&eacute;alis&eacute;e par Theo de 
    Raadt au CanSecWest. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> [ALLEMAND] <a href="http://www.heise.de/newsticker/data/anw-08.04.03-001/">US-Verteidigungsministerium 
    unterstützt OpenBSD</a>, Heise News-Ticker, 8 avril 2003. </strong></font><br>
    Financement d'OpenBSD par des fonds du DARPA. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.newsfactor.com/perl/story/21212.html"> 
    NEWSFACTOR SPECIAL REPORT: Inside the World of Secure Operating Systems</a> 
    NewsFactor, 8 avril 2003. </strong></font><br>
    Joe "Zonker" Brockmeier explique ce qui compose un syst&egrave;me d'exploitation 
    s&eacute;curis&eacute;, en faisant la distinction entre les syst&egrave;mes 
    &agrave; confiance et ceux qui sont renforc&eacute;s, et il pr&eacute;sente 
    ensuite l'approche d'OpenBSD. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.globeandmail.ca/servlet/story/RTGAM.20030406.whack46/BNStory/Technology/?query=openbsd"> 
    U.S. military helps fund Calgary hacker</a>, The Globe And Mail, 6 avril 2003. 
    </strong></font><br>
    OpenBSD continue &agrave; attirer l'attention du Canada du fait de son financement 
    partiel par des fonds du DARPA. Theo indique que bien que le DARPA offre des 
    fonds, ils n'expliquent pas au projet ce qu'il doit faire, mais que cet apport 
    financier permet d'acc&eacute;l&eacute;rer des d&eacute;veloppements en cours, 
    le tout distribu&eacute; sous licence BSD. </li>
</ul>
<h2>Mars 2003</h2>
<ul>
  <li><font color="#009000"><strong><a href="http://www.libroscope.org/article.php3?id_article=69"><font color="#008000">[FRANCAIS]</font> 
    OpenBSD ne désarme pas</a>, Libroscope interview, 19 mars 2003 </strong></font><br>
    L'&eacute;quipe du projet libre en ligne <a href="http://www.libroscope.org/">Libroscope</a> 
    a men&eacute; une entrevue avec les d&eacute;veloppeurs d'OpenBSD Marc Espie 
    et Miod Vallat au sujet du projet OpenBSD et son &quot;way of life''. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2003/03/13/darpabsd.html"> 
    Hackers Meet Soldiers</a>, ONLamp.com, 13 mars 2003. </strong></font><br>
    L'auteur de l'article discute du pass&eacute; d'OpenBSD dans le domaine de 
    la s&eacute;curit&eacute; et c'est pourquoi l'arm&eacute;e am&eacute;ricaine, 
    au-travers d'un financement du DARPA, am&eacute;liore le d&eacute;veloppement 
    d'OpenBSD. Les programmes <a href="http://www.darpa.mil/ato/programs/chats.htm">CHATS</a> 
    et<a href="http://www.cis.upenn.edu/%7Edsl/POSSE/">POSSE</a> sont mention&eacute;s. 
    Theo est cit&eacute; : &quot;aucun de nos d&eacute;veloppements ne sert les 
    objectifs du gouvernement": "Pratiquement tout le code qui est d&eacute;velopp&eacute; 
    est plac&eacute; dans l'arbre de sources d'OpenBSD..." L'article r&eacute;sume 
    les derniers d&eacute;veloppements plac&eacute;s dans la version current (qui 
    feront partie de la version 3.3). 
    <p> Note: les mat&eacute;riaux en relation avec le projet POSSE sont en miroir 
      <a href="http://www.darwinsys.com/posse-mirror/">ici</a></p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.seas.upenn.edu/whatsnew/computer-security.html"> 
    DARPA Awards Computer Scientists $2.1 Million to Integrate Security Features 
    into Mainstream Computers</a>. </strong></font><br>
    L'annonce originelle de l'universit&eacute; de Pennsylvanie au sujet de l'effort 
    coop&eacute;ratif entre OpenBSD et l'universit&eacute;, ainsi que les fonds 
    apport&eacute;s par le DARPA. &quot;Pendant les derni&egrave;res ann&eacute;es, 
    l'approche du gouvernement est de prendre sous contrat des chercheurs capables 
    de d&eacute;velopper les composants destin&eacute;s aux stations de travail 
    &agrave; haute-s&eacute;curit&eacute;, pour des usages sp&eacute;cifiques 
    et situ&eacute;s en-dehors de l'industrie informatique traditionnelle&quot; 
    a indiqu&eacute; le professeur [Jonathan] Smith, professeur de science informatique 
    et de calcul de Penn. &quot;Le probl&egrave;me c'est que le d&eacute;veloppement 
    de ces ordinateurs &agrave; usages particuliers ne progressent que lentement 
    et lorsque les machines sont enfin disponibles, elles sont s&ucirc;res mais 
    aussi obsol&egrave;tes&quot;. 
    <p> "Smith et les membres de Penn, l'&eacute;quipe de d&eacute;veloppement 
      du consortium OpenBSD, la fondation Apache Software et le groupe OpenSSL 
      proposent d'utiliser le mod&egrave;le du d&eacute;veloppement open source 
      - o&ugrave; les programmeurs partagent leurs avanc&eacute;es de mani&egrave;re 
      ouverte - afin de d&eacute;velopper de meilleures fonctionalit&eacute;s 
      de s&eacute;curit&eacute; au sein des ordinateurs, et pas seulement ceux 
      d&eacute;velopp&eacute;s pour les militaires ou les organisations recherchant 
      un haut niveau de s&eacute;curit&eacute;. Le gouvernement pourra alors en 
      b&eacute;n&eacute;ficier en utilisant des machines de meilleur prix, standardis&eacute;es 
      tout en conservant un bon niveau de s&eacute;curit&eacute;" </p>
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://slate.msn.com/id/2079549/"> 
    Bush's Cyberstrategery: The administration's war against a bogus threat </a>, 
    Slate, 3 mars 2003. </strong></font><br>
    Brendan Koerner qui r&eacute;fute le FUD (peur, incertitude et doute) totalement 
    coup&eacute; de la r&eacute;alit&eacute; dans le r&eacute;cent document publi&eacute; 
    par l'administration Bush, le <a href="http://www.whitehouse.gov/pcipb/">National 
    Strategy to Secure Cyberspace</a>, NIPC et les vendeurs qui en profitent au-travers 
    de leurs mensonges sur la menace de pirates contre lesquels la seule solution 
    serait une v&eacute;ritable guerre au m&ecirc;me titre que celles qui sont 
    men&eacute;es contre la drogue ou le terrorisme. Il conclut ainsi : &quot;l'essentiel 
    du rapport est d'un niveau tr&egrave;s m&eacute;diocre. La majeure partie 
    n'est qu'un jargon sans aucun sens, comme des suggestions : &quot;les futurs 
    composants de la cyber infrastructure sont construits pour incorporer une 
    forte s&eacute;curit&eacute; et utiles pour leurs utilisateurs&quot;. Un sentiment 
    fantastique mais aussi flou que de dire que le pr&eacute;sident ne se destine 
    &quot;qu'aux enfants&quot;. Pourquoi ne pas rendre ces vendeurs de logiciels 
    responsables de leurs bogues ? Ou d'&eacute;liminer les produits de Microsoft 
    sans aucune s&eacute;curit&eacute; comme le serveur SQL en faveur de solutions 
    plus &eacute;prouv&eacute;es comme <a href="http://www.openbsd.org/">OpenBSD</a>?" 
    Je doute fortement que le d&eacute;tenteur direct de Slate, c'est &agrave; 
    dire Microsoft, les paie pour &eacute;crire ce genre de choses (sans compter 
    que Koerner semble penser qu'OpenBSD est une base de donn&eacute;es...). Enfin, 
    &quot;Rien ne saurait &ecirc;tre inutile en termes de strat&eacute;gie. C'est 
    un autre indicateur que les tsars nationaux de la s&eacute;curit&eacute; informatique 
    semblent trop satisfaits de continuer de discuter &agrave; perp&eacute;tuit&eacute;. 
    Plus grande sera la menace telle que percue, et plus le sujet sera trait&eacute; 
    avec s&eacute;rieux au sein de la 'Beltway' "
    <p> </p>
  </li>
</ul>
<h2>Janvier 2003</h2>
<ul>
  <li><font color="#009000"><strong><a href="http://kerneltrap.org/node.php?id=568">Feature: 
    OpenBSD's Battle For UltraSparc III Documentation</a>, Kerneltrap, 26 janvier 
    2003. </strong></font><br>
    Jeremy Andrews a r&eacute;dig&eacute; un rapport afin de mieux contacter Sun 
    pour leur expliquer la situation et leur demander de clarifier la signification 
    de leur affirmation &quot;d'architecture ouverte UltraSparc III) mais aucune 
    r&eacute;ponse n'aura malheureusement &eacute;t&eacute; obtenue de la part 
    de Sun. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.egovos.org/pdf/dodfoss.pdf">Use 
    of Free and Open-Source Software (FOSS) in the U.S. Department of Defense</a>, 
    MITRE Report Number MP 02 W0000101, r&eacute;vis&eacute; le 2 janvier 2003 
    </strong></font><br>
    Pr&eacute;par&eacute; par la corporation MITRE pour le DISA (Defense Information 
    Systems Agency), ce rapport analyse comment le DoD (le d&eacute;partement 
    de la d&eacute;fense am&eacute;ricain) utilise les logiciels libres. Le r&eacute;sum&eacute; 
    &eacute;tudie bri&egrave;vement les divers termes qui caract&eacute;risent 
    les logiciels libres (libre, open source, etc.) puis discute de l'&eacute;tude 
    elle-m&ecirc;me dont l'une des questions est &quot;... la question hypoth&eacute;tique... 
    de ce qui pourrait survenir si les logiciels libres n'&eacute;taient plus 
    disponibles au d&eacute;partement de la d&eacute;fense pour ses usages informatiques&quot;.<br>
    &quot;La principale conclusion de l'analyse est que les logiciels FOSS jouent 
    un r&ocirc;le critique au sein du d&eacute;partement de la d&eacute;fense, 
    et ce bien plus qu'on ne le reconna&icirc;t. Ces applications sont tr&egrave;s 
    importantes dans quatre zones d'ensemble : le support et l'infrastructure, 
    le d&eacute;veloppement logiciel et la recherche. Un r&eacute;sultat innatendu 
    est le degr&eacute; auquel la s&eacute;curit&eacute; des syst&egrave;mes d'information 
    d&eacute;pend des logiciels libres. Interdire les logiciels libres dans l'infrastructure 
    (comme par exemple OpenBSD) aurait de graves cons&eacute;quences sur la s&eacute;curit&eacute; 
    des r&eacute;seaux. Le d&eacute;partement de la d&eacute;fense serait &eacute;galement 
    limit&eacute; dans ses acc&egrave;s, sans compter la r&eacute;duction du degr&eacute; 
    d'analyse et de d&eacute;tection requis pour d&eacute;tecter et contrer &agrave; 
    temps les attaques. Enfin, le d&eacute;partement de la d&eacute;fense a montr&eacute; 
    que la vitesse de r&eacute;action pratiquement imm&eacute;diate aux trous 
    de s&eacute;curit&eacute; est vitale dans leur usage de l'outil informatique, 
    car les attaques les plus &eacute;volu&eacute;es et r&eacute;centes sont souvent 
    utilis&eacute;es contre leurs syst&egrave;mes.<br>
    Esp&eacute;rons donc que les responsables des politiques de s&eacute;curit&eacute; 
    liront ce rapport.<br>
  </li>
</ul>
<h2>Décembre 2002</h2>
<ul>
  <li><font color="#009000"><strong><a href="http://news.com.com/2100-1001-975941.html">Open-Source 
    clan in spat with Sun</a>, CNET News.com, 4 d&eacute;cembre 2002. </strong></font><br>
    Un rapport qui explique que Sun refuse de communiquer la documentation ad&eacute;quate 
    pour qu'OpenBSD puisse acc&eacute;der aux fonctionalit&eacute;s du processeur 
    UltraSPARC III sans devoir signer de NDA. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.heise.de/newsticker/data/anw-04.12.02-006/"> 
    [ALLEMAND] Sun blockiert OpenBSD</a>, Heise News-Ticker, 4 d&eacute;cembre 
    2002 </strong></font><br>
    Sun refuse de fournir au projet OpenBSD les sp&eacute;cifications du processeur 
    UltraSPARC III si le projet ne signe pas de NDA. 
    <p> </p>
  </li>
  <li><font color="#009000"><strong> <a href="http://www.eweek.com/article2/0,3959,743002,00.asp"> 
    OpenHack 2002 Downloads</a>, eWeek, 3 d&eacute;cembre 2002. </strong></font><br>
    eWEEK utilise OpenBSD pour leurs quatres parefeux et serveurs de courrier, 
    Web et DNS dans leur concours annuel de s&eacute;curit&eacute; OpenHack.<br>
    <p> </p>
  </li>
</ul>

<h2>October 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/10/31/ssn_openbsd.html"> 
    Securing Small Networks With OpenBSD, Part 9: Simple Things to Improve Your 
    System's Security</a>, <br>
    O'Reilly Network, 31 octobre 2002 </strong></font><br>
    Apprenez à améliorer la sécurité de votre système 
    en exploitatn au mieux les drapeaux des fichiers, en empêchant l'accès 
    de root via OpenBSD et en créant des hachages MD5 des fichiers sensibles. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.eweek.com/article2/0,3959,640713,00.asp"> 
    OpenBSD 3.2 is back on track</a>, eWeek, 18 octobre 2002 </strong></font><br>
    Un intéressant résumé de la récente lutte des 
    développeurs pour améliorer la sécurité de leur 
    système d'exploitation. L'article liste les nouvelles fonctionnalités 
    et recommande OpenBSD, en particulier pour les "emplacements en bord 
    de réseau qui doivent être installés correctement au premier 
    essai". <br>
    <p> 
</p></li></ul>


<h2>Août 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/08/22/ssn_openbsd.html"> 
    Securing Small Networks With OpenBSD, Part 8: Managing Advanced PF Logs</a>, 
    O'Reilly Network, 22 août 2002 </strong></font><br>
    Utilisez le langage Perl pour améliorer le script "readpflog" 
    de la <a href="http://www.onlamp.com/pub/a/bsd/2002/07/25/ssn_openbsd.html">partie 
    6</a>. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/08/08/ssn_openbsd.html"> 
    Securing Small Networks With OpenBSD, Part 7:</a>, O'Reilly Network, 8 août 
    2002 </strong></font><br>
    L'amélioration de la sécurité des systèmes d'enregistrement 
    d'activité à distance, et apprendre à calculer l'espace 
    requis pour la journalisation des activités dans cette partie.

   <p> 
  </p></li><li><font color="#009000"><strong> [polonais] <a href="http://urtica.linuxnews.pl/">OpenBSD 
    and Linux</a>, LinuxNews Radio, 2 août 2000 </strong></font><br>
    Bartek Rozkrut (aussi connu sous le diminutif "Madey"), a participé
    à une émission de radio : LinuxRadio. Il a expliqué les
    différences qu'il peut exister entre Linux et OpenBSD. Pendant l'émission,
    les auditeurs ont pu faire des commentaires et poser des questions depuis
    le canal IRC #linuxnews (IRCNET). La critique principale semble être
    le manque de support du multi-processeur par OpenBSD, et le fait qu'il ne
    soit pas disponible pour la plateforme IA64. LinuxNEWS est le plus grand fournisseur
    d'informations Linux du pays, et il y couvre toute la scène Linux.<br>
    <i>En voici le <a href="http://urtica.linuxnews.pl/radio/audycja7.mp3">MP3</a></i>.
<p> 
</p></li></ul>

<h2>Juillet 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/07/25/ssn_openbsd.html"> 
    Securing Small Networks With OpenBSD, Part 6</a>, O'Reilly Network, 25 juillet 
    2002 </strong></font><br>
    L'archivage des fichiers d'activité de pf à l'aide d'une station 
    de surveillance ; la <a href="http://www.onlamp.com/pub/ct/58">série</a> 
    se poursuit. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://ezine.daemonnews.org/200207/transpfobsd.html"> 
    HOWTO: Transparent Packet Filtering with OpenBSD</a>, Daemonnews E-Zine, 1er 
    juillet 2002 </strong></font><br>
    Un autre article qui détaille la mise en place d'un parefeu transparent 
    de type "pont" (transparent bridging firewall), cette fois en se 
    basant sur pf.<br>
    <p> 
</p></li></ul>

<h2>Juin 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/06/20/openbsd.html"> 
    Securing Small Networks With OpenBSD, Part 5</a>, O'Reilly Network, 20 juin 
    2002 </strong></font><br>
    La <a href="http://www.onlamp.com/pub/ct/58">série</a> continue avec 
    un article sur la vie secrète des journaux de pf et leur rotation. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/06/06/ssnwopenbsd.html"> 
    Securing Small Networks With OpenBSD, Part 4</a>, O'Reilly Network, 26 juin 
    2002 </strong></font><br>
    Plus de contenu au sujet de pf, cette fois la description complète 
    d'une bonne journalisation de son activité.
<p> 
</p></li></ul>

<h2>Avril 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/04/25/securing.html"> 
    Securing Small Networks With OpenBSD, Part 3</a>, O'Reilly Network, 25 avril 
    2002 </strong></font><br>
    Un autre article intéressant dans cette <a href="http://www.onlamp.com/pub/ct/58">série</a>, 
    qui décrit comment les paquets sont traités par pf, et comment 
    sendmail peut rencontrer des problèmes si vous configurer pf comme 
    il l'a été décrit dans les deux premiers articles de 
    cette série. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/04/11/securing.html"> 
    Securing Small Networks With OpenBSD, Part 2</a>, O'Reilly Network, 11 avril 
    2002 </strong></font><br>
    Le successeur d'un article couvrant OpenBSD 2.9 et ipf, cette nouvelle version 
    couvre OpenBSD et son nouveau parefeu pf, comment migrer les règles 
    d'ipf vers pf en particulier.
<p> 
</p></li></ul>

<h2>Mars 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://zdnet.com.com/2100-1107-863169.html"> 
    Want a Windows alternative? Try BSD</a>, ZDNet News AnchorDesk, 19 mars 2002 
    </strong></font><br>
    Un assez bon aperçu des trois BSD. L'auteur explique pourquoi il faut 
    s'intéresser à ces BSD plutôt que Linux. Il souligne en 
    particulier l'intérêt d'OpenBSD et sa méthodologie d'audit 
    des sources, et son attitude vis à vis d'une sécurité 
    active "par défaut".<br>
    <p> 
</p></li></ul>

<h2>Février 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2002/02/28/openbsd.html"> 
    Securing Small Networks With OpenBSD, Part 1</a>, O'Reilly Network, 28 février 
    2002 </strong></font><br>
    Le début d'une série sur OpenBSD comme parefeu, avec ipf comme 
    coeur du système. Cet article est un peu moins à jour que les 
    nouvelles séries qui se basent sur le nouveau parefeu pf d'OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://theregister.co.uk/content/55/24239.html"> 
    Woz blesses Captain Crunch's new box</a>, The Register, 27 février 
    2002 </strong></font><br>
    Andrew Orlowski discute avec Steven Wozniak de la machine de Captain Crunch 
    : CrunchBox. Il s'agit d'un parefeu et système de détection 
    des intrusions basés sur OpenBSD 2.9 et dotés d'heuristiques 
    personnalisés à cette fin. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2002/February/Features642.html"> 
    Parents: OpenBSD Is Superior</a>, BSD Today, 27 février 2002 </strong></font><br>
    Ben Goren nous explique pourquoi il a préféré installer 
    OpenBSD plutôt qu'une distribution Linux sur la machine de ses parents.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.openlysecure.org/openbsd/how-to/invisible_firewall.html"> 
    Memoirs of an invisible firewall</a>, openlysecure.org, 13 février 
    2002 </strong></font><br>
    Un vieil article qui discute de l'utilisation d'OpenBSD comme parefeu invisible 
    pont à l'aide d'IPFilter.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://techupdate.zdnet.com/techupdate/stories/main/0,14179,2846265,00.html"> 
    BSD operating systems: Perspective</a>, ZDNet Tech Update, 13 février 
    2002 </strong></font><br>
    Une discussion au sujet des trois BSD et de BSD/OS comme compétition 
    à Linux et les Unices commerciaux. Mary Hubley étudie des thèmes 
    qui vont de l'histoire des BSD aux futures perspectives des quatres OS couverts 
    par son article.<br>
    La partie sur OpenBSD souligne la sécurité du système 
    d'exploitation et ses mécanismes cryptographiques intégrés 
    comme OpenSSH, IPsec ou Kerberos.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.osopinion.com/perl/story/16160.html"> 
    OpenBSD as an example for Microsoft would-be improvements in software and 
    security</a>, OS Opinion, 5 février 2002 </strong></font><br>
    Reprenant l'annonce publiée par Microsoft au sujet des problèmes 
    de sécurité affectant ses codes sources, l'auteur de cet article 
    donne OpenBSD comme exemple de réussite que l'on peut obtenir par un 
    audit constant et régulier des sources. Il explique que les autres 
    systèmes d'exploitation ne considèrent pas ces risques sérieusement 
    et même que "<em>si Microsoft était capable de traquer les 
    bogues et de les éliminer comme OpenBSD a pu le faire, les développeurs 
    d'autres systèmes d'exploitation pourraient se retrouver très 
    vite dans une mauvaise position</em>"<br>
    Ce n'est pas mauvais pour une campagne de marketing, bien que tout le monde 
    sache que Microsoft n'a aucune crédibilité dans le domaine de 
    la sécurité, de par son histoire, alors qu'OpenBSD... a prouvé 
    de longue date que son niveau de sécurité est sans aucune comparaison.<br>
    <p> 
</p></li></ul>

<h2>Janvier 2002</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2002/January/Features617.html"> 
    A commercial hosting company implements OpenBSD: An Interview</a>, BSD Today, 
    janvier 2002 </strong></font><br>
    L'auteur Open Source Robert Bernstein explique à Chris Nadovich, détenteur 
    et opérateur d'une entreprise de comptes distants et d'hébergement 
    Web, pourquoi ils ont migré leurs systèmes SystemV vers Linux, 
    puis vers BSD. Il détaille les questions de sécurité. 
    "<em>C'est l'augmentation sensible des mauvaises activités dans 
    le monde du réseau qui nous a poussé à ouvrir les yeux 
    et à comprendre certaines "différences essentielles" 
    et nous avons finalement choisi d'utiliser OpenBSD</em>".<br>
    Somme toute, un excellent article qui explique pourquoi un fournisseur de 
    services et d'accès à Internet expérimenté adopte 
    OpenBSD comme système d'exploitation de facto.
<p> 
</p></li></ul>

<h2>Décembre 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2001/December/News604.html"> 
    OpenBSD 3.0 officially released</a>, BSD Today, décembre 2001 </strong></font><br>
    Annonce de la version 3.0 d'OpenBSD sur BSD Today.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.itworld.com/nl/unix_insider/12182001/"> 
    OpenBSD 3.0 Debuts</a>, ITworld, 18 décembre 2001 </strong></font><br>
    Annonce de la version 3.0 d'OpenBSD et quelques commentaires de la part de 
    Theo de Raadt sur cette nouvelle version.<br>
    <p> 
</p></li></ul>

<h2>Novembre 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.kerneltrap.org/article.php?sid=389"> 
    Interview with Theo de Raadt</a>, kerneltrap.org, 26 novembre 2001 </strong></font><br>
    Jeremy Andrews dans un entretien étendu avec Theo de Raadt. La majeure 
    partie de l'entrevue est très intéressante pour ses questions 
    et réponses, mais certaines questions semblent motiver Theo qui se 
    montre plus volubile sur certaines fonctionalités comme les Soft Updates 
    ou le statut de parefeu développér par l'équipe d'OpenBSD 
    : pf. Une excellente lecture.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://techupdate.zdnet.com/techupdate/stories/main/0,14179,2822483,00.html"> 
    OpenBSD: The most secure OS around</a>, ZDNet, 6 novembre 2001 </strong></font><br>
    Le rédacteur et ancien membre de la NASA et administrateur du réseau 
    du DoD (également programmeur) Steven Vaughan-Nichols, acclame OpenBSD 
    pour son audit de sécurité et la recherche de problèmes 
    potentiels qui permettent au projet OpenBSD de régler les problèmes 
    de sécurité <b>avant</b> qu'ils ne deviennent des trous de sécurité. 
    "<em>Au contraire de la plupart des autres systèmes d'exploitation, 
    l'équipe d'OpenBSD a une attitude pro-active plutôt que réactive 
    face aux problèmes de sécurité"</em><br>
    Il explique la politique de <i>sécurité par défaut</i> 
    d'OpenBSD, l'implémentation du protocole d'authentification Kerberos 
    et la pile TCP/IP intégrant le protocole IPsec, ces composants permettant 
    la mise en place de solutions de réseau virtuel privé alors 
    que sous d'autres systèmes il faut installer des composants puis les 
    configurer. Qui plus est, il explique pourquoi il pense que, comme Theo de 
    Raadt, la "<em>securité est toujours améliorée par 
    le retrait de composants logiciels, et pas en ajoutant plus de détritus" 
    </em> ; la complexité restant le premier enemi de la sécurité.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.byte.com/documents/s=1778/byt20011031s0004/"> 
    Operating System 2010</a>, Byte, 5 novembre 2001 </strong></font><br>
    Un regard sur l'évolution future des systèmes d'exploitation, 
    qui couvre le niveau d'intégration logicielle au sein du système 
    d'exploitation, la sécurité qu'il incorpore par défaut, 
    la distinction entre serveur et client et les modèles ouverts, fermés 
    ou hybrides. Steven Vaughan-Nichols montre ces perspectives depuis plusieurs 
    points de vues, avec dans le modèle Unix celui d'OpenBSD en particulier 
    qui a beaucoup à montrer.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.infoworld.com/articles/tc/xml/01/11/05/011105tcbsd.xml"> 
    BSD's strength lies in devilish details</a>, InfoWorld 2 novembre 2001 </strong></font><br>
    Par Tom Yager. En comparant les systèmes BSD et dérivés 
    avec ceux basés sur Linux, l'auteur souligne la stabilité et 
    les forces quand à la sécurité que les BSD apportent. 
    Il montre OpenBSD comme <i>policier</i> du groupe et fait remarquer le fait 
    que <em>"il n'a à ce jour jamais été possible de 
    forcer à distance la sécurité d'un serveur OpenBSD"</em>. 
    <p> 
</p></li></ul>

<h2>Octobre 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.infoworld.com/articles/op/xml/01/10/29/011029opsource.xml"> 
    Already a Contender</a>, InfoWorld, 29 octobre 2001 </strong></font><br>
    Le consultant Open Source Russel Pavlicek propose la solution des logiciels 
    open source en réponse à un article qui tente de convaincre 
    que l'open source n'est pas une source d'innovation. Il réfute ce mensonge 
    en citant des logiciels open source comme sendmail, Apache ou Bind. <i>Ho.. 
    Et si vous en avez assez de voir votre IIS être piraté, Apache 
    sous OpenBSD permet d'assurer une présence bien plus sécurisée 
    sur Internet.</i><br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://zdnet.com.com/2100-1107-504079.html"> 
    How Code Red revealed the perils of port 80</a>, ZDNet, 2 octobre 2001 </strong></font><br>
    L'auteur Stephan Somogyi et le directeur technique de Counterpane Systems, 
    Bruce Schneier, dans un article au sujet des effets et conséquences 
    du ver "Code Red" qui a attaqué les serveurs utilisant IIS 
    de Microsoft soulignent les mérites et la fiabilité par rapport 
    à la course aux nouvelles fonctionnalités. Comme exemple positif 
    il citent OpenBSD.<br>
    <p> 
</p></li></ul>

<h2>Août 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.nas.nasa.gov/About/Media/announcements.html#alert_8_23_01"> 
    OpenBSD firewall gateway at NASA's Advanced Supercomputing Division</a>, 23 
    août 2001 </strong></font><br>
    Le groupe en charge de la sécurité des réseaux de la 
    NASA, division avancée des super-calculateurs (NAS) a implémenté 
    une passerelle sans-fil reposant sur OpenBSD, afin de <i>régler les 
    problèmes connus du standard sans-fil 802.11n en y consacrant le minimum 
    de temps et d'investissement.</i><br>
    Les détails de leur implémentaion sont disponibles dans ce <a href="http://www.nas.nasa.gov/Groups/Networks/Projects/Wireless/index.html"> 
    document</a>. 
    <p> 
  </p></li>
  <li><font color="#009000"><strong> <a 
    href="http://www.ciberpais.elpais.es/d/20010816/cibersoc/soc1.htm">[espagnol] HAL 
    2001 coverage</a>, Ciberpaís (El País), 16 août 2001 </strong></font><br>
    L'édition en ligne de ce journal majeur espagnol propose un court article
    du <a href="http://www.hal2001.org/">HAL 2001</a>. L'auteur attire l'attention
    sur les autocollants des portables et les t-shirts que portaient les gens
    : <i>"cela ressemble à un tournoi médiéval où 
    les plus puissants montrent leurs bannières de guerre : <b>OpenBSD</b>, 
    CCC, Cypherpunks, 2600, Indymedia..."</i><br>
  <p>
  </p></li>
  <li><font color="#009000"><strong> <a href="http://www.unixreview.com/documents/s=1232/urm0108m/"> 
    Thinking about Security</a>, Unix Review, août 2001 </strong></font><br>
    En réponse au ver "Code Red" qui a frappé IIS, Joe 
    "Zoncker" Brockmeir fait le tour des systèmes d'administration 
    dans le domaine de la sécurité et explique que même les 
    systèmes qui utilisent Apache comme OpenBSD peuvent avoir des problèmes 
    de sécurité de temps en temps.<br>
    Et bien nous devrons vivre avec cela, et au lieu d'avoir un système 
    totalement sécurisé se contenter d'être le système 
    le plus sécurisé disponible à ce jour.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.samag.com/documents/s=1147/sam0108m/"> 
    Homebrew Intrusion Detection Systems</a>, SysAdmin, août 2001 </strong></font><br>
    Chris Kuethe va plus loin qu'installer des systèmes de détection 
    d'intrusion et explique comment choisir un bon environnement pour installer 
    ces outils et comment les faire fonctionner, en prenant OpenBSD comme plateforme 
    de référence:<br>
    <em>"En l'état de mes connaissances (vous êtes invités 
    à me faire part du contraire) OpenBSD est le système qui dispose 
    aujourd'hui de la pile TCP/IP la plus rapide (et il faut reconnaître 
    que les systèmes BSD partagent un code remarquable dans ce domaine) 
    et un record de sécurité plus qu'enviable. L'outil de surveillance 
    réseau est unique car il se situe souvent en-dehors du réseau 
    et doit donc être particulièrement bien protégé 
    pour servir sa fonction au mieux"</em><br>
    Pour référence, il indique que <em>"OpenBSD dispose d'une 
    documentation complète ; pratiquement tout ce dont vous aurez jamais 
    besoin pour mettre en place votre station d'analyse se trouve dans les pages 
    man du système, ou sa FAQ.""</em> <br>
    Bravo! 
    <p> 
</p></li></ul>

<h2>Juillet 2001</h2>
<ul>
  <li><font color="#009000"><strong> Un article dans <a href="http://www.sun.com/blueprints/0701/openSSH.html"> 
    Sun's Solaris Blueprints Online series</a> </strong></font> parle d'OpenSSH 
    comme un bon remplacement de telent, login et associés. L'article indique 
    même: <br>
    "OpenSSH est géré par l'équipe d'OpenBSD. OpenBSD 
    est un système d'exploitation Open Source basé sur BSD 4.4-Lite 
    et disponible gratuitement. L'un des principaux objectifs de ce projet est 
    la création d'un système d'exploitation sécurisé 
    par l'audit du code source, la correction rapide des problèmes de sécurité 
    et l'intégration d'outils de sécurité et cryptographiques..."
<p> 
</p></li></ul>

<h2>Juin 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.internetweek.com/reviews01/rev061801.htm"> 
    The OS X Files: Apple's updated operating system looks to the Internet</a>, 
    InternetWeek, 18 juin 2001 </strong></font><br>
    Au cours d'une étude de MacOS X, Larry Loeb étudie la question 
    du changement entre MacOS et MacOS X en indiquant que :<br>
    <em>"[...] la couche Unix se base sur OpenBSD, l'un des Unix libres les plus 
    sécurisés disponibles."</em> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a 
    href="http://www.itviikko.fi/uutiset/uutinen.asp?UutisID=46057">[finlandais] ITviikko 
    - uutinen</a> 14 juin 2001 </strong></font><br>
    Un court article sur IPF qui menace les principes open source du projet OpenBSD
    et pourquoi IPF sera, en conséquence, retiré du projet.
   <p>
  </p></li><li><font color="#009000"><strong> <a 
    href="http://nyheter.idg.se/display.asp?id=010613-CS3">[su&eacute;dois]  
    Computer Sweden</a>, 13 juin 2001</strong></font><br>
    Une annonce de presse sur la sortie d'OpenBSD 2.9
   <p>
  </p></li><li><font color="#009000"><strong> <a href="http://zdnet.com.com/2100-11-530016.html"> 
    Strife and success in the land of open source</a>, ZDNet News, 11 juin 2001 
    </strong></font><br>
    Stephan Somogyi étudie les problèmes liés à la 
    licence d'IPF et explique pourquoi le projet OpenBSD a décidé 
    de retirer ce logiciel de son arbre des sources. Comme il l'indique <em>"le 
    code parle de lui-même et OpenBSD s'est déjà exprimé 
    de manière plus qu'éloquente de part le passé"</em>. 
    Un peu plus loin dans l'article in explique que l'audit des <em>licences</em> 
    au sein d'OpenBSD a poussé Wietse Venema à modifier la licence 
    couvrant son tcp_wrappers après une discussion avec Theo de Raadt. 
    Pour mettre un terme à l'épineuse question de la licence IPF 
    vis à vis d'OpenBSD? Somogyi indique dans la fin de son article que 
    concernant la dernière version d'OpenBSD 2.9 nous avons une <em>"histoire 
    de succes story open source".</em> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2001/June/Features496.html"> 
    Interview with Wietse Venema about his tcp_wrappers license</a>, BSD Today, 
    1er juin 2001 </strong></font><br>
    Effectuant des recherches poussées dans l'arbre de sources de BSD, 
    Jeremy C. Reed a découvert que la licence de tcp_wrappers n'est pas 
    conforme aux objectifs du projet. L'interview qui suit avec Wietse Venema 
    a attiré l'attention de Theo de Raadt qui a eu une discussion assez 
    longue et amusant avec ce dernier, au sujet de sa licence. La nouvelle <a href="ftp://ftp.porcupine.org/pub/security/tcp_wrappers_license">licence</a> 
    des tcp_wrappers est désormais libre, comme la <a href="ftp://ftp.porcupine.org/pub/security/logdaemon_license">licence</a> 
    de logdaemon! 
    <p> 
</p></li></ul>

<h2>Mai 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://false.net/ipfilter/2001_05/0332.html">Re: 
    IPFilter 3.4 update. </a>, Darren Reed, IPFilter mailing list archive, 19 
    mai 2001<br>
    <a href="http://lwn.net/2001/0524/#ipfilter">BSD is not free software?</a>, 
    LWN weekly news, 24 mai 2001<br>
    <a href="http://www.bsdtoday.com/2001/May/News489.html">IP Filter License 
    change?</a>, Jeremy C. Reed, BSD Today, 24 mai 2001<br>
    <a href="http://www.deadly.org/article.php3?sid=20010527142347"> Changes in 
    IPFilter license to affect OpenBSD?</a>, Dengue, OpenBSD Journal, 27 mai 2001<br>
    <!-- <a href="http://securityportal.com/articles/ipf20010528.html"> -->
    IPF: Free no more?, Kurt Seifried, Security Portal, 28 mai 2001 <br>
    <a href="http://slashdot.org/article.pl?sid=01/05/28/1225224&amp;mode=thread">IPF 
    License Change: Redistribution Not Allowed</a>, Timothy, Slashdot, 28 mai 
    2001<br>
    <a href="http://slashdot.org/article.pl?sid=01/05/28/0610252&amp;mode=thread">Changes 
    in IPFilter License</a>, Hemos, Slashdot, 28 mai 2001 <br>
    <a href="http://www.deadly.org/article.php3?sid=20010530141105"> IPF removed 
    from OpenBSD</a>, Dengue, OpenBSD Journal, 30 mai 2001<br>
    <a href="http://linuxtoday.com/news_story.php3?ltsn=2001-05-30-001-20-NW-BD">IPFilter 
    Comes Out of OpenBSD CVS</a>, Theo de Raadt, Linux Today, 30 mai 2001<br>
    <a href="http://news.cnet.com/news/0-1003-200-6119988.html">Open-source spat 
    spurs software change</a>, Stephen Shankland, CNET.com - Tech News, 30 mai 
    2001<br>
    <a href="http://nyheter.idg.se/display.asp?id=010531-cs14">[su&eacute;dois]  
    Computer Sweden</a>, 31 mai 2001<br> 
    <a href="http://lwn.net/2001/0531/a/ipfilter-gone.php3">ipf (more)</a>, Theo 
    de Raadt, LWN weekly news, 31 mai 2001<br>
    <a href="http://lwn.net/2001/0601/">IP Filter licensing followup.</a>, LWN 
    weekly news, 1er juin 2001<br>
    <a href="http://www.bsdtoday.com/2001/June/Features495.html"> BSD project 
    goals, IP Filter licensing, and Darren Reed interview</a>, Jeremy C. Reed, 
    BSD Today, 1er juin 2001<br>
    <a href="http://www.computerworld.com/cwi/story/0,1199,NAV47_STO61038,00.html"> 
    OpenBSD drops firewall program in licensing dispute</a>, Todd R. Weiss, ComputerWorld, 
    1er juin 2001<br>
    <a href="http://slashdot.org/article.pl?sid=01/06/03/1911246&amp;mode=thread">Changes 
    in IPFilter License</a>, Hemos, Slashdot, June 3, 2001<br>
    <a href="http://www.newsforge.com/article.pl?sid=01/06/06/169245&amp;mode=thread"> 
    OpenBSD and ipfilter still fighting over license agreement</a>, NewsForge, 
    June 6, 2001<br>
    <a href="http://slashdot.org/article.pl?sid=01/06/25/1557213"> OpenBSD gets 
    brand-new packet filter</a> <em>(Slashdot echoes OpenBSD <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pf&amp;sektion=4">pf(4)</a> 
    development.)</em>, Slashdot, June 25, 2001<br>
    </strong></font><br>
    De nombreux articles et discussions ont suivi la clarification par Darren 
    Reed de la licence de son logiciel <a href="http://coombs.anu.edu.au/%7Eavalon/ip-filter.html">IP 
    Filter</a><br>
    Considérant qu'IPF n'est pas <a href="http://www.opensource.org/">Open 
    Source</a> et qu'il ne convient pas aux <a href="http://www.openbsd.org/fr/goals.html">règles 
    sur leslicences acceptables par OpenBSD</a>, IPF a été retiré 
    de la prochaine version d'OpenBSD et sera remplacé par une alternative 
    libre. <br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.seifried.org/security/os/20011107-linux-openbsd.html"> 
    Why Linux Will Never Be as Secure as OpenBSD</a>, SecurityPortal (now at Seifried's 
    site), 16 mai 2001 </strong></font><br>
    La suite d'un article de la semaine précédente, qui était 
    intitulé <a href="http://www.seifried.org/security/os/20011107-openbsd-linux.html">"Why 
    OpenBSD will never be as secure as Linux"</a>. Kurt Seifried en vient à 
    la conclusion qu'une programmation propre et efficace est plus importante 
    que les fonctionnalités, les ajouts.. et qu'OpenBSD se trouve donc 
    dans une meilleure position au vu de cet objectif.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://news.com.com/2100-1001-257013.html"> 
    Flaw found in common Internet standard</a>, ZDNet News, 3 mai 2001 </strong></font><br>
    Robert Lemos nous explique <a href="http://www.cert.org/advisories/CA-2001-09.html">l'avertissement</a> 
    du <a href="http://www.cert.org/">CERT</a> au sujet des numéros initiaux 
    de séquence (ISN) et le risque qui peut survenir lorsqu'ils sont utilisés 
    pour prendre le contrôle d'une connexion, en soulignant le fait que 
    cette attaque n'est pas possible face à OpenBSD.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a 
    href="http://nyheter.idg.se/display.asp?id=010503-cs7">[su&eacute;dois]  
    Computer Sweden</a>, 3 mai 2001</strong></font><br>
    Un article sur ce qu'est réellement FreeBSD, avec la mention explicite
    qu'OpenBSD est le meilleur choix quand la sécurité est le premier 
    critère. 
    <p> 
</p></li></ul>


<h2>Avril 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://razor.bindview.com/publish/papers/tcpseq.html"> 
    Strange Attractors and TCP/IP Sequence Number Analysis</a>, Razor Bindview, 
    21 avril 2001 </strong></font><br>
    Michal Zalewski a réalisé une étude sur le degré 
    de probabilité pour qu'un attaquant puisse insérer un paquet 
    malicieux au sein d'une connexion TCP. En utilisant une série de graphiques 
    très intéressants, chaque système d'exploitation est 
    couvert dont Windows 9x, Me, 2000, Solaris, Linux et la famille des systèmes 
    BSD. OpenBSD obtient un score intéressant, fiable jusqu'à la 
    version 2.8 et complétement sûr à partir de la version 
    2.9 <br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a 
    href="http://nyheter.idg.se/display.asp?id=010420-cs6">[su&eacute;dois]  
    Computer Sweden</a>, 20 avril 2001</strong></font><br>
    Un annonce qui explique que le produit "Service Protector" de Cygate
    est basé sur OpenBSD.
    <p>
  </p></li><li><font color="#009000"><strong> <a href="http://www.seifried.org/security/articles/20011015-elias-levy-interview.html"> 
    Abandon hope all ye who enter here</a>, Security Portal (now at Seifried's 
    site), 5 avril 2001 </strong></font><br>
    Kurt Seifried, lors d'un entretien avec Elias Levy, a.k.a. Aleph1 de Bugtraq 
    indique que <em>"des efforts comme ceux d'OpenBSD sont un <strong> must</strong>"</em> 
    puis il indique plus loin <em>"les systèmes qui ont subi un tel 
    niveau d'audit devraient avoir une étiquette obligatoire indiquant 
    <strong>Lasciate ogne speranza, voi ch'intrate</strong>"</em>.<br>
    Au cours de l'entrevue il donne une note intéressante concernant les 
    autres modèles de sécurité complexes qui peuvent exister 
    au sein d'autres systèmes d'exploitation, et comment une implémentation 
    incorrecte ou des erreurs de configuration peuvent, dans ces modèles 
    trop complexes, provoquer des vulnérabiltiés au final. La sécurité 
    demande la simplicité. Cela ne sonne-t-il pas familièrement 
    à vos oreilles ?
<p> 
</p></li></ul>

<h2>Mars 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/onlamp/2001/03/02/ipv6_ItoJun.html"> 
    IPv6: An Interview with Itojun</a>, O'Reilly Network, 2 mars 2001 </strong></font><br>
    Hubert Feyrer propose un entretien avec Jun-ichiro "itojun" Hagino, 
    l'un des principaux développeurs de KAME, qui a intégré 
    la pile IPv6 de KAME dans OpenBSD et NetBSD. Il est quelque peu déçu 
    par le faible déploiement d'IPv6, les fabriquants de routeurs le demandent 
    peu et les fournisseurs d'accès attendent pour leur part le matériel. 
    Il parle des autres projets de KAME et WIDE et nous invite à visiter 
    le japon, où il fait bon être un geek BSD !<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.infosecuritymag.com/articles/march01/features1_open_source_sec.shtml">Open 
    source under the hood</a>, Information Security, mars 2001. </strong></font><br>
    De plus en plus de vendeurs de logiciels commerciaux se tournent vers les 
    logiciels open source, dont OpenBSD, pour les utiliser comme blocs de construction 
    de leurs produits. Le rédacteur Pete Loshin en étudie les implications 
    de sécurité.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.net-security.org/text/articles/mostsecure.shtml">Your Opinion: 
    "Most Secure OS"</a>, Help Net Security, mars 2001 </strong></font><br>
    Sur 340 avis, les éditeurs ont retenu cinq réponses dont deux 
    indiquaient qu'OpenBSD est clairement le "système le plus sécurisé".<br>
    <p> 
</p></li></ul>


<h2>Février 2001</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.thedukeofurl.org/reviews/misc/openbsd28/">Review: OpenBSD 2.8</a>, 
    The Duke of URL, 9 février 2001 </strong></font><br>
    Un parcours très détaillé d'OpenBSD 2.8 par Patrick Mullen, 
    qui le teste sur du matériel AMD et Intel, et montre des reproductions 
    de l'écran au cours du processus d'installation. Il réfute également 
    le fait qu'OpenBSD ne serait pas capable de fonctionner sur VMWare.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://geodsoft.com/howto/harden/">Hardening OpenBSD Internet Servers</a>, 
    GeodSoft, 17 février 2001 </strong></font><br>
    Ce n'est pas un article de presse à proprement parler, mais c'est un 
    manuel qui explique avec soin comme verrouiller un serveur OpenBSD (et même 
    comment créer un CD-Rom de récupération pour réduire 
    les temps d'inactivité en cas de problème matériel). 
    Les conseils peuvent s'appliquer à d'autres systèmes d'exploitation.<br>
    <p> 
</p></li></ul>


<h2>Janvier 2001</h2>
<ul>
  <li><font color="#009000"><strong> <u>Global geeks bet on open source</u>, The 
    Globe and Mail, 29 janvier 2001 </strong></font><br>
    Le rédacteur Jim Carroll utilise la dernière série d'attaques 
    contre les sites de Microsoft pour s'intéresser à des logiciels 
    plus adaptés au commerce en ligne, comme OpenBSD <em>"qui est 
    bien connu pour sa sécurité à toute épreuve"</em>. 
    <br>
    (en version imprimable uniquement). 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.newsforge.com/article.pl?sid=01/01/29/1718219">Theo de Raadt 
    gives it all to OpenBSD</a>, NewsForge, 29 janvier 2001 </strong></font><br>
    Cette fois le "profiler" des personnalités Open Source Julie 
    Bresnick s'intéresse à Theo de Raadt, le principal développeur 
    d'OpenBSD. Il explique, avant même d'avoir débuté OpenBSD, 
    ce qu'est la "famille" des BSD, le hacking, les conférences, 
    ses amis, la bière et les randonnées de vélo en montagne. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2001/January/News394.html">Tucows 
    BSD Channel is no more</a>, BSD Today, 24 janvier 2001 </strong></font><br>
    Le rédacteur Jeremy Reed n'arrive pas à essuyer une larme pour 
    le médiocre (et souvent ouvertement hostile) site bsd.tucows.com<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.newsforge.com/article.pl?sid=01/01/16/0333216">With Snoopy's 
    Eriksen, the more things change, the more they stay the same</a>, NewsForge, 
    16 janvier 2001 </strong></font><br>
    Au cours d'un autre profil, le rédacteur de NewsForge Julie Bresnick 
    discute avec Aamodt Eriksen, l'auteur de l'outil d'enregistrement des commandes 
    Snoopy, qui fonctionne sous OpenBSD et son Thinkpad et il explique le rôle 
    de modèle que peut avoir Theo de Raadt. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2001/January/Features379.html">A lot of misinformation 
    about BSD</a>, BSD Today, 6 janvier 2001 </strong></font><br>
    Le rédacteur Jeremy Reed explique à quel point bsd.tucows.com 
    fournit des informations erronnées et des analyses médiocres 
    des systèmes BSD, et citant même l'attribution par ces derniers 
    de la licence GPL à OpenBSD (indice: c'est tout sauf cela, voir notre 
    page <a href="http://www.openbsd.org/fr/policy.html">de position à ce sujet</a>. [Note 24 janvier: 
    bsd.tucows.com a été arrêté.] 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.ddj.com/documents/s=865/ddj0165a/"> Theo de Raadt, Todd Miller, 
    Angelos Keromytis, Werner Losh, and Jack Woehr at "A Roundtable on BSD, Security, 
    and Quality"</a>, Dr. Dobb's, janvier 2001 </strong></font><br>
    L'éditeur Jack Woehr a modéré une table ronde comprenant 
    quatre membres du mouvement BSD lors du dernier USENIX et du Security Symposium 
    2000. 
    <p> 
</p></li></ul>

<h2>Décembre 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://eltoday.com/article.php3?ltsn=2000-12-26-001-13-PS">Florist.com Blossoms 
    with Open Source E-Commerce Software from Akopia</a>, Enterprise Linux Today, 
    6 décembre 2000 </strong></font><br>
    Le vendeur en ligne de fleurs d'Hollywood utilise OpenBSD. Un reportage de 
    John Wolley. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.theregister.co.uk/content/4/15614.html">OpenBSD exploit gets 
    serious</a>, The Register, 20 décembre 2000 </strong></font><br>
    Les développeurs d'OpenBSD soulignent le degré d'importance 
    d'une faille par dépassement de tampon au sein du daemon FTP après 
    la publication d'un exploit (ftpd n'est pas activé par défaut 
    sous OpenBSD). 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://slashdot.org/article.pl?sid=00/12/11/1455210&amp;mode=thread">Theo 
    de Raadt Responds</a>, Slashdot, 11 décembre 2000 </strong></font><br>
    Le principal développeur Theo de Raadt répond aux questions 
    modérées par l'éditeur Slashdot Roblimo. Cette entrevue 
    de masse couvre un large domaine de sujets : l'expérience de l'audit 
    de code, la sécurisation de l'arbre des <a href="http://www.openbsd.org/fr/ports.html">ports</a>, 
    des livres de différentes couleurs, les pratiques de sécurisation 
    du code, le matériel, les patches et quelques ouvertures. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.itbusiness.ca/index.asp?theaction=61&amp;sid=27059"> 
    OpenBSD Updated</a>, Computer Dealer News, 8 décembre 2000 </strong></font><br>
    Un court article sur la version 2.8 d'OpenBSD et la vente de CD-Rom. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.maccentral.com/news/0012/07.openbsd.shtml">OpenBSD 2.8 runs on 
    G3/G4 machine</a>, MacCentral Online, 7 décembre 2000 </strong></font><br>
    OpenBSD 2.8 est disponible et, c'est gratuit, il fonctionne désormais 
    sur iMac, G3, G4, les machines Cube. Et si cela ressemble à grec pour 
    vous, laissez-nous vous l'expliquer. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://seifried.org/security/technical/20020307-kernel-options.html"> 
    System and Network Security - Kernel Options</a>, Kurt's Closet, Security 
    Portal, 6 décembre 2000 </strong></font><br>
    Allant au-delà des mesures de sécurité habituelles, qui 
    consiste à regarder les options souvent ignorées du kernel et 
    quelques réglages, Kurt Seifried étudie ces options de noyau 
    sous différents systèmes : OpenBSD, Linux et Solaris. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a 
    href="http://www.zdnet.co.jp/macwire/0012/06/c_opinion.html">[japonais] Opinion: 
    why I use OpenBSD</a>, MacWIRE Online, ZDNet Japan, 6 décembre 2000 
    </strong></font><br>
    Un traduction d'un article d'opinion de Stephan Somogyi où il explique
    pourquoi il utilise OpenBSD. On pourrait penser que son propre exemple de
    faille de sécurité, les relais de courier électronique
    par trop 'ouverts' n'est pas très bon, il souligne toutefois un point
    crucial : si un système d'exploitation autorise dès l'installation
    par défaut le relai de tout courrier, cela donne un message clair quand
    à la faible résistance aux détournements dont il peut
    faire l'objet. Il reproche également à Intel et 3Com leur attitude
    fermée sur la fourniture d'informations qui permettraient d'utiliser
    au mieux leurs cartes réseau dotées de capacités IPsec.
<p>
</p></li><li><font color="#009000"><strong> <a href="http://macweek.macworld.com/2000/12/03/1204bsd.html"> Why I use OpenBSD</a>, 
    MacWeek, 4 décembre 2000 </strong></font><br>
    Stephan Somogyi explique pourquoi il utilise OpenBSD et l'importance à 
    ses yeux de la sécurité. On pourrait lui dire que son exemple 
    de faille de sécurité, de serveurs qui relaient le courrier 
    n'est pas essentiel, mais il souligne quelques points importants quand au 
    niveau de sécurité offert par un système d'exploitation 
    après son installation et ce que cela signifie pour les pirates quand 
    au degré d'effort qu'ils auront à fournir. Il reproche également 
    à Intel de ne pas permettre l'accès aux documentations requises 
    pour que leurs cartes réseau soient utilisées dans leur mode 
    IPsec. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.upside.com/texis/mvm/open_season?id=3a26ad1a2">BSD community 
    learns to get along</a>, Open Season, Upside Today, 1er décembre 2000 
    </strong></font><br>
    OpenBSD reçoit une bonne mention de Sam Williams au sujet du potentiel 
    de distribution étendue du système dérivé de BSD 
    : MacOS X. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2000/December/News345.html"> 
    OpenBSD 2.8 officially released</a>, BSD Today, décembre 2000 </strong></font><br>
    OpenBSD 2.8 est officiellement annoncé sur BSD Today. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.ddj.com/documents/s=875/ddj0065o/"> The Future of OpenBSD: A 
    Conversation with Theo de Raadt</a>, Dr. Dobbs Journal, décembre 2000 
    </strong></font><br>
    Le rédacteur Jack J. Woeher réalise une entrevue avec Theo de 
    Raadt lors du Usenix Security Symposium 2000 et offre une perspective de la 
    dynamique du projet, vers quoi le système se dirige et comment l'audit 
    de sécurité a évolué depuis une recherche des 
    bogues et produit une philosophie de programmation correcte, et sans bogues.
<p> 
</p></li></ul>

<h2>Novembre 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://zdnet.com.com/2100-1107-503171.html"> 
    BSD to leapfrog Linux</a>, ZDnet Linux Opinion, 29 novembre 2000 </strong></font><br>
    Un article relativement spéculatif d'Henry Kingman basé sur 
    la récente série de distributions, de nouveaux produits et d'activités 
    en conférences du monde BSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://macweek.macworld.com/2000/11/19/1123somogyi.html"> 
    <!-- http://www.zdnet.com/zdnn/stories/comment/0,5859,2657124,00.html" -->
    Is Darwin getting due respect?</a>, MacWeek, 23 novembre 2000 </strong></font><br>
    Stephan Somogyi refuse la proposition d'Apple qu'il trouve "opportuniste" 
    et soulève le chapeau pour révéler OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.nwfusion.com/columnists/2000/1120works.html">Beyond Windows and 
    Linux: Discovering the BSDs</a>, NetworkWorld Fusion, 20 novembre 2000 </strong></font><br>
    Inquiet au sujet de Linux qui pourrait être déstabilisé 
    par la machine à mensonges ? Paul Hoffman suggère de jeter un 
    sérieux regard sur OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.thelinuxgurus.org/linuxopenbsdfirewalls.shtml">Building 
    Linux and OpenBSD Firewalls</a>, book review, The Linux Gurus, 18 novembre 
    2000 </strong></font><br>
    Dans une revue détaillée du livre "<a href="http://www.openbsd.org/books.html">firewalls 
    book</a>" de Sonnenreich &amp; Yates, l'auteur (non cité) explique 
    qu'il n'est même pas paranoiaque au point de vouloir réduire 
    un système utilisé comme parefeu à son struict minimum. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.vnunet.com/Features/1113887">What the future holds for Unix</a>, 
    vnunet.com, 10 novembre 2000 </strong></font><br>
    Dave Cartwright prend sa robe étrange et observe sa boule de cristal 
    afin de déterminer l'avenir d'Unix, de Linux et de BSD. Le meilleur 
    extrait de l'article est : <br>
    <em>"Linux, FreeBSD et OpenBSD vont continuer de s'améliorer grâce 
    à leur ouverture, qualité et attitude"</em>. La qualité, 
    c'est nous (et l'attitude aussi). 
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- <a href="http://www.sunworld.com/sunworldonline/swol-11-2000/swol-1110-silicon.html"> -->
    <u>BSDCon 2000: A small, tasty conference</u>, Sun World, novembre 2000 </strong></font><br>
    Le rédacteur de Silicon Carny, Rich Morin, couvre BSD Con 2000. Il 
    donne une idée des cinq variantes BSD disponibles et rapporte un peu 
    de l'atmosphère du salon.<br>
    <p> 
</p></li></ul>

<h2>Octobre 2000</h2>
<ul>
  <li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/closet/closet20001025.html"> -->
    <u>Auditing Code, Kurt's Closet</u>, Security Portal, 31 octobre 2000 </strong></font><br>
    Kurt Seifried propose une entrevue avec John Viega, l'auteur du système 
    d'audit de code ITS4. Bien qu'il souligne l'importance du processus d'audit 
    d'OpenBSD strictement basé sur des experts, il explique qu'un outil 
    d'audit, même imparfait, est meilleur que de ne pas réaliser 
    d'audit du tout.<br>
    <p> 
  </p></li><li><font color="#009000"><strong><a href="http://www.zdnet.com/intweek/stories/news/0,4164,2644279,00.html">Linux 
    Boosts Unix</a>, ZDnet Inter@ctive Week, 23 octobre 2000 </strong></font><br>
    Charles Babcock montre que les systèmes Unix comme Linux ou OpenBSD 
    placent une énorme pression sur la part de marché de Windows 
    2000 et que ce n'est pas si mal pour des groupes de hackers qui le font juste 
    pour le plaisir de la programmation... 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.stallion.com/html/support/bsdcon-paper.html">Porting 
    OpenBSD to the Motorola ColdFire</a>, BSDCon, 18 octobre 2000 </strong></font><br>
    Dean Fogarty et David O'Rourke, ingénieurs chez Stallion Technologies 
    Pty Ltd en Australie ont présenté le papier suivant au BSD Con 
    : <br>
    <i>"Réaliser un produit tout-intégré Internet pour 
    le public de grande consommation n'est pas une tâche facile. Les choix 
    impliquent le matériel, le développement logiciel et la conception 
    même de l'interface utilisateur et chacun de ces éléments 
    peut aider ou réduire la qualité du produit final. Ce travail 
    souligne les choix de Stallion Technologies du processeur ColdFire Motorola 
    et d'OpenBSD comme système d'exploitation pour mener au succès 
    ce projet".</i> 
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- a href="http://www.feedmag.com/essay/es405lofi.html" -->
    <a href="http://www.guardian.co.uk/weblogarticle/0,6799,194423,00.html"> Cry 
    Hackerdom!</a>, FEED (Guardian Unlimited), 17 octobre 2000 </strong></font><br>
    Brendan Koerner continue d'explorer le monde numérique avec cette année 
    sa visite du Defcon. Theo de Raadt fait son apparition, annoncé comme 
    un hacker affamé. Avant que les listes de distribution ne croulent 
    sous les avis de faillite annoncée nous voulons vous dire que, de temps 
    en temps, Theo aime bien prendre une pinte de Guiness avec une pizza. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://rootprompt.org/article.php3?article=1061">Sniping 
    at OpenBSD</a>, #RootPrompt.org, 9 octobre 2000 </strong></font><br>
    Le rédacteur Noel discute de quelques commentaires agressifs vis à 
    vis d'OpenBSD et de l'annonce par Bugtraq d'une vulnérabilité 
    locale. Il explique que l'audit du code source n'a pas pour objet le recherche 
    de failles de sécurité, mais la correction de bogues avant qu'ils 
    ne deviennent un risque de sécurité. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://napalm.osuny.co.uk/txt/issue7.txt">Using 
    IPSEC and Samba to integrate Windows Networks</a>, Napalm, 6 octobre 2000 
    </strong></font><br>
    OpenBSD, IPsec, IPF, Samba et Windows: azure couvre tout dans son récit 
    où il tente de relier en réseau deux machines Windows sur un 
    réseau virtuel privé, que cela leur plaise ou non. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.upsidetoday.com/texis/mvm/story?id=39dceffe0.html"> 
    OpenBSD plugs a rare security leak</a>, Upside Today, 6 octobre 2000 </strong></font><br>
    Le développeur Aaron Campbell participe à une entrevue avec 
    le journaliste Sam Williams d'Upside, et répond aux questions quand 
    à la récente vulnérabilité de "format string" 
    et comment OpenBSD a répondu à cette menace. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.networkmagazine.com/article/NMG20001003S0001/1">The 
    Pros and Cons of Posting Vulnerabilities</a>, Network Magazine, 5 octobre 
    2000</strong></font><br>
    Dissiper le nuage de fumée et de fausses informations au sujet du "full 
    disclosure" est une tâche sans fin. Rik Farrow montre comment cela 
    fonctionne en considérant une journée particulièrement 
    occupée de Bugtraq, la liste de distribution prônant cette approche. 
    Il termine avec un coup de chapeau à OpenBSD:<br>
    <i>"Le véritable objectif devrait être d'écrire des logiciels 
    correctement, dès le début. Une seule version d'Unix, OpenBSD, 
    réalise un audit complet de son code à la recherche de bogues 
    avant sa distribution."</i> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.byte.com/documents/s=448/byt20000927s0001/index.htm"> 
    BSD OSs Offer Unix Alternatives to Linux</a>, Byte, 2 octobre 2000 </strong></font><br>
    Dans un long article intitulé "<i>Pour la sécurité, 
    l'extensivilité : considérez un OS BSD"</i> le rédacteur 
    Bill Nicholls étudie les différents systèmes BSD disponibles. 
    Il résume en fait l'histoire de chacun et cite les sites propres de 
    chaque projet mais c'est le genre d'article qui peut le mieux introduire les 
    systèmes BSD auprès des novices, bombardés de propagande 
    Linux. <br>
    <p> 
</p></li></ul>

<h2>Septembre 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.zdnet.com/devhead/stories/articles/0,4413,2631312,00.html"> 
    BSD System Takes On Linux</a>, 
    <!-- a href="http://www.zdnet.com/intweek/stories/news/0,4164,2631373,00.html" -->
    Chris Coleman Explains BSD Unix, Inter@ctive Week, 25 septembre 2000 </strong></font><br>
    (Note: le second article n'est plus en ligne)<br>
    Deux articles en relation avec BSD dans une même publication d'importance, 
    le même jour. Une tendance, peut-être ? Le premier article, orienté 
    pour l'oeil du gestionnaire commercial, crédite l'approche de sécurité 
    pro-active d'OpenBSD d'importante pour le développement de la sécurité 
    au sein des autres groupes BSD, et même pour Linux. Le second est une 
    entrevue avec le rédacteur Chris Coleman qui tente d'expliquer ce que 
    sont les divers BSD. L'auteur de l'article ne maîtrise visiblement pas 
    son sujet, et il a même du mal à écrire le nom de Coleman 
    correctement. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.zdnet.com/devhead/stories/articles/0,4413,2631312,00.html"> 
    BSD System Takes On Linux</a>, Inter@ctive Week, 25 septembre 2000 </strong></font><br>
    Un article rédigé du point de vue du décideur commercial, 
    soulignant la saine approche de la sécurité pro-active du projet 
    OpenBSD et de son importance auprès des autres groupes BSD, mais également 
    Linux. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://upside.com/texis/mvm/story?id=39b82a2e0"> 
    Primed and ready</a>, Upside Today, 7 septembre 2000 </strong></font><br>
    Un article par Sam Williams au sujet de la réction de RSA Security 
    suite à la sortie dans le domaine public prématurée de 
    son algorithme RSA. Quel impact sur OpenBSD ? Minime, car nos utilisateurs 
    utilisaient déjà une astuce pour télécharger la 
    librairie SSL après l'installation du système d'exploitation. 
    <p> 
  </p></li><li><font color="#009000"><strong> <u>OpenBSD as a VPN Solution</u> <em>(cet 
    article n'est pas disponible en ligne)</em>, Sys Admin, septembre 2000 </strong></font><br>
    Alex Withers a participé à l'élaboration d'un article 
    sur la mise en place d'un réseau virtuel privé à l'aide 
    d'OpenBSD et de son IPsec et du daemon de gestion ISAKMPD. Il admet que son 
    implémentation, bien que très utile, ne fait qu'éfleurer 
    les capacités qui sont disponibles. Il suggère fortemetn de 
    consulter les pages man (<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vpn&amp;apropos=0&amp;sektion=0&amp;manpath=OpenBSD+Current&amp;arch=i386&amp;format=html">vpn(8)</a>, 
    <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&amp;apropos=0&amp;sektion=0&amp;manpath=OpenBSD+Current&amp;arch=i386&amp;format=html">ipsec(4)</a> and <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=isakmpd&amp;apropos=0&amp;sektion=0&amp;manpath=OpenBSD+Current&amp;arch=i386&amp;format=html">isakmpd(8)</a>) 
    et la <a href="http://www.openbsd.org/fr/faq/faq13.html">FAQ IPSec</a> d'OpenBSD pour en tirer un meilleur 
    profit. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.osopinion.com/Opinions/KeithRankin%20/Keith%20Rankin1.html">FreeBSD, 
    OpenBSD and SuSE 6.2 Eval Review</a>, OS Opinion, septembre 2000 </strong></font><br>
    Keith Rankin, un administrateur système vétéran, qualifie 
    les systèmes d'exploitation en fonction de leur facilité d'usage 
    et productivité. Malgré des remarques injustifiées au 
    sujet des installations minimales, vi et le shell "C Shell" retenu 
    par défaut, il donne un bon avis d'OpenBSD et de son installation par 
    disquette par réseau, le mécanisme d'étude du système, 
    le filtrage IP et le NAT (translation d'adresses).
<p> 
</p></li><li><font color="#009000"><strong> [allemand] Das BSD-Ports-Verzeichnis, FreeX Magazin, 
    4.Quartal 2000 </strong></font><br>
    Jörg Braun étudie le système des <a href="http://www.openbsd.org/fr/ports.html">Ports</a>
    qui permet aux utilisateurs d'accéder facilement à plusieurs
    milliers d'applications. L'auteur couvre les différentes options de
    make disponibles, et il souligne également le mécanisme "fake"
    d'OpenBSD qui permet de créer des paquetages que l'on peut distribuer
    facilement tout en conservant une capacité d'utilisation de ces derniers
    au sein des ports.
<p> 
</p></li></ul>

<h2>Août 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.onlamp.com/pub/a/bsd/2000/08/29/OpenBSD.html"> 
    OpenBSD and the Future of the Internet</a>, OpenBSD Explained, O'Reilly Network, 
    29 août 2000 </strong></font><br>
    Le rédacteur David Jorm note le fait qu'OpenBSD est fourni avec un 
    IPv6 actif. Il explique comment configurer OpenBSD pour le faire participer 
    au projet "6bone", un réseau IPv6 expérimental. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://rootprompt.org/article.php3?article=832">OpenBSD's 
    Good Example</a>, # RootPrompt.org, 23 août 2000 </strong></font><br>
    Noel continue sa série "Cracked!" et s'intéresse à 
    de nouveaux sujets en sécurité. Cette fois il installe OpenBSD 
    et s'attend à un système très épuré pour 
    les parefeux et serveurs et découvre, en fait, un système totalement 
    adapté aux usages bureautiques. OpenBSD donne l'exemple aux autres 
    systèmes indique-t-il : <i>"Je pense qu'il y a beaucoup de leçons 
    à tirer d'OpenBSD et de la manière qu'ils ont de faire les choses, 
    et la communauté Linux devrait prendre quelques notes"</i> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.newsforge.com/article.pl?sid=00/08/22/0132212&amp;mode=thread">The 
    Brit and the Big Boy</a>, NewsForge, 22 août 2000 </strong></font><br>
    Le rédacteur Julie Bresnick de NewsForge propose le profil de Tom Yates, 
    le co-auteur avec Wes Sonnenreich du livre "<a href="http://www.wiley.com/compbooks/catalog/35366-3.htm">B</a><a href="http://www.wiley.com/compbooks/catalog/35366-3.htm">uilding 
    Linux and OpenBSD Firewalls</a>" 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://abcnews.go.com/sections/tech/FredMoody/moody000816.html">Linux 
    Revisited</a>, ABCnews.com, 16 août 2000 </strong></font><br>
    Dans un article intitulé "Moody battles on" le rédacteur 
    Fred Moody continue sa bataille solitaire. Il qualifie d'OpenBSD du meilleur 
    choix pour ceux qui "veulent beaucoup, beaucoup plus" et cite Marcus 
    Ranum de la compagnie Network Flight Recorder lorsqu'il parle de l'audit du 
    code d'OpenBSD : <i>"Ils ont fait quelque chose de vraiment intéressant: 
    ils ont réalisé des audits complets de majeures parties du code 
    au sein du système d'exploitation, et ils otn découvert des 
    trous de sécurité énormes et horribles que les autres 
    Unix ignorent encore aujourd'hui".</i> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.thestandard.com/article/display/0,1151,17541,00.html">The 
    World's Most Secure Operating System</a>, The Industry Standard, 14 août 
    2000 </strong></font><br>
    <i>"Un canadien solitaire remodèle la manière dont les logiciels 
    sotn écrits. Est-ce que le monde prête attention ?"</i> 
    (En fait, on l'aide quand même un peu). Le rédacteur-vétéran 
    en technologie, Brendan Koerner, propose une entrevue avec Theo de Raadt et 
    interroge des vendeurs de produits de sécurité, et compare l'audit 
    du code d'OpenBSD et sa position de "sécurité par défaut" 
    vis à vis des pratiques que l'on rencontre aujourd'hui partout ailleurs. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.oreillynet.com/pub/a/bsd/2000/08/08/OpenBSD.html">An 
    Overview of OpenBSD Security</a>, OpenBSD Explained, O'Reilly Network, 8 août 
    2000 </strong></font><br>
    David Jorm détaille les étapes requises pour configurer le daemon 
    sshd d'OpenBSD et pour mettre en place un serveur sécurisé proposant 
    un support du SSL depuis OpenBSD. Il explique aussi la position du projet 
    OpenBSD vis à vis de la sécurité, l'audit du code et 
    comment installer les patch de sécurité. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://lwn.net/2000/0803/security.php3">OpenBSD 
    runs fuzz</a>, Linux Weekly News, 3 août 2000 </strong></font><br>
    Le rédacteur Liz Coolbaugh, spécialisé dans le domaine 
    de la sécurité chez Linux Weekly News a décidé 
    de s'intéresser au fil de discussion Bugtraq sur <code>fuzz</code>, 
    un outil qui teste les lignes de commande avec l'injection d'arguments générés 
    aléaoirement. Le principal développeur du projet OpenBSD, Theo 
    de Raadt, l'a utilisé sous OpenBSD et a découvert des erreurs 
    de traitement des arguments dans plus d'une dizaine de commandes, bien qu'aucune 
    ne soit liée à des fonctions de sécurité au sein 
    du système d'exploitation. L'article reprend l'envoi de Theo et ses 
    commentaires. Bien que l'exercice soit intéressant, l'outil en fait 
    que montrer les zones à regarder de plus près mais ce n'est 
    en aucun cas un substitut possible à l'audit du code source. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.oreillynet.com/pub/a/bsd/2000/08/01/OpenBSD.html">OpenBSD 
    in a Datacenter Scale Environment</a>, BSD DevCenter, O'Reilly Network, 1er 
    août 2000 </strong></font><br>
    David Jorm, rédacteur de "OpenBSD Explained" discute de l'avis 
    sceptique du gestionnaire Grant Bailey au sujet d'OpenBSD et de ses capacités 
    à supporter le trafic Web et FTP du site www.2600.org.au ; en utilisant 
    un budget réduit il a pu mettre en place une machine K-6 450 MHz avec 
    128 Mo de mémoire vive et un simple disque dur, pour obtenir un résultat 
    particulièrement appréciable sur un modem câble.<br>
    <i>Mise à jour (4 août 2000): Grant a indiqué avoir rencontré 
    le jour le plus occupé de son serveur : 56 Go de données envoyées 
    vers Internet vers plus de 260 clients, et la machine n'aura été 
    finalement limitée que par sa quantité de mémoire disponible.</i> 
    <p> 
</p></li></ul>

<h2>Juillet 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.vnunet.com/News/1107318"> 
    Linux developers hunt for kernel bugs</a>, vnunet.com, 26 juillet 2000 </strong></font><br>
    John Leyden donne son avis sur le nouveau projet d'audit des sources du noyau 
    Linux. Il était temps. L'article mentionne que <i>"OpenBSD, l'autre 
    Unix-like, fait ce type d'audit de ses sources depuis 1996".</i> L'article 
    cite également Roy Hills de NTA qui indique que <i>"c'est la première 
    fois que j'entends parler d'un audit du noyau compelt d'un système 
    à usage général" </i>mais il a depuis fait amende 
    honorable... 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.securite.org/interview/theoderaadt/"> 
    Interview: Theo de Raadt</a>, Sécurité.org, 26 juillet 2000 
    </strong></font><br>
    Nicolas Fischbach a pu mettre la main sur Theo de Raadt au CanSecWest de Vancouver 
    et il nous propose une entrevue où ils abordent ensemble des sujets 
    tels que la sécurité par défaut et la genèse d'OpenSSH. 
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- <a href="http://www.securityportal.com/closet/closet20000726.html"> -->
    <u>IPsec - We've Got a Ways To Go</u> (Part II), Security Portal, 26 juillet 
    2000 </strong></font><br>
    Kurt Seifried discute des différentes méthodes de gestion des 
    clefs et des modes de transmission par tunnel. Il aborde ensuite les extensions 
    possibles aux implémentations IPsec, ainsi que le modèle d'IPsec 
    sur Ethernet avec pont d'OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2000/July/Contribution236.html"> 
    Setting up OpenBSD 2.7 as a cable NAT system </a>, BSD Today, 24 juillet 2000 
    </strong></font><br>
    Vlad Sedach rapport son expérience dans l'installation d'une machine 
    OpenBSD pour agir en tant que parefeu et NAT. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.vnunet.com/News/1106857"> 
    Most secure operating system update uses Digital Signature Algorithm</a>, 
    vnunet.com, 17 juillet 2000 </strong></font><br>
    James Middleton liste les fonctionalités de la nouvelle version 2.7 
    d'OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2000/July/Features230.html"> OpenBSD is installed -- now 
    what?</a>, BSD Today, 14 juillet 2000 </strong></font><br>
    Faisant suite à son article <a href="http://www.bsdtoday.com/2000/June/Features213.html">Installing 
    OpenBSD 2.7</a>, Clifford Smith explique comment <i>"configurer OpenBSD 
    comme machine d'utilisateur personnelle, avec un bureau adéquat et 
    suffisament d'informations pour installer au-travers des ports KDE et l'arrêt 
    de tous les services inutiles sur ce type de configuration. L'utilisation 
    d'IPFilter est également couverte".</i> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://napalm.firest0rm.org/issue6.txt">IPsec 
    Crash Course (part 1)</a>, Napalm, 13 juillet 2000 </strong></font><br>
    Un article technique sur l'IPsec par ajax, qui explore les bases du réseau, 
    les daemon de gestion des clefs et les différentes implémentations 
    disponibles, libres et commerciales. Il dépasse le niveau habituel 
    des articles en expliquant le fonctionnement sous-jascent et leurs travers. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.itbusiness.ca/index.asp?theaction=61&amp;sid=32935"> 
    In the shadow of the penguin</a>, Computing Canada, 7 juillet 2000 </strong></font><br>
    Le rédacteur d'opinions Matthew Friedman tente de clarifier les choses 
    : l'open source ne concerne pas que Linux. Il s'intéresse aux performances 
    réseau et leur solidité, et la sécurité. A cette 
    occasion il discute avec Theo de Raadt du projet OpenBSD et Jordan K. Hubbard 
    du projet FreeBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.osopinion.com/Opinions/MontyManley/MontyManley8.html">Be 
    An Engineer, Not An Artist</a>, OS Opinion, 6 juillet 2000 </strong></font><br>
    Monty Manley ouvre le débat au sujet des développements artistiques 
    par rapport à l'approche classique et plus sérieuse dans le 
    développement logiciel. Il explique que peu de gens, y compris les 
    responsables de l'audit de code d'OpenBSD, sont prêts à expliquer 
    comment programmer correctement. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2000/July/Contribution221.html"> Attempting to install 
    OpenBSD under VMware</a>, BSD Today, 6 juillet 2000 </strong></font><br>
    Le membre de BSD Today Jeremy Weatherford pose les mains sur OpenBSD et tente 
    de l'installer sur VMWare, une machine virtuelle qui permet de faire fonctionner 
    plusieurs systèmes d'exploitation sur une même machine. Nous 
    ne pouvons lui repprocher mais il est trop débutant sous OpenBSD et 
    VMWare pour pouvoir mener à son terme un projet aussi ambitieux, d'autant 
    que VMWare ne cite même pas OpenBSD comme système supporté 
    par la machine virtuelle...
<p> 
</p></li></ul>

<h2>Juin 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2000/June/Features213.html">Installing 
    OpenBSD 2.7</a>, BSD Today, 29 juin 2000 </strong></font><br>
    <i>Alors vous voulez essayer OpenBSD n'est ce pas ? Vous pensez que c'est 
    votre genre de système d'exploitation ? Patrick Mullen installe et 
    étudie la version 2.7 d'OpenBSD</i>. Une autre expérience intéressante 
    d'installation d'OpenBSD avec un humour très appréciable dans 
    ce genre d'articles qui sont parfois trop arides. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://maccentral.macworld.com/news/0006/23.macosx.shtml"> 
    Road to Mac OS X: Security and OS X</a>, MacCentral Online, 23 juin 2000 </strong></font><br>
    Dans l'une des séries d'articles du rédacteur Dennis Sellers 
    de MacCentral Online, les questions de migration de MacOS vers MacOS X sont 
    couvertes. L'auteur aborde la question de la sécurité et il 
    cite Mark Block : <em>"Gardez à l'esprit qu'un système 
    basé sur Unix n'est pas plus vulnérable vis à vis de 
    pirates. OpenBSD est un Unix très sécurisé à l'historique 
    parlant en matière de sécurité".</em> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.itbusiness.ca/index.asp?theaction=61&amp;sid=33044"> 
    BSD (and Joe) are Canadian</a>, lettre à l'éditeur, Computing 
    Canada, 23 juin 2000 </strong></font><br>
    "Dave the Canadian software guy" écrit à l'éditeur 
    de la rubrique "The computing road less travelled". Dans un article 
    qui listait les systèmes libres alternatifs, OpenBSD n'a pas été 
    mentionné une fois, ni même NetBSD alors qu'il s'agissait du 
    seul BSD présent au Linux Quebec d'Avril. Il demande d'ailleurs si 
    : "Is it time for a Joe the Canadian commercial for Canadian Software?"<br>
    <i>La lettre est reproduite plus bas dans la page.</i> 
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- <a href="http://www.securityportal.com/closet/closet20000621.html"> -->
    Securing Your Network With OpenBSD, Kurt's Closet, Security Portal, 21 juin 
    2000 </strong></font><br>
    Kurt Seifried s'intéresse aux nouvelles fonctionalités de la 
    version 2.7 d'OpenBSD et recommande le système comme plateforme si 
    vous passez beaucoup de temps sur Internet. Il donne également une 
    liste des nombreux outils de sécurité qui sont disponibles pour 
    la détection d'intrusion, l'analyse des vulnérabilités, 
    la gestion et l'analyse du réseau, le tout depuis la <a href="http://www.openbsd.org/fr/ports.html"> 
    collection des "Ports"</a> 
    <p> 
  </p></li><li><font color="#009000"><strong><a href="http://www.zdnet.com/eweek/stories/general/0,11011,2589471,00.html">Exposed 
    to a Web of viruses</a>, eWeek.com, 19 juin 2000 </strong></font><br>
    Peter Coffee, du laboratoire eWeek, mentionne OpenBSD dans un article intitulé 
    : "IT wanted integration; Microsoft delivered. Now both must fix lax 
    security". Il écrit : <i>Ceux qui veulent défier des processus 
    open source comme le système d'exploitation OpenBSD et son incroyable 
    historique quand aux failles de sécurité déjouées 
    ferait mieux de s'attacher aux faits réels. Mais il y a également 
    d'autres exemples comme des trous dans le code de Kerberos qui sont restés 
    présents pendant des années, ce qui réduit toutefois 
    les limites des efforts volontaires.<br>
    </i>Une nouvelle fois nous notons que le code publié n'implique par 
    une meilleure sécurité. Ce genre de chose ne survient pas d'elle-même 
    : il faut que les gens <i>le désirent et le fassent. </i> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.openbsd.org/fr/reprints/pr27.html">OpenBSD 2.7 
    press release</a>, 15 juin 2000 </strong></font><br>
    Cette annonce pour la presse a été traduite dans plusieurs langages 
    et distribuée à la presse et aux sites d'information sur Internet.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2000/June/News196.html">Coming 
    soon: a real-time OpenBSD?</a>, BSD Today, 14 juin 2000 </strong></font><br>
    Randy Lewis de RTMX explique pourquoi il a choisi OpenBSD et ses extensions 
    pour le temps réels, qu'ils ont développé. Ils ont également 
    décidé d'offrir ces modifications au projet OpenBSD pour leur 
    inclusion dans la prochaine version du système d'exploitation.<br>
    Entrevue réalisée par Jeremy C. Reed. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.oreillynet.com/pub/a/bsd/2000/06/13/OpenBSD.html">Introduction 
    to OpenBSD Networking</a>, BSD DevCenter, O'Reilly Network, 13 juin 2000 </strong></font><br>
    David Jorm, un habitué d'OpenBSD, propose un petit tour détaillé 
    de la configuration de base d'un OpenBSD comme passerelle avec une interface 
    LAN et une connexion PPP. Il montre également les différences 
    par rapport au monde Linux qui peuvent gêner ceux qui migrent vers OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.unixreview.com/documents/s=1247/urm0006c/"> 
    The state of the daemon</a>, UNIX Review, 7 juin 2000 </strong></font><br>
    Michael Lucas s'intéresse aux systèmes BSD et dérivés 
    et montre un optimisme certain. "OpenBSD montre qu'il est possible d'avoir 
    une paranoia constructive". Nous sommes du même avis : la sécurité 
    est un état d'esprit, mais au vu des problèmes de sécurité 
    du monde informatique nous sommes encore très loin de subir la moindre 
    paranoia. <br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.infosecuritymag.com/articles/june00/columns3_open_sources.shtml">Security 
    By DEFAULT</a>, OPEN SOURCES, Information Security, juin 2000 </strong></font><br>
    <i>OpenBSD est l'un des systèmes d'exploitation qui a été 
    élu "le plus sûr". Alors pourquoi ne pas l'utiliser 
    pour vos applications ?<br>
    </i>Le rédacteur Pete Loshin montre qu'OpenBSD est une sérieuse 
    alternative pour la conception de serveurs Internet sécurisés. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.americasnetwork.com/issues/2000issues/20000601/20000601_hackers.htm"> 
    Meet the hackers</a>, America's Network, 1 juin 2000 </strong></font><br>
    Patrick Neighly a rédigé un article long et détaillé 
    sur le comment et pourquoi de la communauté des hackers. Il termine 
    par l'interview d'un hacker qui indique : <i>"OpenBSD est une solution à 
    la sécurité pro-active, ce qui signifie qu'ils trouvent les 
    trous de sécurité et les corrigent avant qu'ils ne soient publiés 
    dans Bugtraq pour tous les autres"</i>
<p> 
</p></li><li><font color="#009000"><strong> <a 
    href="http://www.openbsd.org/fr/reprints/openbsd-hwcrypto.html">[su&eacute;dois]  
    Säkerhet &amp; Sekretess</a>, No 4, 2000</strong></font><br>
    Cet article donne, dans un ton positif, une vue des dernières fonctionalités
    d'OpenBSD et de son support matériel des cartes accélératrices
    cryptographiques.
    <p>
</p></li></ul>

<h2>Mai 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://rootprompt.org/article.php3?article=493">Cracked! 
    Part4: The Sniffer</a>, # RootPrompt.org, 31 mai 2000 </strong></font><br>
    Noel continue sa chronique où un pirate attaque son réseau local. 
    Dans cette partie 4, il note que même les vulnérabilités 
    locales ne peuvent être ignorées car vous devez, avant tout, 
    être persuadé qu'un attaquant ne sera pas capable de deviner 
    un coupe login/mot de passe. En conclusion, il mentionne qu'il aimerait explorer 
    les systèmes OpenBSD et il y voit une bonne solution s'il faut fournir 
    des comptes à des utilisateurs. Les trois premières parties 
    sont également une lecture intéressante que nous recommandons 
    aux administrateurs système.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.computerworld.com/home/print.nsf/all/000526E30E">Flaw 
    found in PGP 5.0</a>, Computer World, 26 mai 2000 </strong></font><br>
    Une sérieuse faille de sécurité a été découverte 
    dans PGP 5.0 et qui affecte Linux et OpenBSD. Il est possible de remplacer 
    une chaîne de données aléatoires en provenance de /dev/random 
    par des séries de "1" pendant la génération 
    de paires de clefs sous certaines conditions.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.beopen.com/features/articles/security_article.html">Security 
    Beyond the Garden of Eden</a>, BeOpen.com, 19 mai 2000 </strong></font><br>
    Sam Williams frappe une nouvelle fois. Il propose une entrevue avec le principal 
    développeur d'OpenBSD, Theo de Raadt et Tom Vogt (principal développeur 
    de Nexus, une distribution Linux à la "sécurité 
    maximale" et annoncée le 9 mai). L'article souligne deux approches 
    distinctes de la sécurité.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.upside.com/texis/mvm/story?id=3921a9080">OpenBSD 
    perfects security by one-upmanship</a>, Upside Today, 17 mai 2000 </strong></font><br>
    Le rédacteur freelance Sam Williams capture la dynamique du mouvement 
    OpenBSD et le considère à la "poursuite de la perfection". 
    Williams prend aussi note de l'approche "business-friendly" d'OpenBSD 
    qui reste non commerciale : pas de soutien du monde commercial mais malgré 
    cela une pléthore d'outils et de produits qui utilisent OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.securityfocus.com/frames/?vdb=vdb&amp;content=/vdb/stats.html">Vulnerability 
    Database Statistics</a>, Security Focus, 15 mai 2000 </strong></font><br>
    "3 personnes sur 2 ne comprennent rien aux statistiques" dit-on souvent. 
    Sous cet éclairage, nous aimerions vous présenter un sommaire 
    des vulnérabilités proposé par Security Focus. Lisez 
    les annonces préliminaires et amusez vous à discuter des résultats. 
    Vous devrez ensuite admettre qu'OpenBSD fait bonne figure par rapport aux 
    autres systèmes d'exploitation. Nous pensons que le tableau le plus 
    intéressant est celui qui fait la somme des vulnérabilités. 
    C'est assez inquiétant car il souligne que la majeure partie de l'industrie 
    ne prend visiblement pas la bonne direction et qu'ils sont prêts à 
    sacrifier la sécurité pour leurs utilisateurs : ce n'est pas 
    le bon message.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- <a href="http://www.securityportal.com/closet/closet20000510.html"> -->
    Why We're Doomed to Failure, Security Portal, 10 mai 2000 </strong></font><br>
    Kurt Seifried explique ce que les gens peuvent faire pour promouvoir la sécurité 
    et se protéger contre les attaques les plus répandues. Sa première 
    suggestion se destine aux vendeurs de logiciels qui devraient faire le même 
    type d'audit que le projet OpenBSD. Cela demande toutefois des programmeurs 
    compétents et d'y consacrer le temps nécessaire. Il pense que 
    des ajouts comme des patch pour Linux ou des librairies de remplacement et 
    d'autres outils de développement pourraient faire l'affaire. Nous pensons 
    qu'il a abandonné l'idée trop rapidement : en acceptant des 
    coussins en lieu et place de véritables airbags il prend le risque 
    du mauvais côté et n'impose pas aux vendeurs de logiciels d'éliminer 
    véritablement les bogues de leurs produits défectueux.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.vnunet.com/Features/27240"> 
    They're after your data</a>, vnunet.com, 17 mai 2000 </strong></font><br>
    Dans une discussion en rapport avec le piratage de machines appartenant au 
    gouvernement, Dearbail Jordan obtient la réponse suivante d'un hacker 
    pendant une entrevue : "<i>En ce qui concerne les systèmes d'exploitation 
    libres, OpenBSD est une variante accessible et probablement l'Unix de niveau 
    C2 le plus sécurisé disponible"</i> Et bien en fait OpenBSD 
    n'est pas classé C2 car ce standard dit du "livre orange C2" 
    se destine aux systèmes "Trusted" et non pas aux systèmes 
    "sécurisés" comme OpenBSD mais le reste de son commentaire 
    reste intéressant. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.computerworld.com/home/print.nsf/all/000502db52">Open 
    Source Smugglers</a>, ComputerWorld, 5 mai 2000 </strong></font><br>
    "Psssstt! Vous voulez un système fiable et bon sans vous ruiner 
    ? C'est possible, mais vous ne pourrez rien dire à votre patron". 
    Le rédacteur Peter Wayner, spécialisé dans le domaine 
    technologique, explique aux techniciens comment briser les règles et 
    mettre en place des systèmes open source furtivement pour faire votre 
    travail au mieux. Il mentionne le système OpenBSD "conscient des 
    questions de sécurité" et le propose comme meilleur serveur 
    possible pour le commerce électronique face à l'implémentation 
    rivale sous NT et il montre comment Marcus Rannum a incorporé OpenBSD 
    dans son application matérielle tout-intégrée (appliance) 
    d'enregistrement réseau pour se mettre à l'abri des troubles 
    provoqués par l'utilisation de NT vis à vis d'Unix.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://biz.yahoo.com/bw/000502/va_global__1.html">PowerCrypt 
    Encryption Accelerator Endorsed by OpenBSD</a>, Business Wire, 2 mai 2000 
    </strong></font><br>
    Une annonce destinée à la presse de Global Technologies Group, 
    qui annonce le support d'OpenBSD pour leurs cartes matérielles d'accélération 
    des opérations cryptographiques PowerCrypt IP. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a 
    href="http://nyheter.idg.se/display.pl?ID=000502-CSD1">[su&eacute;dois]  
    Computer Sweden</a>, 2 mai 2000</strong></font><br>
    Un article qui décrit BSD comme le choix de "plus demandeurs".
    OpenBSD est cité pour ses objectifs de sécurité et d'intégration
    de la cryptographie.
    <p>
  </p></li><li><font color="#009000"><strong> <a href="http://www.bsdtoday.com/2000/May/Features138.html">An 
    experience installing OpenBSD</a>, BSD Today, mai 2000 </strong></font><br>
    Un autre article du genre "J'ai installé OpenBSD" par Jeremy 
    C. Reed. Il explique, pas à pas, et dans une chronique rapide comment 
    il a installé OpenBSD 2.6, la configuration de X Window, la mise en 
    place du gestionnaire de fenêtres Blackbox et son utilisation de Netscape. 
    Le tout aura pris 4 heures et 38 minutes. Et bien... 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.daemonnews.org/200005/adventure.html">My 
    Adventures In OpenBSD 2.6</a>, Daemon News, mai 2000 </strong></font><br>
    Alison décrit comment elle a découvert le côté 
    geek de sa nature, en sauvant un vieux PC de la mort et en lui offrant une 
    installation d'OpenBSD. "Contrairement à l'opinion répandue, 
    je pense que ce n'est pas qu'une question de fiabilité qui touche OpenBSD 
    mais également de simplicité et clarté du système 
    : deux concepts qui sont visiblement ignorés dans les plus importantes 
    caractéristiques que l'on peut attendre d'un logiciel".<br>
</li></ul>

<h2>Avril 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://e-zine.nluug.nl/hold.html?cid=91">Interview 
    with OpenBSD's Theo de Raadt</a>, <font color="#4669ad"><sup>eup</sup></font> 
    E-zine, 20 avril 2000 </strong></font><br>
    Dans cet entrevue, Daniel De Kok discute avec le principal développeur 
    d'OpenBSD Theo de Raadt au sujet de la convergence entre BSDI et FreeBSD, 
    la position d'OpenBSD comme système embarqué et le futur d'OpenBSD.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.openbsd.org/fr/reprints/article_20000419.html">Security 
    Experts Say Proprietary Code Isn't Scrutinized Well Enough</a>, SOURCES, 19 
    avril 2000 </strong></font><br>
    Ce bulletin d'informatino discute des problèmes de sécurité 
    qui sont soulignés par les récentes vulnérabiliéts 
    au sein de produits commerciaux, et la présence de "porte dérobées" 
    et autres formes d'enregistrement ou d'envoi d'information personnelles sans 
    autorisation. Cet article cite Jerry Harold, président et co-fondateur 
    de Network Security Technologies : <i>"C'est pourquoi NetSec construit 
    ses produits en se basant sur un système d'exploitation, OpenBSD, qui 
    a fait de la sécurité son premier objectif".</i><br>
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/direct.cgi?/topnews/os20000417.html"> -->
    Open Source - Why it's Good for Security, SecurityPortal, 17 avril 2000 </strong></font><br>
    Dans un autre article destiné à combattre les fausses rumeurs, 
    le rédacteur Kurt Seifried s'entretient avec le principal développeur 
    du projet Bastille Linux, Jay Beale, qui réfute les informations propagées 
    selon lesquelles les logiciels open source seraient plus vulnérables 
    à cause de l'exploitation possible de failles par les "black hat" 
    (les hackers et pirates mal intentionnés, par opposition aux "white 
    hats"). Dans ce cas, il se demande pourquoi OpenBSD dont les sources 
    sont disponibles peut être aussi sûr et fiable. Il détruit 
    le concept de "sécurité par l'obscurité", un 
    mythe tenace qui ne veut pas mourir.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.securityfocus.com/commentary/19">Wide 
    Open Source</a>, SecurityFocus.com, 16 avril 2000 </strong></font><br>
    Elias Levy de BUGTRAQ discute du concept de sécurité entre les 
    logiciels open source et ceux qui sont fermés. Les développeurs 
    OpenBSD sont cités comme l'un des rares groupes qui s'intéresse 
    véritablement à l'audit du code et la correction des vulnérabilités 
    de sécurité.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.32bitsonline.com/article.php3?file=issues/200004/badpressedit"> 
    Bad Press</a>, 32Bits Online, avril 2000 </strong></font><br>
    Ecrasant les récentes annonces dans la presse qui clament que l'open 
    source, et en particulier Linux, produirait plus de problèmes de sécurité 
    logicelle, Clifford Smith indique <b>"Il existe une preuve définitive 
    et claire que les sources publiées permettent la création de 
    systèmes d'exploitation fiables et sécurisés : et cette 
    preuve s'appelle OpenBSD"</b>
<p> 
</p></li></ul>

<h2>Mars 2000</h2>
<ul>
  <li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/closet/closet20000329.html"> -->
    Linux is a security risk, I don't think so!, Security Portal, 29 mars 2000 
    </strong></font><br>
    Le rédacteur Kurt Seifried utilise l'audit de code réalisé 
    par OpenBSD pour réfuter une pièce de propagande de l'industrie 
    informatique qui veut faire croire aux gens que Linux serait un risque pour 
    la sécurité, car des personnes mal intentionnées seraient 
    capables d'y trouver plus facilement des failles. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.linux.com/interviews/20000308/44/">The 
    Kurt Seifried interview</a>, Linux.com, 8 mars 2000 </strong></font><br>
    Les rôles sont désormais inversés. Le rédacteur 
    spécialisé en sécurité, Kurt Seifried, est désormais 
    le sujet de cet article. Il discute du Security Portal, le rôle de la 
    sécurité dans Linux, le modèle de sécurité 
    d'OpenBSD et les scripts de renforcement pour Linux tels que Bastille Linux. 
    Il est assez pessimiste pour l'avenir et il pense que l'apathie des responsables 
    face à la sécurité risque de créer <i>"les 
    10 à 50 prochaines années qui seront, du point de vue de la 
    sécurité informatique, relativement misérables".</i><br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.openbsd.org/fr/reprints/article_20000306.html">Open 
    source software: Ready for Credit Union Primetime?</a>, CUES Tech Port, 16 
    mars 2000 </strong></font><br>
    Un article qui explique les différences que l'on peut rencontrer en 
    utilisant des logiciels open source par rapport à d'autres solutions, 
    et comment tout cela peut être appliqué aux entreprises de crédit 
    et les banques, et clarifie quelques points sur la courbe d'apprentissage 
    des équipes qui ne seraient pas formées à Unix. L'auteur 
    Tom DeSot recommande fortement OpenBSD dans cet article, visiblement écrit 
    pour les décideurs en charge des systèmes informatiques des 
    banques et organismes de crédit.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.sunworld.com/sunworldonline/swol-03-2000/f_swol-03-silicon.html">The 
    Unix players change, but the (r)evolution continues</a>, SunWorld, mars 2000 
    </strong></font><br>
    Rich Morin propose une perspective du morcellement de l'histoire d'Unix dans 
    les années 80 en examinant les tensiosn créatives qui ont parcouru 
    les cinq systèmes d'exploitation dérivés de 4.4BSD-Lite. 
    Au lieu de répéter les habituelles platitudes que l'on rencontre 
    à ce sujet, la rubrique Silicon Carny de Morin montre que les projets 
    coopèrent entre eux même s'ils ont des objectifs qui peuvent 
    diverger. Et maintenant que Sun déplace une partie de ses propres sources 
    en direction de l'open source, il se demande comment le monde va réagir.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://boardwatch.internet.com/mag/2000/mar/bwm79.html">Getting 
    to know OpenBSD</a>, Boardwatch Magazine, mars 2000 </strong></font><br>
    Le rédacteur Unix Jeffrey Carl continue son étude des alternatives 
    libres pour les fournisseurs d'accès à Internet dans une entrevue 
    avec Louis Bertrand. L'auteur discute également des mérites 
    relatifs d'OpenBSD et comment les fournisseurs d'accès peuvent l'utiliser 
    pour gagner un avantage compétitif.<br>
    <p> 
</p></li></ul>

<h2>Février 2000</h2>
<ul>
  <li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/direct.cgi?/research/ssh-part2.html"> -->
    All About SSH - Part II: OpenSSH, Security Portal, 28 février 2000 
    </strong></font><br>
    Seán Boran porte son regard sur SSH dans un article consacré 
    à la version OpenSSH sur OpenBSD mais aussi sur d'autres systèmes 
    d'exploitation. Il mentionne les problèmes rencontrés dans le 
    portage d'OpenSSH vers d'autres plateformes qui ne disposent pas d'un niveau 
    d'intégration cryptographique aussi développé que celui 
    d'OpenBSD.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/direct.cgi?/closet/closet20000216.html"> -->
    Firewalling with IPF, Security Portal, February 16, 2000 </strong></font><br>
    Kurt Seifried, l'auteur du guide "Linux Administrators Security Guide" 
    explique comment mettre en place un parefeu sous OpenBSD basé sur ipf. 
    Ses exemples utilisent la version 2.6 d'OpenBSD bien que son article ne se 
    destine pas spécifiquement à un système d'exploitation 
    particulier. 
    <p> 
  </p></li><li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/direct.cgi?/closet/closet20000209.html"> -->
    OpenBSD 2.6 - new features, Security Portal, 9 février 2000 </strong></font><br>
    Kurt Seifried présente OpenBSD 2.6 et ses nouvelles fonctionalités 
    comme <a href="http://www.openssh.com/">OpenSSH</a>, Apache DSO et les nouveaux 
    gestionnaires de périphériques. Il apprécie son viel 
    ami la "sécurité par défaut" dès l'installation. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.computerworld.com/cwi/story/0,1199,NAV47_STO41147,00.html">Three 
    Unixlike systems may be better than Linux</a>, ComputerWorld, 7 février 
    2000 </strong></font><br>
    Nous apprécions particulièrement Simson lorsqu'il écrit 
    <i>"Mais si vous voulez en avoir pour votre argent et le plus haut niveau 
    de sécurité possible, vous devriez vous intéresser aux 
    systèmes BSD. La récompense peut être considérable". 
    </i>Mais il rate le point crucial sur l'intégration de la cryptographie 
    à cause des fausses informations qui circulent au sujet des navigateurs 
    128-bits. Le brevêt sur RSA a plus été une muselière 
    qu'une forme d'innovation dans ce domaine à cause des restrictions 
    d'exportation américaines. Il est également à noter qu'OpenBSD 
    et FreeBSD proposent une intégration par défaut d'IPv6 dans 
    leur code de base.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.32bitsonline.com/article.php3?file=issues/200002/fbsd34&amp;page=1">Review 
    of FreeBSD 3.4</a>, 32BitsOnline, février 2000 </strong></font><br>
    Dans l'essaie de la version 3.4 de FreeBSD l'auteur de cet article, Cliffod 
    Smith, a été suffisament impressionné par OpenBSD pour 
    dire "<i>OpenBSD est probablement la distribution d'Unix la plus sûre 
    disponible et ce dès son installation car son code source a fait objet 
    d'un audit complet. Il est également fourni avec KERBEROS tandis qu'OpenSSL 
    et ssh font partie de la distribution. IPFilter fonctionne imméditament 
    : vraiment brillant".<br>
    </i> 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.infosecuritymag.com/feb2000/Linux.htm">Securing 
    Linux</a>, Information Security, février 2000 </strong></font><br>
    Pete Loshin étudie le statut de l'industrie vis à vis de Linux 
    et de la sécurité d'Unix. Il souligne un problème en 
    croissance constante : les utilisateurs novices de Linux qui laissent leur 
    système vulnérable par manque de connaissances, ou qui créent 
    des trous de sécurité par leurs erreurs de configuration. La 
    barre sur le côté explique l'intérêt d'OpenBSD, 
    les objectifs du projet et souligne sa réputation chez les experts 
    en sécurité.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.osopinion.com/Opinions/KeithRankin%20/Keith%20Rankin1.html">FreeBSD, 
    OpenBSD and SuSE 6.2 Eval Review</a>, OS Opinion, février 2000 </strong></font><br>
    Vous n'arrivez pas à vous décider ? Le vétéran 
    de l'informatique Keith Rankin compare une distribution Linux à deux 
    BSD. Long, et détaillé.
<p> 
</p></li><li><font color="#009000"><strong> <a 
    href="http://linux.kbst.bund.de/index.html">[allemand] Open 
    Source Software in der Bundesverwaltung</a>, Bundesministerium des Innern, 
    Februar 2000 </strong></font><br>
    Un article sur l'utilisation des logiciels open source au sein du gouvernemnt
    fédéral allemand, publié par le ministère fédéral
    de l'intérieur. Cet article, qui donne en référence OpenBSD
    comme système d'exploitation et application disponible, a été
    publié puis retiré sur "ordre" du ministère.
    Tenant compte des <a href="http://www2.linuxtag.de/2000/deutsch/shownews.php3?id=0047">fortes 
    pressions et protestations</a> ils ont accepté de publier à
    nouveau le document après avoir retiré certains chiffres (comme
    le prix des licences Microsoft, par exemple).
<p>
</p></li></ul>

<h2>Janvier 2000</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.epinions.com/cmd-review-7105-3AF042F-388EBC43-prod1">Secure 
    by default - a review of OpenBSD</a>, Epinions.com, 26 janvier 2000 </strong></font><br>
    OpenBSD obtient cinq étoiles dans une revue d'utilisateurs, sous l'égide 
    de Justin Roth. Dans un court mais brillant article qui se concentre sur les 
    aspects de sécurité d'OpenBSD, il est rappellé que la 
    sécurité est un facteur qui dépend également, 
    et même directement, du niveau d'attention de l'administrateur.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.zdnet.com/enterprise/stories/linux/news/0,6423,2426206,00.html">Opening 
    up, government style</a>, ZDNet, 24 janvier 2000</strong></font><br>
    Le rédacteur Evan Leibovitch marque une victoire : le gouvernement 
    américain a reconnu l'open source comme un "bien public" 
    appréciable au sein de ses récentes régulations d'exportation 
    du matériel cryprographique. Il cite Theo de Raadt et le fait que le 
    brevêt RSA a eu plus d'effets en matière de restrictions sur 
    le développement de la cryptographie que les lois d'exportation américaines. 
    <p> 
  </p></li><li><font color="#009000"><strong> "Info.sec.radio" radio show. 11:00AM, Monday, 
    10 janvier 2000<br>
    <a href="http://www.cjsw.com/">CJSW 90.9 FM campus radio in Calgary</a> en 
    association avec <a href="http://www.securityfocus.com/">SecurityFocus</a> 
    </strong></font><br>
    Lors d'une soirée d'inauguration de <strong>Info.sec.radio</strong>, 
    Dean Turner deSecurity Focus fait l'interview de Theo de Raadt au sujet d'OpenBSD, 
    de la sécurité et de la cryptographie.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> Mudge, the halo and the 2.4 sticker, MSNBC, 
    6 janvier 2000. </strong></font><br>
    Le sticker de beastie OpenBSD 2.4 a été aperçu sur le 
    portable de Mudge lors d'une photographie, au sein d'un article couvrant le 
    déplacement de L0pht sur le territoire commercial des poids lourds. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.nwfusion.com/newsletters/sec/0103sec2.html">Does 
    'open' mean secure?</a>, NetworkWorld Fusion Newsletters, 5 janvier 2000 </strong></font><br>
    Le fondateur du Security Portal, Jim Reavis, appelle OpenBSD le "Linux 
    de Linux". Nous ne sommes pas sûr de bien comprendre ce qu'il veut 
    dire, mais il soulignait à cette occasion l'effort d'audit du code 
    source du système et ce qu'il apporte à la sécurité 
    du système, il doit donc s'agir d'un compliment. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.zdnet.com/sr/stories/news/0,4538,2416865,00.html">Giving 
    Back</a>, Sm@rt Reseller Online, 4 janvier 2000</strong></font><br>
    Le rédacteur Linux Steven J. Vaughan-Nichols écrit sur VA Linux 
    et sur la création d'un site regroupant les projets open source. On 
    y trouve une citation intéressante : <i>"Qu'un projet open source 
    fonctionne sous OpenBSD, Palm ou même Windows, du moment qu'il s'agit 
    d'un projet Open Source il peut faire partie de SourceForge"</i>. OpenBSD 
    sera bientôt un mot ajouté au dictionnaire ! 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.itbusiness.ca/index.asp?theaction=61&amp;sid=32876"> 
    There's more to open source than just Linux</a>, Computing Canada, janvier 
    2000 </strong></font><br>
    <i>"Le manque de cohérence et de consistence entre les différentes 
    distributions pousse les administrateurs à examiner une nouvelle fois 
    leur approche" </i>indique le rédacteur Linux Gene Wilburn. Il 
    suggère les systèmes BSD comme alternative sérieuse, 
    car ils savent offrir <i>"un haut degré d'intégrité 
    et de cohérence"</i>. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.sunworld.com/sunworldonline/swol-01-2000/swol-01-supersys.html">A 
    report from LISA</a>, SunWorld, janvier 2000 </strong></font><br>
    Le rédacteur Peter Galvin propose un résumé de LISA'99 
    et il mentionne en particulier le <a href="http://www.openbsd.org/fr/events.html#lisa99">travail</a> 
    de Bob Beck au sujet de la sécurisation des accès libres de 
    type "Ethernet" que l'on trouve sur les campus universitaires. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.northernjourney.com/opensource/linside/li006.html">Canadian 
    open source projects</a>, The Computer Paper, janvier 2000 </strong></font><br>
    OpenBSD fait partie des projets open source listés dans la revue annuelle 
    canadienne : <a href="http://www.canadacomputes.com/cc/section/pub/1,1100,33,00.html?pub=1&amp;iss=52">The 
    Computer Paper</a>. Le rédacteur Lniux Gene Wilburn l'a compris, malheureusement 
    ce document n'est pas disponible sur le site de Computer Paper mais sur le 
    site de l'auteur lui-même.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.casselman.net/artlist/OpenBSD.htm"> 
    A Home-Grown Operating System?</a>, Alberta Venture Magazine, janvier/février 
    2000 </strong></font><br>
    Grace Casselman propose une entrevue avec Theo de Raadt au sujet du processus 
    de développement d'OpenBSD.
    <p>
  </p></li><li><font color="#009000"><strong> [polonais] <a href="http://www.linux.news.pl/openbsd.html">OpenBSD 
    - ma same zalety?</a>, <i>OpenBSD - Nothing but advantages?</i>, LinuxNews 
    Serwis Informacyjny, January 2000 </strong></font><br>
    Bartek Rozkrut combine un aperçu d'OpenBSD avec un article qui explique
    comment télécharger puis installer le système. Il mentionne
    "l'obsession" de Theo de Raadt au sujet de la sécurité
    et comment il peine les fanatiques de Linux sur les listes de Bugtraq avec
    des mentions telles que "ce problème a été fixé
    depuis longtemps sous OpenBSD" à chaque faille de sécurité.
    L'auteur prend le temps d'expliquer le système de partitionnement par
    disklabel et il explique que le script d'installation, bien que non graphique,
    fonctionne parfaitement pour ce qu'on attend de lui. Il donne même les
    temps de téléchargement moyens en fonction du fournisseur d'accès
    utilisé pour l'installation.<br>
    <i>Nous souhaitons remercier Vadim Vygonets, Wojciech Scigala et Tenyen pour 
    leur aide dans la traduction. Pour le texte complet nous vous invitons à 
    consulter les <a href="http://www.openbsd.org/mail.html">archives de la liste 
    de distribution advocacy@openbsd.org</a></i>
   <p>
  </p></li><li><font color="#009000"><strong> [russe] Byte Magazine, Russia, <u>January 2000 issue</u> 
    </strong></font><br>
    Une entrevue avec Theo de Raadt au sujet de l'histoire et des fonctionalités 
    du projet OpenBSD. 

<p> 
</p></li></ul>

<h2>Décembre 1999</h2>
<ul>
  <li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/closet/closet19991222.html"> -->
    OpenSource projects - what I learned from Bastille (and others), Security 
    Portal, 23 décembre 1999 </strong></font><br>
    Kurt Seifried (<a href="mailto:seifried@seifried.org">seifried@seifried.org</a>), 
    analyste en sécurité et auteur du guide "<i>Linux Administrators 
    Security Guide</i>" discute des efforts requis pour créer une 
    distribution Linux. Il mentionne l'audit des sources d'OpenBSD comme point 
    de référence pour la sécurisation d'un système.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://serverwatch.internet.com/news/1999_12_03_a.html">OpenBSD 
    2.6 Now Available</a>, Server Watch, 3 décembre 1999 </strong></font><br>
    Annonce de presse au sujet de la version 2.6 d'OpenBSD. 
    <p> 
  </p></li>  <li><font color="#009000"><strong> <a 
    href="http://www.heise.de/newsticker/data/odi-02.12.99-000/">[allemand] 
    OpenBSD 2.6 ist da</a>, heise online newsticker, December 2, 1999 </strong></font><br>
    Un court résumé de l'annonce de distribution d'OpenBSD 2.6
<p>
</p></li><li><font color="#009000"><strong> <a href="http://www.tekpress.com/Archives/1999/Dec/openbsd.html">OpenBSD 
    Review</a>, TekPress.COM, décembre 1999 </strong></font><br>
    Vlad Sedach offre un regard détaillé sur OpenBSD : son histoire, 
    sa position vis à vis de la sécurité et la cryptographie. 
    Il souligne le manque de support des machines dotées de <a href="http://www.openbsd.org/smp.html">plusieurs 
    processus</a> mais qualifie son niveau de sécurité comme le 
    meilleur actuellement disponible, en particulier s'il faut le comparer à 
    celui de NT.
<p> 
</p></li></ul>

<h2>Novembre 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://linux.com/featured_articles/19991115/206/">Buddying 
    up to BSD: Part Three - Regrouping</a>, Linux.com, 15 novembre 1999 </strong></font><br>
    Le rédacteur Matt Michie répond aux critiques adressées 
    à son dernier article sur OpenBSD où il discute de la promotion 
    d'OpenBSD et de Linux.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.infoworld.com/articles/op/xml/99/11/08/991108opsecwatch.xml"> 
    OpenBSD comes close to security nirvana with a system that is 'secure by default'</a>, 
    InfoWorld, 8 novembre 1999 </strong></font><br>
    Les rédacteurs Stuart McClure etJoel Scambray de Security Watch disent 
    de bonnes choses au sujet de la conception de la sécurité du 
    projet OpenBSD : <i>"Vous savez qu'en ce qui nous concerne nous ne sommes 
    pas très enthousiastes quand aux positions vis à vis de la sécurité 
    de la plupart des vendeurs. Toutefois, OpenBSD nous donne de bons espoirs, 
    et au moins ils essaient d'aller dans le bon sens".</i><br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.linux.com/featured_articles/19991108/200/">Buddying 
    up to BSD: Part Two - OpenBSD</a>, Linux.com, 8 novembre 1999 </strong></font><br>
    Le rédacteur Matt Michie parle de son expérience lors de l'installation 
    d'OpenBSD 2.5 comme serveur FTP sur un vieillissant Pentium 133. Malgré 
    quelques problèmes rencontrés pendant l'installation, il recommande 
    aux utilisateurs Linux expérimetés OpenBSD s'ils souhaitent 
    élargir leur horizon. Ensuite, quelques lecteurs lui repprochent ses 
    difficultés lors de l'approche d'OpenBSD...<br>
    <p> 
  </p></li><li><font color="#009000"><strong><a href="http://slashdot.org/interviews/99/11/04/1716225.shtml">UK 
    Royal Family webmaster prefers OpenBSD</a>, Slashdot, 4 novembre 1999 </strong></font><br>
    Mick Morgan, de l'agence anglaise "Central Computer and Telecommunications 
    Agency" répond aux questions des lecteurs du site d'information 
    Slashdot au sujet de la conception d'un site Web comme celui de la famille 
    royale anglaise. Il explique en particulier avoir retenu OpenBSD pour des 
    questions de sécurité. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://techupdate.zdnet.com/techupdate/stories/main/0,14179,2386632,00.html"> 
    Turning on the Zedz</a>, ZDNet, 3 novembre 1999 </strong></font><br>
    Le rédacteur Linux Evan Leibovitch continue à souligner les 
    méfaits provoqués par les lois portant sur la cryptographie 
    aux Etats-Unis, et il cite quelques sources alternatives comme OpenBSD et 
    <a href="http://www.openssh.com/">OpenSSH</a>. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.boardwatch.com/mag/99/nov/bwm77pg4.html">Freenix 
    flavors or, three demons and a penguin</a>, Boardwatch Magazine, novembre 
    1999 </strong></font><br>
    Le rédacteur du magazine Unix Boardwatch Magazine étudie les 
    choix d'Unix libres pour les fournisseurs d'accès à Internet. 
    Il en vient à la conclusion que la sécurité et les fonctionnalités 
    sont deux concepts en opposition. Si c'était le cas, nous pensons que 
    les utilisateurs soucieux de leur sécurité débrancheraient 
    aussi tôt leurs machines d'Internet pour se limiter uniquement à 
    l'envoi de Fax.<br>
    <p> 
</p></li></ul>

<h2>Octobre 1999</h2>
<ul>
  <li><font color="#009000"><strong> 
    <!-- <a href="http://securityportal.com/direct.cgi?/closet/closet19991027.html"> -->
    OpenBSD - a secure alternative, Security Portal, 27 octobre 1999 </strong></font><br>
    Kurt Seifried (<a href="mailto:seifried@seifried.org">seifried@seifried.org</a>), 
    analyste en sécurité et auteur du guide "<i>Linux Administrators 
    Security Guide</i>" discute de la mise en place d'un parefeu sous OpenBSD.<br>
    <p> 
  </p></li><li><font color="#009000"><strong><a href="http://slashdot.org/article.pl?sid=99/10/22/1157259&amp;mode=thread">Interview 
    with The Cult of the Dead Cow</a>, Slashdot, 22 octobre 1999 </strong></font><br>
    Entre deux réponses crues et rudes aux lecteurs de Slashdot, les membres 
    du "Cult of the dead Cow" évoquent le modèle de sécurité 
    d'OpenBSD et l'audit de son code source.<br>
    <p> 
  </p></li><li><font color="#009000"><strong><a href="http://www.lwn.net/1999/1014/security.phtml">The 
    existence of OpenSSH-1.0 has been confirmed</a>, Linux Weekly News, 14 octobre 
    1999 </strong></font><br>
    L'article de Linux Weekly News est la première organisation de nouvelles 
    non-BSD qui annonce l'existence d'<a href="http://www.openbsd.org/fr/crypto.html#ssh">OpenSSH</a> qui 
    sera distribué avec OpenBSD 2.6 <br>
    <p> 
  </p></li><li><font color="#009000"><strong><a href="http://www10.nytimes.com/library/tech/99/10/biztech/articles/11code.html">Easing 
    on Software Exports Has Limits</a>, New York Times, 11 octobre 1999 </strong></font><br>
    Peter Wayner porte un regard appuyé sur les conséquences qu'ont 
    les lois de restriction d'exportation du gouvernement américain sur 
    les logiciels cryptographiques, et il le fait de manière assez ironique. 
    OpenBSD est largement cité avec une photographie de Theo de Raadt brandissant 
    des CD-Rom du système d'exploitation (aucun paiement n'est requis pour 
    lire cet article en-ligne).<br>
    <p> 
  </p></li><li><font color="#009000"><strong><a href="http://www.netsec.net/press_100699.html">NSTI 
    announces commercial support services for OpenBSD</a>, Yahoo News, 6 octobre 
    1999 </strong></font><br>
    L'annonce destinée à la presse de Network Security Technologies 
    qui annonce que le NSTI utilise OpenBSD dans son centre de contrôle 
    des opérations réseau.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.daemonnews.org/199910/openbsd.html">I've 
    been hacked! How OpenBSD saved our project</a>, Daemon News, octobre 1999 
    </strong></font><br>
    L'administrateur système débordé qu'est John Horn nous 
    narre son expérience avec un serveur Lynx accessible sur Internet.<br>
    <p> 
</p></li></ul>

<h2>Septembre 1999</h2>
<ul>
  <li><font color="#009000"><strong><a href="http://www.calgaryherald.com/business/technology/stories/990930/2929913.html">Calgarian 
    heads team ensuring OpenBSD security</a>, Calgary Herald, 30 septembre 1999 
    </strong></font><br>
    Le journaliste spécialisé en technologie Matthew McClearn interroge 
    des administrateurs système au sujet de la sécurité, 
    et ils expliquent pourquoi ils ont choisi d'utiliser OpenBSD : pour sa stabilité, 
    et sa sécurité pro-active. Un court historique du projet est 
    également fourni. 
    <p> 
  </p></li><li><strong> Small town in Kentucky has Internet connectivity unlike the rest 
    of America<font color="#009000">, MSNBC, 29 septembre 1999 </font></strong><br>
    Jethro indique sur une liste de distribution par courrier électronique 
    que MSNBC a fait un reportage sur une petite ville du Kentucky qui dispose 
    d'un accès rapide à Internet. Pendant le reportage, on peut 
    voir le jeune gourou en sécurité taper sur son terminal :<br>
    <blockquote> <code>Connected to spanweb.glasgow-ky.com.<br>
      Escape character is '^]'.<br>
      <br>
      OpenBSD/mac68k (spanweb.glasgow-ky.com) (ttyp0)<br>
      </code> </blockquote>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.infoworld.com/cgi-bin/displayStory.pl?/features/990927hack.htm">Hack 
    this! Microsoft and its critics dispute software-security issues, but users 
    make the final call</a>, Infoworld, 27 septembre 1999</strong></font><br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.cnn.com/TECH/computing/9909/28/ms.security.idg/index.html">Microsoft: 
    Bad security, or bad press?</a>, CNN, 28 septembre 1999 </strong></font><br>
    Un aperçu effrayant des citations "L'insécurité 
    par défaut" du CDC qui expliquent que "La plateforme la plus 
    sécurisée disponible aujourd'hui dès l'installation du 
    système est OpenBSD, car la sécurité est un prime objectif 
    du projet". Un contraste marqué entre celui de Microsoft et le 
    <a href="http://www.openbsd.org/fr/security.html#default">nôtre</a>. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a 
    href="http://www.ascii.co.jp/BSDmag/">[japonais] BSD 
    Magazine</a>, 28 septembre 1999 </strong></font><br>
    La société ASCII Corporation lance un magazine en japonais afin
    de couvrir les systèmes Unix libres, les BSD, BSD/OS et les projets
    associés. Le magazine va également traduire et imprimer des
    articles provenant du magazine BSD <a href="http://www.daemonnews.org/">Daemon 
    News</a>
<p>
</p></li><li><font color="#009000"><strong> <a href="http://www.usatoday.com/life/cyber/tech/ctg183.htm">Open 
    source has roots in the Net</a>, USA Today, 20 septembre 1999 </strong></font><br>
    Une mention de haut vol d'OpenBSD par Will Rodger : "Nombreux sont ceux 
    et celles qui souvent expliquent que les développeurs open source sont 
    en constante compétition pour trouver et régler les problèmes, 
    ce qui les sépare clairement des vendeurs traditionnels de logiciels. 
    OpenBSD -un autre système d'exploitation open source- est d'ailleurs 
    réputé pour être le système d'exploitation le plus 
    sûr du monde".<br>
    <p> 
  </p></li><li><strong> Even better than Linux, <a href="http://www.boston.com/globe/">Boston 
    Globe</a><font color="#009000">, 16 septembre 1999 </font></strong><br>
    Le rédacteur spécialiste en technologie, Simson L. Garfinkel, 
    explique qu'il préfère OpenBSD à Linux, et il explique 
    pourquoi. Il consacre un bon paragraphe au sujet d'OpenBSD et de sa sécurité, 
    et des objectifs d'intégration de la cryptographie. Toutefois, vous 
    aurez l'impression après cette lecture que tous les développeurs 
    sont canadiens (indice : ce n'est pas le cas). L'article a été 
    déplacé dans les archives, et un enregistrement gratuit est 
    requis pour y accéder.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www2.idg.com.au/CWT1997.nsf/Home+page/83CB1A288A3B3EB54A2567E5001FEF41?OpenDocument">Microsoft, 
    Linux to become duopoly?</a>, ComputerWorld Australia, 8 septembre 1999. </strong></font><br>
    Le reporter Natasha David propose une entrevue avec le développeur 
    principal du projet, Theo de Raadt. Il explique que la compatibilité 
    vis à vis des Unix traditionnels perd du terrain face à la compatibilité 
    Linux. de Raadt aura participé à la session d'ouverture du rassemblement 
    Australian Unix User Group (AUUG) à Melbourne.<br>
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.idg.net/idgns/1999/09/08/GNULaunchesFreeEncryptionTool.shtml">GNU 
    launches free encryption tool</a>, IDG News Service, 8 septembre 1999 </strong></font><br>
    <a href="http://www.gnupg.org/">GNU Privacy Guard</a> fonctionne parfaitement 
    sous OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.samag.com/documents/s=1174/sam9909d/"> 
    Maintaining Patch Levels with Open Source BSDs</a>, article de SysAdmin, septembre 
    1999 </strong></font><br>
    Michael Lucas explique les lignes générales du modèle 
    de développement BSD et comment il est possible de maintenir les systèmes 
    BSD à jour à l'aide de BSD. L'auteur prend la plupart de ses 
    exemples depuis FreeBSD mais il prend le temps d'expliquer les différences 
    vis à vis des autres BSD. La majeure partie de ces technologies auront 
    été inventée, d'ailleurs, par les premiers développeurs 
    d'OpenBSD, comme cela a été décrit dans un document de 
    travail présénté à <a href="http://www.openbsd.org/fr/events.html#anoncvs_paper">Usenix</a>). 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.opensourceit.com/tutorials/990901_openbsd.html"> 
    My own private IRP</a>, open source IT tutorial, septembre 1999 </strong></font><br>
    Sean Sosik-Hamor décrit comment il a construit son propre service de 
    fournisseur de services à Internet (IRP ou "Internet resource 
    provider") en utilisant des matériels simples d'accès et 
    des logiciels Unix libres. Il a utilisé OpenBSD pour la mise en place 
    de sa zone DMZ (démilitarisée, avant le parefeu) et il décrit 
    son isntallation par FTP. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www2.idg.com.au/CWT1997.nsf/cwtoday/C02D91FFCD8CD68A4A2567F3007A9A05?OpenDocument">India-based 
    Web site offers raft of free OSes</a>, ComputerWorld Australia, septembre 
    1999</strong></font><br>
    OpenBSD est l'un des nombreux systèmes d'exploitation offerts à 
    <a href="http://www.freeos.com/">FreeOS</a>, un site basé en Inde qui 
    propose l'accès aux systèmes libres et aux informations les 
    concernant. 
    <p> 
</p></li></ul>

<h2>Aôut 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.lti.on.ca/cw/archive/CW15-17/cw_wtemplate.cfm?filename=c1517n8.htm"> 
    A Secure and Open Society</a>, ComputerWorld Canada, 27 août 1999</strong></font><br>
    L'article commence par une histoire personnelle au sujet du développeur 
    principal Theo de Raadt, mais si vous lisez avec attention vous découvrirez 
    des explications détaillées des origines et objectifs d'OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.computermags.com/CCP/Pub/Story/1,1080,715,00.html"> 
    1999's Technically Excellent Canadians</a>, COMPUTERMAGS.COM, 10 août 
    1999</strong></font><br>
    "CCW est très heureux de pouvoir nommer cinq canadiens d'excellence 
    technique, dont le travail affecte fortement les technologies aussi bien domestiques 
    qu'ailleurs. Nous remercions nos lecteurs pour leur implication et ces nominations". 
    Les éditeurs du Canadian Computer Wholesaler (août 1999) et du 
    Computer Paper (septembre 1999) ont présenté cette récompense 
    à Theo de Raadt pour son travail au sein du projet OpenBSD (l'article 
    se trouve un peu plus dans la page en lien).
<p> 
</p></li></ul>

<h2>Juillet 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.msnbc.com/news/292376.asp"> 
    The Net's stealth operating system</a>, MSNBC, 22 juillet 1999</strong></font><br>
    "Le groupe OpenBSD, qui a réalisé un audit des sources de son 
    système ligne à ligne, est aujourd'hui considéré 
    comme le système d'exploitation le plus fiable du monde".
   <p>
  </p></li><li><font color="#009000"><strong> [russe] Byte Magazine, Russia, <u>July/August 1999 
    issue</u>. </strong></font><br>
    Une revue d'OpenBSD 2.5 et des objectifs du projet OpenBSD. 
<p> 
</p></li></ul>

<h2>Juin 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.data.com/issue/990607/ipsec.html">IPsec 
    Tech Tutorial</a>, Data Communications, juin 1999</strong></font><br>
    "IPsec est peut être un standard ouvert, il n'y a aucune garantie de 
    la part des vendeurs que leurs solutions fonctionnent ensemble. Pour tester 
    cette inter-opérabilité, nous avons placé une douzaine 
    de produits dans ce domaine ensemble afin d'étudier leur fonctionnement". 
    Des implémentations commerciales d'IPsec et d'OpenBSD 2.4 ont été 
    testées par un laboratoire indépendant, et vérifier la 
    facilité d'accès et de configuration des tunnels. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.sunworld.com/swol-06-1999/swol-06-usenix.html?IDG.net">A 
    glimpse at the USENIX Technical Conference</a>, SunWorld, juin 1999 </strong></font><br>
    Dans un article de cette année, intitulé "USENIX and Unix 
    -- then and now", le rédacteur Vicki Brown souligne le contraste 
    entre la première conférence de 1979 et la plus récente 
    qui a eu lieu à Montery en Californie. Bien qu'il ne fait que mentionner 
    OpenBSD dans la section des liens de son article, il reste une intéressante 
    lecture. 
    <p> 
</p></li></ul>

<h2>Mai 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.nationalpost.com/financialpost.asp?f=990525/2636405&amp;s2=canadianbusiness"> 
    Operating system designed to foil hackers</a>, National Post, 25 mai 1999</strong></font><br>
    Le rédacteur du Post David Akin propose une entrevue avec Theo de Raadt, 
    dans un article qui débute sur la première page et se poursuite 
    dans la partie "Business" du titre. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.pioneerplanet.com/reprints/051799tech.htm"> 
    OS Also-Rans: After Windows 98, Mac OS and Linux, what's left for your Macintosh 
    or Intel PC? Lots</a>, St.Paul-Minneapolis Pioneer-Planet, 17 mai 1999 </strong></font><br>
    Malgré un très mauvais titre, le rédacteur Julio Ojeda-Zapata 
    propose un article qui donne à chaque alternative un poids équitable. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.daemonnews.org/199905/open-japan.html">In 
    Search of OpenBSD</a>, DaemonNews, mai 1999</strong></font><br>
    Ejovi Nuwere au Japon : trois jours, trois endroits et un système d'exploitation. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.daemonnews.org/199905/chroot.html">Safe 
    and friendly read-only chroot jails for FTP and WWW</a>, DaemonNews, mai 1999 
    </strong></font><br>
    "Ruffy" explique comment mettre en place un serveur FTP et des services Web 
    sans prendre de risques en utilisant le serveur ftpd d'OpenBSD comme exemple.<br>
    <p> 
</p></li></ul>

<h2>Mars 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.computerbits.com/archive/19990300/bsd.htm"> 
    Why to BSD in a Linux world</a>, mars 1999</strong></font><br>
    Description du processus de développement d'OpenBSD, et les arguments 
    qui expliquent pourquoi Linux ne peut atteindre le même niveau d'audit 
    de sécurité. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://archive.infoworld.com/cgi-bin/displayNew.pl?/peer/990308pp.htm">Alternative 
    OSes face a Sisyphean struggle to get into the PC mainstream</a>, Infoworld, 
    mars 1999 </strong></font><br>
    Le rédacteur Brett Arquett montre que Linux n'est pas la seule alternative 
    comme système d'exploitation des machines PC, puis il décrit 
    les gestionnaires de périphériques, et en quoi le support final 
    des utilisateurs permet de rendre un système d'exploitation populaire. 
    Il mentionne OpenBSD et propose un lien vers son site.
<p> 
</p></li></ul>

<h2>Février 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.daemonnews.org/199902/samba.html"> 
    DaemonNews: Serving NT filesystems from an OpenBSD server</a> février 
    1999</strong></font><br>
    Un administrateur système casse le mythe selon lequel il serait uniquement 
    possible d'utiliser NT pour servir de bon serveur de fichiers à des 
    machines sous windows. En utilisant du vieux matériel et OpenBSD il 
    montre comment en tirer les meilleures performances, avec l'ajout de scripts 
    pour automatiser la configuration ; tout cela lui aura permis de gagner le 
    support de son équipe de direction lors de l'installation de ce test. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.infoworld.com/cgi-bin/displayNew.pl?/security/990215sw.htm"> 
    Security Watch, end of year Golden Guardian awards.</a> février 1999</strong></font><br>
    "Enfin, il serait mal venu de ne pas citer OpenBSD ou de l'ignorer dans toute 
    discussion en relation avec la meilleure sécurité disponible. 
    Ce système aura été classé très haut dans 
    notre enquête par courrier électronique et nous promettons d'y 
    consacrer un regard plus actif dans nos prochains articles".
<p> 
</p></li></ul>

<h2>Janvier 1999</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.planetit.com/techcenters/docs/linux/technology/PIT19990701S0039/">Open-Source 
    Software: Power to the People</a>, Data Communications, 4 janvier 1999 </strong></font><br>
    Le rédacteur Lee Bruno s'émerveille des logiciels libres qui 
    servent à côté de logiciels plus connus. La page 3 mentionne 
    OpenBSD. 
    <p> 
  </p></li><li><font color="#009000"><strong> <a href="http://www.sunworld.com/sunworldonline/swol-01-1999/swol-01-bsd_p.html">The 
    return of BSD</a>, SunWorld, janvier 1999</strong></font><br>
    Le vétéran BSD Greg Lehey note la loyauté très 
    forte des utilisateurs de SunOS 4 et étudie les systèmes d'exploitation 
    dérivés de BSD disponibles sur matériel Sparc et PC. 
    L'article offre également de très bons liens (dont une partie 
    ne sont plus fonctionnels).
<p> 
</p></li></ul>

<h2>Novembre 1998</h2>
<ul>
   <li><font color="#009000"><strong> <a 
    href="http://www.datateknik.se/arkiv/98-20/28.html">[su&eacute;dois]  
    Datateknik</a>, 20 novembre 1998</strong></font><br>
    Un article sur l'événement suédois <a href="http://www.openbsd.org/fr/events.html#ipsec98">IPsec 
    interop</a> qui mentionne OpenBSD comme un participant à succès,
    avec une mini-entrevue du développeur OpenBSD Niklas Hallqvist.
    <p>
  </p></li><li><font color="#009000"><strong> <a 
    href="http://www.datateknik.se/arkiv/98-13/1.html">[su&eacute;dois]  
    Datateknik</a>, 13 novembre </strong></font><font color="#009000"><strong> 
    1998 et<a href="http://www.datateknik.se/arkiv/98-14/1.html"> Datateknik</a>, 
    14 novembre 1998</strong></font><br>
    Deux lettres publiées qui évoquent le rôle d'OpenBSD dans
    MacOS X. La première semble avoir mal compris certains aspects, ce
    qui est corrigé par la seconde lettre qui explique les questions de
    licence et renvoie sur notre propre page de <a href="http://www.openbsd.org/fr/policy.html">copyright 
    policy</a>.
   <p>
  </p></li><li><font color="#009000"><strong> <a href="http://www.daemonnews.org/199811/security.html"> 
    OpenBSD and IPsec, leading the pack</a>, novembre 1998 </strong></font><br>
    Un article de deux parties par Ejovi Nuwere qui se concentre sur le développement 
    de l'IPsec au sein d'OpenBSD. La première partie est une introduction 
    au Photurisd d'OpenBSD et son actuelle implémentation. On y trouve 
    une entrevue avec le créateur de Photurisd : Neils Provos.
<p> 
</p></li></ul>

<h2>Août 1998</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.wired.com/news/news/culture/story/5943.html"> 
    Beyond HOPE coverage, Wired Magazine</a>, 11 août 1997</strong></font><br>
    Une description totalement fausse (mais assez amusant) de ce qu'est OpenBSD.
<p> 
</p></li></ul>

<h2>Juillet 1998</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.infoworld.com/cgi-bin/displayArchive.pl?/98/28/o03-28.40d.htm"> 
    Security Watch: Monthly Editorial.</a> juillet 1998</strong></font><br>
    Cet article pointe notre <a href="http://www.openbsd.org/security.html">page 
    de sécurité</a> en l'appellant "le mantra OpenBSD".<br>
  
</li></ul>

<h2>June, 1998</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://webserver.cpg.com/reviews/r1/3.4/index.html"> 
    WebServer Online</a>, réimprimé dans <a href="http://sw.expert.com/R/WS4.JUN.98.pdf"> 
    Server/Workstation Expert (formerly SunExpert Magazine)</a>, juin 1998, page 
    81</strong></font><br>
    Un description d'OpenBSD sur quatre pages, qui met l'emphase sur les utilisations 
    du système en tant que serveur et système d'exploitation qui 
    propose une sécurité "par défaut" à 
    l'installation (la version SunExpert est dans le document PDF mais propose 
    son propre article - une sorte de mélange entre Superman et le daemon 
    BSD, qu'on ne trouve pas dans la version HTML).<br>
    <br>
  </li><li> 
    <p><font color="#009000"><strong><a href="http://www.wired.com/">Wired Magazine</a>, 
      juin 1998, page 96 (édition papier uniquement)<br>
      </strong><font color="#000000">Une description d'une demi-page de ce qu'est 
      OpenBSD, avec une étrange image de Theo de Raadt (Wired aime Photoshop).</font></font>
  
</p></li></ul>

<h2>Mai 1998</h2>
<ul>
  <li><font color="#009000"><strong> <a href="http://www.wired.com/news/news/business/story/12035.html"> 
    Usenix coverage, Wired Magazine</a>, 1er mai 1998</strong></font><br>
    L'article mentionne OpenBSD et cite son implication dans le Freenix "track" 
    qui a eu lieu lors du dernier Usenix de New Orleans (Etats-Unis).
<p> 
</p></li></ul>

<p>
 
<hr>
<a href="index.html"><img height="24" width="24" 
src="../back.gif" border="0" alt="OpenBSD"></a>
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: press.html,v 1.359 ]<br>
$Translation: press.html,v 1.10 2003/06/17 21:52:56 xsa Exp $<br>
$OpenBSD: press.html,v 1.6 2003/06/21 11:54:32 jufi Exp $ 
</small> 

</body>
</html>
