<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>OpenBSD &agrave; l'oeuvre</title>
<link rev=made href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name=keywords content="OpenBSD,users,commercial,operating system,Unix,Un*x,BSD,secure">
<meta name="distribution" content="global">
<meta name="copyright" content="This document copyright 1999-2003 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000" link="#23238e">
<a href="index.html"><img alt="[OpenBSD]" height="30" width="141" src="../images/smalltitle.gif" border="0"></a>
<p>
<h2><font color="#e00000">Utilisateurs</font></h2>
<hr>
Le terme &quot;utilisateurs&quot; a plusieurs significations. Il peut
s'agir des <i>utilisateurs finaux</i>, ceux qui sont
int&eacute;ress&eacute;s par le syst&egrave;me pour leur propre usage
personnel, pour partager des id&eacute;es, discuter de leurs
probl&egrave;mes et trouver ensemble des solutions, voire tout
simplement discuter de leur syst&egrave;me d'exploitation favori autour
d'une bonne table et de quelques boissons. L'un des meilleurs moyens
pour rencontrer d'autres utilisateurs est de rejoindre l'un de nos <a
href="../groups.html">groupes d'utilisateurs de par le monde.</a>

<p> 
Une autre signification de ce terme correspond &agrave; &quot;qui
utilise ce syst&egrave;me, et pour quoi faire ?&quot; et c'est le sujet
du reste de cette page. Ces <a href="#com">compagnies</a> et
organisations utilisent OpenBSD et font confiance &agrave; notre
processus rigoureux d'audit de code, et notre foi absolue dans notre
mod&egrave;le de d&eacute;veloppement orient&eacute;
s&eacute;curit&eacute;, &agrave; tout stade. Ils utilisent ainsi notre
syst&egrave;me d'exploitation pour concevoir des pare-feux, des
syst&egrave;mes de d&eacute;tection d' intrusion ou bien des serveurs
d'usage g&eacute;n&eacute;ral. Des <a href="#edu">chercheurs
universitaires</a> et d'autres d&eacute;veloppeurs professionnels ont
souvent des besoins en termes de s&eacute;curit&eacute; et de
stabilit&eacute; &eacute;quivalents et choisissent OpenBSD. De
tr&egrave;s nombreux <a href="#isp">fournisseurs d'acc&egrave;s &agrave;
Internet</a> appr&eacute;cient beaucoup les fonctionnalit&eacute;s de
s&eacute;curit&eacute; d'OpenBSD.<br> 
<br>Si vous souhaitez faire partie de cette page, vous pouvez prendre
contact avec nous &agrave; l'adresse suivante : <a
href="mailto:press@openbsd.org">press@openbsd.org</a>
  . <br>
  <br>
  <i><b>NOTE:</b> pour des raisons de s&eacute;curit&eacute;, de
        nombreuses compagnies nous ont demand&eacute; soit de ne pas
        faire figurer directement leur nom, soit celui de leurs clients.
        Dans ce cas, la mention &quot;compagnie &agrave;
        l'identit&eacute; pr&eacute;serv&eacute;e&quot; appara&icirc;tra
        en lieu et place de ces informations.</i><br> <br> <hr>

<h2><font color="#e00000"><a name="edu">Recherche et autres utilisateurs non-commerciaux</a></font></h2>
<ul>

<li><a href="http://www.ospedalimantova.it">Azienda Ospedaliera, Mantova, Italie</a><br>
Azienda Ospedaliera "Carlo Poma" est la plus grande institution
sanitaire de la province de Mantova (Lombardie) avec six h&ocirc;pitaux
et d'autres petites structures ambulantes. OpenBSD a &eacute;t&eacute;
choisi en raison de sa robustesse et maintenant il sert comme pont
filtrant entre le WAN et l'h&ocirc;pital principal de Mantova. Nous
utilisons pf et altq pour des applications pare-feu et QoS, et fwanalog
pour g&eacute;n&eacute;rer des statististiques du trafic WAN.
<p>

<li><a href="http://www.belperschool.co.uk">Belper School, Belper, Derbyshire, 
Angleterre </a><br>
L'&eacute;cole Belper utilise des machines OpenBSD comme serveurs de
fichiers Samba pour pr&egrave;s de 1100 &eacute;tudiants, mais aussi
pour le stockage de leurs pages Web, le pare-feu et la passerelle NAT du
site.<br>
<p> 

<li><a href="http://elm.eu.org/">ELM consortium, Biocomputing Unit EMBL, Heidelberg, Germany</a><br>
Le consortium ELM h&eacute;berge une base de donn&eacute;es dite
&quot;Eukaryotic Linear Motif&quo; et utilise OpenBSD pour les serveurs
de communication du consortium.
<p>

<li><A HREF="http://www.iztacala.unam.mx">ENEP Iztacala</A><br>
ENEP Iztacala est l'une des &eacute;coles de la p&eacute;riph&eacute;rie
de l'<A HREF="http://www.unam.mx">UNAM</A>. L'UNAM est la plus grande
universit&eacute; de Mexico, avec plus de 250000 &eacute;tudiants,
tandis que l'ENEP Iztacala en comprend un peu plus de 10000. Ce campus
est essentiellement orient&eacute; dans les domaines de la sant&eacute;
ce qui explique la taille relativement restreinte de son parc
informatique. Ils utilisent deux serveurs OpenBSD, une machine Solaris
et deux autres sous Linux. OpenBSD y est utilis&eacute; pour proposer le
site web principal (qui fonctionne sans interruption ni probl&egrave;me
depuis sept ans sur une machine Sun Sparcstation 5), g&eacute;rer les
comptes de courrier &eacute;lectronique des &eacute;tudiants ainsi que
pour agir en tant que pare-feu.<br> Il y a &eacute;galement deux autres
machines sous OpenBSD, situ&eacute;es dans la zone de
d&eacute;veloppement. La premi&egrave;re sert &agrave; surveiller le
r&eacute;seau, &agrave; l'aide de Snort, et sera prochainement
d&eacute;plac&eacute;e pour se rapprocher du pare-feu. L'autre machine
sert de miroir CVS &agrave; OpenBSD
(<strong>CVSROOT=anoncvs@anoncvs.mx.openbsd.org:/cvs</strong>).<br> Bien
que ces machines ne soient pas utilis&eacute;es pour de la
cr&eacute;ation &agrave; proprement parler, OpenBSD y est largement
utilis&eacute; pour les fonctions qu'il sait mener avec brio :
fonctionner parfaitement y compris sur du vieux mat&eacute;riel, et
lib&eacute;rer de leurs contraintes et inqui&eacute;tudes les
administrateurs du site, et des doutes qu'ils subissent avec d'autres
syst&egrave;mes d'exploitation.<br> Ce site h&eacute;berge
&eacute;galement une liste de diffusion en espagnol
: openbsd@tlali.iztacala.unam.mx. 
<p> 

<li><a href="http://fortthunder.org/music/ff/index.html">"Forcefield" art installation</a><br>
Une partie de l'audio et de l'&eacute;clairage de l'installation d'art
Forcefield pr&eacute;sent&eacute;e lors de l'exposition biennale de
2002, au mus&eacute;e Whitney d'art am&eacute;ricain &agrave; New York
repose sur le contr&ocirc;le d'une VAXstation 3100 sous OpenBSD. Ce
derneir aura &eacute;t&eacute; retenu pour sa simplicit&eacute; et sa
robustesse.
<p> 

<li><a href="http://www.hus.fi/group/">Helsinki University Central
    Hospital, Finlande</a><br>
L'h&ocirc;pital du district d'Helsinki et d'Uusimaa (HUS) en Finlande
totalite pr&egrave;s de 18000 personnes. Il offre des soins
m&eacute;dicaux sp&eacute;cialis&eacute;s aux r&eacute;sidents de la
capitale et &agrave; d'autres membres locaux. OpenBSD y est
utilis&eacute; pour les services de DNS, de passerelle, de r&eacute;seau
virtuel priv&eacute; et de solutions de pare-feu pour prot&eacute;ger
les machines du campus interne mais &eacute;galement vis &agrave; vis
d'Internet.
<p> 

<li><a href="http://www.polyprep.org">Polytechnic Preparatory Country Day School</a><br>
Poly Prep CDS, une grande &eacute;cole priv&eacute;e au sud de Brooklyn
(New York) utilise OpenBSD depuis sa version 2.9 pour ses pare-feux (sur
les deux campus) et d&eacute;sormais pour les serveurs de fichiers de
ses &eacute;tudiants. Ces serveurs, qui font partie du club des
utilisateurs informatiques, fonctionnent sous OpenBSD 3.2 et sont
administr&eacute;s par les &eacute;tudiants sous la direction d'un
administrateur Unix exp&eacute;riment&eacute;. Le but du programme est
de leur enseigner les responsabilit&eacute;s qui sont attendues des
adminsitrateurs Unix comp&eacute;tents, l'exploitation de
syst&egrave;mes coh&eacute;rents et de qualit&eacute; et de montrer
qu'il existe des alternatives viables &agrave; Linux.
<p> 

<li><u>INFN Italian Institute of Nuclear Physics, Florence, Italie</u><br>
Cette organisation de recherche gouvernementale &agrave; but
non-lucratif est une institution acad&eacute;mique qui utilise OpenBSD
pour son service de noms de domaines et la protection de son
r&eacute;seau gr&acirc;ce &agrave; son pare-feu
int&eacute;gr&eacute;.<br>
<p> 

<li><u>Prague Institute of Chemical Technology, R&eacute;publique Tch&egrave;que</u><br>
Cette universit&eacute; utilise OpenBSD sur plate-forme PC pour offrir
&agrave; ses &eacute;tudiants et &agrave; son personnel un acc&egrave;s
Web, le courrier &eacute;lectronique et des comptes shell distants. Une
machine Sparc IPX sert &eacute;galement de serveur-horloge
centralis&eacute; et de DNS secondaire. Les stations des administrateurs
fonctionnent aussi sur plate-forme PC sous OpenBSD.
<p> 

<li><a href="http://www.ceesonora.org.mx">Sonora State Electoral Council, M&eacute;xico</a><br>
El Consejo Estatal Electoral del Estado de Sonora usa OpenBSD para
proteger sus sistemas, estas aplicaciones estan en linea a traves de
Internet, dando resultados electorales al usuario, su red privada esta
protegida por usuarios internos y externos.<br>
    <i>
    Cette agence gouvernementale utilise OpenBSD pour prot&eacute;ger
    son r&eacute;seau et disposer de services de d&eacute;tection
    d'intrusion. Le r&eacute;seau virtuel priv&eacute; bas&eacute; sur
    OpenBSD permet de distribuer les r&eacute;sultats &eacute;lectoraux
    aux utilisateurs aussi bien internes qu'externes.<br> 
    </i>
<p> 

<li><a href="http://www.ualberta.ca/">The University of Alberta</a><br>
L'universit&eacute; d'Alberta utilise OpenBSD sur des plates-formes
Sparc et Intel pour ses serveurs proxy, Kerberos, surveillance des
services, impression, surveillance pro-active du r&eacute;seau et
r&eacute;ponse aux incidents. OpenBSD sur plate-forme Intel sert
&agrave; la construction des pare-feux, des r&eacute;seaux virtuels
priv&eacute;s de l'universit&eacute; o&ugrave; tous les syst&egrave;mes
administratifs se trouvent. OpenBSD sert &eacute;galement de <A
HREF="http://www.ualberta.ca/~beck/authgw.html">passerelle
d'authentification</A> aux laboratoires accessibles au public et aux
prises d'acc&egrave;s Ethernet sur les 40 sites du campus (soit environ
1500 emplacements de connexion) pour s&eacute;curiser l'acc&egrave;s
internet public. Le d&eacute;partement de science informatique utilise
pour l'instruction de ses &eacute;tudiants en licence un laboratoire de
20 places, enti&egrave;rement sous OpenBSD.
<p>

<li>The University of Lund's <a href="http://www.jur.lu.se">Law Department</a><br>
Ce d&eacute;partement utilise OpenBSD pour ses pare-feux, NAT, proxy
Squid et syst&egrave;mes de d&eacute;tection d'intrusion. Les
&eacute;tudiants utilisent l'acc&egrave;s Web pour leurs applications
telles que le suivi de cours ou des lectures multim&eacute;dia. Tous
passent au moins une fois par des machines sous OpenBSD.
<p>  

<li>The University of Michigan's <a href="http://www.citi.umich.edu/"> Center for Information Technology Integration (CITI)</a><br>
Le laboratoire du CITI utilise OpenBSD comme base pour de nombreux
projets de recherche intensifs. OpenBSD est utilis&eacute; pour
d&eacute;velopper et analyser les contenus de cartes <a href=
"http://www.citi.umich.edu/projects/sinciti/smartcard/">&agrave;
puce</a> et de leurs protocoles, que ce soit de mani&egrave;re
isol&eacute;e ou au sein d'applications du monde r&eacute;el. Des
projets sont en cours d'&eacute;tude pour fournir des cartes contenant
des jetons d'authentification qui permettront aux &eacute;tudiants
d'acc&eacute;der aux services d'impression et au r&eacute;seau via
Kerberos. OpenBSD y sert &eacute;galement de plateforme test pour le
programme d'<a href=
"http://www.citi.umich.edu/projects/mobile.html">informatique
mobile</a>. En interne, le &quot;coffre &agrave; paquets&quot; est une
machine, sous OpenBSD, qui enregistre et chiffre tous les paquets qui
transitent sur le r&eacute;seau interne &agrave; 10 Mbit. En cas de
d&eacute;tection d'intrusion, ils servent &agrave; une analyse plus
approfondie (le chiffrement &eacute;tant requis pour garantir les
aspects privatifs de chaque utilisateur). D'autre part, un nombre
cons&eacute;quent des administrateurs du site utilisent OpenBSD comme
syst&egrave;me d'exploitation principal.<br>
<p> 

<li><a href="http://www.umn.edu/">The University of Minnesota</a><br>
Cette universit&eacute; utilise OpenBSD sur des machines Sun Sparc pour
la surveillance de son r&eacute;seau et la planification de
capacit&eacute;. Ils r&eacute;alisent des requ&ecirc;tes vers plus de
53000 interfaces (en date de mai 1999) via SNMP et stockent plus de 250
Mo de donn&eacute;es SNMP par mois.
<p> 

<li><u>Uppsala University Hospital, Department of Infectious Diseases</u><br>
Ce d&eacute;partement utilise OpenBSD pour ses serveurs internes et pour
l'&eacute;laboration de pare-feux et passerelles Internet.
<p> 

<li>Warsaw University's <a href="http://www.chem.uw.edu.pl/">Department of Chemistry</a><br>
Ce d&eacute;partement universitaire utilise OpenBSD pour ses pare-feux,
serveurs de courrier &eacute;lectronique, DNS, Web, proxy Squid,
serveurs de fichiers et d'autres usages. Le d&eacute;ploiement du
syst&egrave;me d'exploitation touche plus de 1000 &eacute;tudiants.<br>
<p> 

<li><a href="http://www.xscanners.org/">Xscanners Information Warfare Center</a><br>
Xscanners IWC est orient&eacute; vers plusieurs diff&eacute;rents
aspects de la guerre de l'information et cyberguerre, traitant des
sujets et des discussions tr&egrave;s importants dans le monde post 9/11
d'aujourd'hui. Xscanners met en place et con&ccedil;oit des
environnements s&eacute;curis&eacute;s utilisant OpenBSD dans plusieurs
domaines diff&eacute;rents. Nous avons aussi des comit&eacute;s de
discussion autour de la s&eacute;curit&eacute;.
<p>

</ul>

<h2><font color="#e00000"><a name="com">Utilisateurs commerciaux</a></font></h2>

<ul>
<li><a href="http://www.adobe.com/">Adobe Systems</a><br>
Ce g&eacute;ant du logiciel utilise OpenBSD pour un nombre non
indiqu&eacute; de serveurs pare-feux et de syst&egrave;mes de
d&eacute;tection d'intrusion.
<p> 

<li><a href="http://www.alteon.com">Alteon Networks</a><br>
Ce fabriquant de cartes Ethernet Gigabit utilise OpenBSD sur des
machines diverses, des machines de tests aux passerelles.
<p> 

<li><a href="http://www.core-sdi.com">CORE SDI S.A.</a><br>
Une compagnie traitant de s&eacute;curit&eacute; de l'information,
bas&eacute;e &agrave; Buenos Aires en Argentine. Elle utilise OpenBSD
comme principale plate-forme de fonctionnement et pour le
d&eacute;veloppement de produits li&eacute;s &agrave; la
s&eacute;curit&eacute;. &quot;La robustesse, la portabilit&eacute; et
l'attachement aux questions de s&eacute;curit&eacute; d'OpenBSD, ainsi
que ses capacit&eacute;s &agrave; fonctionner sur un nombre
cons&eacute;quent de plates-formes mat&eacute;rielles, nous donne le
syst&egrave;me d'exploitation id&eacute;al pour la conception de nos
environnements, o&ugrave; la s&eacute;curit&eacute; et les
crit&egrave;res de haute-disponibilit&eacute; sont essentiels &agrave;
notre activit&eacute;&quot; indique Ivan Arce, le PDG de CODE SDI.
<p> 

<li><a href="http://www.fscinternet.com">FSC Internet Corp.</a><br>
Une grande firme de s&eacute;curit&eacute; de l'information et de
d&eacute;veloppement sur Internet, situ&eacute;e &agrave; Toronto. Ils
ont utilis&eacute; OpenBSD et son support IPsec pour d&eacute;velopper
un projet de r&eacute;seau virtuel priv&eacute; de plusieurs milliards
de dollars d'un client. &quot;Nous sommes ravis par les performances, la
fiabilit&eacute; et l'attitude pro-active vis &agrave; vis de la
s&eacute;curit&eacute; du projet OpenBSD&quot; indique un porte-parole
de la compagnie. &quot;Nous allons continuer &agrave; utiliser OpenBSD
pour nos projets futurs. Nous croyons fermement aux projets Open Source
comme OpenBSD, qui savent fournir le haut niveau de
s&eacute;curit&eacute; demand&eacute; par nos clients. Les logiciels aux
sources ferm&eacute;es ne peuvent offrir le niveau de
s&eacute;curit&eacute; obtenu par l'audit continu d'OpenBSD&quot;.
<p> 
    
<li><a href="http://www.learningtree.com/">Learning Tree International</a>,<br> 
Learning Tree International, le leader de la formation
ind&eacute;pendant de tout &eacute;diteur, utilise OpenBSD dans quelques
uns des cours de s&eacute;curit&eacute; et pare-feu.
<p>

<li><a href="http://www.netfriend.org/">NetFriend Ltd.</a><br>
NetFriend Ltd. est un fournisseur de services polonais de serveurs
OpenBSD, h&eacute;bergement Web et d&eacute;veloppement, services de
noms, solutions e-Commerce, serveurs d&eacute;di&eacute;s, services de
base de donn&eacute;es et applicatifs.
<p>

<li><a href="http://www.netsec.net/">Network Security Technologies, Inc.</a><br>
Cette firme de s&eacute;curit&eacute; r&eacute;seau et informatique
utilise OpenBSD pour la d&eacute;tection d'intrusion sur des liens
r&eacute;seau rapides, la conception de r&eacute;seaux virtuels
priv&eacute;s et des applications de stockage de donn&eacute;es. Cette
entreprise, situ&eacute;e dans la zone m&eacute;tropolitaine de
Washington DC, dispose de nombreux clients au sein d'agences
gouvernementales ou militaires dont l'identit&eacute; est
pr&eacute;serv&eacute;e.
<p> 

<li><a href="http://www.softquad.com/">SoftQuad Software Inc.</a><br>
Cette entreprise propose des logiciels d'&eacute;dition HTML et XML.
Elle utilise OpenBSD pour ses passerelles, pare-feux et services FTP.
<p> 

<li><a href="http://www.third-net.com/">Third-Net.Com</a><br>
Third-Net.Com est un fournisseur de solutions &agrave; Calgary.
Plusieurs de nos clients ont migr&eacute; vers OpenBSD pour leur
pare-feu/VPN vu sa rapidit&eacute;, sa stabilit&eacute;, et sa
s&eacute;curit&eacute;.
<p>

<li><a href="http://www.touchtunes.com/">TouchTunes</a><br>
TouchTunes est actuellement le seul fournisseur de &quot;jukeboxes&quot;
num&eacute;riques &agrave; pi&egrave;ces sur tous les Etats-Unis qui
utilise extensivement OpenBSD pour ses serveurs FTP dont le trafic est
tr&egrave;s soutenu. OpenBSD sert &eacute;galement &agrave; la
conception de pare-feux et de toute la connectivit&eacute; du
r&eacute;seau virtuel priv&eacute;. Les serveurs DNS internes
fonctionnent &eacute;galement sous OpenBSD.
<p> 

<li><a href="http://www.xtime.com/">Xtime</a><br>
Le coeur de technologie de Xtime est le &quot;Time Inventory Management
Engine&quot; ou &quot;TIMEngine &reg;&quot;. Cette technologie permet
&agrave; cette entreprise d'offrir &agrave; ses clients un suivi
permanent et en temps r&eacute;el de leurs inventaires que ce soit par
t&eacute;l&eacute;phone, Web ou autre. Elle utilise OpenBSD pour
pr&egrave;s de 75 % de son infrastructure r&eacute;seau critique, ce qui
comprend les serveurs en charge du courrier &eacute;lectronique, DNS,
plusieurs pare-feux et points de connexion du r&eacute;seau virtuel
priv&eacute;, des h&ocirc;tes de connexion s&eacute;curis&eacute;s et
des syst&egrave;mes de surveillance des tentatives d'intrusion et, bien
entendu, les serveurs Web en production. OpenBSD est le syst&egrave;me
d'exploitation de facto pour le traitement du r&eacute;seau chez Xtime
et dispose d'un taux d'utilisation de 100 % sur les machines des
utilisateurs.
<p> 

</ul>

<h2><font color="#e00000"><a name="isp">Fournisseurs d'acc&egrave;s &agrave; Internet</a></font></h2>
<p> 
L'un des objectifs des fournisseurs d'acc&egrave;s &agrave; Internet est
de prot&eacute;ger les sites et les comptes de leurs clients en ligne
contre les intrusions. Le record de s&eacute;curit&eacute; d'OpenBSD est
parlant et cette seule raison leur suffit. En fait, beaucoup indiquent
utiliser OpenBSD pour beaucoup, si ce n'est la totalit&eacute;, de leurs
services.<br> 

<ul>

<li><a href="http://www.anonix.net/">Anonix</a><br>
Anonix est un fournisseur d'acc&egrave;s qui propose du courrier
&eacute;lectronique anonyme, des comptes distants (shell) et des
services d'h&eacute;bergement Web. Tous ces syst&egrave;mes, ainsi que
les DNS et le syst&egrave;me de facturation fonctionnent depuis
OpenBSD.<br>
    <i>&quot;Nous sommes confiants quand au niveau de
       s&eacute;curit&eacute; obtenu, et nous appr&eacute;cions
       l'approche par couche et tr&egrave;s propre du syst&egrave;me
       d'exploitation. L'installation en base ne laisse pas grand chose
       &agrave; prot&eacute;ger et il n'y a pas vraiment de
       m&eacute;nage &agrave; faire ; tout ce qui se trouve sur nos
       syst&egrave;mes sert &agrave; quelque chose, il n'y a rien
       d'inutile.&quot;i>
<p> 

<li><a href="http://www.appws.com/">Appalachian Web Solutions</a><br>
Appalachian Web Solutions est une entreprise bas&eacute;e en Caroline
d'h&eacute;bergement et de conception web qui utilise OpenBSD pour leur
pare-feu d'entreprise et pour d'autres fonctions
s&eacute;curit&eacute;."Apr&egrave;s avoir totalement
&eacute;valu&eacute; toutes les options aussi bien commerciales que open
source, ce f&ucirc;t une d&eacute;cision facile d'utiliser OpenBSD pour
notre pare-feu et pour d'autres services s&eacute;curit&eacute;.&quot;
<p>

<li><a href="http://www.bsws.de/">BS Web Services</a><br>
BS Web Services, un fournisseur d'acc&egrave;s allemand, utilise OpenBSD
sur ses serveurs DNS primaires et secondaires (djbdns),
l'h&eacute;bergement primaire des pages Web (Apache) et des services de
traitement du courrier &eacute;lectronique (qmail-ldap). Ils utilisent
&eacute;galement OpenBSD pour le fonctionnement de leur syst&egrave;me
critique d'authentification LDAP (openLDAP) et les bases de
donn&eacute;es MySQL. Le responsable de l'h&eacute;bergement Henning
Brauer indique :<br>
    <i>&quot;OpenBSD a demand&eacute; quelques r&eacute;glages sur nos
       machines, en particulier des maxprocs et maxfiles plus
       importants, mais il tient une charge extraordinaire sur du
       mat&eacute;riel ordinaire. Nous utilisons des machines AMD Athlon
       (en particulier les nouveaux Thunderbird) et des AMD K6 III.
       Plusieurs machines internes fonctionnent sous OpenBSD tels que
       les machines de test, les serveurs d'impression, ainsi que
       d'autres machines. Nous comptons faire migrer d'autres machines
       vers OpenBSD, en particulier nos pare-feux. Malheureusement, nous
       continuons &agrave; utiliser quelques logiciels ferm&eacute;s et
       l'&eacute;mulation Linux pourrait &ecirc;tre une solution. Le
       comportement d'OpenBSD sous de lourdes charges de fonctionnement,
       en particulier lors d'attaques par d&eacute;ni de service (ou
       DoS) ne se compare m&ecirc;me pas aux machines Linux que nous
       avions jusqu'alors utilis&eacute;es : alors que Linux
       ralentissait de plus en plus au fur et &agrave; mesure de
       l'attaque, OpenBSD l'ignore totalement et continue &agrave;
       fonctionner de plus belle, sur le m&ecirc;me mat&eacute;riel
    !&quot;</i> 
<p> 

<li><a href="http://www.calyx.net">Calyx Internet Access Corp.</a><br>
Cette compagnie utilise OpenBSD pour de nombreux services critiques dont
le Web, le FTP, le courrier &eacute;lectronique et le traitement de
trafic g&eacute;n&eacute;r&eacute; par le r&eacute;seau virtuel
priv&eacute;. Ses syst&egrave;mes de surveillance du r&eacute;seau
l'utilisent &eacute;galement, que ce soit &agrave; New York, Los Angeles
ou Amsterdam. Des sites Web encore plus importants comme <a
href="http://www.snapple.com">snapple.com</a>, <a
href="http://www.tanqueray.com">tanqueray.com</a> et d'autres ne posent
aucun probl&egrave;me &agrave; OpenBSD.
<p> 

<li><a href="http://c2pro.net">C2PRO</a><br>
C2PRO est un fournisseur d'acc&egrave;s &agrave; Internet
indon&eacute;sien qui utilise OpenBSD pour ses serveurs Web, le
traitement du courrier &eacute;lectronique, la fourniture de comptes
(shell) distants et les machines en charge de la surveillance du
r&eacute;seau.
<p>

<li><a href="http://www.compartment.se/">Compartment</a><br>
Compartment est un FAI su&eacute;dois qui utilise OpenBSD dans plusieurs
de ses serveurs de production et de d&eacute;veloppement ainsi que sur
la messagerie, le web, et les routeurs.
<p>

<li><a href="http://www.crown.net">Crown.Net</a><br>
Ce fournisseur d'acc&egrave;s &agrave; Internet utilise un
m&eacute;lange de machines OpenBSD/sparc et OpenBSD/i386. Ses deux
serveurs Web, le courrier &eacute;lectronique, les DNS primaire et
secondaire et les serveurs Radius fonctionnent sous OpenBSD/sparc tandis
que le serveur de comptes distants et des serveurs en co-location
fonctionnent sur OpenBSD/i386.
<p> 

<li><a href="http://www.elixor.net/">Elixor Networks Inc.</a><br>
Elixor Networks utilise OpenBSD sur du mat&eacute;riel AMD pour proposer
des comptes distants (shell), de l'h&eacute;bergement Web et des
services DNS &agrave; ses clients.
<p> 

<li><a href="http://www.empirenet.net/">Empire Net</a><br>
Fournisseur d'acc&egrave;s situ&eacute; &agrave; Bend dans l'Oregon qui
utilise OpenBSD sur du mat&eacute;riel AMD, Intel et Sun pour ses
besoins de routage, pare-feux, IPsec (r&eacute;seaux virtuels
priv&eacute;s) et de <A HREF="http://www.csl.sony.co.jp/person/kjc/soft-
ware.html#ALTQ">contr&ocirc;le de la bande passante</a>,
l'h&eacute;bergement Web, les serveurs de bases de donn&eacute;es, la
surveillance du r&eacute;seau, la d&eacute;tection des tentatives
d'intrusion, le traitement du courrier &eacute;lectronique, les serveurs
de sauvegarde, les serveurs de cache et les stations de travail. Un
routeur OpenBSD g&egrave;re le trafic d'une ligne T3 sur huit ports
Ethernet rapides ainsi que plusieurs r&eacute;seaux virtuels 802.1Q
s&eacute;par&eacute;s pour des clients sp&eacute;cifiques en co-location
et des entreprises. Un serveur sous OpenBSD traite le courrier
&eacute;lectronique et l'authentification RADIUS pour plus de 5000
utilisateurs. Plusieurs serveurs OpenBSD d&eacute;di&eacute;s servent
plus de 300 sites Web.
<p> 

<li><a href="http://www.globalwire.se/">Globalwire Communications</a><br>
Globalwire Communications utilise OpenBSD pour le fonctionnement de sa
passerelle de SMS (short message service) et ses serveurs de bases de
donn&eacute;es.
<p> 

<li><a href="http://www.hobbiton.org/">Hobbiton.org</a><br>
Cet ISP a utilis&eacute; OpenBSD pour faire fonctionner son serveur
offrant des comptes distants gratuits (shell) pendant de nombreuses
ann&eacute;es. Le service a &eacute;t&eacute; ferm&eacute; en novembre
2001 &agrave; cause de son co&ucirc;t trop prohibitif pour un service
&quot;gratuit&quot;. Ils utilisent &eacute;galement OpenBSD sur d'autres
serveurs. Le serveur de comptes, une seule machine AMD Athlon 650 a
trait&eacute; plus de 101 796 utilisateurs. &quot;Nous avons retenu
OpenBSD apr&egrave;s avoir rencontr&eacute; de s&eacute;rieux
probl&egrave;mes de s&eacute;curit&eacute;, r&eacute;currents, avec
d'autres syst&egrave;mes d'exploitation&quot; a indiqu&eacute; Leif
Pedersen d'Hobbiton. &quot;Depuis l'adoption d'OpenBSD, le
syst&egrave;me d'exploitation n'est plus un probl&egrave;me et en plus
nous avons d&eacute;couvert son &eacute;tonnante stabilit&eacute;&quot;.
<p> 

<li><a href="http://www.hurontario.net">Hurontario.net</a><br>
Entreprise situ&eacute;e dans la r&eacute;gion des haut-lacs de
l'Ontario (Canada), elle utilise OpenBSD pour ses propres serveurs mais
&eacute;galement pour les machines de ses clients.
<p> 

<li><a href="http://www.info-time.nl/">Infotime</a><br>
Infotime, situ&eacute; aux Pays-Bas, offre des services
d'h&eacute;bergement web et l'enregistrement des noms de domaine sur des
serveurs fonctionnant sous OpenBSD. Nous trouvons qu'OpenBSD est le
syst&egrave;me d'exploitation le plus fiable et le plus
s&eacute;curis&eacute; qui soit pour offrir des services.
<p>

<li><a href="http://www.networkinformation.com/">inTEXT Communications</a><br>
inTEXT Communications est une entreprise de s&eacute;curit&eacute;
r&eacute;seau qui utilise OpenBSD pour les pare-feux, les r&eacute;seaux
priv&eacute;s virtuels, ainsi que pour d'autres syst&egrave;mes de
s&eacute;curit&eacute; haut de gammme. inTEXT Communications Inc (1994)
est situ&eacute;e &agrave; Vancouver, BC, Canada et d&eacute;ploie
OpenBSD pour plusieurs entreprises grand compte y compris une firme
pharmaceutique.
<p>

<li><a href="http://www.ioactive.com/">IOActive</a><br>
IOActive fournit des services Web aux d&eacute;veloppeurs et hackers,
afin de mener des tests. Ce fournisseur, situ&eacute; &agrave; Seatlle,
utilise &eacute;galement OpenBSD de pare-feux, r&eacute;seaux virtuels
priv&eacute;s et syst&egrave;mes de d&eacute;tection des tentatives
d'intrusion pour des entreprises r&eacute;gionales. &quot;OpenBSD est
rapide, fiable et je dors mieux depuis que je sais que je
l'utilise&quot; nous indique Josh Pennell. &quot;Ce que j'aime aussi
beaucoup c'est que la moiti&eacute; du travail qui consiste &agrave;
s&eacute;curiser une machine est d&eacute;j&agrave;
r&eacute;alis&eacute; d&egrave;s l'installation, ce qui permet &agrave;
mon entreprise de gagner beaucoup de temps. OpenBSD est, en ce qui me
concerne, le standard de facto pour les syst&egrave;mes d'exploitation
s&eacute;curis&eacute;s. Tout le monde essaie de suivre, autour...&quot;
<p> 

<li><a href="http://www.phoenixcomm.net">Phoenix Communications</a><br>
Phoenix Communications est un fournisseur d'acc&egrave;s italien qui
utilise OpenBSD pour ses pare-feux et d'autres composants de son
infrastructure.
<p> 

<li><a href="http://www.poppe.com">Poppe Tyson Europe</a> utilise OpenBSD comme 
serveur DNS primaire et machine de traitement de courrier
&eacute;lectronique (comportant plus d'une centaines de comptes) ainsi
que leur site de d&eacute;veloppement, pour plus de 50 sites en ligne.
<p> 

<li><a href="http://www.qpalzm.com">qpalzm.com services</a><br>
qpalzm services utilise OpenBSD pour fournir des comptes distants
(shell) et d'h&eacute;bergement Web. Le site principal propose des mises
&agrave; jour journali&egrave;res sur la programmation, le jeu, l'irc et
d'autres aspects techniques. Un MUD en-ligne est &eacute;galement
propos&eacute;. Il y a aussi une liste <a
href="http://www.jscript.org">JavaScript</a> qui utilise OpenBSD pour
tenir inform&eacute;s les utilisateurs de Javascript et de DHTML. Le
serveur Web, FTP et de mail de qpalzm.com fonctionne parfaitement
malgr&eacute; sa charge sur une simple machine Pentium Pro &agrave; 200
MHz sous OpenBSD.
<p> 

<li><a href="http://www.rtmx.net">RTMX Networking Services</a><br>
Ce fournisseur d'acc&egrave;s de Caroline du Nord utilise OpenBSD sur de
multiples serveurs Web, DNS et g&egrave;re plus de 1000 utilisateurs
dans sa communaut&eacute;, &agrave; l'ouest du &quot;triangle de la
recherche&quot;. On y trouve un m&eacute;lange de machines AMD K-6,
Micro Sparc II et PowerPC avec des sous-r&eacute;seaux de clients qui
s'y raccordent. Les miroirs RTMX.NET des sites <a
href="http://openbsd.groupbsd.org">WWW</a> et <a
href="ftp://openbsd.groupbsd.org/pub/OpenBSD/">ftp</a> d'OpenBSD s'y
trouvent ainsi qu'un miroir des sources d'OpenBSD accessible via CVS
(CVSROOT=anoncvs@openbsd.groupbsd.org:/cvs), gr&acirc;ce aux 47 Go
d'espace disponible et &agrave; la connexion T1.<br>
<p> 

<li><a href="http://start.swebase.com/?sida=maskiner">Swebase Network</a><br>
Ce fournisseur d'acc&egrave;s su&eacute;dois utilise OpenBSD pour ses
serveurs Web, DNS et de messagerie.
<p> 

<li><a href="http://www.tronicguard.com/">TronicGuard GmbH</a><br>
Cet FAI et entreprise d'hébergement localisé en Allemagne utilise
OpenBSD pour l'hébergement et sur des systèmes à multiples utilisations,
de même que sur des appliances sécurité telles que les pare-feux et des
serveurs de base de données pour des entreprises de petite à moyenne
taille.
<p>

<li><a href="http://www.vovoid.com">Vovoid Software & Multimedia.</a><br>
Vovoid Software & Multimedia &agrave; Gothenburg en Su&egrave;de utilise
OpenBSD pour ses pare-feux, serveurs Web et DNS. &quot;Le choix
d'OpenBSD pour nos serveurs de production est logique et
repr&eacute;sente la pierre angulaire de notre strat&eacute;gie de
s&eacute;curit&eacute;.
<p> 

<li><a href="http://www.wythenet.com">WytheNet, Inc.</a><br>
Ce fournisseur d'acc&egrave;s situ&eacute; en Virginie utilise OpenBSD
pour tous ses serveurs, et les deux serveurs primaire et secondaire
Radius, les deux serveurs primaires DNS, le traitement du courrier
&eacute;lectronique et la surveillance du r&eacute;seau. Plusieurs pare-
feux utilisent OpenBSD et ils vendent aussi des routeurs et pare-feux
bas&eacute;s sur OpenBSD &agrave; leurs clients DSL.
<p> 

</ul>

<hr>
<a href="index.html"><img height="24" width="24" src="../back.gif" border="0" alt="OpenBSD"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small> 
Originally [OpenBSD: users.html,v 1.102 ]<br>
$Translation: users.html,v 1.13 2003/12/28 21:32:48 saad Exp $<br>
$OpenBSD: users.html,v 1.8 2003/12/29 22:08:35 horacio Exp $
</small>
 
</body>
</html>
