<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta name="generator" content="Vi IMproved">
<meta http-equiv="Content-Type" content= "text/html; charset=iso-8859-1">
<meta name="resource-type" content="documento">
<meta name="description" content= "Guía rápida para escribir portes">
<meta name="keywords" content="openbsd,portes,ports">
<meta name="distribution" content="global">
<meta name="copyright" content= "Este documento es copyright 2001 de OpenBSD.">
<title>Manejo de las bibliotecas compartidas en el
&aacute;rbol de portes de OpenBSD</title>
</head>
<body text="black" bgcolor="white" link="#23238e">
<img height="30" width="141" src="../../images/smalltitle.gif" alt= "[OpenBSD]"> 

<h1>C&oacute;mo manejar las bibliotecas compartidas en el
&aacute;rbol de portes</h1>

<h2>Qu&eacute; son las reglas num&eacute;ricas de las
bibliotecas compartidas</h2>
Las bibliotecas compartidas son algo complicadas por varias
razones.  Para su manejo es necesario entender antes el
esquema de nombres de las bibliotecas:
<code>libfoo.so.major.minor</code>.
</p>
Cuando se enlaza un programa, el enlazador <code>ld</code>
embebe esa informaci&oacute;n en el binario que se genera.
Esto se puede ver con <code>ldd</code>.
M&aacute;s tarde, cuando se ejecuta este programa, el
enlazador din&aacute;mico <code>ld.so</code> utiliza esa
informaci&oacute;n para encontrar la biblioteca
din&aacute;mica pertinente:
<ul>
	<li>Requiere una biblioteca con la numeraci&oacute;n
	superior exactamente igual.
	<li>Requiere una biblioteca con la numeraci&oacute;n
	inferior igual o mayor.
</ul>
Esto quiere decir que <strong>todas</strong> las bibliotecas
con el mismo n&uacute;mero superior y con un n&uacute;mero
inferior igual o mayor al requerido, <strong>deben satisfacer
el API binario que el programa espera encontrar</strong>.  Si
no fuera as&iacute;, entonces el porte ser&iacute;a
err&oacute;neo;  en concreto, el porte no funcionar&iacute;a
cuando los usuarios intentaran actualizar sus sistemas.
</p>
Las reglas para las bibliotecas compartidas son bastante
simples.
<ul>
	<li>Si se a&ntilde;aden funciones a la bibliotecas, es
	necesario incrementar el n&uacute;mero inferior de la
	biblioteca:  un programa que necesite esas funciones
	no tiene otro modo para requerirlas que no sea el de
	pedirlas de forma expl&iacute;cita para, por lo menos,
	esta versi&oacute;n.
	<li>Si el API actual cambia, o sea, si se altera la
	firma de cualquier funci&oacute;n, o si las secuencias
	de llamada ya no son v&aacute;lidas, si un tipo cambia
	de forma incompatible, el n&uacute;mero superior
	<strong>se debe incrementar</strong>.
	<li>Esto incluye la eliminaci&oacute;n de funciones
	antiguas.  Cualquier eliminaci&oacute;n de funciones
	deber&iacute;a ir acompa&ntilde;ada por un incremento
	en el n&uacute;mero superior.
</ul>
</p>
Algunas veces sucede que una biblioteca est&aacute; escrita en
varios ficheros, y las funciones internas son visibles para
permitir la comunicaci&oacute;n entre esos ficheros.
Esos nombre de funciones suelen empezar con un gui&oacute;n
bajo, y no son parte del API.
</p>
N&oacute;tese que el esquema de nombres de las bibliotecas es
ubicuo en las plataformas de OpenBSD, tanto si el formato es
ELF como a.out.

<h2>Cambios en los portes para obtener nombre correctos</h2>
Un buen n&uacute;mero de portes necesitan cambios para poder
ser compilados con bibliotecas compartidas.  Recuerde que la
compilaci&oacute;n de las bibliotecas compartidas se debe
hacer mediante
<code>gcc -shared -fpic|-fPIC -o libfoo.so.4.5 obj1 obj2</code>
</p>
Si intenta cambiar el nombre de la biblioteca m&aacute;s tarde
para ajustar el n&uacute;mero de versi&oacute;n, no
funcionar&aacute;:  las bibliotecas ELF usan magia adicional
para el nombre interno de la biblioteca, por lo que debe
enlazar desde la primera vez con la versi&oacute;n correcta.
</p>
Por otra parte, recuerde que puede anular y cambiar variables
de <em>Makefile</em> desde la l&iacute;nea de &oacute;rdenes,
usando <code>MAKE_FLAGS</code> en el fichero
<em>Makefile</em> del porte.  Esto le ser&aacute; de gran
utilidad en algunos portes, como por ejemplo los basados en
<em>libtool</em>, ya que proveen de una de estas variables de
versi&oacute;n por cada biblioteca que crean.

<h2>Intente poner todas las bibliotecas visibles en
/usr/local/lib</h2>
Exigir que el usuario a&ntilde;ada directorios a su camino a
ldconfig es, como regla general, una mala idea:  todas las
bibliotecas compartidas que se encuentran directamente
enlazadas a programas deber&iacute;an aparecer en
<em>/usr/local/lib</em>.  Sin embargo, es posible usar un
enlace simb&oacute;lico a una determinada biblioteca.  Es
necesario que se comprendan las reglas de b&uacute;squeda de
las bibliotecas:
<ul>
	<li>En el momento de la compilaci&oacute;n,
	<code>ld</code> usa los indicadores <code>-L</code>
	para configurar un camino en el que buscar la
	biblioteca.  En cuanto encuentra una biblioteca que
	coincide con sus requisitos, para de buscar.
	<li>En el momento de la ejecuci&oacute;n,
	<code>ld.so</code> usa la informaci&oacute;n guardada
	mediante <code>ldconfig</code> para encontrar la
	biblioteca requerida.
</ul>

Asumamos que tenemos dos portes que provean dos versiones
principales de una cierta biblioteca, pongamos como ejemplo
<code>qt.1.45</code> y <code>qt.2.31</code>.  Como los dos
portes no se pueden instalar de forma simult&aacute;nea, para
asegurarnos de que un programa cualquiera enlace con qt.1, esa
biblioteca se proveer&aacute; como
<code>/usr/local/lib/qt/libqt.so.1.45</code>, y los programas
se enlazar&aacute;n usando 
<code>ld -o program program.o -L/usr/local/lib/qt -lqt</code>.
De igual modo, un programa que enlace con qt.2 usar&aacute; el
fichero <code>/usr/local/lib/qt2/libqt.so.2.31</code> con
<code>ld -o program program.o -L/usr/local/lib/qt2 -lqt</code>.
</p>
Para resolver esas bibliotecas en el momento de la
ejecuci&oacute;n, se proveer&aacute; un enlace llamado
<code>/usr/local/lib/libqt.so.1.45</code> y otro llamado
<code>/usr/local/lib/libqt.so.2.31</code>.  Esto ser&aacute;
suficiente para satisfacer a <code>ld.so</code>.
</p>
Enlazar un programa usando qt1 con
<code>ld -o program program.o -L/usr/local/lib -lqt</code> es
un error.  Este c&oacute;digo asume que <code>qt.2.31</code>
no ha sido instalado, lo que es una presunci&oacute;n
err&oacute;nea.
</p>
Estos trucos s&oacute;lo son necesarios en casos especiales en
los que se den bibliotecas para las que se necesite proveer de
un periodo de transici&oacute;n entre versiones.  Por lo
general, bastar&aacute; con asegurarse de que la biblioteca
aparezca en <em>/usr/local/lib</em>.
<h2>C&oacute;mo escribir correctamente las dependencias de las
bibliotecas</h2>
El nuevo c&oacute;digo de dependencia necesita dependencias de
bibliotecas completas.  Debe usar <code>make
lib-depends-check</code> para verificar que un porte mencione
todas las bibliotecas que requiere.  Separe las
especificaciones de bibliotecas con comas:
<code>LIB_DEPENDS=gtk.1.2,gdk.1.2::x11/gtk+</code>.
</p>
Adem&aacute;s, especificar las bibliotecas est&aacute;ticas en
una l&iacute;nea de LIB_DEPENDS no es un error.  LIB_DEPENDS
es evaluado por completo en el momento de la
compilaci&oacute;n de un paquete:  el paquete resultante
tendr&aacute; la informaci&oacute;n sobre dependencias de
bibliotecas embebido, en forma de l&iacute;neas para
<code>ld.so</code>, que contienen el n&uacute;mero
superior.inferior que fue usado para su compilaci&oacute;n, y
nada para las bibliotecas compartidas.
</p>
Tambi&eacute;n debe proveer de RUN_DEPENDS si un porte
requiere algo m&aacute;s que compilar enlazando a una
biblioteca.  Esto permitir&aacute; al porte compilar
correctamente en arquitecturas que no tengan soporte para
bibliotecas compartidas.
</p>
De hecho, proveer l&iacute;neas LIB_DEPENDS para bibliotecas
est&aacute;ticas es una buena idea:  esto simplificar&aacute;
la acutalizaci&oacute;n del porte si una cierta dependencia
pasa de biblioteca est&aacute;tica a biblioteca compartida.
</p>
La l&iacute;neas LIB_DEPENDS deben especificar los mismos
caminos que se utilizan para <code>ld</code>.  Por ejemplo, el
fragmento de dependencia t&iacute;pico de qt2 dice:
<code>LIB_DEPENDS+=lib/qt2/qt.2::x11/qt2</code>, para que las
l&iacute;neas de dependencias de la biblioteca se resuelvan
correctamente.  Esto permite a la dependencia comprobar el
c&oacute;digo para poder hacer lo correcto si se encuentra con
varias versiones de la misma biblioteca.
<h2>C&oacute;mo actualizar los portes correctamente</h2>
Cuando se actualice o a&ntilde;ada un porte en el que haya por
medio bibliotecas compartidas, hay que tener en cuenta unos
cuantos detalles.
<ul>
	<li>Aseg&uacute;rese de que los n&uacute;meros
	superior.inferior de las bibliotecas compartidas sean
	los correctos.
	<li>Verifique todos los portes que dependan de su
	porte.  Verifique que compilen correctamente con sus
	cambio.  Notifique de la actualizaci&oacute;n a los
	mantenedores correspondientes, para que &eacute;stos
	puedan verificar que sus portes todav&iacute;a
	funcionan bien.
	<li>Puede que tenga que ajustar LIB_DEPENDS.  Si
	introduce nuevas bibliotecas compartidas, preste
	atenci&oacute;n a los BUILD_DEPENDS que tengan que ser
	convertidos en LIB_DEPENDS.
	<li>Siempre que introduzca un nuevo porte debe
	verificar que no est&eacute; creando una biblioteca
	que entre en conflicto con otra ya existente:  las
	bibliotecas de dos portes con el mismo n&uacute;mero
	son mortales, debido a que sus esquemas de
	enumeraci&oacute;n de versiones no pueden coincidir.
	Debe intentar resolver esta situaci&oacute;n con el
	programa del autor (por ejemplo, una biblioteca que se
	llame libnet es un mal comienzo).
</ul>
  <hr>
  <a href="../../index.html"><img height="24" width="24" src="../../back.gif" border="0" alt="OpenBSD"></a> 
  <a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: libraries.html,v 1.4 ]<br>
$Translation: libraries.html,v 1.3 2004/08/29 16:14:27 santana Exp $<br>
$OpenBSD: libraries.html,v 1.3 2004/08/29 16:55:04 jufi Exp $
</small>
 </body>
</html>
