<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>1 - Einf&uuml;hrung in OpenBSD</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="resource-type" content="document">
<meta name="description"   content="Die OpenBSD FAQ Seiten - FAQ 1: Einf&uuml;hrung">
<meta name="keywords"      content="openbsd,faq,einfuehrung">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2004 by OpenBSD.">
</head>

<body bgcolor="#ffffff" text="#000000">
<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color="#0000e0">
<a href= "index.html">[FAQ Index]</a>
<a href= "faq2.html">[Zum Kapitel 2 - Andere Informationsquellen zu OpenBSD]</a>
</font>

<h1><font color="#e00000">1 - Einf&uuml;hrung in OpenBSD</font></h1>
<hr>

<p>
<h3>Inhaltsverzeichnis</h3>
<ul>
<li><a href="#WhatIs">1.1 - Was ist OpenBSD?</a></li>
<li><a href="#Platforms">1.2 - Auf welchen Systemen l&auml;uft OpenBSD?</a></li>
<li><a href="#ReallyFree">1.3 - Ist OpenBSD wirklich frei?</a></li>
<li><a href="#WhyUse">1.4 - Warum sollte ich OpenBSD benutzen?</a></li>
<li><a href="#Support">1.5 - Wie kann ich OpenBSD unterst&uuml;tzen?</a></li>
<li><a href="#WhoMaintains">1.6 - Wer betreut das OpenBSD Projekt?</a></li>
<li><a href="#Next">1.7 - Wann erscheint die n&auml;chste Version von OpenBSD?</a>
<li><a href="#Included">1.8 - Was beinhaltet OpenBSD?</a>
<li><a href="#WhatsNew">1.9 - Was gibt es Neues in  in OpenBSD 3.5?</a>
<li><a href="#Desktop">1.10 - Kann ich OpenBSD als Desktop System benutzen?</a>

</ul>

<hr>

<p>
<a name="WhatIs"></a>
<h2>1.1 - Was ist OpenBSD?</h2>

<p>
Das <a href="../../de/index.html">OpenBSD</a> Projekt produziert ein frei erh&auml;ltliches, 
plattform&uuml;bergreifendes, auf 4.4BSD-basierendes UNIX-&auml;hnliches 
Betriebssystem. Unsere 
<a href="../../de/goals.html">Ziele</a> legen den Schwerpunkt auf 
Korrektheit, <a href="../../de/security.html">Sicherheit</a>, 
Standardisierung und <a href="../../de/plat.html">Portabilit&auml;t</a>. 
OpenBSD unterst&uuml;tzt Bin&auml;remulation der meisten Programme von 
SVR4 (Solaris), FreeBSD, Linux, BSD/OS, SunOS und HP-UX.
<br>

<!-- XXXrelease -->
<p>
Diese FAQ beschr&auml;nkt sich ausschlie&szlig;lich auf das aktuellste
Release von OpenBSD, Version 3.5.

<p>
<a name="Platforms"></a>
<h2>1.2 - Auf welchen Systemen l&auml;uft OpenBSD?</h2>
<!-- XXXrelease -->
<p>
OpenBSD 3.5 l&auml;uft auf den folgenden Plattformen:
<ul>
    <li><a href="../../de/alpha.html">alpha</a> - nur FTP
    <li><a href="../../de/amd64.html">amd64</a> - Bootf&auml;hige CD <i>Neu mit 3.5!</i>
    <li><a href="../../de/cats.html">cats</a> - nur FTP <i>Neu mit 3.5!</i>
    <li><a href="../../de/hp300.html">hp300</a> - nur FTP 
    <li><a href="../../de/hppa.html">hppa</a> - nur FTP 
    <li><a href="../../de/i386.html">i386</a> - von CD bootf&auml;hig</li>
    <li><a href="../../de/mac68k.html">mac68k</a> - nur FTP</li>
    <li><a href="../../de/macppc.html">macppc</a> - von CD bootf&auml;hig</li>
    <li><a href="../../de/mvme68k.html">mvme68k</a> - nur FTP</li>
    <li><a href="../../de/sparc.html">sparc</a> - von CD bootf&auml;hig</li>
    <li><a href="../../de/sparc64.html">sparc64</a> - von CD bootf&auml;hig</li>
    <li><a href="../../de/vax.html">vax</a></li>
</ul>

<p>
<i>bootf&auml;hig</i> bedeutet, dass OpenBSD direkt von der CD 
starten wird.  Die CDs werden auf einigen Plattformen starten. Details, 
wie man OpenBSD auf CD beziehen kann, gibt es in 
<a href="faq3.html">Kapitel 3</a> dieser FAQ. 

<p>
Vorherige Versionen von OpenBSD hatten auch einen Port f&uuml;r:
<ul>
  <li><a href="../../de/amiga.html">amiga</a> - Entfernt nach der Version 3.2 
  <li><a href="../../de/sun3.html">sun3</a> - Entfernt nach der Version 2.9 
  <li><a href="../../de/arc.html">arc</a> - Entfernt nach der Version 2.3 
  <li><a href="../../de/pmax.html">pmax</a> - Entfernt nach der Version 2.7
</ul>

<p>
OpenBSD unterst&uuml;tzt zur Zeit nicht mehr als eine CPU.
In der <a href="../faq8.html#SMP">FAQ 8, SMP</a> findest du
dazu weitere Informationen.

<p>
<a name="ReallyFree"></a>
<h2>1.3 - Ist OpenBSD wirklich frei?</h2>

<p>
OpenBSD ist vollst&auml;ndig frei. Die Bin&auml;rdateien sind frei.
Die Quelltexte sind frei. Alle Teile von OpenBSD unterliegen entsprechenden 
Urheberrechtsbestimmungen, die die freie Weiterverbreitung erlauben.
Dies beinhaltet auch die M&ouml;glichkeit, die meisten Teile von den 
OpenBSD Quelltexten WIEDERZUVERWENDEN, sei es f&uuml;r private oder 
kommerzielle Zwecke. OpenBSD unterliegt KEINEN weiteren Beschr&auml;nkungen 
als durch die originale BSD Lizenz.  Software, die unter strikterer 
Lizenz verfasst wurde, kann nicht in der regul&auml;ren OpenBSD 
Distribution eingebunden werden. Dies dient zur Sicherstellung der 
weiteren freien Nutzbarkeit von OpenBSD. Zum Beispiel kann OpenBSD frei 
f&uuml;r den privaten und akademischen Gebrauch, von 
Regierungsinstitutionen, von non-profit Organisationen und von Unternehmen 
eingesetzt werden.
OpenBSD, oder Teile davon, k&ouml;nnen auch problemslos in
<a href="../../de/products.html">kommerzielle Produkte</a> integriert werden.

<p>
F&uuml;r weitere Informationen &uuml;ber popul&auml;re Lizenzen siehe: 
<a href="../policy.html">OpenBSD Copyright Policy</a>.

<p>
Die Leiter von OpenBSD unterst&uuml;tzen das Projekt haupts&auml;chlich 
aus ihren eigenen Taschen.  Dies beinhaltet die Zeit f&uuml;r 
Programmieren, die eingesetzte Hardware f&uuml;r die verschiedenen 
Plattformen, die Netzwerkressourcen, um OpenBSD zu dir zu bringen, und 
die Zeit, um Fragen zu beantworten und die Fehlerberichte der Benutzer 
zu untersuchen. Die OpenBSD Entwickler sind nicht gerade reich und auch 
ein kleiner Beitrag an Zeit, Hardware oder Ressourcen macht einen
gro&szlig;en Unterschied.


<p>
<a name="WhyUse"></a>
<h2>1.4 - Warum sollte ich OpenBSD benutzen?</h2>

<p>
Neue Benutzer wollen h&auml;ufig wissen, ob OpenBSD anderen 
UNIX-&auml;hnlichen Betriebssytemen &uuml;berlegen ist. Diese Frage ist 
eigentlich unbeantwortbar und das Thema von zahllosen (und nutzlosen) 
Debatten. Stelle diese Frage bitte unter keinen Umst&auml;nden auf einer 
OpenBSD Mailingliste. 

<p>
Anbei stehen ein paar Gr&uuml;nde, warum wir glauben, dass OpenBSD
ein n&uuml;tzliches Betriebssystem ist. Ob OpenBSD das richtige System 
f&uuml;r dich ist, kannst nur du entscheiden.

<p>
<ul>
   <li>OpenBSD l&auml;uft auf vielen verschiedenen Hardware 
   <a href="../../de/plat.html">Plattformen</a>.
   <li>OpenBSD wird von vielen Sicherheitsexperten als das 
   <a href="../../de/security.html">sicherste</a> UNIX-&auml;hnliche 
   Betriebssystem angesehen, was das Resultat eines immer weiter andauernden
   ausf&uuml;hrlichen Quelltextsicherheitsaudits ist.
   <li>OpenBSD ist ein voll ausgestattetes UNIX-&auml;hnliches 
   Betriebssystem, das im Quelltext ohne Kosten verf&uuml;gbar ist.
   <li>OpenBSD integriert neueste Sicherheitstechnologien, die geeignet 
   sind, Firewalls und
   <a href= "../../de/crypto.html#hardware">private Netzwerkdienste</a>
   in verteilten Umgebungen zu errichten.
   <li>OpenBSD profitiert von der raschen Entwicklung in vielen 
   Bereichen, was die M&ouml;glichkeit zur Zusammenarbeit von neu 
   entwickelten Technologien mit der internationalen Gemeinschaft der 
   Programmierer und Endbenutzer betrifft. 
</ul>

<p>
<a name="Support"></a>
<h2>1.5 - Wie kann ich OpenBSD unterst&uuml;tzen?</h2>

<p>
Wir sind allen Menschen und Organisationen zu Dank verpflichtet, die 
zum OpenBSD Projekt beigetragen haben. Sie werden namentlich auf der
<a href= "../../de/donations.html">Spendenseite</a> aufgef&uuml;hrt.

<p>
OpenBSD ben&ouml;tigt andauernd bestimmte Arten von Unterst&uuml;tzung 
von der Benutzergemeinschaft. Wenn du OpenBSD n&uuml;tzlich findest, 
dann solltest du einen Weg finden, um etwas beizutragen. Solltest du 
keinen der unten angef&uuml;hrten Vorschl&auml;ge als f&uuml;r dich 
angemessen empfinden, dann schlag etwas Besseres vor, indem du eine 
E-Mail an 
<a href="mailto:donations@openbsd.org">donations@openbsd.org</a> sendest.

<p>
<ul>
    <li><a href="../de/orders.html">Kaufe ein OpenBSD CD Set</a>.
    Es beinhaltet die aktuelle Vollversion 
    von OpenBSD und ist auf vielen Plattformen bootf&auml;hig. Der Kauf 
    tr&auml;gt Geld zur Unterst&uuml;tzung des OpenBSD Projekts bei und 
    reduziert die Belastung der Netzwerkressourcen, um die  Distribution 
    via Internet zu verbreiten. Dieses kosteng&uuml;nstige drei-CD Set 
    beinhaltet den vollen Quelltext. Denke daran, auch deine Freunde 
    ben&ouml;tigen ihre eigenen CDs!
    <li>Spende Geld. Das Projekt ben&ouml;tigt andauernd Geld, um Hardware, 
    Netzwerkanbindungen und CD Produktionskosten zu bestreiten.
    Die Produktion der CDs setzt die Vorfinanzierung durch die OpenBSD 
    Entwickler ohne garantierte Einnahmen voraus. Schick eine E-Mail an
    <a href= "mailto:donations@openbsd.org">donations@openbsd.org</a> um 
    herauszufinden, wie du etwas beisteuern kannst. Sogar kleine 
    Spenden machen einen gro&szlig;en Unterschied.
    <li>Spende Ausr&uuml;stung und Hardware. Das Projekt sucht immer 
    normale und spezielle Hardware. Dinge wie IDE und SCSI Festplatten
    oder verschiedene Arten von RAM werden immer gerne genommen. 
    F&uuml;r andere Hardwaretypen wie Computersysteme und Motherboards 
    solltest du den aktuellen Bedarf durch eine E-Mail an 
    <a href= "mailto:donations@openbsd.org">donations@openbsd.org</a>
    erfragen.
    <li>Steuere deine Zeit und F&auml;higkeiten bei. Programmierer, die 
    gerne an Betriebssystemen schreiben, sind nat&uuml;rlich immer 
    willkommen, aber es gibt buchst&auml;blich Dutzende von anderen 
    M&ouml;glichkeiten, um n&uuml;tzlich zu sein. Verfolge die 
    Mailinglisten und beantworte Fragen von neuen Benutzern.
    <li>Hilf uns, die Dokumentation auf dem Laufenden zu halten, indem du 
    neues FAQ-Material einbringst (an 
    <a href= "mailto:faq@openbsd.org">faq@openbsd.org</a>). Richte 
    eine lokale Benutzergruppe ein und &uuml;berzeuge deine Freunde 
    von OpenBSD. Zeige deinem Arbeitgeber die F&auml;higkeiten von 
    BSD f&uuml;r die Arbeit. Wenn du ein Student bist, sprich mit 
    deinen Professoren &uuml;ber OpenBSD als Lehrmittel f&uuml;r EDV. 
    Es ist auch noch erw&auml;hnenswert, einen der wichtigsten Wege 
    aufzuzeigen, um dem OpenBSD Projekt "nicht" zu  helfen:
    Beteilige dich nicht an Beschimpfungsorgien (Flamewars) in Usenet 
    newsgroups &uuml;ber andere Betriebssysteme. Dies bringt dem 
    Projekt keine neuen Benutzer und schadet den wichtigen Beziehungen 
    der Entwickler zu den anderen Entwicklern.        
</ul>


<p>
<a name="WhoMaintains"></a>
<h2>1.6 - Wer betreut das OpenBSD Projekt?</h2>

<p>
OpenBSD wird von einem Entwicklerteam betreut, das &uuml;ber viele 
verschiedene <a href="../../images/map.jpg">L&auml;nder</a> verteilt ist. 
Das Projekt wird von Theo de Raadt koordiniert, der in Kanada 
wohnhaft ist.

<p>
<a name="Next"></a>
<h2>1.7 - Wann erscheint die n&auml;chste Version von OpenBSD?</h2>

Das OpenBSD Team ver&ouml;ffentlicht alle 6 Monate eine neue Version, 
mit den angestrebten Daten 1. Mai und 1. November. Mehr Informationen
zum Entwicklungsprozess gibt es 
<a href="faq5.html#Flavors">hier</a>.

<a name="Included"></a>
<h2>1.8 - Was beinhaltet OpenBSD?</h2>
OpenBSD wird zusammen mit einer ganzen Anzahl von Software dritter Parteien 
ver&ouml;ffentlicht, einschlie&szlig;lich:
<!-- XXXrelease -->

<ul>
<li><a href="http://www.xfree.org">XFree86 4.4.0</a>, nicht betroffen von 
einer neuerlichen &Auml;nderung der Lizenz mit lokalen Patches.
F&uuml;r i386 werden auch v3.3 X Server mitgeliefert, um mehr Grafik-Karten-Chips
zu unterst&uuml;tzen. Wird durch die <tt>x*.tgz</tt>
<a href="../faq4.html#FilesNeeded">Installations Datei Sets</a> installiert.

<li><a href="http://gcc.gnu.org/">GCC</a> Versionen 2.95.3 und 3.3.2. GNU
C Compiler. Das OpenBSD Team hat zus&auml;tzlich die
<a href="http://www.trl.ibm.com/projects/security/ssp">Propolice</a>
Stack Protection Technologie eingebaut, die standardm&auml;&szlig;ig 
eingeschaltet ist und sowohl im OpenBSD Userland als auch
bei allen Anwendungen genutzt wird, die unter OpenBSD &uuml;bersetzt werden. 
Wird als Teil des <tt>comp35.tgz</tt>
<a href="../faq4.html#FilesNeeded">Datei Sets</a> installiert.

<li><a href="http://www.perl.com/">Perl 5.8.2</a> mit Patches und
Verbesserungen des OpenBSD Teams.

<li><a href="http://www.apache.org/">Apache 1.3.29</a> Webserver.
Das OpenBSD Team hat 
<a href="../faq10.html#httpdchroot">standardm&auml;&szlig;iges chrooting</a>,
,privilege revocation' und andere sicherheitsrelevante Verbesserungen
eingef&uuml;gt. Er beinhaltet auch mod_ssl 2.8.16 und Unterst&uuml;tzung 
f&uuml;r DSO.

<li><a href="http://www.openssl.org">OpenSSL 0.9.7c</a> mit Patches
und Verbesserungen vom OpenBSD Team.

<li><a href="http://www.gnu.org/software/groff/groff.html">Groff 1.15</a>
Textprozessor.

<li><a href="http://www.sendmail.org/">Sendmail 8.12.11</a> Mailserver.

<li><a href="http://www.isc.org/products/BIND/">BIND 9.2.3</a> DNS
Server. OpenBSD hat viele Verbesserungen im chroot Betrieb und andere
sicherheitsrelevante Dinge eingef&uuml;gt.

<li><a href="http://lynx.isc.org/">Lynx 2.8.4rel.1</a> Text Webbrowser.
Mit HTTPS Unterst&uuml;tzung plus Patches des OpenBSD Teams.

<li><a href="http://www.courtesan.com/sudo/">Sudo v1.6.7p5</a>, das
den Benutzern erlaubt, einzelne Kommandos als root auszuf&uuml;hren.

<li><a href="http://www.gnu.org/software/ncurses/ncurses.html">Ncurses
5.2.</a>

<li><a href="http://www.kame.net/">KAME</a> IPv6.

<li>Heimdal 0.6rc1 mit Patches

<li>Arla-current

<li><a href="http://www.openssh.com">OpenSSH 3.8.1</a>

</ul>

Wie man sehen kann, patcht das OpenBSD Team oftmals Produkte
dritter Parteien, um die Sicherheit und Qualit&auml;t des Codes
zu erh&ouml;hen. In einigen F&auml;llen wird der Anwender keinerlei
&Auml;nderungen im Betrieb bemerken, in einigen
anderen F&auml;llen GIBT es Unterschiede, die meist nur einzelne
Anwender betreffen.
Denke an diese &Auml;nderungen, bevor du einfach verschiedene 
Versionen derselben Software installierst.

<p>
Nat&uuml;rlich k&ouml;nnen weitere Anwendungen weiterhin 
mittels des OpenBSD 
<a href="../faq8.html#Packages">Packages</a> und
<a href="../faq8.html#Ports">Ports</a> Systems eingespielt werden. 
<p>

<a name="WhatsNew"></a>
<h2>1.9 - Was gibt es Neues in OpenBSD 3.5?</h2>
<!-- XXXrelease -->

Die vollst&auml;ndige Liste der &Auml;nderungen kann man
<a href="../../plus35.html">hier</a> einsehen, trotzdem gibt es
hier eine Liste einiger &Auml;nderungen, die nach Ansicht des
OpenBSD-Teams einer speziellen Erw&auml;hnung bed&uuml;rfen,
insbesondere f&uuml;r diejenigen, die von &auml;lteren Versionen
kommen: 

<ul>
<li><b>Die i386 Plattform wurde mit OpenBSD/i386 3.4 auf ELF umgestellt.</b>
Das 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=elf&amp;sektion=5">ELF</a>
executable Dateiformat bietet gr&ouml;&szlig;ere Flexibilit&auml;t in
der Auslegung des Speichers gegen&uuml;ber dem alten
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=a.out&amp;sektion=5">a.out</a>
Format und war f&uuml;r unsere W^X Implementation auf i386 notwendig.
Ein Upgrade &uuml;ber Quellcode ist KEINE Option.
Bin&auml;r-Upgrades sind m&ouml;glich, aber sehr schwierig,
und erzwingen die vorhergehende Deinstallation aller
<a href="../faq8.html#Packages">Packages</a> und eine
erneute Installation nach dem Upgrade.
Es gibt noch viele weitere potenzielle Probleme, daher fordert
das OpenBSD-Team unbedingt dazu auf von Grund auf neu zu installieren.
Bedenke, dass eine
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_aout&amp;sektion=8">a.out
bin&auml;r Emulation</a> durch sysctl f&uuml;r reine Bin&auml;rapplikationen 
zur Verf&uuml;gung gestellt wird.
Falls du ein Upgrade machst, wirst du sie mit an Sicherheit 
grenzender Wahrscheinlichkeit einschalten m&uuml;ssen.

<li><b>Bin&auml;r-Emulationen sind standardm&auml;&szlig;ig abgeschaltet.</b>
Das wurde gemacht, um zu erschweren, ein sch&auml;dliches Programm 
laufen zu lassen, das f&uuml;r eine andere Plattform geschrieben wurde.
Bis die Emulation via 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sysctl&amp;sektion=8">sysctl</a>s 
eingeschaltet ist, werden allerdings
viele <a href="../faq8.html#Ports">Ports</a> nicht sauber funktionieren.
Im Standard GENERIC Kernel sind diese Optionen vorhanden, aber deaktiviert.  
Ein Neu&uuml;bersetzen des Kernels ist nicht notwendig.
Weitere Informationen finden sich in <a href="../faq9.html#Interact">diesem Artikel</a>.
Wenn du ein Upgrade machst, wirst du h&ouml;chstwahrscheinlich
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_aout&amp;sektion=8">compat_aout</a>
einschalten m&uuml;ssen.

<li><b>Das 8G Limit f&uuml;r die root Partition gibt es nicht mehr.</b>
Die i386 Plattform unterst&uuml;tzt jetzt das Booten aus jedem
Bereich der Festplatte, der auch vom BIOS unterst&uuml;tzt wird.
Ja, das bedeutet, dass das 8G Limit vorhergehender Version nicht
mehr existiert.
Intelligentes <a href="../faq4.html#SpaceNeeded">partitionieren</a> wird
trotzdem sehr empfohlen.

<li><b>PXE Booting.</b>
Die i386 und amd64 Plattformen unterst&uuml;tzen jetzt <a href="../faq6.html#PXE">PXE
booting</a> f&uuml;r Installationen.

<li><b>Neue Plattformen.</b>
OpenBSD hat mit 3.5 neue Plattformen hinzugef&uuml;gt: 
<ul>
<li><a href="../../cats.html">cats</a>, ein StrongARM-basiertes Entwicklungs-Board,
<li><a href="../../amd64.html">amd64</a>, der AMD 64 Bit Prozessor, und 
<li><a href="../mvme88k.html">mvme88k</a>, Systeme basierend auf der 
Serie 88000 von Motorola RISC Prozessoren.
</ul>

<li><b>sparc64 benutzt jetzt GCC 3.3.2.</b>
Die <a href="../sparc64.html">sparc64</a> Plattform verwendet nun
3.3.2 anstelle des GCC 2.95.3, der noch auf anderen 
Plattformen verwendet wird.
Eine Neuinstallation ist gegen&uuml;ber einem Upgrade deshalb auf jeden
Fall vorzuziehen.
Die neuen <a href="../cats.html">cats</a> und
<a href="../amd64.html">amd64</a> Plattformen benutzen ebenso GCC 3.2.2.
Lokale Zus&auml;tze wie ProPolice und andere Verbesserungen sind
nat&uuml;rlich im neuen GCC enthalten.

<li><b>Neue User und Gruppen.</b>
Mehrere neue User und Gruppen wurden OpenBSD zum Zwecke der
,privilege separation' hinzugef&uuml;gt.
Leute, die ihr System upgraden, m&uuml;ssen ihr <tt>/etc</tt>
Verzeichnis sorgf&auml;ltig, wie in der 
<a href="../upgrade-minifaq.html">upgrade-minifaq</a> beschrieben,
aktualisieren.

</ul>

<a name="Desktop"></a>
<h2>1.10 - Kann ich OpenBSD als Desktop System benutzen?</h2>
Diese Frage wird oftmals genau in diesem Wortlaut gestellt -- 
ohne jegliche Erkl&auml;rung was der Fragesteller genau mit "Desktop"
meint.
Die einzige Person, die diese Frage beantworten kann, bist du selbst,
nur du weisst, was deine Erwartungen und Anforderungen sind.

<p>
W&auml;hrend OpenBSD einen ziemlich guten Ruf als "Server" Betriebssystem hat,
kann es auch auf dem Desktop benutzt werden und wird es auch bereits.
Viele "Desktop" Anwendungen sind durch die
<a href="../faq8.html#Ports">Ports und Packages</a>.
Wie bei allen Entscheidungen &uuml;ber Betriebssysteme ist die Frage: 
kann es die Aufgabe in der Art und Weise bew&auml;ltigen
die du m&ouml;chtest?
Diese Frage musst du dir selbst beantworten.

<p>

<font color= "#0000e0">
<a href="index.html">[FAQ Index]</a>
<a href="faq2.html">[Zum Kapitel 2 - Andere Informationsquellen zu OpenBSD]</a>
</font>
</p>

<p>
<hr>
<a href="index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[zur&uuml;ck]"></a> 
<a href="mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq1.html,v 1.59 ]
<br>
$Translation: faq1.html,v 1.54 2004/09/27 13:44:19 jufi Exp $
<br></small>
<small>$OpenBSD: faq1.html,v 1.44 2004/09/27 13:58:26 jufi Exp $</small>
</body>
</html> 
