<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>3 - Wo man OpenBSD herbekommt</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name= "description"   content= "Die OpenBSD FAQ Seiten - FAQ 3: OpenBSD erwerben oder kaufen">
<meta name= "keywords"      content= "openbsd,faq,beziehen,kaufen,erstehen,T-Shirts,CD">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2004 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000" link= "#23238E">

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color= "#0000e0">
<a href= "index.html">[FAQ Index]</a>
<a href= "faq2.html">[Zum Kapitel 2 - Andere Informationsquellen zu OpenBSD]</a>
<a href= "faq4.html">[Zum Kapitel 4 - Installationsanleitung]</a>
</font>

<h1><font color="#e00000">3 - Wo man OpenBSD herbekommt</font></h1>
<hr>
<p>
<h3>Inhaltsverzeichnis</h3>
<ul>
<li><a href= "#BuyCD"     >3.1 - Eine OpenBSD CD kaufen</a>
<li><a href= "#BuyTShirts">3.2 - OpenBSD T-Shirts kaufen</a>
<li><a href= "#ISO"       >3.3 - Gibt es ein OpenBSD ISO Image?</a>
<li><a href= "#FTP"       >3.4 - Downloaden via FTP, HTTP oder AFS</a>
<li><a href= "#GetCurrent">3.5 - Wo man den aktuellsten Source Code (current)
     herbekommt</a>
</ul>

<hr>

<p>
<a name= "BuyCD"></a>
<h2>3.1 - Eine OpenBSD CD kaufen</h2>

<p>
Eine OpenBSD CD zu kaufen ist der allgemein beste Weg, zu beginnen. Besuche
die Bestellseite um deine Kopie zu erwerben:
<a href= "../../de/orders.html">OpenBSD Bestellseite</a>.

<p>
Es gibt mehrere gute Gr&uuml;nde, eine OpenBSD CD zu besitzen:
<ul>
  <li>CD Verk&auml;ufe unterst&uuml;tzten die Weiterentwicklung von
      OpenBSD.
  <li>Die Entwicklung eines plattform&uuml;bergreifenden Betriebssystems
      ben&ouml;tigt andauernd Investitionen in Hardware.
  <li>Deine Unterst&uuml;tzung in Form eines CD Kaufes hat einen realen
      Einfluss auf zuk&uuml;nftige Entwicklungen.
  <li>Die CD beinhaltet Bin&auml;rdateien (und Quelltexte) f&uuml;r alle
      unterst&uuml;zten Plattformen.
  <li>Die CD ist bootf&auml;hig auf mehreren Plattformen und man kann mittels
      CD das Betriebssystem direkt installieren.
  <li>Mit der CD kann man auch die Installation starten, um einen Snapshot
      zu installieren.
  <li>Die Installation von CD ist schneller! Und Netzwerkressourcen werden
      eingespart.
  <li>Die OpenBSD CDs beinhalten immer sehr h&uuml;bsche Aufkleber. Dein
      System ist nicht komplett, solange du sie nicht hast. Diese Aufkleber
      kannst du nur durch den Kauf einer CD oder Spenden von Hardware
      erwerben.
</ul>

<p>
Wenn du eine offizielle Version von OpenBSD installierst, dann solltest du
eine CD benutzen.
</p>

<p>
<a name= "BuyTShirts"></a>
<h2>3.2 - OpenBSD T-Shirts kaufen</h2>
<p> Ja, OpenBSD hat T-Shirts f&uuml;r dein Tragevergn&uuml;gen. Hier kannst
du sie sehen: <a href="../../de/tshirts.html">OpenBSD T-Shirts Seite</a>. 
Nett, oder? :)

<p>
<a name= "ISO"></a>
<h2>3.3 - Gibt es ein OpenBSD ISO Image?</h2>
Einige andere OpenSource Betriebssysteme werden &uuml;blicherweise
als CD-ROM Images verbreitet. Das ist bei OpenBSD <i>nicht</i>
der Fall.
<p>
Das OpenBSD Projekt stellt die offiziellen ISO Images nicht zur Verf&uuml;gung,
die als Master f&uuml;r die offiziellen CDs benutzt werden. 
Der Grund daf&uuml;r ist einfach, dass wir gerne die CDs verkaufen m&ouml;chten,
und zwar um die weitere Entwicklung von OpenBSD sicherzustellen.
Das offizielle OpenBSD CD-ROM Layout unterliegt dem Copyright von
Theo de Raadt. Theo erlaubt es niemandem, die Images der offiziellen CD weiter
zu verbreiten. Als weiteren Anreiz zum Kauf der CDs gibts es zus&auml;tzlich
noch ,artwork' und Aufkleber.
<p>
Denk aber daran, dass nur das CD Layout unter Copyright liegt, OpenBSD selbst
ist frei. Nichts hindert irgendjemanden daran, sich OpenBSD zu besorgen und
seine eigene CD zu machen. Wenn du aus irgendeinem Grund ein CD Image
herunterladen willst, sieh im Archiv der Mailinglisten nach, dort gibt es
Quellen. Nat&uuml;rlich gibt es dabei nur zwei M&ouml;glichkeiten: Entweder
verletzen die im Internet erh&auml;ltlichen Images das Copyright von Theo de
Raadt oder sind einfach keine offiziellen Images. Die Quelle von inoffiziellen
Images sind entweder vertrauensw&uuml;rdig oder eben nicht, die Entscheidung
liegt bei dir.
<p>
Wir schlagen einfach allen Leuten vor, die OpenBSD umsonst haben wollen, die
FTP Installationsoption zu w&auml;hlen. Diejenigen, die eine bootbare CD
f&uuml;r ihr System ben&ouml;tigen, k&ouml;nnen
<!-- XXXrelease -->
Bootdisk ISO Images (namens <tt>cd35.iso</tt>) f&uuml;r eine Reihe von
Plattformen herunterladen, die es dann erlauben, den Rest des Systems via FTP
zu installieren. Diese ISO-Images haben nur eine Gr&ouml;sse von wenigen MB,
und enthalten nichts weiter als die Installationstools, aber nicht die
wirklichen Dateien.

<p>
<a name= "FTP"></a>
<h2>3.4 - Downloaden via FTP, HTTP oder AFS</h2>

<p>
Es gibt zahlreiche internationale FTP Server, die OpenBSD Versionen und 
Snapshots f&uuml;hren. AFS Zugang ist auch m&ouml;glich. Du solltest immer 
den dir n&auml;chsten Server w&auml;hlen. Bevor du mit dem Runterladen 
einer Version oder eines Snapshots beginnst, solltest du mittels
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ping&amp;sektion=8"
>ping(8)</a> und <a
href="http://www.openbsd.org/cgi-bin/man.cgi?query=traceroute&amp;sektion=8"
>traceroute(8)</a> feststellen, welcher Server f&uuml;r dich am schnellsten
ist. Klarerweise ist das offizielle OpenBSD CD Set immer n&auml;her als
jeder Server. Zugangsinformationen findest du hier: 

<p>
<a href= "../../de/ftp.html">OpenBSD FTP Seite</a>.

<p>
<a name= "GetCurrent"></a>
<h2>3.5 - Wo man den aktuellsten Sourcecode (current) herbekommt</h2>

<p>
Die Quelltexte von OpenBSD d&uuml;rfen frei verbreitet werden und sind frei 
erh&auml;ltlich. Im Allgemeinen ist der beste Weg, den Verzeichnisbaum 
mit den aktuellen Quelltexten aufzubauen, die Quelltexte von der letzten 
CD zu installieren und sie dann mittels AnonCVS 
regelm&auml;&szlig;ig zu erneuern. Informationen &uuml;ber AnonCVS 
findest du hier:

<p>
<a href= "../../de/anoncvs.html">OpenBSD AnonCVS Seite</a>. 

<p>
sowie auch in der <a href= "../faq8.html#CVS">FAQ 8, CVS</a>.

<p>
Sollte deine Netzwerkanbindung f&uuml;r AnonCVS unzureichend sein oder dein
Internetzugang besteht via UUCP, kannst du die Quelltexte mittels CTM auf dem
laufenden halten. Solltest du dich in dieser Situation befinden, dann ist das
Beginnen mit der CD umso wichtiger. Informationen &uuml;ber CTM findest du
hier:

<p>
<a href= "../../ctm.html">OpenBSD CTM Seite</a>.

<p>
Eine weitere M&ouml;glichkeit an den Quelltext zu kommen bietet dir das
Webinterface "cvsweb" an:

<a href="http://www.openbsd.org/cgi-bin/cvsweb/"
>http://www.openbsd.org/cgi-bin/cvsweb/</a>.


<p>
<font color= "#0000e0">
<a href= "index.html">[FAQ Index]</a>
<a href="faq2.html">[Zum Kapitel 2 - Andere Informationsquellen]</a>
<a href="faq4.html">[Zum Kapitel 4 - Installationsanleitung]</a>
</font>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[zur&uuml;ck]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq3.html,v 1.44 ]
<br>
$Translation: faq3.html,v 1.39 2004/09/27 13:44:19 jufi Exp $
<br>
</small>
<small>$OpenBSD: faq3.html,v 1.35 2004/09/27 13:58:26 jufi Exp $</small>
</body>
</html>  
