<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>5 - Neuerzeugen des Systems aus den Quelltexten</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta http-equiv="Content-Language" content="de">
<meta name= "description"   content= "Die OpenBSD FAQ Seiten">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2002 by OpenBSD.">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
</head>

<body bgcolor= "#ffffff" text= "#000000">
<!-- Passes validator.w3.org.  Please keep it this way -->

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<h2><font color="#e00000">5 - Neuerzeugen des Systems aus den Quelltexten</font></h2>
<hr>

<p>
<ul><h3>Inhaltsverzeichnis</h3>
<li><a href= "#Flavors">5.1 - OpenBSD's Flavors</a>
<li><a href= "#Why">5.2 - Warum brauche ich einen selber kompilierten Kernel?</a>
<li><a href= "#Options">5.3 - Kernelkonfigurationsoptionen</a>
<li><a href= "#Building">5.4 - Einen eigenen Kernel kompilieren</a>
<li><a href= "#BootConfig">5.5 - Boot-time Konfiguration</a>
<li><a href= "#VerboseBoot">5.6 - Mehr Lognachrichten w&auml;hrend des Startens</a>
<li><a href= "#config">5.7 - Mittels config(8) deine Kernelbin&auml;rdatei ver&auml;ndern</a>
</ul>
<hr>
<br>


<a name="Flavors"></a>
<h2>5.1 - OpenBSD's Flavors</h2>

Es gibt drei "flavors" von OpenBSD:
<ul>
<li><b>-release:</b> Die Version von OpenBSD, die alle 6 Monate auf CD ausgeliefert wird.
<li><b>-stable:</b>  Release und zus&auml;tzliche Patches, die f&uuml;r 
    Sicherheit und Zuverl&auml;ssigkeit als notwendig erachtet werden.
<li><b>-current:</b> Die jetzt-im-Moment-aktuelle Version von OpenBSD, die sich in die
    n&auml;chste release-Version verwandelt.
</ul>

Grafisch sieht die Entwicklung dieser flavors ungef&auml;hr so aus:

<blockquote>
<pre>
       ,------o-----------o----X                    2.9 Stable 
       |      .           .
       |      .    ,------o---------o----X          3.0 Stable
       |      .    |      .         .
       |      .    |      .    ,----o----------o--&gt; 3.1 Stable
       |      .    |      .    |    .          .
       |      .    |      .    |    .    ,-----o--&gt; 3.2 Stable
       |      .    |      .    |    .    |     .
       |      .    |      .    |    .    |     .
 --&gt;2.9Rel-----&gt;3.0Rel-----&gt;3.1Rel-----&gt;3.2Rel----&gt; Current 
          Time ---&gt;
</pre>
</blockquote>

<p>
Der code tree wird alle sechs Monate in <i>-current</i>, <i>-release</i> und
<i>-stable</i> aufgeteilt -- <i>-release</i> wird zu einem festen Punkt
(einem &quot;Tag&quot;) in der Geschichte des source tree - der niemals
ge&auml;ndert, und genau der ist auch auf den <a href="../orders.html">CDs</a> und 
<a href="../ftp.html">FTP
Servern</a>.
<br>
<i>-Current</i> dagegen ist die Baustelle, an der die aktive Arbeit 
gemacht wird, und die dann der n&auml;chste <i>-release</i> von OpenBSD wird.

<p>
Der <i>-stable</i> branch (auch bekannt als der "Patch branch") basiert auf
<i>-release</i>, und ist, wie man sehen kann, ein "branch" aus dem 
Entwicklungspfad von OpenBSD. Wenn wichtige Korrekturen und Fixes
an <i>-current</i> vorgenommen werden, werden diese in die <i>-stable</i>
branches "zur&uuml;ckportiert". 
In der obigen Illustration sind die vertikalen gepunkteten Linien 
Bug Fixes, die in die <i>-stable</i> branches eingef&uuml;gt werden. Du wirst
auch erkennen, dass der Lebenszyklus des <i>2.9-stable</i> branch mit
Erscheinen des <i>3.1-release</i> beendet war und der <i>3.0-stable</i> 
branch mit Erscheinen von <i>3.2-release</i> beendet war -- alte Versionen werden 
typischerweise noch zwei "releases" lang weitergepflegt. Es braucht nunmal 
Ressourcen und Zeit, &auml;ltere Versionen zu pflegen, und obwohl wir das
gerne tun w&uuml;rden, konzentrieren wir uns doch lieber auf neue Features.
Der <i>-stable</i> branch kann vom Design her sehr leicht aus dem 
<i>-release</i> branch der selben Version erzeugt werden (z.B. von
<i>3.2-release</i> zu <i>3.2-stable</i>).

<p>
Der <i>-stable</i> branch ist <i>-release</i> plus patches, die man 
auf der <a href="../../de/errata.html">errata Seite</a> findet, und 
ein paar einfache fixes, die keinen errata-Entrag verdienen.
Normalerweise ist die Bedienung und der Betrieb von <i>-stable</i>
genauso wie der des <i>-release</i>, auf dem er basiert. Wenn die
<a href="http://www.openbsd.org/cgi-bin/man.cgi">man pages</a> 
ge&auml;ndert werden m&uuml;ssen, wird es wahrscheinlich nicht in
<i>-stable</i> eingef&uuml;gt werden. Mit anderen Worten, 
Unterst&uuml;tzung f&uuml;r neue Hardware wird NICHT in <i>-stable</i> 
eingef&uuml;gt, und neue Features werden nur dann eingef&uuml;gt, wenn 
das als sehr wichtig erachtet wird.

<p>
Warnung: <i>-current</i> ist ein sich bewegendes Ziel. Es &auml;ndert sich
fast min&uuml;ltlich, und kann sich genauso gut mehrere Male in der
Zeit &auml;ndern, die man braucht, um dem Source Code zu holen.
Wie vorher schon gesagt, gibt es keinerlei Garantie, dass das System
kompiliert oder gar funktioniert (nat&uuml;rlich hoffen wir das immer).
Es ist absolut m&ouml;glich und nicht ungew&ouml;hnlich, dass man sich
den <i>-current</i> Source holt, und er nicht kompiliert werden kann, 
w&auml;hrend es f&uuml;nf Minuten sp&auml;ter wieder klappt.
<b>Wenn du damit nicht umgehen kannst, lass deine Finger von 
<i>-current</i>.</b>

<p>
Die meisten User sollten also einfach <i>-stable</i> oder <i>-release</i>
benutzen. Wo das jetzt klar ist, sollte man aber auch wissen, dass viele Leute
<i>-current</i> auf Produktionssystemen fahren, und das ist insofern wichtig,
weil es hilft Bugs zu finden und neue Features zu testen. Wenn du aber
nicht weisst, wie man sauber Probleme beschreibt, diagnostiziert oder
damit umgeht, rede dir (oder jemand anderem ) besser nicht ein,
du w&uuml;rdest "dem Projekt helfen", indem du <i>-current</i> benutzt.
"Es funktioniert nicht!" ist kein <a href="../../de/report.html#bugtypes">
n&uuml;tzlicher bug report</a>. "The recent changes to the pciide driver broke
compatibility with my Slugchip-based IDE interface, dmesg of working and
broken systems follow..." k&ouml;nnte dagegen durchaus ein sinnvoller
und n&uuml;tzlicher Bericht sein.

<p>
Es mag Zeiten geben, wo auch ein "normaler" User gerne "auf des Messers
Schneide" leben will und <i>-current</i> benutzt. Der h&auml;ufigste Grund
daf&uuml;r ist, dass er ein Ger&auml;t hat, was nicht von <i>-release</i> 
unterst&uuml;tzt wird (und daher nat&uuml;rlich auch nicht von <i>-stable</i>),
oder er m&ouml;chte ein neues Feature aus <i>-current</i> benutzen. In 
diesem Fall hat er die Wahl zwischen <i>-current</i> oder dem Nichtbenutzen
seines Ger&auml;tes, und dann ist eben das Benutzen von <i>-current</i> oftmals
weniger schlimm. Man sollte dann aber auf keinen Fall ein H&auml;ndchenhalten 
der Entwickler erwarten, falls es zu Problemen kommt.

<h3>Snapshots</h3>
Zwischen den formalen Ver&ouml;ffentlichungen neuer Versionen von OpenBSD 
werden <i>snapshots</i> &uuml;ber die <a href="../../de/ftp.html">FTP Sites</a>
verf&uuml;gbar gemacht. Wie der Name schon sagt, sind das Versionen von Code,
der gerade zu eben diesem Zeitpunkt aktuell war, als der &Uuml;bersetzer des
snapshot sich eine Kopie des Source Code f&uuml;r eben diese Plattform 
gemacht hat. Denke bitte daran, dass das auf einigen Plattformen auch einige
TAGE sein k&ouml;nnen, bis der Snapshot dann auch kompiliert und zur 
Verf&uuml;gung gestellt wird. Es gibt auch keinerlei Garantien, dass die 
Snapshots funktionsf&auml;hig sind, oder auch nur installationsf&auml;hig.
Oftmals werden Snapshots dann erzeugt, wenn es eine &Auml;nderung gibt,
die getestet werden muss. Bei einigen Plattformen werden Snapshots
auf fast t&auml;glicher Basis erstellt, andere sind weniger regelm&auml;ssig.
Wenn du unbedingt <i>-current</i> benutzen willst, ist ein aktueller Snapshot
oft das einzige, was du dazu brauchst, und das Upgraden auf den aktuellen
Snapshot ist auch ein wunderbarer Ausgangspunkt, bevor du versuchst <i>-current</i>
zu erzeugen.

<p>
Manchmal wird gefragt, ob es einen Weg gibt, genau den Source-Code zu 
bekommen, der zur Erzeugung eines Snapshot eingesetzt wurde. Die Antwort
ist "Nein". Erstens ergibt sich daraus kein besonderer Vorteil. Zweitens
werden Snapshots nach Bedarf erzeugt, wenn die Zeit es erlaubt oder 
es gen&uuml;gend Ressourcen gibt. Auf schnellen Plattformen k&ouml;nnte
man z.B. mehrere Snapshots an einem Tag erzeugen. Auf den langsameren
kann das schon mal eine ganze Woche dauern. Und das Platzieren eines
"Tag" f&uuml;r jeden Snapshot in den Source Code ist nun wirklich 
extrem unpraktisch.

<h3>Die Dinge in Balance halten</h3>
Es ist wichtig zu verstehen, dass OpenBSD ein Betriebssystem ist, 
und als ganzes gesehen werden muss, nicht ein Kernel mit einem 
Schwanz an Applikationen, die drangeh&auml;ngt sind. Du musst sicherstellen,
dass dein Kernel, dein "Userland" (die unterst&uuml;tzenden Werkzeuge und
Dateien) und dein <a href="../../de/ports.html"><tt>ports</tt></a> tree
alle synchronisiert sind, oder es werden unangenehme Dinge passieren. 
Oder anders ausgedr&uuml;ckt (da es immer wieder Leute gibt, die das
versuchen), kannst du keine brandneuen <tt>ports</tt> auf einem System laufen
lassen, das einen Monat alt ist, oder einen Kernel aus <i>-current</i>
neu erzeugen und dann erwarten, dass er mit einem <i>release</i>-Userland
zusammenarbeitet. Ja, das heisst, dass du dein System auf aktuellem Stand 
halten musst, wenn du ein neues Programm laufen lassen willst, das z.B. erst
heute in den ports tree eingef&uuml;gt wurde. Tut uns erneut leid, aber 
OpenBSD hat nunmal nur sehr begrenzte Ressourcen, so dass wir sowas
nicht &auml;ndern k&ouml;nnen.

<p>
Man sollte verstehen, dass der Update-Prozess, wenn man ein
<a href="../upgrade-minifaq.html">Upgrade mittels Source</a> durchf&uuml;hrt, 
<b>nur in eine Richtung unterst&uuml;tzt wird: Von &auml;lter zu neuer</b>,
und von <i>-stable</i> zu <i>-current</i>.  Du kannst kein <i>3.2-current</i> 
(oder einen Snapshot) laufen lassen, und dich dann entscheiden, dass dir 
das zu gef&auml;hrlich ist, und einfach nach <i>3.2-stable</i> 
zur&uuml;ckgehen. Du bist auf dich allein gestellt, wenn du einen anderen Weg
w&auml;hlst als den normalen und unterst&uuml;tzen, n&auml;mlich dein System
von Grund auf neu zu installieren, erwarte bitte keinerlei Hilfeleistung
vom OpenBSD Entwicklerteam.

<p>
Ja, das soll wirklich heissen, dass du lang und breit dar&uuml;ber nachdenken
sollst, bevor du dich an <i>-current</i> wagst. 


<p>
<a name= "Why"></a>
<a name= "5.2"></a>
<h2>5.2 - Warum brauche ich einen selber kompilierten Kernel?</h2>

<p>
Es gibt daf&uuml;r mehrere Gr&uuml;nde, obwohl das 
Kompilieren eines eigenen Kernels eher f&uuml;r 
erfahrenere Benutzer geeignet ist, die bereits ein gutes 
Allgemeinverst&auml;ndnis vom System besitzen. 

<ul>
    <li>Dein Computer hat sehr wenig Hauptspeicher, den du so gut wie 
	m&ouml;glich ausnutzen willst, indem du nicht 
	ben&ouml;tigte Ger&auml;tetreiber entfernst. 
    <li>Du m&ouml;chtest Standardoptionen entfernen oder Optionen hinzuf&uuml;gen, die
	nicht standardm&auml;&szlig;ig aktiviert sind. 
    <li>Du m&ouml;chtest experimentelle Optionen hinzuf&uuml;gen. 
</ul>

<p>
In den meisten F&auml;llen wirst du keinen eigenen Kernel kompilieren 
m&uuml;ssen.  
Ein GENERIC Kernel wird normalerweise alles beinhalten, das du brauchst. 
Es gibt sogar mehrere Gr&uuml;nde, warum du keinen eigenen Kernel kreieren willst. 
Der Hauptgrund ist, da&szlig; man zwar logisch aussehende &Auml;nderungen an der
Kernelkonfiguration auf einfache Weise durchf&uuml;hren kann, aber dein
Kernel funktioniert dann nicht. 
Dies soll ein Warnsignal sein. Wenn etwas nicht zu funktionieren 
scheint, dann probiere bitte vorher einen 
GENERIC Kernel zu starten, bevor du einen Fehlerbericht einschickst. 
Die Entwickler werden im Normalfall jeden Fehlerbericht ignorieren,
der nicht mit einem GENRIC Kernel erzeugt und getestet wurde, 
es sei denn das Problem kann ebenfalls mit einem GENERIC Kernel
reproduziert werden. Nimm das als Warnung.

<p>
<a name= "Options"></a>
<a name= "5.3"></a>
<h2>5.3 - Kernelkonfigurationsoptionen</h2>


<p>
Kernelkonfigurationsoptionen bieten dir die M&ouml;glichkeit, zus&auml;tzliche 
Unterst&uuml;tzung zu deinem Kernel hinzuzuf&uuml;gen. Dies erlaubt dir, nur 
die von dir gew&uuml;nschten Ger&auml;te zu unterst&uuml;tzen. Es gibt eine Vielzahl 
von M&ouml;glichkeiten, deinen Kernel auf deine W&uuml;nsche abzustimmen. 
Hier werden wir nur auf einige der am h&auml;ufigsten benutzten 
M&ouml;glichkeiten eingehen. 
Siehe 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&apropos=0&sektion=4&format=html">options(4)</a>
f&uuml;r eine komplette Liste der Optionen. Es stehen auch 
Beispielkonfigurationsdateien f&uuml;r deine Architektur bereit. 


<P>
Nicht alle Kerneloptionen sind auf Kompatibilit&auml;t mit allen anderen 
Optionen getestet worden. Daher solltest du keine Option in deinem 
Kernel setzen, wenn du nicht einen triftigen Grund daf&uuml;r hast! 
Am meisten wird der GENERIC Kernel getestet. Dies ist normalerweise 
die Kombination der Optionen in 
/usr/src/sys/arch/&lt;deine Arch&gt;/conf/GENERIC 
und /usr/src/sys/conf/GENERIC. 
</P>

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/alpha/conf/">Alpha Kernel Konfgurationsdateien </a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/i386/conf/">i386 Kernel Konfigurationsdateien</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/macppc/conf/">macppc Kernel Konfigurationsdateien</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc/conf/">sparc Kernel Konfigurationsdateien</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc64/conf/">sparc64 Kernel Konfigurationsdateien</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/vax/conf/">vax Kernel Konfigurationsdateien</a>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/">Andere Architekturen</a>
</ul>


<p>
Wenn du diese Dateien genauer betrachtest, dann wird dir eine Zeile 
wie diese auffallen:<br>
<strong>include "../../../conf/GENERIC"</strong><br>
Dies bedeutet, da&szlig; ein Verweis auf eine andere 
Konfigurationsdatei vorhanden ist. 
Diese Datei beinhaltet architekturunabh&auml;ngige Optionen. 
Wenn du also deinen eigenen Kernel konfigurieren willst, 
dann mu&szlig;t du auch 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/conf/GENERIC">/sys/conf/GENERIC</a> 
beachten. Dort <b>sind</b> Optionen enthalten, die <b>ben&ouml;tigt</b> werden. 


<p>
Alle nachfolgend aufgelisteten Optionen sollten in deiner 
Kernelkonfigurationsdatei im Format von:<br>
<strong>option      OPTION</strong><br>
angef&uuml;hrt sein. Um die Option debug im Kernel zu plazieren, 
f&uuml;ge eine Zeile wie diese ein:<br>
<strong>option	    DEBUG</strong><br>
Die Optionen im OpenBSD Kernel werden in Compilerpr&auml;prozessoroptionen 
&uuml;bersetzt, daher w&uuml;rde eine Option wie DEBUG den Quelltext mit der 
Option -DDEBUG kompilieren, was einem #define DEBUG im Kernel entspricht.


<p>
OpenBSD hat viele Kompatibilit&auml;tsm&ouml;glichkeiten, die dir erlauben, 
Bin&auml;rdateien von anderen Betriebsystemen auszuf&uuml;hren.
Nicht alle Optionen sind auf jeder Architektur vorhanden, daher lies 
die entsprechende Manualseite, ob die Architektur unterst&uuml;tzt wird.

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_svr4&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_SVR4(8)</a> - Kompatibilit&auml;t mit SVR4 Bin&auml;rdateien.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_bsdos&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_BSDOS(8)</a> - Kompatibilit&auml;t mit BSD/OS Bin&auml;rdateien.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_LINUX(8)</a> - Kompatibilit&auml;t mit Linux Bin&auml;rdateien.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_sunos&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_SUNOS(8)</a> - Kompatibilit&auml;t mit SunOS Bin&auml;rdateien.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ultrix&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_ULTRIX(8)</a> - Kompatibilit&auml;t mit Ultrix Bin&auml;rdateien.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_freebsd&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_FREEBSD(8)</a> - Kompatibilit&auml;t mit FreeBSD Bin&auml;rdateien.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_hpux&amp;sektion=8">COMPAT_HPUX(8)</a> 
   - Kompatibilit&auml;t mit HP-UX Bin&auml;rdateien. Nur auf einigen m68k Architekturen verf&uuml;gbar.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ibcs2&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_IBCS2(8)</a> - Kompatibilit&auml;t mit ibcs2 Bin&auml;rdateien.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_osf1&amp;sektion=8">COMPAT_OSF1(8)</a> 
   - Digital Unix Bin&auml;rdateien laufen lassen. Nur auf der Alpha Plattform verf&uuml;gbar.
<li>COMPAT_43 - Kompatibilit&auml;t mit 4.3BSD. Von dessen Gebrauch wird zwar abgeraten, aber wird f&uuml;r einige Applikationen ben&ouml;tigt. 
<li>COMPAT_11 - Kompatibilit&auml;t mit NetBSD 1.1.
<li>COMPAT_NOMID - Kompatibilit&auml;t mit a.out executables ohne machine id.
</ul>


<p>
Es ist immer hilfreich, Probleme mit dem Kernel debuggen zu k&ouml;nnen. 
Aber viele wollen diese Optionen nicht in ihren Kernel setzen, weil 
diese Optionen den Kernel sehr vergr&ouml;&szlig;ern. Sie sind aber extrem 
hilfreich im Falle eines Fehlers.
Ein Entwickler wird die Quelle deiner Probleme viel schneller finden 
k&ouml;nnen. 
Hier eine Liste der debug Optionen: 

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ddb&sektion=4&format=html">DDB(4)</a> - Kernelinterner Debugger. Nicht auf allen Plattformen. Daher konsultiere die Manualseite.
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gdb&amp;sektion=1">KGDB(7)</a> - Kompiliert einen `remote kernel debugger` mittels `remote target` Option von gdb.
<li>makeoptions  DEBUG="-g" - Erzeugt bsd.gdb gemeinsam mit bsd. Dies ist n&uuml;tzlich, um crash dumps mit gdb zu debuggen.
<li>DEBUG - Diverse debugging Optionen im Kernel, die im Quelltext definiert wurden.
<li>KTRACE - F&uuml;gt "hooks" f&uuml;r "system call tracing facility" ein. Dies erlaubt den Benutzern: <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ktrace&sektion=1&format=html">ktrace(1)</a>.
<li>DIAGNOSTIC - F&uuml;gt Code im Kernel f&uuml;r interne Konsistenz&uuml;berpr&uuml;fungen ein.
<li>GPROF - F&uuml;gt Code im Kernel f&uuml;r Kernelprofilierung mit <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kgmon&sektion=8&format=html">kgmon(8)</a> ein.
<li>makeoptions PROF="-pg" - Die -pg Option dient zur Unterst&uuml;tzung von "profiling" im Kernel. Die Option GPROF wird daf&uuml;r ben&ouml;tigt.
</ul>

<p>
<strong>Dateisystemoptionen.</strong>
<ul>
<li>FFS - Berkeley Fast Filesystem. <strong>ANMERKUNG:</strong> Diese Option wird immer ben&ouml;tigt.
<li>EXT2FS - Second Extended File System, ben&ouml;tigt f&uuml;r das Lesen von Linux Partitionen.
<li>MFS - Memory File System, speichern von Dateien in swap - Speicher.
<li>NFS - Network File System, ben&ouml;tigt f&uuml;r NFS.
<li>CD9660 - Das iso9660 + rockridge Dateisystem; zum Lesen von CDs.
<li>MSDOSFS - Ben&ouml;tigt, um MS-DOS FAT Dateisysteme zu lesen; bietet Unterst&uuml;tzung f&uuml;r Windows 95 (lange Dateinamen + Gro&szlig;-/Kleinschreibungerweiterungen).
<li>FDESC - Beinhaltet Code f&uuml;r ein Dateisystem, das auf /dev/fd gemountet werden kann.
<li>KERNFS - Beinhaltet Code f&uuml;r das Mounten eines speziellen Dateisystems (normalerweise auf /kern), in dem sich Dateien befinden, die spezielle Kernelvariablen und -parameter repr&auml;sentieren.
<li>NULLFS - Code f&uuml;r ein loopback Dateisystem. In <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_null&sektion=8&format=html">mount_null(8)</a> hat dazu weitere Informationen
<li>PROCFS - Beinhaltet Code f&uuml;r ein spezielles Dateisystem (normalerweise auf /proc)
<li>PORTAL - Beinhaltet das (experimentelle) portal Dateisystem.  Dies erlaubt interessante Tricks wie TCP sockets durch das &Ouml;ffnen von Dateien im Dateisystem zu &ouml;ffnen.
<li>UMAPFS - Beinhaltet ein loopback Dateisystem, in dem Benutzer- und Gruppenids umgelegt werden d&uuml;rfen -- n&uuml;tzlich, wenn man fremde Dateisysteme mit anderen uids und gids als das lokale System mounten will (zB.: NFS).
<li>UNION - Beinhaltet Code f&uuml;r das union Dateisystem, welches das Mounten von Verzeichnissen &uuml;bereinander erlaubt, so da&szlig; beide Dateisysteme sichtbar bleiben. Dieser Code ist noch nicht sehr stabil.
<li>XFS - F&uuml;gt "hooks" f&uuml;r ein Dateisystem ein, das kompatibel mit dem AFS Dateisystem ist. Derzeit vom Arla/AFS Code benutzt.
<li>FFS_SOFTUPDATES - Erlaubt den Gebrauch von softupdates. Hier mehr dazu: <a href="../faq14.html#SoftUpdates">Softupdates FAQ</a>.
<li>NFSSERVER - Serverseitiger NFS Code im Kernel.
<li>NFSCLIENT - Klientseitiger NFS Code im Kernel.
<li>FIFO - Unterst&uuml;tzung f&uuml;r FIFOs. <b>Empfohlen</b>.
<li>NVNODE=integer - Wobei integer eine Ganzzahl ist, die der Gr&ouml;&szlig;e des Caches bei name-to-inode &Uuml;bersetzungsroutinen entspricht (dh. der namei() Cache, obwohl er auch von vielen anderen Funktionen im Kernelquelltext aufgerufen wird).
<li>EXT2FS_SYSTEM_FLAG - Diese Option &auml;ndert das Verhalten der APPEND- und der IMMUTABLE-option f&uuml;r Dateien in einem 
EXT2FS-Dateisystem. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&sektion=4&format=html">options(4)</a> f&uuml;r 
weitere Details.

<li>QUOTA - Unterst&uuml;tzung f&uuml;r Quoten im Dateisystem. Hier mehr dazu: <a href="../faq10.html#Quotas">FAQ 10, Quotas</a>.
</ul>


<p>
<strong>Diverse Optionen</strong>
<ul>
<li>PCIVERBOSE - Mehr Details w&auml;hrend des Startprozesses von PCI Ger&auml;ten.
<li>EISAVERBOSE - Mehr Details w&auml;hrend des Startprozesses von EISA Ger&auml;ten.
<li>PCMCIAVERBOSE - Mehr Details w&auml;hrend des Startprozesses von PCMCIA Ger&auml;ten.
<li>APERTURE - Liefert kernelinterne Unterst&uuml;tzung f&uuml;r VGA Bildzwischenspeicher durch Umlegen von Benutzerprozessen. Ben&ouml;tigt f&uuml;r X.
<li>LKM - Unterst&uuml;tzung f&uuml;r Loadable Kernel Modules (ladbare Kernelmodule). Nicht auf allen Architekturen. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=lkm&sektion=4&format=html">lkm(4)</a> f&uuml;r weitere Informationen.
<li>INSECURE - Setzt das Kernelsicherheitsniveau auf -1. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=init&sektion=8&format=html">init(8)</a> f&uuml;r weitere Informationen bez&uuml;glich der Kernelsicherheitseinstellungen.
<li>RAM_DISK_HOOKS - Erlaubt den Aufruf von rechnerabh&auml;ngigen Funktionen, wenn der Ramdisktreiber konfiguriert ist.
<li>RAM_DISK_IS_ROOT - Zwingt die Ramdisk, root zu sein.
<li>CCDNBUF=integer - Setzt die Anzahl des "component buffers" von 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccd&amp;sektion=4">CCD(4)</a>.
Standard ist 8. F&uuml;r mehr &uuml;ber CCD siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccd&sektion=4&format=html">CCD(4)</a> oder das <a href="faq11.html#ccd">Performancetuning FAQ Kapitel.</a>
<li>KMEMSTATS - Damit unterh&auml;lt malloc(9) (kernel memory allocator) Statistiken &uuml;ber seinen Gebrauch. Wenn die Option DEBUG benutzt wird, wird diese Option automatisch von config aktiviert. 
<li>BOOT_CONFIG - F&uuml;gt die Unterst&uuml;tzung f&uuml;r die -c boot Option ein.
</ul>


<p>
<strong>Netzwerkoptionen</strong><br>
Siehe auch das <a href="faq6.html">Netzwerk FAQ</a> oder das <a href="faq11.html#Network">Netzworking Performancetuning FAQ</a>.
<ul>
<li>GATEWAY - Erm&ouml;glich IPFORWARDING und erh&ouml;ht (auf den meisten Plattformen) die Gr&ouml;&szlig;e der NMBCLUSTERS.
<li>NMBCLUSTERS=integer - Steuert die Gr&ouml;&szlig;e der mbuf cluster map. 
<li>IPFORWARDING - Erm&ouml;glich IP routing Verhalten.  Wenn diese Option aktiviert ist, wird der Rechner IP Datagramme zwischen seinen Netzwerkkarten weiterleiten, die f&uuml;r andere Rechner bestimmt sind.
<li>MROUTING - Beinhaltet Unterst&uuml;tzung f&uuml;r IP multicast Router.
<li>INET - Beinhaltet Unterst&uuml;tzung f&uuml;r den TCP/IP protocol stack. Diese Option wird BEN&Ouml;TIGT.
<li>MCLSHIFT=Wert - Diese Option ist der Logarithmus zur Basis 2 der Gr&ouml;&szlig;e des mbuf clusters. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&sektion=4&format=html">options(4)</a> f&uuml;r mehr Information &uuml;ber diese Option.
<li>NS - Inkludiere Unterst&uuml;tzung f&uuml;r den Xerox XNS protocol stack.  Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ns&sektion=4&apropos=0&manpath=OpenBSD+Current">ns(4)</a>.
<li>ISO,TPIP - Inkludiere Unterst&uuml;tzung f&uuml;r den allgegenw&auml;rtigen OSI protocolstack. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=iso&sektion=4&format=html">iso(4)</a> f&uuml;r mehr Information.
<li>EON - Inkludiere Unterst&uuml;tzung f&uuml;r OSI tunneling &uuml;ber IP.
<li>CCITT,LLC,HDLC - Inkludiere Unterst&uuml;tzung f&uuml;r den X.25 protocol stack.
<li>IPX, IPXIP - Inkludiere Unterst&uuml;tzung f&uuml;r: Internetwork Packet Exchange protocol, das von Novell NetWare verwendet wird.
<li>NETATALK - Inkludiere Kernelunterst&uuml;tzung f&uuml;r die AppleTalk Protokolfamilie.
<li>TCP_COMPAT_42 - Vom Gebrauch dieser Option wird sehr abgeraten, daher sollte sie auch nicht aktiviert werden: TCP Fehlerkompatibilit&auml;t mit 4.2BSD. In 4.2BSD waren die TCP Sequenzzahlen 32-bit signierte Werte.  Moderne Implementationen des TCP verwenden unsignierte Werte.
<li>TCP_NEWRENO - Aktiviert "NewReno fast recovery phase", welche die Wiederherstellung eines verlorenen Segmentes pro R&uuml;cklaufzeit erlaubt.
<li>TCP_SACK - Aktiviert selektive Best&auml;tigungen.
<li>TCP_FACK - Aktiviert weiterleitende Best&auml;tigungen, die pr&auml;zisere Sch&auml;tzungen &uuml;ber noch ausstehende Daten w&auml;hrend der "fast recovery phase" mittels SACK Informationen erlauben. Diese Option kann gemeinsam mit TCP_SACK benutzt werden.
<li>PPP_FILTER - Diese Option aktiviert auf <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcap&sektion=3&format=html">pcap(3)</a> basierende Filterung f&uuml;r PPP Verbindungen.
<li>PPP_BSDCOMP - PPP BSD Kompression.
<li>PPP_DEFLATE - Wird gemeinsam mit PPP_BSDCOMP verwendet.
<li>IPSEC - Diese Option erm&ouml;glicht die Unterst&uuml;tzung des IP security protocol. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">ipsec(4)</a> f&uuml;r mehr Details. Dies impliziert nun die Option KEY, welche Unterst&uuml;tzung f&uuml;r PFKEYv2 bietet. 
<li>ENCDEBUG - Diese Option erm&ouml;glicht, da&szlig; Debuginformationen aufgezeichnet werden, wenn IPSEC Fehler bemerkt.
</ul>


<p>
<strong>SCSI Subsystemoptionen</strong>
<ul>
<li>SCSITERSE - Knappere SCSI Fehlermeldungen.  Dies l&auml;&szlig;t die Tabelle, 
um ASC/ASCQ Informationen zu dekodieren, aus, was etwa 8 Bytes einspart.
<li>SCSIDEBUG - Druckt zus&auml;tzliche Debuginformationen f&uuml;r das SCSI Subsystem auf die Konsole.
</ul>



<p> 
<a name= "Building"></a>
<a name= "5.4"></a>
<h2>5.4 - Einen eigenen Kernel kompilieren</h2>


<p>
Vollst&auml;ndige Instruktionen zum Kreieren deines eigenen Kernels 
findest du hier in
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&apropos=0&sektion=8&format=html">
afterboot(8)</a>.


<p>
Um deinen eigenen Kernel von CDROM zu kompilieren, mu&szlig;t 
du zun&auml;chst den Quelltext haben. 
Der Source ist sowohl auf der 
<a href="../../de/orders.html">offiziellen CD</a> (Disk 3) als auch auf den
<a href="../../de/ftp.html">FTP Sites</a> zu finden. Das folgende Beispiel nimmt an,
dass die CD3 unter /mnt gemountet ist:


<blockquote>
<pre>
# <strong>cd /usr/src</strong>
# <strong>tar xvzf /mnt/src.tar.gz</strong>
</pre>
</blockquote>

<p>
Am einfachsten ist es, mit einem GENERIC 
Kernel zu beginnen. Dieser befindet sich unter 
<tt>/usr/src/sys/arch/${arch}/conf/GENERIC</tt>,
wobei ${arch} deine Architektur ist. In diesem Verzeichnis 
befinden sich auch weitere Beispielskonfigurationen. 
Hier zwei Beispiele f&uuml;rs Kompilieren deines Kernels.
Das erste Beispiel behandelt das Kompilieren von einem 
Quelltextbaum, der nur Leseberechtigung hat. Das zweite 
Beispiel zeigt, wie es auf einem 
Quelltextbaum mit Schreibberechtigung funktioniert.


<blockquote> 
<pre>
# <strong>cd /irgendwo</strong>
# <strong>cp /usr/src/sys/arch/$ARCH/conf/IRGENDEINEDATEI .</strong>
# <strong>vi IRGENDEINEDATEI</strong> (um deine gew&uuml;nschten &Auml;nderung durchzuf&uuml;hren)
# <strong>config -s /usr/src/sys -b . IRGENDEINEDATEI</strong>
<ul>
# <strong>make depend</strong> 
<ul>
(Der obige Schritt ist notwendig, wenn du irgendwelche &Auml;nderungen 
[inkl. Updates und Patches] an deinem Kernelquelltextbaum 
durchgef&uuml;hrt hast.  Dieser Schritt kann 
ignoriert werden, wenn du dem n&auml;chsten Schritt folgst.)
</ul>
<font size="+1">
<b><i>ODER</i></b>
</font>
# <strong>make clean</strong>
<ul>
(Der obige Schritt ist notwendig, wenn du irgendwelche &Auml;nderungen an 
Kernelkonfigurationsoptionen durchf&uuml;hrst und er ist 
auch empfohlen, wenn du gr&ouml;&szlig;ere Updates an deinem 
Quelltextbaum vornimmst. Ansonsten kannst du diesen 
Schritt &uuml;berspringen und 'make depend' eingeben.)
</ul>
</ul>
# <strong>make</strong>
</pre>
</blockquote>

<p>
Um einen Kernel von einem Quelltextbaum mit Schreibberechtigung zu 
bauen, tue folgendes:


<blockquote>
<pre>
# <strong>cd sys/arch/$ARCH/conf</strong>
# <strong>vi IRGENDEINEDATEI</strong> (um deine gew&uuml;nschten &Auml;nderung durchzuf&uuml;hren)
# <strong>config IRGENDEINEDATEI</strong> (hier mehr dar&uuml;ber : 
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=config&apropos=0&sektion=8&format=html">config(8)</a>)
# <strong>cd ../compile/IRGENDEINEDATEI</strong>
# <strong>make</strong> 
</pre>
</blockquote>

<p>
Wobei $ARCH f&uuml;r die von dir benutzte Architektur ist (z.B. i386). Du kannst auch 
ein <strong>make depend</strong> durchf&uuml;hren, um die Abh&auml;ngigkeiten 
f&uuml;rs n&auml;chste Kernelkompilieren zu schaffen. 


<p>
Jetzt mu&szlig; der Kernel noch an den richtigen Platz.


<blockquote>
<pre>
# <strong>cp /bsd /bsd.old</strong>
# <strong>cp /sys/arch/$ARCH/compile/IRGENDEINEDATEI/bsd /bsd</strong>
</pre>
</blockquote>

<p>
Um deinen alten Kernel zu starten, mu&szlig;t du nur 

<blockquote>
<pre>
boot&gt; <strong>bsd.old</strong>
</pre>
</blockquotel>

<p>
beim Starten eingeben, und dein alter Kernel wird anstelle von /bsd geladen.


<p>
Manchmal wirst du auch neue Bootbl&ouml;cke installieren m&uuml;ssen, wenn du einen Kernel 
gebaut hast. Um dies zu tun, siehe <a href="../faq14.html#InstBoot">
FAQ 14.8, Installieren von Bootblocks</a>. Dies wird dir eine &Uuml;bersicht vom Gebrauch 
des OpenBSD Bootloaders geben.


<p>
<a name= "BootConfig"></a>
<a name="5.5"></a> 
<h2>5.5 - Boot-Time Konfiguration </h2>


<p>
Manchmal findet der Kernel beim Booten dein Ger&auml;t, aber eventuell den falschen
IRQ. Und vielleicht brauchst du dieses Ger&auml;t sofort. Nun, ohne den Kernel neu zu 
bauen, kannst du mit der OpenBSD eigenen Boot-Time Konfiguration dieses Problem 
l&ouml;sen. Dies wird aber dein Problem nur einmal l&ouml;sen. Wenn du rebootest, dann 
mu&szlig;t du diese Prozedur wiederholen. Daher ist dies nur als 
vor&uuml;bergehende L&ouml;sung gedacht, und du solltest das Problem 
durch das Neukompilieren deines eigenen 
Kernels l&ouml;sen. Dein Kernel wird die <strong>option BOOT_CONFIG</strong> 
ben&ouml;tigen, die GENERIC bereits beinhaltet.


<p>
Den Gro&szlig;teil dieses Dokumentes kannst du in der Manualseite 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&apropos=0&sektion=8&format=html">boot_config(8)</a> finden.


Um in die Benutzerkernelkonfiguration (User Kernel Config) oder 
UKC zu gelangen, mu&szlig;t du beim Starten die -c Option verwenden.

<ul><pre>
boot&gt; <strong>boot wd0a:/bsd -c</strong>
</pre></ul>

<p>
Oder welchen Kernel du auch immer laden willst. So kommst du in die 
UKC. Hier kannst du Befehle ausf&uuml;hren, die kernelspezifische Ger&auml;te 
&auml;ndern oder deaktivieren.


<p>
Hier eine Liste der g&auml;ngigen Befehle in der UKC.


<ul>
<li><tt>add <strong>device</strong></tt> - F&uuml;ge ein Ger&auml;t durch Kopieren eines anderen hinzu
<li><tt>change <strong>devno | device </strong></tt> - &Auml;ndere ein oder mehrere Ger&auml;te
<li><tt>disable <strong>devno | device </strong></tt> - Deaktiviere ein oder mehrere Ger&auml;te
<li><tt>enable <strong>devno | device </strong></tt> -  Aktiviere ein oder mehrere Ger&auml;te
<li><tt>find <strong>devno | device </strong></tt> - Suche ein oder mehrere Ger&auml;te
<li><tt>help</tt> - Kurze Zusammenfassung dieser Befehle
<li><tt>list</tt> - Liste ALLE bekannten Ger&auml;te au
<li><tt>exit/quit</tt> - Setze Starten fort
<li><tt>show <strong>[attr [val]]</strong></tt> - Zeige alle Ger&auml;te mit Eigenschaft 
	(attribute) und optional mit einem spezifierten Wert (value)
</ul>

<p>
Wenn du einmal dein Ger&auml;t konfiguriert hast, dann steige 
mit quit oder exit aus UKC aus und setze das Starten fort.
Nun solltest du deine Kernelkonfiguration korrigieren 
und einen eigenen Kernel kompilieren. 
Siehe <a href="faq5.html#Building">Einen eigenen Kernel kompilieren
</a> f&uuml;r weitere Hilfe.


<p>
<a name= "VerboseBoot"></a>
<a name="5.6"></a>
<h2>5.6 - Mehr Lognachrichten w&auml;hrend des Startens</h2>


<p>
Mehr Lognachrichten w&auml;hrend des Startens zu bekommen kann sehr 
hilfreich sein, wenn man Bootprobleme l&ouml;sen will. 
Wenn du ein Problem hast und du zu wenig Informationen beim Starten 
erh&auml;ltst, dann gib beim Starten bei "boot&gt;" wieder "-c" ein, 
um zur UKC zu gelangen, dann:


<blockquote>
<pre>
UKC&gt; <strong>verbose</strong>
autoconf verbose enabled
UKC&gt; <strong>quit</strong>
</pre>
</blockquote>

<p>
Nun wirst du extrem ausf&uuml;hrliche Meldungen beim Booten erhalten.


<p>
<a name= "config"></a>
<a name="5.7"></a>
<h2>5.7 - Mittels config(8) deine Kernelbin&auml;rdatei ver&auml;ndern</h2>
<p>
Die <b>-e</b> und <b>-u</b> Options von
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&sektion=8&format=html">config(8)</a>.
k&ouml;nnen sehr hilfreich sein, und Zeit sparen, die du mit dem 
Neukompilierewn von Kerneln verschwenden w&uuml;rdest.
Die <b>-e</b> Option erlaubt dir die UKC auf einem laufenden System zu 
benutzen. Die &Auml;nderungen werden dann beim n&auml;chsten Reboot wirksam. 
Die <b>-u</b> Option testet, ob irgendwelche &Auml;nderungen 
am laufenden Kernel w&auml;hrend des Bootens gemacht wurden. 
D.h., ob du mittels <b>boot -c</b> die UKC beim Starten benutzt hast.


<p>
Das folgende Beispiel zeigt das Deaktivieren des ep* Ger&auml;tes im
Kernel. Zur Sicherheit mu&szlig;t du die 
<b>-o</b> Option benutzen, die die &Auml;nderung in die angegebene Datei schreibt. 
Z.B.: <strong>config -e -o bsd.new /bsd</strong> wird die &Auml;nderungen 
in bsd.new schreiben. Das folgende Beispiel verwendet die <b>-o</b> Option nicht,
daher werden die &Auml;nderungen einfach ignoriert und nicht in 
eine Kernelbin&auml;rdatei geschrieben. 
F&uuml;r weitere Informationen &uuml;ber Fehler- und Warnmeldungen 
siehe die 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&sektion=8&format=html">config(8)</a>
Manualseite.


<blockquote>
<pre>
$ <strong>sudo config -e /bsd</strong>
OpenBSD 3.2 (GENERIC) #25: Thu Oct  3 19:51:53 MDT 2002
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
warning: no output file specified
Enter 'help' f&uuml;r information
ukc&gt; ?
        help                            Command help list
        add         dev                 Add a device
        base        8|10|16             Base on large numbers
        change      devno|dev           Change device
        disable     attr val|devno|dev  Disable device
        enable      attr val|devno|dev  Enable device
        find        devno|dev           Find device
        list                            List configuration
        lines       count               # of lines per page
        show        [attr [val]]        Show attribute
        exit                            Exit, mitout saving changes
        quit                            Quit, saving current changes
        timezone    [mins [dst]]        Show/change timezone
        nmbclust    [number]            Show/change NMBCLUSTERS
        cachepct    [number]            Show/change BUFCACHEPERCENT
        nkmempg     [number]            Show/change NKMEMPAGES
        shmseg      [number]            Show/change SHMSEG
        shmmaxpgs   [number]            Show/change SHMMAXPGS
ukc&gt; <strong>list</strong>
  0 audio* at sb0|sb*|gus0|pas0|sp0|ess*|wss0|wss*|ym*|eap*|eso*|sv*|neo*|cmpci*|clcs*|clct*|auich*|autri*|auvia*|fms*|uaudio*|maestro*|esa*|yds*|emu* flags 0x0
  1 midi* at sb0|sb*|opl*|opl*|opl*|opl*|ym*|mpu*|autri* flags 0x0
  2 nsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  3 nsphyter* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  4 qsphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  5 inphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  6 iophy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  7 eephy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
  8 exphy* at aue*|xe*|ef*|gx*|stge*|bge*|nge*|sk*|ste*|sis*|sf*|wb*|tx*|tl*|vr*|ne0|ne1|ne2|ne*|ne*|ne*|dc*|dc*|rl*|fxp*|fxp*|xl*|xl*|ep0|ep0|ep0|ep*|ep*|ep*|ep*|ep* phy -1 flags 0x0
[...snip...]
--- more ---   
[snip]
ukc&gt; <strong>disable ep</strong>
 65 ep0 disabled
 66 ep* disabled
 67 ep* disabled
149 ep0 disabled
150 ep0 disabled
151 ep* disabled
152 ep* disabled
202 ep* disabled
ukc&gt; <strong>quit</strong>
not forced
</pre>
</blockquote>

<p>
Im obigen Beispiel werden alle ep* Ger&auml;te im Kernel deaktiviert und werden 
auch nicht abgefragt. In einigen Situationen, in denen du die UKC beim 
Booten mittels <b>boot -c</b> benutzt hast, willst du diese &Auml;nderungen dauerhaft 
niederschreiben. Daf&uuml;r brauchst du die <b>-u</b> Option.
Im folgenden Beispiel wurde die UKC gestartet und das 
wi(4) Ger&auml;t deaktiviert. Da diese &Auml;nderung mit boot -c NICHT dauerhaft sind, 
m&uuml;ssen die &Auml;nderungen erst geschrieben werden. Dieses Beispiel schreibt die 
&Auml;nderung in boot -c in eine neue Kernelbin&auml;rdatei namens bsd.new.


<blockquote>
<pre>
$ <strong>sudo config -e -u -o bsd.new /bsd</strong>
OpenBSD 3.2 (GENERIC) #25: Thu Oct  3 19:51:53 MDT 2002
    deraadt@i386.openbsd.org:/usr/src/sys/arch/i386/compile/GENERIC
Processing history...
105 wi* disabled
106 wi* disabled
Enter 'help' for information
ukc&gt; <strong>quit</strong>
</pre>
</blockquote>


<p>
<font color= "#0000e0">
<a href="index.html">[Zur&uuml;ck zum Hauptindex]</a>
<a href="faq4.html">[Zu Kapitel 4.0 - Installationsleitfaden]</a>
<a href="faq6.html">[Zu Kapitel 6.0 - Netzwerk Einstellungen]</a>
</font>


<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[zur&uuml;ck]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq5.html,v 1.73 ]
<br>
$Translation: faq5.html,v 1.42 2002/11/01 19:45:21 jufi Exp $
<br>
</small>
<small>$OpenBSD: faq5.html,v 1.39 2002/11/01 19:56:44 jufi Exp $</small>
</body>
</html>
