<html>
<head>
<title>5.0 - Kernelkonfiguration</title>
<link rev= "made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-2000 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000" link= "#23238E">

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<h2><font color=#e00000>5.0 - Kernelkonfiguration</font><hr></h2>
</p>

<p>
<ul><h3>Inhaltsverzeichnis</h3>
<li><a href= "faq5.html#5.1">5.1 - Warum brauche ich einen selber kompilierten Kernel?</a></li>
<li><a href= "faq5.html#5.2">5.2 - Kernelkonfigurationsoptionen</a></li>
<li><a href= "faq5.html#5.3">5.3 - Einen eigenen Kernel kompilieren</a></li>
<li><a href= "faq5.html#5.4">5.4 - Boot-time Konfiguration</a></li>
<li><a href= "faq5.html#5.5">5.5 - Mehr Lognachrichten w&auml;hrend des Startens</a></li>
<li><a href= "faq5.html#5.6">5.6 - Mittels config(8) deine Kernelbin&auml;rdatei ver&auml;ndern</a>
</ul>
</p>
<hr>
<br>

<p>
<a name= "5.1"></a>
<h2>5.1 - Warum brauche ich einen selber kompilierten Kernel?</h2>
</p>

<p>
Es gibt daf&uuml;r mehrere Gr&uuml;nde, obwohl das Kompilieren eines eigenen Kernels
eher f&uuml;r erfahrenere Benutzer geeignet ist, die bereits ein gutes 
Allgemeinverst&auml;ndnis vom System besitzen. 

<ul>
    <li>Dein Computer hat sehr wenig Hauptspeicher, den du so gut wie 
m&ouml;glich ausn&uuml;tzen willst, indem du nicht ben&ouml;tigte Ger&auml;tetreiber 
entfernst. 
    <li>Standardoptionen entfernen oder Optionen hinzuf&uuml;gen, die
nicht standardm&auml;&szlig;ig aktiviert sind. 
    <li>Experimentelle Optionen hinzuf&uuml;gen. 
</ul>
</p>
<p>
In den meisten F&auml;llen wirst du keinen eigenen Kernel kompilieren m&uuml;ssen.  
Ein GENERIC Kernel wird normalerweise alles beinhalten, das du brauchst. Es gibt sogar mehrere Gr&uuml;nde, warum du keinen eigenen Kernel kreieren willst. 
Der Hauptgrund ist, da&szlig; man zwar logisch aussehende &Auml;nderungen an der
Kernelkonfiguration auf einfache Weise durchf&uuml;hren kann, aber dein
Kernel funktioniert dann nicht. 
Dies soll ein Warnsignal sein. Wenn etwas nicht zu funktionieren 
scheint, dann probiere bitte vorher einen 
GENERIC Kernel zu starten, bevor du einen Fehlerbericht einschickst. 
</p>

<p>
<a name= "5.2"></a>
<h2>5.2 - Kernelkonfigurationsoptionen</h2>
</p>

<p>
Kernelkonfigurationsoptionen bieten dir die M&ouml;glichkeit, zus&auml;tzliche 
Unterst&uuml;tzung zu deinem Kernel hinzuzuf&uuml;gen. Dies erlaubt dir, nur 
die von dir gew&uuml;nschten Ger&auml;te zu unterst&uuml;tzen. Es gibt eine Vielzahl 
von M&ouml;glichkeiten, deinen Kernel auf deine W&uuml;nsche abzustimmen. 
Hier werden wir nur auf einige der am h&auml;ufigsten benutzten 
M&ouml;glichkeiten eingehen. 
Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&apropos=0&sektion=4&format=html">options(4)</a>
f&uuml;r eine komplette Liste der Optionen. Es stehen auch Beispielkonfigurationsdateien f&uuml;r deine Architektur bereit. 
</p>

<P>
Nicht alle Kerneloptionen sind auf Kompatibilit&auml;t mit allen anderen 
Optionen getestet worden. Daher solltest du keine Option in deinem 
Kernel setzen, wenn du nicht einen triftigen Grund daf&uuml;r hast! 
Am meisten wird der GENERIC Kernel getestet. Dies ist normalerweise 
die Kombination der Optionen in /usr/src/sys/arch/&lt;deine Arch&gt;/conf/GENERIC 
und /usr/src/sys/conf/GENERIC. 
</P>

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/alpha/conf/">Alpha Kernel Konfgurationsdateien </a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/i386/conf/">i386 Kernel Konfigurationsdateien</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/mac68k/conf/">mac68k Kernel Konfigurationsdateien</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/pmax/conf/">pmax Kernel Konfigurationsdateien</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/sparc/conf/">sparc Kernel Konfigurationsdateien</a></li>
<li><a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/arch/">Andere Architekturen</a></li>
</ul>
</p>

<p>
Wenn du diese Dateien genauer betrachtest, dann wird dir eine Zeile 
wie diese auffallen:<br>
<strong>include "../../../conf/GENERIC"</strong><br>
Dies bedeutet, da&szlig; ein Verweis auf eine andere Konfigurationsdatei 
vorhanden ist. 
Diese Datei beinh&auml;lt architekturunabh&auml;ngige Optionen. Wenn du also 
deinen eigenen Kernel konfigurieren willst, dann mu&szlig;t du auch 
<a href="http://www.openbsd.org/cgi-bin/cvsweb/src/sys/conf/GENERIC">/sys/conf/GENERIC</a> 
beachten. Dort SIND Optionen enthalten, die BEN&Ouml;TIGT werden. 
</p>

<p>
Alle nachfolgend aufgelisteten Optionen sollten in deiner Kernelkonfigurationsdatei im Format von:<br>
<strong>option      OPTION</strong><br>
angef&uuml;hrt sein. Um die Option debug im Kernel zu plazieren, f&uuml;ge eine
Zeile wie diese ein:<br>
<strong>option	    DEBUG</strong><br>
Die Optionen im OpenBSD Kernel werden in Compilerpr&auml;prozessoroptionen &uuml;bersetzt, daher w&uuml;rde eine Option wie DEBUG den Quelltext mit der Option -DDEBUG kompilieren, was einem #define DEBUG im Kernel entspricht.
</p>

<p>
OpenBSD hat viele Kompatibilit&auml;tsm&ouml;glichkeiten, die dir erlauben, 
Bin&auml;rdateien von anderen Betriebsystemen auszuf&uuml;hren.
Nicht alle Optionen sind auf jeder Architektur vorhanden, daher lies 
die entsprechende Manualseite, ob die Architektur unterst&uuml;tzt wird.
</p>
<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_svr4&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_SVR4(8)</a> - Kompatibilit&auml;t mit SVR4 Bin&auml;rdateien.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_bsdos&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_BSDOS(8)</a> - Kompatibilit&auml;t mit BSD/OS Bin&auml;rdateien.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_LINUX(8)</a> - Kompatibilit&auml;t mit Linux Bin&auml;rdateien.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_sunos&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_SUNOS(8)</a> - Kompatibilit&auml;t mit SunOS Bin&auml;rdateien.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ultrix&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_ULTRIX(8)</a> - Kompatibilit&auml;t mit Ultrix Bin&auml;rdateien.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_freebsd&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_FREEBSD(8)</a> - Kompatibilit&auml;t mit FreeBSD Bin&auml;rdateien.</li>
<li>COMPAT_HPUX - Kompatibilit&auml;t mit HP-UX Bin&auml;rdateien. Nur auf einigen m68k Architekturen.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_ibcs2&sektion=8&apropos=0&manpath=OpenBSD+Current">COMPAT_IBCS2(8)</a> - Kompatibilit&auml;t mit ibcs2 Bin&auml;rdateien.</li>
<li>COMPAT_OSF1 - F&uuml;r Digital Unix Bin&auml;rdateien. Nur auf Alpha Plattform.</li>
<li>COMPAT_43 - Kompatibilit&auml;t mit 4.3BSD. Von dessen Gebrauch wird zwar abgeraten, aber wird f&uuml;r unseren Navigator port ben&ouml;tigt. </li>
<li>COMPAT_11 - Kompatibilit&auml;t mit NetBSD 1.1</li>
<li>COMPAT_NOMID - Kompatibilit&auml;t mit a.out executables ohne machine id.
</ul>
</p>

<p>
Es ist immer hilfreich, Probleme mit dem Kernel debuggen zu k&ouml;nnen. 
Aber viele wollen diese Optionen nicht in ihren Kernel setzen, weil 
diese Optionen den Kernel sehr vergr&ouml;&szlig;ern. Sie sind aber extrem 
hilfreich im Falle eines Fehlers.
Ein Entwickler wird die Quelle deiner Probleme viel schneller finden 
k&ouml;nnen. 
Hier eine Liste der debug Optionen: 
</p>

<p>
<ul>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ddb&sektion=4&format=html">DDB</a> - Kernelinterner Debugger. Nicht auf allen Plattformen. Daher konsultiere die Manualseite.</li>
<li><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gdb&sektion=1&format=html">KGDB</a> - Kompiliert einen `remote kernel debugger` mittels `remote target` Option von gdb.</li>
<li>makeoptions  DEBUG="-g" - Erzeugt bsd.gdb gemeinsam mit bsd. Dies ist n&uuml;tzlich, um crash dumps mit gdb zu debuggen.</li>
<li>DEBUG - Diverse debugging Optionen im Kernel, die im Quelltext definiert wurden.</li>
<li>KTRACE - F&uuml;gt "hooks" f&uuml;r "system call tracing facility" ein. Dies erlaubt den Benutzern: <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ktrace&sektion=1&format=html">ktrace(1)</a>.</li>
<li>DIAGNOSTIC - F&uuml;gt Code im Kernel f&uuml;r interne Konsistenz&uuml;berpr&uuml;fungen ein.</li>
<li>GPROF - F&uuml;gt Code im Kernel f&uuml;r Kernelprofilierung mit <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kgmon&sektion=8&format=html">kgmon(8)</a> ein.</li>
<li>makeoptions PROF="-pg" - Die -pg Option dient zur Unterst&uuml;tzung von "profiling" im Kernel. Die Option GPROF wird daf&uuml;r ben&ouml;tigt.</li>
</ul>
</p>

<p>
<strong>Dateisystemoptionen.</strong>
<ul>
<li>FFS - Berkeley Fast Filesystem. <strong>ANMERKUNG:</strong> Diese Option wird ben&ouml;tigt.</li>
<li>EXT2FS - Second Extended File System, ben&ouml;tigt f&uuml;r das Lesen von Linux Partitionen.</li>
<li>MFS - Memory File System, speichern von Dateien in swap - Speicher.</li>
<li>NFS - Network File System, ben&ouml;tigt f&uuml;r NFS.</li>
<li>CD9660 - Das iso9660 + rockridge Dateisystem; zum Lesen von CDs.</li>
<li>MSDOSFS - Ben&ouml;tigt, um MS-DOS FAT Dateisysteme zu lesen; bietet Unterst&uuml;tzung f&uuml;r Windows 95 (lange Dateinamen + Gro&szlig;-/Kleinschreibungerweiterungen).</li>
<li>FDESC - Beinhaltet Code f&uuml;r ein Dateisystem, das auf /dev/fd gemountet werden kann.</li>
<li>KERNFS - Beinhaltet Code f&uuml;r das Mounten eines speziellen Dateisystemes (normalerweise auf /kern), in dem sich Dateien befinden, die spezielle Kernelvariablen und -parameter repr&auml;sentieren.</li>
<li>NULLFS - Code f&uuml;r ein loopback Dateisystem. In <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=mount_null&sektion=8&format=html">mount_null(8)</a> hat dazu weitere Informationen</li>
<li>PROCFS - Beinhaltet Code f&uuml;r ein spezielles Dateisystem (normalerweise auf /proc)</li>
<li>PORTAL - Beinhaltet das (experimentelle) portal Dateisystem.  Dies erlaubt interessante Tricks wie TCP sockets durch das &Ouml;ffnen von Dateien im Dateisystem zu &ouml;ffnen.</li>
<li>UMAPFS - Beinhaltet ein loopback Dateisystem, in dem Benutzer- und Gruppenids umgelegt werden d&uuml;rfen -- n&uuml;tzlich, wenn man fremde Dateisysteme mit anderen uids und gids als das lokale System mounten will (zB.: NFS).</li>
<li>UNION - Beinhaltet Code f&uuml;r das union Dateisystem, welches das Mounten von Verzeichnissen &uuml;bereinander erlaubt, so da&szlig; beide Dateisysteme sichtbar bleiben. Dieser Code ist noch nicht sehr stabil.</li>
<li>XFS - F&uuml;gt "hooks" f&uuml;r ein Dateisystem ein, das kompatibel mit dem AFS Dateisystem ist. Derzeit vom Arla/AFS Code benutzt.</li>
<li>LFS - Log Structured Filesystem.</li>
<li>FFS_SOFTUPDATES - Erlaubt den Gebrauch von softupdates. Hier mehr dazu: <a href="../faq14.html#14.5">Softupdates FAQ</a>.
<li>NFSSERVER - Serverseitiger NFS Code im Kernel.</li>
<li>NFSCLIENT - Klientseitiger NFS Code im Kernel.</li>
<li>FIFO - Unterst&uuml;tzung f&uuml;r FIFOs.. EMPFOHLEN.</li>
<li>NVNODE=integer - Wobei integer eine Ganzzahl ist, die der Gr&ouml;&szlig;e des Caches bei name-to-inode &Uuml;bersetzungsroutinen entspricht (dh. der namei() Cache, obwohl er auch von vielen anderen Funktionen im Kernelquelltext aufgerufen wird).</li>
<li>EXT2FS_SYSTEM_FLAG - Diese Option &auml;ndert das Verhalten der APPEND- und der IMMUTABLE-option f&uuml;r Dateien in einem 
EXT2FS-Dateisystem. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&sektion=4&format=html">options(4)</a> f&uuml;r 
weitere Details.</li>

<li>QUOTA - Unterst&uuml;tzung f&uuml;r Quoten im Dateisystem. Hier mehr dazu: <a href="../faq10.html#10.10">FAQ 10</a>.</li>
</ul>
</p>

<p>
<strong>Diverse Optionen</strong>
<ul>
<li>PCIVERBOSE - Mehr Details w&auml;hrend des Startprozesses von PCI Ger&auml;ten.</li>
<li>EISAVERBOSE - Mehr Details w&auml;hrend des Startprozesses von EISA Ger&auml;ten.</li>
<li>PCMCIAVERBOSE - Mehr Details w&auml;hrend des Startprozesses von PCMCIA Ger&auml;ten.</li>
<li>APERTURE - Liefert kernelinterne Unterst&uuml;tzung f&uuml;r VGA Bildzwischenspeicher durch Umlegen von Benutzerprozessen. Ben&ouml;tigt f&uuml;r X.</li>
<li>XSERVER - Unterst&uuml;tzung f&uuml;r die X Server Konsolentreiber. Ben&ouml;tigt f&uuml;r X.</li>
<li>LKM - Unterst&uuml;tzung f&uuml;r Loadable Kernel Modules (ladbare Kernelmodule). Nicht auf allen Architekturen. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=lkm&sektion=4&format=html">lkm(4)</a> f&uuml;r weitere Informationen.</li>
<li>INSECURE - Setzt das Kernelsicherheitsniveau auf -1. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=init&sektion=8&format=html">init(8)</a> f&uuml;r weitere Informationen bez&uuml;glich der Kernelsicherheitseinstellungen.</li>
<li>MACHINE_NONCONTIG - &Auml;ndert Teile des VM/pmap Interfaces, um "non-contiguous memory" zu erlauben.</li>
<li>RAM_DISK_HOOKS - Erlaubt den Aufruf von rechnerabh&auml;ngigen Funktionen, wenn der Ramdisktreiber konfiguriert ist.</li>
<li>RAM_DISK_IS_ROOT - Zwingt die Ramdisk, root zu sein.</li>
<li>CCDNBUF=integer - Setzt die Anzahl des "component buffers" von CCD(4). Standard ist 8. F&uuml;r mehr &uuml;ber CCD siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ccd&sektion=4&format=html">CCD(4)</a> oder das <a href="../faq11.html#11.2">Performancetuning FAQ Kapitel.</a></li>
<li>KMEMSTATS - Damit unterh&auml;lt malloc(9) (kernel memory allocator) Statistiken &uuml;ber seinen Gebrauch. Wenn die Option DEBUG benutzt wird, wird diese Option automatisch von config aktiviert. </li>
<li>BOOT_CONFIG - F&uuml;gt die Unterst&uuml;tzung f&uuml;r die -c boot Option ein.</li>
</ul>
</p>

<p>
<strong>Netzwerkoptionen</strong><br>
Siehe auch das <a href="faq6.html">Netzwerk FAQ</a> oder das <a href="../faq11.html#11.1">Netzworking Performancetuning FAQ</a>.
<ul>
<li>GATEWAY - Erm&ouml;glich IPFORWARDING und erh&ouml;ht (auf den meisten Plattformen) die Gr&ouml;&szlig;e der NMBCLUSTERS.</li>
<li>NMBCLUSTERS=integer - Steuert die Gr&ouml;&szlig;e der mbuf cluster map. </li>
<li>IPFORWARDING - Erm&ouml;glich IP routing Verhalten.  Wenn diese Option aktiviert ist, wird der Rechner IP Datagramme zwischen seinen Netzwerkkarten weiterleiten, die f&uuml;r andere Rechner bestimmt sind.</li>
<li>MROUTING - Beinhaltet Unterst&uuml;tzung f&uuml;r IP multicast Router.</li>
<li>INET - Beinhaltet Unterst&uuml;tzung f&uuml;r den TCP/IP protocol stack. Diese Option wird BEN&Ouml;TIGT.</li>
<li>MCLSHIFT=Wert - Diese Option ist der Logarithmus zur Basis 2 der Gr&ouml;&szlig;e des mbuf clusters. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=options&sektion=4&format=html">options(4)</a> f&uuml;r mehr Information &uuml;ber diese Option.</li>
<li>NS - Inkludiere Unterst&uuml;tzung f&uuml;r den Xerox XNS protocol stack.  Siehe <A HREF="http://www.openbsd.org/cgi-bin/man.cgi?query=ns&sektion=4&apropos=0&manpath=OpenBSD+Current">ns(4)</a>.</li>
<li>ISO,TPIP - Inkludiere Unterst&uuml;tzung f&uuml;r den allgegenw&auml;rtigen OSI protocolstack. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=iso&sektion=4&format=html">iso(4)</a> f&uuml;r mehr Information.</li>
<li>EON - Inkludiere Unterst&uuml;tzung f&uuml;r OSI tunneling &uuml;ber IP.</li>
<li>CCITT,LLC,HDLC - Inkludiere Unterst&uuml;tzung f&uuml;r den X.25 protocol stack.</li>
<li>IPX, IPXIP - Inkludiere Unterst&uuml;tzung f&uuml;r: Internetwork Packet Exchange protocol, das von Novell NetWare verwendet wird.</li>
<li>NETATALK - Inkludiere Kernelunterst&uuml;tzung f&uuml;r die AppleTalk Protokolfamilie.</li>
<li>TCP_COMPAT_42 - Vom Gebrauch dieser Option wird sehr abgeraten, daher sollte sie auch nicht aktiviert werden: TCP Fehlerkompatibilit&auml;t mit 4.2BSD. In 4.2BSD waren die TCP Sequenzzahlen 32-bit signierte Werte.  Moderne Implementationen des TCP verwenden unsignierte Werte.</li>
<li>TCP_NEWRENO - Aktiviert "NewReno fast recovery phase", welche die Wiederherstellung eines verlorenen Segmentes pro R&uuml;cklaufzeit erlaubt.</li>
<li>TCP_SACK - Aktiviert selektive Best&auml;tigungen.</li>
<li>TCP_FACK - Aktiviert weiterleitende Best&auml;tigungen, die pr&auml;zisere Sch&auml;tzungen &uuml;ber noch ausstehende Daten w&auml;hrend der "fast recovery phase" mittels SACK Informationen erlauben. Diese Option kann gemeinsam mit TCP_SACK benutzt werden.</li>
<li>IPFILTER - Diese Option aktiviert IP Filterung auf Paketebene mit ip-filter.</li>
<li>IPFILTER_LOG - Diese Option (zusammen mit IPFILTER) aktiviert das Loggen von IP Paketen mittels ip-filter.</li>
<li>IPFILTER_DEFAULT_BLOCK - Diese Option setzt die Standardrichtlinie von ip-filter. Wenn diese gesetzt ist, dann wird ip-filter standardm&auml;&szlig;ig Pakete blockieren.</li>
<li>PPP_FILTER - Diese Option aktiviert auf <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=pcap&sektion=3&format=html">pcap(3)</a> basierende Filterung f&uuml;r PPP Verbindungen.</li>
<li>PPP_BSDCOMP - PPP BSD Kompression.</li>
<li>PPP_DEFLATE - Wird gemeinsam mit PPP_BSDCOMP verwendet.
<li>IPSEC - Diese Option erm&ouml;glicht die Unterst&uuml;tzung des IP security protocol. Siehe <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ipsec&sektion=4&format=html">ipsec(4)</a> f&uuml;r mehr Details. Dies impliziert nun die Option KEY, welche Unterst&uuml;tzung f&uuml;r PFKEYv2 bietet.</li> 
<li>ENCDEBUG - Diese Option erm&ouml;glicht, da&szlig; Debuginformationen aufgezeichnet werden, wenn IPSEC Fehler bemerkt.</li>
</ul>
</p>

<p>
<strong>SCSI Subsystemoptionen</strong>
<ul>
<li>SCSITERSE - Knappere SCSI Fehlermeldungen.  Dies l&auml;&szlig;t die Tabelle, um ASC/ASCQ Informationen zu dekodieren, aus, was etwa 8 Bytes einspart.</li>
<li>SCSIDEBUG - Druckt zus&auml;tzliche Debuginformationen f&uuml;r das SCSI Subsystem auf die Konsole.</li>
</ul>
</p>


<p> <a name= "5.3"></a>
<h2>5.3 - Einen eigenen Kernel kompilieren</h2>
</p>

<p>
Vollst&auml;ndige Instruktionen zum Kreieren deines eigenen Kernels findest du hier in
<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=afterboot&apropos=0&sektion=8&format=html">
afterboot(8)</a>.
</p>

<p>
Um deinen eigenen Kernel von Cdrom zu kompilieren, mu&szlig;t du zun&auml;chst den Quelltext haben. 
Daf&uuml;r ben&ouml;tigst du nur den Kernelquelltext, den du auf der CD findest. 
So kopierst du den Quelltext von CD (CD1 ist hier im Beispiel unter /mnt gemountet.): 
</p>

<ul>
<pre>
# <strong>mkdir -p /usr/src/sys</strong>
# <strong>cd /mnt/sys</strong>
# <strong>tar cf - . | ( cd /usr/src/sys; tar xvf - )</strong>
</pre>
</ul>

<p>
Am einfachsten ist es, mit einem GENERIC 
Kernel zu beginnen. Dieser befindet sich unter <i>/usr/src/sys/arch/${arch}/conf/GENERIC</i>,
wobei ${arch} deine Architektur ist. In diesem Verzeichnis befinden sich auch weitere 
Beispielskonfigurationen. 
Hier zwei Beispiele f&uuml;rs Kompilieren deines Kernels.
Das erste Beispiel behandelt das Kompilieren von einem 
Quelltextbaum, der nur Leseberechtigung hat. Das zweite Beispiel zeigt, wie es auf einem 
Quelltextbaum mit Schreibberechtigung funktioniert.
</p>

<ul> 
<pre>
# <strong>cd /irgendwo</strong>
# <strong>cp /usr/src/sys/arch/$ARCH/conf/IRGENDEINEDATEI .</strong>
# <strong>vi IRGENDEINEDATEI</strong> (um deine gew&uuml;nschten &Auml;nderung durchzuf&uuml;hren)
# <strong>config -s /usr/src/sys -b . IRGENDEINEDATEI</strong>
<ul>
# <strong>make depend</strong> 
<ul>
(Der obige Schritt ist notwendig, wenn du irgendwelche &Auml;nderungen [inkl. Updates 
und Patches] an deinem Kernelquelltextbaum durchgef&uuml;hrt hast.  Dieser Schritt kann 
ignoriert werden, wenn du dem n&auml;chsten Schritt folgst.)
</ul>
<font size="+1">
<b><i>ODER</i></b>
</font>
# <strong>make clean</strong>
<ul>
(Der obige Schritt ist notwendig, wenn du irgendwelche &Auml;nderungen an 
Kernelkonfigurationsoptionen durchf&uuml;hrst und er ist auch empfohlen, wenn du 
gr&ouml;&szlig;ere Updates an deinem Quelltextbaum vornimmst. Ansonsten kannst du diesen 
Schritt &uuml;berspringen und 'make depend' eingeben.)
</ul>
</ul>
# <strong>make</strong>
</pre>
</ul>

<p>
Um einen Kernel von einem Quelltextbaum mit Schreibberechtigung zu bauen, tue folgendes:
</p>

<ul>
<pre>
# <strong>cd /sys/arch/$ARCH/conf</strong>
# <strong>vi IRGENDEINEDATEI</strong> (um deine gew&uuml;nschten &Auml;nderung durchzuf&uuml;hren)
# <strong>config IRGENDEINEDATEI</strong> (hier mehr dar&uuml;ber : <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=config&apropos=0&sektion=8&format=html">config(8)</a>)
# <strong>cd ../compile/IRGENDEINEDATEI</strong>
# <strong>make</strong> 
</pre>
</ul>

<p>
Wobei $ARCH f&uuml;r die von dir benutzte Architektur ist (z.B. i386). Du kannst auch 
ein <strong>make depend</strong> durchf&uuml;hren, um die Abh&auml;ngigkeiten f&uuml;rs n&auml;chste
Kernelkompilieren zu schaffen. 
</p>

<p>
Jetzt mu&szlig; der Kernel noch an den richtigen Platz.
</p>

<ul>
<pre>
# <strong>cp /bsd /bsd.old</strong>
# <strong>cp /sys/arch/$ARCH/compile/IRGENDEINEDATEI/bsd /bsd</strong>
</pre>
</ul>

<p>
Um deinen alten Kernel zu starten, mu&szlig;t du nur 
</p>

<ul>
<pre>
boot> <strong>bsd.old</strong>
</pre>
</ul>

<p>
beim Starten eingeben, und dein alter Kernel wird anstelle von /bsd geladen.
</p>

<p>
Manchmal wirst du auch neue Bootbl&ouml;cke installieren m&uuml;ssen, wenn du einen Kernel 
gebaut hast. Um dies zu tun, siehe <a href="../faq14.html#14.8">
FAQ 14.8 &Uuml;ber den OpenBSD's Bootloader</a>. Dies wird dir eine &Uuml;bersicht vom Gebrauch 
des OpenBSD Bootloaders geben.
</p>

<p>
<a name="5.4"></a> 
<h2>5.4 - Boot-Time Konfiguration </h2>
</p>

<p>
Manchmal findet der Kernel beim Booten dein Ger&auml;t, aber eventuell den falschen
IRQ. Und vielleicht brauchst du dieses Ger&auml;t sofort. Nun, ohne den Kernel neu zu 
bauen, kannst du mit der OpenBSD eigenen Boot-Time Konfiguration dieses Problem 
l&ouml;sen. Dies wird aber dein Problem nur einmal l&ouml;sen. Wenn du rebootest, dann 
mu&szlig;t du diese Prozedur wiederholen. Daher ist dies nur als vor&uuml;bergehende L&ouml;sung 
gedacht, und du solltest das Problem durch das Neukompilieren deines eigenen 
Kernels l&ouml;sen. 
Dein Kernel wird die <strong>option BOOT_CONFIG</strong> ben&ouml;tigen, die GENERIC 
bereits beinh&auml;lt.
</p>

<p>
Den Gro&szlig;teil dieses Dokumentes kannst du in der Manualseite 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot_config&apropos=0&sektion=8&format=html">boot_config(8)</a> finden.
</p>

Um in die Benutzerkernelkonfiguration (User Kernel Config) oder UKC zu gelangen, mu&szlig;t 
du beim Starten die -c Option verwenden.

<ul><pre>
boot> <strong>boot wd0a:/bsd -c</strong>
</pre></ul>

<p>
Oder welchen Kernel du auch immer laden willst. So kommst du in die 
UKC. Hier kannst du Befehle ausf&uuml;hren, die kernelspezifische Ger&auml;te 
&auml;ndern oder deaktivieren.
</p>

<p>
Hier eine Liste der g&auml;ngigen Befehle in der UKC.
</p>

<CODE>
<p>
add <strong>device</strong> - F&uuml;ge ein Ger&auml;t durch Kopieren eines anderen hinzu 
</p>

<p>
change <strong>devno | device </strong> - &Auml;ndere ein oder mehrere Ger&auml;te
</p>

<p>
disable <strong>devno | device </strong> - Deaktiviere ein oder mehrere Ger&auml;te 
</p>

<p>
enable <strong>devno | device </strong> - Aktiviere ein oder mehrere Ger&auml;te 
</p>

<p>
find <strong>devno | device </strong> - Suche ein oder mehrere Ger&auml;te
</p>

<p>
help - Kurze Zusammenfassung dieser Befehle
</p>

<p>
list - Liste ALLE bekannten Ger&auml;te auf
</p>

<p>
exit/quit - Setze Starten fort
</p>

<p>
show <strong>[attr [val]]</strong> - Zeige alle Ger&auml;te mit Eigenschaft (attribute) und optional mit einem spezifierten Wert (value)
</p></CODE>

<p>
Wenn du einmal dein Ger&auml;t konfiguriert hast, dann steige mit quit oder exit aus UKC aus 
und setze das Starten fort.
Nun solltest du deine Kernelkonfiguration korrigieren und einen eigenen Kernel 
kompilieren. 
Siehe <a href="faq5.html#5.3">Einen eigenen Kernel kompilieren
</a> f&uuml;r weitere Hilfe.
</p>

<a name="5.5"></a>
<h2>5.5 - Mehr Lognachrichten w&auml;hrend des Startens</h2>


<p>
Mehr Lognachrichten w&auml;hrend des Startens zu bekommen kann sehr hilfreich sein, wenn man 
Bootprobleme l&ouml;sen will. Wenn du ein Problem hast und du zuwenig Informationen beim 
Starten erh&auml;ltst, dann gib beim Starten bei "boot>" wieder "-c" ein, um zur UKC zu gelangen, dann:


<ul><pre>
UKC> <strong>verbose</strong>
autoconf verbose enabled
UKC> <strong>quit</strong>
</pre></ul>

<p>
Nun wirst du extrem ausf&uuml;hrliche Meldungen beim Booten erhalten.
</p>

<a name="5.6"></a>
<h2>5.6 - Mittels config(8) deine Kernelbin&auml;rdatei ver&auml;ndern</h2>

<p>
Mit der Version 2.6 kamen die Optionen <b>-e</b> und <b>-u</b> zu 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&sektion=8&format=html">config(8)</a>.
Diese Optionen k&ouml;nnen extrem hilfreich sein und Zeit einsparen, die du sonst zum 
Kernelkompilieren ben&ouml;tigst. 
Die <b>-e</b> Option erlaubt dir die UKC auf einem laufenden System zu 
benutzen. Die &Auml;nderungen werden dann beim n&auml;chsten Reboot wirksam. 
Die <b>-u</b> Option testet, ob irgendwelche &Auml;nderungen am laufenden Kernel w&auml;hrend 
des Bootens gemacht wurden. 
D.h., ob du mittels <b>boot -c</b> die UKC beim Starten benutzt hast.
</p>

<p>
Das folgende Beispiel zeigt das Deaktivieren des ep* Ger&auml;tes aus dem 
Kernel. Zur Sicherheit mu&szlig;t du die 
<b>-o</b> Option benutzen, die &Auml;nderung in die angegebene Datei schreibt. 
Z.B.: <strong>config -e -o bsd.new /bsd</strong> wird die &Auml;nderungen 
in bsd.new schreiben. Das folgende Beispiel verwendet die <b>-o</b> Option nicht,
daher werden die &Auml;nderungen einfach ignoriert und nicht in eine Kernelbin&auml;rdatei geschrieben. 
F&uuml;r weitere Informationen &uuml;ber Fehler- und Warnmeldungen siehe 
die <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=config&sektion=8&format=html">config(8)</a>
Manualseite.
</p>

<ul><pre>
$ <strong>sudo config -e /bsd</strong>
OpenBSD 2.6 (GENERIC) #1: Tue Nov 16 21:25:10 EST 1999
    ericj@oshibana:/usr/src/sys/arch/i386/compile/GENERIC
warning: no output file specified
Enter 'help' f&uuml;r information
ukc> <strong>?</strong>
        help                            Command help list
        add     dev                     Add a device
        base    8|10|16                 Base on large numbers
        change  devno|dev               Change device
        disable attr val|devno|dev      Disable device
        enable  attr val|devno|dev      Enable device
        find    devno|dev               Find device
        list                            List configuration
        lines   count                   # of lines per page
        show    [attr [val]]            Show attribute
        exit                            Exit, mitout saving changes
        quit                            Quit, saving current changes
ukc> <strong>list</strong>
  0 audio* at sb0|sb*|gus0|pas0|sp0|ess*|wss0|wss*|ym*|eap*|eso*|sv*
  1 midi* at sb0|sb*|opl*|opl*|opl*|ym*|mpu*
  2 nsphy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
  3 inphy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
  4 iophy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
  5 exphy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
  6 rlphy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
  7 icsphy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
  8 sqphy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
  9 ukphy* at xe*|ef*|sf*|xl*|tl*|rl*|fxp* phy -1
 10 scsibus* at bt0|bt1|bt2|aha0|aha1|aha*|ahb*|ahc0|ahc*|ahc*|isp*|aic0|aic*|ncr*|adv*|adw*|sea0|uha0|uha1|uha*|wds0|atapiscsi*
 11 cd* at scsibus* target -1 lun -1
 12 ch* at scsibus* target -1 lun -1
 13 sd* at scsibus* target -1 lun -1
 14 st* at scsibus* target -1 lun -1
 15 ss* at scsibus* target -1 lun -1
 16 uk* at scsibus* target -1 lun -1
 17 atapiscsi* at wdc0|wdc1|wdc*|wdc*|pciide* channel -1
--- more ---   
[snip]
ukc> <strong>disable ep</strong>
 31 ep0 disabled
 32 ep* disabled
 33 ep* disabled
 87 ep0 disabled
 88 ep0 disabled
 89 ep* disabled
 90 ep* disabled
136 ep* disabled
ukc> <strong>quit</strong>
not forced
</pre></ul>
</pre></ul>

<p>
Im obigen Beispiel werden alle ep* Ger&auml;te aus dem Kernel entfernt und werden 
auch nicht abgefragt. In einigen Situationen, in denen du die UKC beim 
Booten mittels <b>boot -c</b> benutzt hast, willst du diese &Auml;nderungen dauerhaft 
niederschreiben. Daf&uuml;r brauchst du die <b>-u</b> Option.
Im folgenden Beispiel wurde die UKC gestartet und das 
wi(4) Ger&auml;t deaktiviert. Da diese &Auml;nderung mit boot -c NICHT dauerhaft sind, 
m&uuml;ssen die &Auml;nderungen erst geschrieben werden. Dieses Beispiel schreibt die 
&Auml;nderung in boot -c in eine neue Kernelbin&auml;rdatei namens bsd.new.
</p>

<ul><pre>
$ <strong>sudo config -e -u -o bsd.new /bsd</strong>
OpenBSD 2.6 (GENERIC) #1: Tue Nov 16 21:25:10 EST 1999
    ericj@oshibana:/usr/src/sys/arch/i386/compile/GENERIC
Processing history...
151 wi* disabled
Enter 'help' for information
ukc> <strong>quit</strong>
</pre></ul>


<p>
<font color= "#0000e0">
<a href="index.html">[Zur&uuml;ck zum Hauptindex]</a>
<a href="faq4.html">[Zu Kapitel 4.0 - Installationsleitfaden]</a>
<a href="faq6.html">[Zu Kapitel 6.0 - Netzwerk Einstellungen]</a>
</font>
</p>

<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[zur&uuml;ck]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq5.html,v 1.49 ]
<br>
$Translation: faq5.html,v 1.14 2001/08/14 19:17:46 jufi Exp $
<br>
</small>
<small>$OpenBSD: faq5.html,v 1.14 2001/08/14 21:06:40 jufi Exp $</small>
</body>
</html>
