<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>7 - Tastatur- und Display-Kontrollen</title>
<link rev="made" href="mailto:www@openbsd.org">
<meta name="resource-type" content="document">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta name="description"   content="Die OpenBSD FAQ Seiten - FAQ 7: 
- Tastatur und Display-Kontrollen">
<meta name="keywords"      content="openbsd,faq,tastatur,display">
<meta name="distribution"  content="global">
<meta name="copyright"     content="This document copyright 1998-2003 by OpenBSD.">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
</head>

<!-- Passes validator.w3.org, please keep it this way;
please, use a max of 72 chars per line -->


<body bgcolor="#ffffff" text= "#000000">

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<font color= "#0000e0">
<a href="index.html">[FAQ Index]</a>
<a href="faq6.html">[Zu Sektion 6 - Netzwerk]</a>
<a href="../faq8.html">[Zu Sektion 8 - Allgemeine Fragen]</a>
</font>

<h1><font color="#e00000">7 - Tastatur- und Display-Kontrollen</font></h1>
<hr>

<p>
<blockquote>
<h3>Inhaltsverzeichnis</h3>
</blockquote>
<ul>
<li><a href= "#Keyboard"     >7.1 - Wie ver&auml;ndere ich die Belegung der Tastatur? (wscons)</a>
<li><a href= "#ConsoleMouse" >7.2 - Gibt es so etwas wie gpm f&uuml;r OpenBSD?</a>
<li><a href= "#ConsoleClear" >7.3 - Wie l&ouml;sche ich die Konsole, sobald sich ein User ausloggt?</a>
<li><a href= "#Scrollback"   >7.4 - Auf den Konsolen 'Scrollback Puffer' zugreifen. (alpha/macppc/i386)</a>
<li><a href= "#SwitchConsole">7.5 - Wie wechsele ich die Konsolen? (i386 spezifisch)</a>
<li><a href= "#80x50"        >7.6 - Wie kann ich auf meiner Konsole eine Aufl&ouml;sung von
    80x50 bekommen ? (i386)</a>
<li><a href= "#SerCon"       >7.7 - Wie kann ich eine serielle Konsole benutzen?</a>
<li><a href= "#Blanker"      >7.8 - Gibt es einen "Blank" f&uuml;r die Konsole? (wscons)</a>
</ul>
<hr>

<br>
<p>
<a name= "Keyboard"></a>
<h2>7.1 - Wie ver&auml;ndere ich die Belegung der Tastatur? <i>(wscons)</i></h2>

<p>
Die ports, die den <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&amp;sektion=4">wscons(4)</a> 
Console Treiber benutzen: <a href="../../de/alpha.html">alpha</a>, 
<a href="../hppa.html">hppa</a>,
<a href="../i386.html">i386</a>,
<a href="../macppc.html">macppc</a>,
<a href="../sparc.html">sparc</a>,
und <a href="sparc64.html">sparc64</a>.
<p>

Bei wscons(4) Konsolen werden die meisten Optionen mit dem 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl&amp;sektion=8">wsconsctl(8)</a> 
Utility kontrolliert. Beispielsweise w&uuml;rde man die Tastaturbelegung 
mit Hilfe von <a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl&amp;sektion=8">wsconsctl(8)</a> 
wie folgt &auml;ndern:

<blockquote><pre>
# <strong>wsconsctl -w keyboard.encoding=de</strong>
</pre></blockquote>

<p>
Im n&auml;chsten Beispiel werden wir die &quot;Caps Lock&quot; Taste neu 
belegen, und zwar so, dass sie nun &quot;Control L&quot; ist:

<blockquote><pre>
# <strong>wsconsctl -w keyboard.map+="keysym Caps_Lock = Control_L"</strong>
</pre></blockquote>

<a name= "ConsoleMouse"></a>
<h2>7.2 -  Gibt es so etwas wie gpm f&uuml;r OpenBSD?</h2>

<p>
F&uuml;r die Plattformen the <a href="../../de/alpha.html">alpha</a> und <a href="../../de/i386.html">i386</a> 
bietet OpenBSD den 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsmoused&amp;sektion=8&amp;arch=i386">wsmoused(8)</a>,
einen port des moused(8) von FreeBSD. Er kann beim jedem Booten 
automatisch aktiviert werden, indem du die passende Zeile in
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.conf&amp;sektion=8">rc.conf(8)</a>
editierst.
<p>

<a name= "ConsoleClear"></a>
<h2>7.3 - Wie l&ouml;sche ich die Konsole, sobald sich ein User ausloggt?</h2>

<p>
Dazu musst du eine Zeile in 
<kbd><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=gettytab&amp;sektion=5">/etc/gettytab(5)</a></kbd>
einf&uuml;gen. &Auml;ndere die Sektion, die so aussieht:
</p>

<blockquote><pre>
P|Pc|Pc console:\
        :np:sp#9600:
</pre></blockquote>

<p>
F&uuml;ge die Zeile &quot;<tt>:cl=\E[H\E[2J:</tt>&quot; am Ende hinzu, so dass das ganze schlussendlich so aussieht:
</p>

<blockquote><pre>
P|Pc|Pc console:\
        :np:sp#9600:\
	:cl=\E[H\E[2J:
</pre></blockquote>

<p>
<a name= "Scrollback"></a>
<h2>7.4 -   Auf den Konsolen 'Scrollback Puffer' zugreifen <i>(i386 und einige Alphas)</i></h2>

<p>
OpenBSD bietet auf einigen Plattformen einen sogenannten "console scrollback buffer". 
Das macht es m&ouml;glich Informationen zu sehen, die bereits wieder 
oben aus dem Bildschirm gescrollt sind. Um sich auf- und abw&auml;rst 
zu bewegen, benutze einfach die Tastenkombinationen
<tt>[SHIFT]+[PGUP]</tt> und <tt>[SHIFT]+[PGDN]</tt>
<p>
Der Standard-Scrollback-Puffer und somit auch die Anzahl der Seiten, die du so betrachten kannst,
betr&auml;gt 8. 
Das ist ein Feature des
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vga&amp;sektion=4">vga(4)</a>
Treibers, daher funktioniert das alles nat&uuml;rlich nicht ohne VGA Karte auf
jeglichen Plattformen (viele Alpha Systeme haben TGA video).

</p>

<a name= "SwitchConsole"></a>
<h2>7.5 - Wie wechsele ich die Konsolen?<i>(i386 und einige Alphas)</i></h2>

Auf dem i386 und einigen Alphas mit 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=vga&amp;sektion=4">vga(4)</a>
Karte bietet OpenBSD sechs virtuelle Terminal an,
/dev/ttyC0 bis /dev/ttyC5.
ttyC4 ist f&uuml; die Benutzung durch das X Window System reserviert, 
was noch f&uuml;nf Text-Konsolen &uuml;brgi l&auml;sst.
Zwischen ihnen hin- und herspringen kannst du, indem du 
Tastaturkombinationen
<tt>[CTRL]+[ALT]+[F1]</tt>, <tt>[CTRL]+[ALT]+[F2]</tt>,
<tt>[CTRL]+[ALT]+[F3]</tt>, <tt>[CTRL]+[ALT]+[F4]</tt> und
<tt>[CTRL]+[ALT]+[F6]</tt> benutzt.

<p>
Die X Umgebung benutzt ttyC4, <tt>[CTRL]+[ALT]+[F5]</tt>.
Wenn du X benutzt,
bringen dich die <tt>[CTRL]+[ALT]+[F</tt><i>n</i><tt>]</tt> Tasten auf 
die Text-Konsolen,
<tt>[CTRL]+[ALT]+[F5]</tt>
bringt dich wieder auf die grafische &Ouml;berfl&auml;che.

Wenn du mehr als die standardm&auml;ssige Anzahl von Text-Konsolen haben
willst, kannst du den
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconscfg&amp;sektion=8">wsconscfg(8)</a>
Befehl benutzen, um Bildschirme f&uuml;r ttyC6, ttyC7 und weitere zu erzeugen.
Zum Beispiel:

<blockquote>
<pre>
wsconscfg -t 80x25 6
</pre>
</blockquote>

erzeugt ein virtuelles Terminal f&uuml;r ttyC6,
was man mit <tt>[CTRL]+[ALT]+[F7]</tt> erreicht.
Vergiss nicht, diesen Befehl deiner
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.local&amp;sektion=8"><tt>rc.local(8)</tt></a>
Datei hinzuzuf&uuml;gen, wenn der zus&auml;tzliche Bildschirm auch nach dem n&auml;chsten
Reboot noch vorhanden sein soll.

<p>
Denk daran, dass du keinen "<tt>login:</tt>" Prompt
auf der neu erzeugten virtuellen Konsole erh&auml;lst, bis du sie in
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ttys&amp;sektion=5"><tt>/etc/ttys(5)</tt></a>,
auf "on" setzt, und entweder mit 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=init&amp;sektion=8">init(8)</a>
rebootest, oder ein HUP Signal mittels 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=kill&amp;sektion=1">kill(1)</a>
sendest.

<a name="80x50"></a>
<h2>7.6 - Wie bekomme ich eine Konsolen-Aufl&ouml;sung von 80x50? <i>(i386)</i></h2>

i386 User haben normalerweise eine Konsole mit 25 Zeilen und jede hat 80 Buchstaben.
Viele VGA Grafik-Karten sind aber in der Lage, eine h&ouml;here 
Textaufl&ouml;sung von 50 Zeilen mit 80 Buchstaben darzustellen.

<p>
Zun&auml;chst einmal kann man einen Font, der die gew&uuml;nschte Aufl&ouml;sung
unterst&uuml;tzt, mittels des 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsfontload&amp;sektion=8">wsfontload</a>
Befehls laden. Der Standard-80x25-Text-Bildschirm benutzt 8x16 pixel
Fonts, um die vertikale Aufl&ouml;sung zu verdoppeln, m&uuml;ssen wir 8x8 pixel
Fonts benutzen.

<p>
Danach m&uuml;ssen wir die
<a href="#SwitchConsole">virtuelle Konsole</a> l&ouml;schen und in der
gew&uuml;nschten Aufl&ouml;sung neu erzeugen, und zwar mit dem
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconscfg&amp;sektion=8">wsconscfg</a>
Befehl.

<p>
Das kann w&auml;hrend des Bootens automatisch am Ende deiner
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=rc.local&amp;sektion=8"><tt>rc.local</tt></a>
Datei geschehen:
<blockquote>
<pre>
wsfontload -h 8 -e ibm /usr/share/misc/pcvtfonts/vt220l.808
wsconscfg -dF 5
wsconscfg -t 80x50 5
</pre>
</blockquote>

Wie bei jeder &Auml;nderung deiner Systemkonfiguration solltest du 
etwas Zeit mit den passenden man pages verbringen, um zu verstehen,
was diese Befehle eigentlich tun.

<p>
Die erste Zeile dort oben l&auml;dt den 8x8 Font. Die zweite Zeile
l&ouml;scht den virtuellen Bildschirm Nummer 5 
(den man mit <tt>[CTRL]-[ALT]-[F6]</tt> erreichen w&uuml;rde). Die dritte
Zeile erzeugt einen neuen Bildschirm 5 mit der Aufl&ouml;sung 50 Zeilen
mit je 80 Buchstaben. Wenn du alles so gemacht hast, werden deine anderen
virtuellen Bildschirme ganz normal im 80x25 Modus erscheinen, und der neue
Bildschirm 5 mit 80x25 ist mit <tt>[CTRL]-[ALT]-[F6]</tt> erreichbar.

<p>
Denke daran, dass <tt>[CTRL]-[ALT]-[F1]</tt> hier Bildschirm 0 ist. Wenn du 
die anderen Schirme auch &auml;ndern willst, wiederhole einfach die
Schritte "delete" und "add screen" f&uuml;r jeden Bildschirm, den du mit
80x50 betreiben willst.

<p>
Du solltest aber Bildschirm 4 (ttyC4, <tt>[CTRL]-[ALT]-[F5]</tt>) 
unver&auml;ndert lassen, da dieser von X als grafischer Schirm genutzt wird.
Ausserdem ist es nicht m&ouml;glich, die Aufl&ouml;sung des 
ersten Konsolen-Device zu &auml;ndern (also ttyC0).

<p>
Nat&uuml;rlich k&ouml;nnen all diese Befehle auch als root an
der Konsole eingegeben werden, oder besser mittels
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=sudo&amp;sektion=8">sudo(8)</a>.

<p>
<b>Hinweis: Das funktioniert nicht mit allen Grafik-Karten.</b> Dummerweise
unterst&uuml;tzen nicht alle Grafik-Karten die von 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&amp;sektion=4">wscons</a>
ben&ouml;tigten Fonts f&uuml;r den 80x50 Text-Modus. In diesen F&auml;llen
solltest du &uuml;ber den Einsatz von X nachdenken.


<a name="SerCon"></a>
<h2>7.7 - Wie kann ich eine serielle Konsole benutzen ?</h2>

Es gibt viele Gr&uuml;nde, warum du auf deinem OpenBSD System eine serielle
Konsole benutzen willst:
<ul>
<li>Aufnehmen der Ausgabe der Konsole (zur Dokumentation). 
<li>Remote Management.
<li>Einfachere Wartung einer grossen Anzahl von Maschinen
<li>Ein sauberes dmesg von Maschinen bekommen, von denen das sonst nicht so einfach ist.
<li>Eine saubere "trace" und "ps" Ausgabe bieten, wenn dein System gecrasht
    ist, so dass die Entwickler eine Chance haben, das Problem zu beheben.
</ul>
OpenBSD unterst&uuml;tzt auf den meisten Plattformen eine serielle Konsole,
die Details weichen aber stark ab.

<p>
Bedenke, dass serielles Arbeiten/Interfacing KEINE einfache
Sache ist -- du wirst oft ungew&ouml;hnliche Kabel ben&ouml;tigen
und ports sind oft nicht zwischen den Maschinen standardisiert, und
manchmal noch nicht mal auf einer einzelnen Maschine konsistent. 
Ein komplettes Tutorial &uuml;ber serielles Arbeiten/Interfacing
geht weit &uuml;ber die M&ouml;glichkeiten dieses Artikels hinaus,
geben wir die trotzdem einen guten Rat: Nur weil der Stecker hineinpasst,
heisst das noch lange nicht, dass es auch funktioniert.

<a name="SerContty"></a>
<h3><i>/etc/ttys</i> &Auml;nderung</h3>
Es gibt zwei Punkte, um eine funktionierende serielle Konsole 
unter OpenBSD zu erhalten. Erstens musst du OpenBSD haben, um deinen
seriellen Port als Konsole f&uuml;r Status-Ausgaben und single User-Modus
benutzen zu k&ouml;nnen. Zweitens muss dein serieller Port eingeschaltet
sein, um als interaktives Terminal benutzbar zu sein, so dass ein User
sich einloggen kann, wenn die Maschine im Multi-User-Betrieb l&auml;uft. 
Dieser Teil ist zwischen den verschiedenen Plattformen relativ gleich 
und wird hier besprochen.
 
<p>
Terminal Sessions werden von der Datei
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=ttys&amp;sektion=5"><i>/etc/ttys</i></a>
kontrolliert. Bevor OpenBSD dir auf der seriellen Konsole einen 
"<tt>login:</tt>" Prompt serviert, musst du das Ganze in <i>/etc/ttys</i>
einschalten, normalerweise gibt es ja andere Verwendungen f&uuml;r die
serielle Schnittstelle. Bei Plattformen, die normalerweise eine 
angeschlossene Tastatur und Bildschirm haben, ist die serielle
Konsole standardm&auml;ssig abgeschaltet. Wir benutzen hier die 
i386-Plattform als Beispiel. In diesem Fall musst du die Zeile
editieren, die wie folgt aussieht:

<pre>
     tty00   "/usr/libexec/getty std.9600"   unknown off
</pre>
Ist zu &auml;ndern in:
<pre>
     tty00   "/usr/libexec/getty std.9600"   vt100   on secure
</pre>

<tt>tty00</tt> ist hier der serielle Port, den wir als Konsole nutzen wollen.
Das "<tt>on</tt>" aktiviert das
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=getty&amp;sektion=8"><i>getty</i></a>
f&uuml;r den seriellen port, so dass "<tt>login:</tt>" Prompt pr&auml;sentiert
wird, das "<tt>secure</tt>" erlaubt ein root (uid 0) Login auf dieser Konsole
(das kann man wollen, oder auch nicht) und das 
"<tt>9600</tt>" ist die Baud-Rate des Terminals.  Denke draran, dass du 
die serielle Konsole auch ohne diese Schritte f&uuml;r Installationen benutzen
kannst, da das System im Singel-User-Modus l&auml;uft, und <i>getty</i>
gar nicht erst f&uuml;r den Login benutzt wird.

<p>
Auf einigen Plattformen und einigen Konfigurationen ist es notwenidg das 
System im Single-User-Modus zu booten, damit die &Auml;nderungen durchgef&uuml;hrt
werden k&ouml;nnen.

<h3>i386</h3>
Um den Boot-Prozess dazu zu bewegen, den seriellen Port als
Konsole zu verwenden, erzeuge oder editiere deine 
<i><a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot.conf&amp;sektion=8&amp;arch=i386">/etc/boot.conf</a></i>
Datei, damit sie folgende Zeile enth&auml;lt: <pre>
     set tty com0
</pre>

angenommen, du m&ouml;chtest den erste seriellen Port als Konsole verwenden.
Die Standard-Baud-Rate ist 9600bps, das kann mittels der stty Option in
<i>/etc/boot.conf</i> angepasst werden. Diese Datei wird auf deinem 
Boot-Laufwerk abgelegt, was auch deine Installations-Floppy  sein kann,
oder das Kommando kann ebenso gut am <tt>boot></tt> Prompt vom
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=boot&amp;sektion=8&amp;arch=i386">OpenBSD
second-stage boot loader</a> eingegeben werden, wenn es nur f&uuml;r ein
einzelnes Mail (oder zum ersten Mal) genutzt werden soll.


<p>
<h4>i386 Hinweise:</h4>
<ul>
<li>OpenBSD z&auml;hlt die seriellen Ports beginned mit <i>tty00</i>,
DOS/Windows mit <i>COM1</i>. Denke als daran, dass 
<i>tty02</i>  <i>COM3</i> ist, und nicht <i>COM2</i>

<li>Einige Systeme k&ouml;nnen sogar ohne eingesteckte Grafikkarte
funktionieren, aber sicher nicht alle -- viele Systeme sehen das
als Fehler an. Manche Systeme verweigern sogar ohne eingesteckte Tastatur
den Dienst.

<li>Einige i386 Systeme sind in der Lage, den seriellen Port als das 
Console Device zu benutzen. Deine Ergebnisse k&ouml;nen hiervon abweichen 
-- dieser Port ist nach dem Booten vielleicht nicht dem Betriebssystem
zug&auml;nglich, und es kann daher notwendig sein, ZWEI serielle
Ports zu verwenden.

<li>PC kompatible Computer sind nicht entworfen worden, um von einer seriellen
Konsole aus bedient zu werden, im Gegensatz zu einigen anderen Plattformen.
Sogar die Systeme, die eine seriellen Konsole unterst&uuml;tzen haben
daf&uuml;r im Normalfall eine Option im BIOS - und sollte diese Information
verloren gehen, wird das System wieder nach normal angeschlossener Tastatur
und Monitor suchen. Du solltest immer einen Monitor und eine Tastatur
griffbereit haben, um im Notfall darauf zur&uuml;ckgreifen zu k&ouml;nnen.

<li>Du wirst <i>/etc/ttys</i> wie 
<a href="#SerContty">oben</a> anpassen m&uuml;ssen.
</ul>


<h3>SPARC und UltraSPARC</h3>
Diese Maschinen sind so entworfen worden, dass sie vollst&auml;ndig
&uuml;ber eine serielle Konsole gewartet werden k&ouml;nnen. 
Entferne einfach die Tastatur von der Maschine, und das System
l&auml;uft &uuml;ber die serielle Konsole.

<h4>SPARC und UltraSPARC Hinweise</h4>
<ul>
<li>Die zwei seriellen ports auf SPARC heissen <i>ttya</i>, 
<i>ttyb</i>, etc.

<li>Anders als auf anderen Plattformen, ist es nicht notwendig irgendwelche
&Auml;nderungen an <i>/etc/ttys</i> zu machen, um die serielle Konsole
benutzen zu k&ouml;nnen.

<li>Die SPARC/UltraSPARC Systeme interpretieren ein BREAK Signal auf dem 
Konsolen-Port als das selbe wie ein STOP-A Kommando, und bringt das System
zur&uuml;ck zum Forth Prompt, und h&auml;lt jede Anwendung und das Betriebssystem
an diesem Punkt an. Das ist recht n&uuml;tzlich, wenn man es braucht, aber
ungl&uuml;cklicherweise senden einige serielle Terminals beim Power-Down und
einige RS-232 Switche etwas, was der Computer als Break-Signal interpretiert und
halten damit die Maschine an. &Uuml;berpr&uuml;fe das, bevor du damit
in einer Produktionsumgebung arbeitest.

<li>Wenn du Tastatur und Monitor angeschlossen hast, kannst du trotzdem die
serielle Konsole benutzen, indem du die folgenden Befehle am
<tt>ok</tt> Prompt eingibst:
 <pre>
     ok <b>setenv input-device ttya</b>
     ok <b>setenv output-device ttya</b>
     ok <b>reset</b>
 </pre>
Wenn Tastatur und Monitor (ttyC0) in <i>/etc/ttys</i>
(<a href="#SerContty">siehe oben</a>) aktiv sind, kannst du sie
zus&auml;tzlich benutzen, obwohl einige Kombinationen von 
SPARC Hardware dann mit der Tastatur Probleme bereiten k&ouml;nnen,
mit OpenBSD 3.3 sollte das aber behoben sein.
</ul>

<h3>MacPPC</h3>
Die MacPPC Maschinen sind durch OpenFirmware f&uuml;r die
Benutzung mittels serieller Konsole vorbereitet. Benutze
die folgenden Befehle:
 <pre>
     ok <b>setenv output-device scca</b>
     ok <b>setenv input-device scca</b>
     ok <b>reset-all</b>
 </pre>
Setze deine serielle Konsole auf 57600bps, 8N1.

<h4>MacPPC Hinweise</h4>
<ul>
<li>Ungl&uuml;cklicherweise ist die serielle Konsole auf den meisten
MacPPCs nicht direkt erreichbar. W&auml;hrend die meisten dieser 
Maschinen zwar serielle Hardware haben, ist sie nicht von aussen zug&auml;nglich.
Einige Firmen bieten jedoch Zusatz-Hardware f&uuml;r verschiedene 
Macintosh-Modelle, so dass dann der Port als serielle Konsole (oder
anderweitig) nutzbar ist. Verwende die Suchmaschine deines Vertrauens
und suche nach etwas wie "Macintosh internal serial port".

<li>Du wirst <tt>tty00</tt> in <i>/etc/ttys</i> auf
<tt>on</tt> &auml;ndern m&uuml;ssen und die Geschwidigkeit auf 57600 anstelle 
der standardm&auml;ssigen 9600 setzen m&uuml;ssen, wie <a href="#SerContty">oben</a> 
beschrieben, und zwar im Single-User-Modus, bevor du eine funktionierende 
serielle Konsole hast.</ul>


<h3>Mac68k</h3>
Die serielle Konsole wird im <i>Booter</i> Programm ausgew&auml;hlt, 
unter dem "<tt>Options</tt>" Pull-Down Men&uuml;, dann 
"<tt>Serial Ports</tt>". Pr&uuml;fe den "Serial Console" Knopf, 
dann w&auml;hle den Modem oder Drucker Port. Du wirst ein Macintosh Modem 
oder Drucker-Kabel an den seriellen Port des Mac anschliessen m&uuml;ssen.
Wenn das in Zukunft deine Standardeinstellung sein soll, musst du dem
Booter-Programm sagen, es soll deine Optionen speichern.


<h4>Mac68k Hinweise</h4>
<ul>
<li>Der Modem Port ist <i>tty00</i>, der Drucker Port ist <i>tty01</i>.

<li>Der Mac68k schaltet seinen seriellen Port nicht ein, bis man ihn danach
fragt, also wird deine breakout box keinerlei Signale anzeigen, bis der
OpenBSD Boot Prozess gestartet ist.

<li>Du wirst den Port in (<i>tty00</i> oder <i>tty01</i>) wie
<a href="#SerContty">oben</a> beschrieben einschalten m&uuml;ssen.</ul>

<a name="Blanker"></a>
<h2>7.8 - Wie schalte ich meinen Konsolen-Bildschirmschoner ein ? (wscons)</h2>
Wenn du m&ouml;chtest, dass sich deine Konsole nach einer gewissen Zeit der 
Inaktivit&auml;t von X abschaltet, kannst du die folgenden 
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wscons&amp;sektion=4">wscons(4)</a>
Variablen &auml;ndern:

<ul>
<li><b><tt>display.vblank</tt></b> auf <tt>on</tt> gesetzt schaltet 
das vertical sync Signal ein, was einige Monitore dazu veranlasst,
in den "energy saver" Modus zu gehen.  Es wird hinterher mehr Zeit 
beanspruchen, den Monitor wieder in den Normalmodus zu bringen,
aber es reduziert den Energieverbrauch und die Hintzentwicklung 
neuerer Monitore. Im Modus <tt>off</tt> wird zwar der Bildschirm 
schwarz, aber der Monitor empf&auml;ngt weiter das honrizontale und 
vertikale sync Signal, und die R&uuml;ckkehr zum Normalbetrieb 
geschieht augenblicklich.

<li><b><tt>display.screen_off</tt></b> gibt die Verz&ouml;gerungszeit
im tausendstel Sekunden an, also w&auml;re 60000 eine Verz&ouml;gerung
von einer Minute.

<li><b><tt>display.kbdact</tt></b> gibt an, ob Aktivit&auml;ten auf
der Tastatur wieder zur R&uuml;ckkehr in den Normalmodus f&uuml;hren.
Normalerweise will man das.

<li><b><tt>display.outact</tt></b> gibt an, ob Ausgaben auf dem Bildschirm
wieder zur R&uuml;ckkehr in den Normalmodus f&uuml;hren.
</ul>

Du kannst diese Variablen auf der Kommandozeile mittels des
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl&amp;sektion=8">wsconsctl(8)</a> 
Befehls setzen:
<pre>
     # <b>wsconsctl -w display.screen_off=60000</b>
     display.screen_off -> 60000
</pre>

oder sie dauerhaft setzen, indem du sie in der Datei
<a href="http://www.openbsd.org/cgi-bin/man.cgi?query=wsconsctl.conf&amp;sektion=5"><i>/etc/wsconsctl.conf</i></a>
eintr&auml;gst, so dass sie beim n&auml;chsten Bootvorgang aktiviert werden:

<pre>
     display.vblank=on               # enable vertical sync blank
     display.screen_off=600000       # set screen blank timeout to 10 minutes
     display.kbdact=on               # Restore screen on keyboard input
     display.outact=off              # Restore screen on display output
</pre>

Der Bildschirmschoner wird entweder aktiv, wenn <tt>display.kbdact</tt> oder
<tt>display.outact</tt> auf "<tt>on</tt>" gesetzt sind.  

<p>
<font color= "#0000e0">
<a href="index.html">[FAQ Index]</a>
<a href="faq6.html">[Zum Kapitel 6 - Netzwerken]</a>
<a href="../faq8.html">[Zum Kapitel 8 - Allgemeine Fragen]</a>
</font>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[back]"></a> 
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br>
<small>
Originally [OpenBSD: faq7.html,v 1.53 ]
<br>
$Translation: faq7.html,v 1.34 2003/07/27 15:48:47 jufi Exp $
<br></small>
<small>$OpenBSD: faq7.html,v 1.31 2003/07/27 15:59:26 jufi Exp $</small>
</body>
</html>
