<html>
<head>
<title>9.0 - Tips f&uuml;r Linux (und andere freie Unix-artige BS) User</title>
<link rev="made" href= "mailto:www@openbsd.org">
<meta name= "resource-type" content= "document">
<meta name= "description"   content= "the OpenBSD FAQ page">
<meta name= "keywords"      content= "openbsd,faq">
<meta name= "distribution"  content= "global">
<meta name= "copyright"     content= "This document copyright 1998-1999 by OpenBSD.">
</head>

<body bgcolor= "#ffffff" text= "#000000" link= "#23238E">

<img alt="[OpenBSD]" height=30 width=141 src="../../images/smalltitle.gif">
<p>
<h2><font color=#e00000>9.0 - Umstieg von Linux</font><hr></h2>
</p>

<p>
<ul><h3>Inhaltsverzeichnis</h3>
<li><a href= "faq9.html#9.1">9.1 - Tips f&uuml;r Linux (und andere freie Unix-artige BS) User</a></li>
<li><a href= "faq9.html#9.2">9.2 - Dual boot mit Linux und OpenBSD</a></li>
<li><a href= "faq9.html#9.3">9.3 - Deine Linux (oder andere System-7-artige) Passwort-Datei in BSD-Style konvertieren.</a></li>
<li><a href= "faq9.html#9.4">9.4 - Wie man OpenBSD und Linux zur Zusammenarbeit bewegt</a></li>
</ul>

F&uuml;r weitere Informationen f&uuml;r Linux Ben&uuml;tzer siehe bitte <a href="http://sites.inka.de/mips/unix/bsdlinux.html">http://sites.inka.de/mips/unix/bsdlinux.html</a>.
</p>
<hr>

<br>

<p>
<a name= "9.1"></a>
<h2>9.1 - Einfache Tips f&uuml;r Linux (und andere freie Unix-artige BS) User</h2>
</p>

<p>
Es gibt einige Unterschiede ziwschen OpenBSD und Linux. Diese Unterschied sind
unter anderem die Bootup-Sequenz, Netzwerkkarten Benutzung und das Festplatten-
Management. Die meisten Unterschiede  sind gut dokumentiert, aber ben&ouml;tigen
ein Suchen in den man-pages. Dieses Dokument versucht als Index dieser Unterschiede 
zu dienen.
</p>

<p>
<ul>
    <li>OpenBSD hat einen <a href="../../de/ports.html">ports tree</a>. Das wirkt der Tatsache
	entgegen, dass bis jetzt nicht allzuviele Anwendungen rein f&uuml;r die
	OpenBSD-Umgebung geschrieben wurden. Dies ist sowohl ein Versuch mehr Anwendungen f&uuml;r
	OpenBSD verf&uuml;gbar zu machen, als auch darauf hinzuwirken, dass mehr OpenBSD-kompatible
	Anwendungen entwickelt werden. Eventuell wird dieser ports tree dazu verwendet, eine nette
	Zusammenstellung von Bin&auml;rpaketen zu machen.
        </li>
    <li>OpenBSD benutzt CVS f&uuml;r Source-&auml;nderungen.  Bei Linux ist der Source-Code zwischen
	verschiedenen Distributionen verteilt und zum Teil unterschiedlich. OpenBSD hat das 'anonymous 
        CVS' zuerst eingef&uuml;hrt, was jedermann erlaubt, den vollen 'source tree' f&uuml;r jede 
	Version von OpenBSD herunterzuladen, (von 2.0 bis -current, und alle Zwischenversionen von
	allen Dateien zwischendurch) und das zu jeder Zeit! Es gibt auch ein sehr bequemes und einfach
	zu bedienendes 
        <A HREF="http://www.openbsd.org/cgi-bin/cvsweb/">web interface to CVS</a>.
	<li>OpenBSD
	gibt regelm&auml;ssig 'snapshots' f&uuml;r verschiedene Architekturen heraus und alle 
	6 Monate gibt es eine stabile offizielle Version auf CD.</li>
    <li>OpenBSD enth&auml;lt STARKE KRYPTOGRAFIE, die Betriebssysteme aus den USA nicht enthalten 
	k&ouml;nnen. (Siehe <a href="../../de/crypto.html">http://www.openbsd.org/de/crypto.html</a>)
        OpenBSD wurde auch einer starken Sicherheits&uuml;berpr&uuml;fung unterzogen und viele 
	Sicherheitsfeatures wurden bereits in den Source tree eingef&uuml;gt. (IPSEC, KERBEROS).</li>
    <li>Der Kernel von OpenBSD's heisst /bsd.</li>
    <li>Die Namen von Festplatten sind f&uuml;r gew&ouml;hnlich <i>/dev/wd</i> und <i>/dev/sd</i> (ATA/SCSI)</li>
    <li><A HREF="http://www.openbsd.org/cgi-bin/man.cgi?query=ifconfig&sektion=8&format=html">/sbin/ifconfig</a> 
	ohne Argumente ergibt unter Linux den Status aller Netzwerkinterfaces.
        Unter OpenBSD ben&ouml;tigst du das -a flag.</li>
    <li><A HREF="http://www.openbsd.org/cgi-bin/man.cgi?query=route&sektion=8&format=html">/sbin/route</a> 
	ergibt unter Linux den Status aller aktiven Routen. Unter OpenBSD brauchst du den
        "<i>show</i>" Parameter, oder nimm einfach 
        <b>netstat -r</b>.</li>
    <li>OpenBSD enth&auml;lt Darren Reed's IP Filter Paket, nicht ipfw.  Das bedeutet:
<ul>
    <li>IP-Masquerading wird mit Hilfe von 'ipnat' gemacht. 
        (<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&apropos=0&sektion=1&format=html">ipnat(1)</a>)</li>
    <li>ipfwadm wird mit Hilfe von ipf 
        (<a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=ipf&apropos=0&sektion=1&format=html">ipf(1)</a>, 
         <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=ipnat&apropos=0&sektion=5&format=html">ipf(5)</a>)gemacht.</li>
     <li>Du solltest dir <A HREF="faq6.html">Kapitel 6</a> der FAQ f&uuml;r detailliertere Konfigurationshilfen
	 und Informationen ansehen.
</ul>
    <li>Die Interface-Adresse wird in <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=hostname.if&sektion=5&format=html">/etc/hostname.&lt;interfacename&gt;</a> aufbewahrt. 
        Sie kann auch ein Name anstatt einer IP Addresse sein.</li>
    <li>Der Name deiner Maschine ist in <i>/etc/myname</i></li>
    <li>Das Standard-Gateway ist in <i>/etc/mygate</i></li>
    <li>Die Netzwerk-Interface Aliases sind in <i>/etc/ifaliases</i>. <b>HINWEIS:</b> Das wurde nach 2.6 ge&auml;ndert. Ab OpenBSD 2.7 ist das Setup jetzt in <i>/etc/hostname.if</i>.
    <li>OpenBSD's Standard-Shell ist /bin/sh, also die Korn shell. Shells wie bash und tcsh k&ouml;nnen als Pakete 
	hinzugef&uuml;gt oder aus dem ports tree instaliert werden.</li>
    <li>Das Passwort-Management ist deutlich ver&auml;ndert. Die Hauptdateien sind verschieden. 
        (<a href=" http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&apropos=0&sektion=1&format=html">passwd(1)</a>,
         <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=passwd&apropos=0&sektion=5&format=html">passwd(5)</a>)</li>
<li>Devices werden nach dem Treiber benannt und nicht nach ihrem Typ. Zum Beispiel gibt es keine eth* Devices. Aber es gibt ne0
f&uuml;r eine NE2000 Ethernet-Karte, und xl0 f&uuml;r 3Com Etherlink XL und Fast Etherlink XL Ethernet Device, etc.
<li>Die OpenBSD Entwickler haben grosse Anstrengungen unternommen, um die 'manual pages' auf aktuellen Stand zu bringen und 
aufzur&auml;umen. Unter <a href= "http://www.openbsd.org/cgi-bin/man.cgi?query=man">man(1)</a> gibt es weitere 
Informationen dazu.
</ul>
</p>

<br>

<p>
<a name= "9.2"></a>
<h2>9.2 - Dual boot mit Linux und OpenBSD</h2>
</p>

<p>
Ja! Es ist machbar!
</p>

<p>
Lies <a href= "ftp://ftp.openbsd.org/pub/OpenBSD/2.8/i386/INSTALL.linux">INSTALL.linux</a>
<p>
<a name= "9.3"></a>
<h2>9.3 - Deine Linux (oder andere System-7-artige) Passwort-Datei in BSD-Style konvertieren.</h2>
<P>
Zuerst finde heraus, ob deine Linux Passwortdatei 'geshadowed' wird oder nicht. Wenn ja,
besorge dir <A HREF="http://www.openwall.com/john/">John the Ripper</a> und benutze
das 'unshadow' Werkzeug, das darin enthalten ist, um deine <Tt>passwd</tt> und <tt>shadow</tt>
Dateien in eine System 7-artige Datei zu verwandeln..
<P>
In deiner Linux Passwort-Datei, wir nennen sie <tt>linux_passwd</tt>,
musst du nun ::0:0 zwischen den Feldern 4 und 7 einf&uuml;gen.  Awk kann das f&uuml;r 
dich erledigen. 
<UL><PRE>
# <b>cat linux_passwd | awk -F : '{printf("%s:%s:%s:%s::0:0:%s:%s:%s\n",$1,$2,$3,$4,$5,$6,$7); }' &gt; new_passwd</b>
</PRE></UL>
An diesem Punkt angelangt, solltest du jetzt die <tt>new_passwd</tt> Datei &auml;ndern und 
 root und andere Systemeintr&auml;ge l&ouml;schen, die bereits in deiner 
OpenBSD Passwortdatei enthalten sind, oder die es in OpenBSD gar nicht gibt(und zwar alle von der Sorte).
Stelle auch sicher, dass es keine doppelten Usernamen oder User IDs zwischen
<tt>new_passwd</tt> und dem <tt>/etc/passwd</tt> auf deiner OpenBSD-Kiste gibt. 
Der einfachste Weg ist, einfach mit einer frischen
<tt>/etc/passwd</tt> anzufangen.
<UL><PRE>
# <b>cat new_passwd &gt;&gt; /etc/master.passwd</b>
# <b>pwd_mkdb -p /etc/master.passwd</b>
</PRE></UL>
Der letzte Schritt, <tt>pwd_mkdb</tt> ist notwendig, um die /etc/spwd.db
und /etc/pwd.db Dateien neu zu erzeugen.  Es erzeugt auch eine System 7-artige Passwortdatei
(ohne verschl&uuml;sselter Passw&ouml;rter)
unter /etc/passwd f&uuml;r die Programme, die darauf zugreifen.
OpenBSD benutzt eine st&auml;rkere Verschl&uuml;selung f&uuml;r Passw&ouml;rter, n&auml;mlich 'blowfish', 
die man wohl kaum auf Systemen mit vollen System7-artigen Passwort-Dateien finden wird.
Um zu dieser st&auml;rkeren Verschl&uuml;sselung zu wechseln, m&uuml;ssen die User einfach
'passwd' benutzen (bzw. tippen) und ihr Passwort &auml;ndern. Das neu eingegeben Passwort wird
mit deiner Standardeinstelung verschl&uuml;sselt (normalerweise 'blowfish', es sei denn, du h&auml;ttest
/etc/passwd.conf ver&auml;ndert).  Oder du machst es als root mit <tt>passwd <i>username</i></tt>.


<p>
<a name="9.4"></a>
<h2>9.4 - Wie man OpenBSD und Linux zur Zusammenarbeit bewegt</h2>
</p>

<P>
Wenn du von Linux zu OpenBSD wechselst, denke daran, dass im OpenBSD GENERIC Kernel
die Option COMPAT_LINUX standardm&auml;ssig aktiviert ist.
Um Linux Binaries zum Laufen zu bringen, die nicht statisch gelinkt sind (und die meisten sind es nicht),
solltest du den Anweisungen auf der <A HREF="http://www.openbsd.org/cgi-bin/man.cgi?query=compat_linux&sektion=8&format=html">compat_linux(8)</a> manual page folgen.
Ein einfacher Weg, die meisten n&uuml;tzlichen Linux Libraries zu kriegen, ist, 
linux_lib aus der 'ports collection' zu installieren. Um mehr &uuml;ber die 'ports collection' zu erfahren, lies einfach <a href="../faq8.html#8.6">FAQ 8.6</a>. 
Wenn du den Ports tree schon installiert hast, benutze diese Kommandos, um die Linux Libraries zu installieren:
</p>

<ul>
<pre>
# <strong>cd /usr/ports/emulators/linux_lib</strong>
# <strong>make install</strong>
</pre>
</ul>

<p>
OpenBSD unterst&uuml;tzt das EXT2FS Dateisystem. Benutze <b>disklabel <i>disk</i></b> (wobei <b><i>disk</i></b> der 'device name' f&uuml;r deine Festplatte ist.)
um zu &uuml;berpr&uuml;fen, was OpenBSD denkt, was deine Linux Partition ist (aber benutze disklabel oder fdisk <strong>nicht</strong>
um daran &Auml;derungen vorzunehmen). F&uuml;r weitere Informationen &uuml;ber die Benutzugn von disklabel lies <a href="../faq14.html#14.1">FAQ 14.1</a>.
</p>



<p>
<font color= "#0000e0">
<a href= "index.html">[Zur&uuml;ck zum Haupt-Index]</a>
<a href= "../faq8.html">[Zum Kapitel 8.0 - Allgemeine Fragen]</a>
<a href= "../faq10.html">[Zum Kapitel 10.0 - System Administration]</a>
</font>
</p>

<p>
<hr>
<a href= "index.html"><img height= "24" width= "24" src= "../../images/back.gif" border= "0" alt= "[back]"></a>
<a href= "mailto:www@openbsd.org">www@openbsd.org</a>
<br><small>
Originally [OpenBSD: faq9.html,v 1.24 ]
<br>
$Translation: faq9.html,v 1.3 2001/02/17 20:20:08 jufi Exp $
<br></small>
<small>$OpenBSD: faq9.html,v 1.3 2001/02/17 20:26:35 jufi Exp $</small>
</p>
</body>
</html>
